openbsd/src/usr.sbin/identd/identd.8
.\"   $OpenBSD: identd.8,v 1.2 2013/03/18 08:55:31 dlg Exp $
.\"
.\" Copyright (c) 2013 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 18 2013 $
.Dt IDENTD 8
.Os
.Sh NAME
.Nm identd
.Nd Identification Protocol daemon
.Sh SYNOPSIS
.Nm
.Op Fl 46d
.Op Fl l Ar address
.Op Fl p Ar port
.Op Fl t Ar timeout
.Ar directory
.Sh DESCRIPTION
.Nm
is a server which implements the Identification Protocol as specified in
RFC 1413.
.Pp
.Nm
operates by looking up specific TCP/IP connections and returning
the name of the user running the process responsible for the connection.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl 4
Forces
.Nm
to use IPv4 addresses only.
.It Fl 6
Forces
.Nm
to use IPv6 addresses only.
.It Fl d
Do not daemonize.
If this option is specified,
.Nm
will run in the foreground and log to stderr.
.It Fl l Ar address
Listen on the specified address.
By default
.Nm
listens on wildcard addresses.
.It Fl p Ar port
Listen on the specified port.
By default
.Nm
listens on the port indicated in the
.Ql auth
service description; see
.Xr services 5 .
.It Fl t Ar seconds
Specifies the idle timeout for client connections.
The default timeout is 120 seconds.
.El
.\" .Sh SEE ALSO
.Sh HISTORY
The
.Nm
command was originally a process run via
.Xr inetd 8 .
It was rewritten for
.Ox 5.4
as a persistent non-blocking daemon.
