openbsd/src/sbin/route/route.8
.\"	$OpenBSD: route.8,v 1.54 2007/05/31 19:19:47 jmc Exp $
.\"	$NetBSD: route.8,v 1.6 1995/03/18 15:00:13 cgd Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)route.8	8.3 (Berkeley) 3/19/94
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt ROUTE 8
.Os
.Sh NAME
.Nm route
.Nd manually manipulate the routing tables
.Sh SYNOPSIS
.Nm route
.Op Fl dnqtv
.Op Fl T Ar tableid
.Ar command
.Oo
.Op Ar modifiers
.Ar args
.Oc
.Sh DESCRIPTION
.Nm
is a utility used to manually view and manipulate the network routing tables.
Except for setting up the default route, it normally is not needed to
manipulate routes, as a
system routing table management daemon, such as
.Xr ripd 8 ,
.Xr ospfd 8 ,
or
.Xr bgpd 8 ,
should tend to this task.
.Pp
.Nm
can be used to modify nearly any aspect of the routing policy,
except packet forwarding, which can be manipulated through the
.Xr sysctl 8
command.
.Pp
The
.Nm
utility supports a limited number of general options,
but a rich command language enables the user to specify
any arbitrary request that could be delivered via the
programmatic interface discussed in
.Xr route 4 .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d
Run in debug-only mode, i.e., don't actually modify the routing table.
.It Fl n
Bypass attempts to print host and network names symbolically
when reporting actions.
(The process of translating between symbolic
names and numerical equivalents can be quite time consuming, and
may require correct operation of the network; thus it may be expedient
to forgo this, especially when attempting to repair networking operations.)
.It Fl q
Suppress all output.
.It Fl T Ar tableid
Select an alternate routing table to modify or query.
Table 0 is the default table.
.It Fl t
Write routing messages to a fake device
.Pa ( /dev/null )
instead of a real routing socket to test route manipulation.
.It Fl v
(verbose) Print additional details.
.El
.Pp
The
.Nm
utility provides several commands:
.Pp
.Bl -tag -width Fl -compact
.It Cm add
Add a route.
.It Cm change
Change aspects of a route (such as its gateway).
.It Cm delete
Delete a specific route.
.It Cm flush
Remove all routes.
.It Cm get
Lookup and display the route for a destination.
.It Cm monitor
Continuously report any changes to the routing information base,
routing lookup misses, or suspected network partitionings.
.It Cm show
Print out the route table similar to "netstat -r" (see
.Xr netstat 1 ) .
.El
.Pp
The
.Cm get
command has the syntax:
.Bd -filled -offset indent
.Nm route Op Fl nv
.Cm get
.Op Ar modifiers
.Ar address
.Ed
.Pp
The
.Cm flush
command has the syntax:
.Bd -filled -offset indent
.Nm route Op Fl dnqtv
.Cm flush
.Op Ar family
.Ed
.Pp
If the
.Cm flush
command is specified,
.Nm
will
.Dq flush
the routing tables of all gateway entries.
When the address family is specified by any one of the
.Ar family
modifiers (listed below), only routes having destinations with addresses
in the
delineated family will be deleted.
.Pp
The
.Cm monitor
command has the syntax:
.Bd -filled -offset indent
.Nm route Op Fl \&dn
.Cm monitor
.Ed
.Pp
The
.Cm show
command has the syntax:
.Bd -filled -offset indent
.Nm route Op Fl n
.Cm show
.Op Ar family
.Op Fl gateway
.Ed
.Pp
If
.Fl gateway
is specified, only routes whose gateway are in the
same address family as the destination are shown.
.Pp
The other commands have the syntax:
.Bd -filled -offset indent
.Nm route Op Fl dnqtv
.Ar command
.Op Ar modifiers
.Ar destination gateway Op Ar netmask
.Ed
.Pp
.Ar destination
is the destination host or network,
.Ar gateway
is the next-hop intermediary via which packets should be routed,
and
.Ar netmask
behaves the same as the argument to the
.Fl netmask
modifier and is described below.
Routes to a particular host may be distinguished from those to
a network by interpreting the Internet address specified as the
.Ar destination
argument.
The optional modifiers
.Fl net
and
.Fl host
cause the destination to be interpreted as a network or a host, respectively.
Otherwise, type is chosen based on the following rules:
.Pp
The route is assumed to be to a network if any of the following apply to
.Ar destination :
.Pp
.Bl -bullet -compact
.It
it is the word "default", equivalent to 0/0
.It
it is an IPv4 address with less than 3 dots
.It
it is an IPv4 address with a
.Dq / Ns Em XX
suffix (where
.Em XX
is the number of bits in the network portion of the address
and is less than 32)
.It
it is the symbolic name of a network.
.El
.Pp
If
.Ar destination
is a valid IP address or host name, it is presumed to be a route to a host.
.Pp
If none of the above apply,
.Nm
prints an error message and exits.
.Pp
For example,
.Li 192.168.1.1
is interpreted as
.Fl host Li 192.168.1.1
and
.Li 192.168.1
is interpreted as
.Fl net Li 192.168.1 .
Note, however, that
.Li 192.168.2.0
will be interpreted as
.Fl host Li 192.168.2.0
since it is a complete IP address with 3 dots.
In this case the number of bits in the network portion of the address must
be explicitly listed, for example
.Li 192.168.2.0/24 ,
.Li 192.168.2/24 ,
or alternately
.Li 192.168.2 .
.Pp
If the destination is directly reachable
via an interface requiring
no intermediary system to act as a gateway, the
.Fl interface
modifier should be specified;
the gateway given is the address of this host on the common network,
indicating the interface to be used for transmission.
.Pp
To allow addresses to be interpreted as belonging to a particular address
family (as well as for use in the
.Ar family
arguments to some commands), the following modifiers may be used:
.Pp
.Bl -tag -width -inet6 -compact
.It Fl inet
Internet Protocol version 4 (IPv4) addresses
(see
.Xr ip 4 )
.It Fl inet6
Internet Protocol version 6 (IPv6) addresses
(see
.Xr ip6 4 )
.It Fl encap
IPsec
(see
.Xr ipsec 4 )
.It Fl ipx
Novell's Internet Packet Exchange (IPX) addresses
.It Fl link
Hardware (link-level) addresses
.It Fl sa
Actual
.Vt sockaddr
data, in hexadecimal format
.El
.Pp
The optional modifier
.Fl link
specifies that all subsequent addresses are specified as link-level addresses,
and the names must be numeric specifications rather than
symbolic names.
.Pp
The optional
.Fl netmask
qualifier is intended to manually add subnet routes with
netmasks different from that of the implied network interface
(as would otherwise be communicated using a routing protocol).
One specifies an additional ensuing address parameter
(to be interpreted as a network mask).
The implicit network mask generated in the
.Dv AF_INET
case
can be overridden by making sure this option follows the
.Ar destination
parameter.
.Fl prefixlen
is also available for a similar purpose, for IPv6/v4.
.Pp
The optional
.Fl mpath
modifier needs to be specified with the
.Cm add
command to be able to enter multiple gateways for the same destination address
(multipath).
When multiple routes exist for a destination, one route is selected based
on the source address of the packet.
The
.Xr sysctl 8
variables
.Va net.inet.ip.multipath
and
.Va net.inet6.ip6.multipath
are used to control multipath routing.
If set to 1,
multiple routes are used equally;
if set to 0,
the first route selected will be used for subsequent packets to that
destination regardless of source.
.Pp
Routes have associated flags which influence operation of the protocols
when sending to destinations matched by the routes.
These flags may be set (or sometimes cleared)
by indicating the following corresponding modifiers:
.Bl -column blackhole RTF_BLACKHOLE
.It Fl blackhole Ta Dv RTF_BLACKHOLE Ta "silently discard pkts (during updates)"
.It Fl cloning   Ta Dv RTF_CLONING   Ta "generates a new route on use"
.It Fl iface     Ta Dv ~RTF_GATEWAY  Ta "destination is directly reachable"
.It Fl llinfo    Ta Dv RTF_LLINFO    Ta "validly translates proto addr to link addr"
.It Fl mpath     Ta Dv RTF_MPATH     Ta "multiple gateways for a destination exist"
.It Fl nostatic  Ta Dv ~RTF_STATIC   Ta "pretend route added by kernel or daemon"
.It Fl proto1    Ta Dv RTF_PROTO1    Ta "set protocol specific routing flag #1"
.It Fl proto2    Ta Dv RTF_PROTO2    Ta "set protocol specific routing flag #2"
.It Fl reject    Ta Dv RTF_REJECT    Ta "emit an ICMP unreachable when matched"
.It Fl static    Ta Dv RTF_STATIC    Ta "manually added route"
.It Fl xresolve  Ta Dv RTF_XRESOLVE  Ta "emit mesg on use (for external lookup)"
.El
.Pp
The optional modifiers
.Fl mtu
and
.Fl expire
provide initial values to quantities maintained in the routing entry
by transport level protocols, such as TCP (see
.Xr tcp 4 ) .
They have the following meanings:
.Pp
.Bl -tag -width "-ssthresh n" -compact
.It Fl expire Ar n
Lifetime for route (e.g., if generated by a redirect).
.It Fl mtu Ar n
Maximum transmission unit
.Tn ( MTU )
size for this path.
.El
.Pp
These may be individually locked by preceding each such modifier to
be locked by
the
.Fl lock
meta-modifier, or one can
specify that all ensuing metrics may be locked by the
.Fl lockrest
meta-modifier.
.Pp
In a
.Cm change
or
.Cm add
command where the destination and gateway are not sufficient to specify
the route, the
.Fl ifp
or
.Fl ifa
modifiers may be used to determine the interface or interface address.
.Pp
The optional
.Fl genmask
modifier specifies that a cloning mask is present.
This specifies the mask applied when determining if a child route should
be created.
It is only applicable to network routes with the
.Dv RTF_CLONING
flag set.
.Pp
The optional
.Fl label
modifier specifies on route addition or modification that the route
should have the given
.Em label
associated with it.
Route labels can be used to attach arbitrary information to a route.
.Pp
All symbolic names specified for a
.Ar destination
or
.Ar gateway
are looked up first as a network name using
.Xr getnetbyname 3 .
If this lookup fails,
.Xr gethostbyname 3
is then used to interpret the name as a valid host name.
.Pp
.Nm
uses a routing socket (see
.Xr route 4 )
and the message types
.Dv RTM_ADD ,
.Dv RTM_DELETE ,
.Dv RTM_GET ,
and
.Dv RTM_CHANGE .
As such, only the superuser may modify
the routing tables.
.Sh FILES
.Bl -tag -width "/etc/networks" -compact
.It Pa /etc/hosts
host name database
.It Pa /etc/mygate
default gateway address
.It Pa /etc/networks
network name database
.El
.Sh EXAMPLES
Add a static
.Xr inet 4
route to the 192.168.5.0/24 network via the 192.168.0.1 gateway:
.Pp
.Dl # route add -inet 192.168.5.0/24 192.168.0.1
.Pp
Amend the
.Xr inet 4
route to the 192.168.5.0/24 network to use the 192.168.0.2 gateway:
.Pp
.Dl # route change -inet 192.168.5.0/24 192.168.0.2
.Pp
Delete the
.Xr inet 4
route to the 192.168.5.0/24 network:
.Pp
.Dl # route delete -inet 192.168.5.0/24
.Sh DIAGNOSTICS
.Bl -diag
.It "%s: gateway %s flags %x"
The specified route is being added to or deleted from the tables.
The values printed are from the routing table entry supplied in the
.Xr ioctl 2
call.
If the gateway address used was not the primary address of the gateway
(the first one returned by
.Xr gethostbyname 3 ) ,
the gateway address is printed numerically as well as symbolically.
.It "%s %s done"
When the
.Cm flush
command is specified, each routing table entry deleted
is indicated with a message of this form.
.It "Network is unreachable"
An attempt to add a route failed because the gateway listed was not
on a directly connected network.
The next-hop gateway must be given.
.It "not in table"
A
.Cm delete
operation was attempted for an entry which
wasn't present in the tables.
.It "routing table overflow"
An
.Cm add
operation was attempted, but the system was
low on resources and was unable to allocate memory
to create the new entry.
.El
.Sh SEE ALSO
.Xr netstat 1 ,
.Xr gethostbyname 3 ,
.Xr getnetbyname 3 ,
.Xr netintro 4 ,
.Xr route 4 ,
.Xr tcp 4 ,
.Xr hosts 5 ,
.Xr mygate 5 ,
.Xr networks 5 ,
.Xr bgpd 8 ,
.Xr ospfd 8 ,
.Xr ripd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
IPv6 support was added by WIDE/KAME project.
.Pp
The
.Fl recvpipe ,
.Fl hopcount ,
.Fl sendpipe ,
.Fl ssthres ,
.Fl rtt ,
and
.Fl rttvar
modifiers used to be used to initialize various quantities in routing
table entries.
The routing system no longer uses these values and the modifiers
exist now only for compatibility with other operating systems.
.Sh BUGS
Some uses of the
.Fl ifa
or
.Fl ifp
modifiers with the
.Cm add
command will incorrectly fail with a
.Dq Network is unreachable
message if there is no default route.
See case
.Dv RTM_ADD
in
.Fn route_output
from
.Pa sys/net/rtsock.c
for details.
