openbsd/src/sbin/route/route.8
.\"	$OpenBSD: route.8,v 1.104 2022/07/29 18:28:32 kn Exp $
.\"	$NetBSD: route.8,v 1.6 1995/03/18 15:00:13 cgd Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)route.8	8.3 (Berkeley) 3/19/94
.\"
.Dd $Mdocdate: July 29 2022 $
.Dt ROUTE 8
.Os
.Sh NAME
.Nm route
.Nd manually manipulate the routing tables
.Sh SYNOPSIS
.Nm route
.Op Fl dnqtv
.Op Fl T Ar rtable
.Ar command
.Oo
.Op Ar modifiers
.Ar args
.Oc
.Sh DESCRIPTION
.Nm
is a utility used to manually view and manipulate the network routing tables.
.Nm
can be used to modify nearly any aspect of the routing policy,
except packet forwarding, which can be manipulated through the
.Xr sysctl 8
command.
.Pp
The
.Nm
utility supports a limited number of general options,
but a rich command language enables the user to specify
any arbitrary request that could be delivered via the
programmatic interface discussed in
.Xr route 4 .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d
Run in debug-only mode, i.e., don't actually modify the routing table.
.It Fl n
Bypass attempts to print host and network names symbolically
when reporting actions.
(The process of translating between symbolic
names and numerical equivalents can be quite time consuming, and
may require correct operation of the network; thus it may be expedient
to forgo this, especially when attempting to repair networking operations.)
.It Fl q
Suppress all output.
.It Fl T Ar rtable
Select an alternate routing table to modify or query.
The default is to use the current routing table.
The current routing table can be displayed with
.Xr id 1 .
.It Fl t
Write routing messages to a fake device
.Pa ( /dev/null )
instead of a real routing socket to test route manipulation.
.It Fl v
(verbose) Print additional details.
.El
.Pp
.Tg command
The
.Nm
utility provides the following simple commands:
.Bl -tag -width Fl
.It Xo
.Nm route
.Op Fl T Ar rtable
.Tg
.Cm exec
.Op Ar command ...
.Xc
Execute a command forcing the process and its children to use the
routing table and appropriate routing domain as specified with the
.Fl T Ar rtable
option.
.It Xo
.Nm route
.Op Fl nqv
.Op Fl T Ar rtable
.Tg
.Cm flush
.Op Ar modifiers
.Xc
Delete all gateway entries from the routing table.
When the address family is specified by any one of the
.Ar family
modifiers (listed below), only routes having destinations with addresses
in the delineated family will be deleted.
Also, only routes matching a specific interface or priority can be flushed
by using the
.Fl iface
or
.Fl priority
modifiers.
.It Xo
.Nm route
.Op Fl nv
.Op Fl T Ar rtable
.Tg
.Cm get
.Op Ar modifiers
.Ar address
.Xc
Extract a routing entry from the kernel.
If
.Fl gateway
is specified, only routes whose gateway are in the
same address family as the destination are shown.
.It Xo
.Nm
.Op Fl n
.Op Fl T Ar rtable
.Tg
.Cm monitor
.Op Ar modifiers
.Xc
Continuously report any changes to the routing information base,
routing lookup misses, or suspected network partitionings.
.Pp
When the address family is specified by any one of the
.Ar family
modifiers (listed below), only routes having destinations with addresses
in the delineated family will be shown.
If the
.Fl iface
modifier is used, only interface specific messages (link state changes)
are shown.
If a routing table is supplied with
.Fl T ,
only changes in that routing table will be displayed.
.El
.Pp
.Bl -tag -width Fl -compact
.It Xo
.Ic route
.Op Fl dtv
.Op Fl T Ar rtable
.Tg
.Cm nameserver
.Ar interface
.Op Ar address ...
.Xc
Broadcast a list of up to five nameserver address proposals.
.Pp
.Xr unwind 8
will learn them and act according to
.Xr unwind.conf 5 .
.Pp
.Xr resolvd 8
will replace all existing nameservers for the given interface in
.Xr resolv.conf 5 .
.Pp
If no
.Ar address
argument is given, a request to remove the nameservers previously entered for
the given interface is sent.
.Pp
.It Xo
.Nm route
.Op Fl nv
.Op Fl T Ar rtable
.Tg
.Cm show
.Op Ar family
.Op Fl gateway
.Op Fl label Ar label
.Op Fl priority Ar priority
.Xc
Print out the routing table, in a fashion similar to "netstat -r".
The output is documented in more detail towards the end of the
.Xr netstat 1
manual.
.Pp
If
.Fl gateway
is specified, only routes whose gateway are in the
same address family as the destination are shown.
.Pp
If
.Fl label
is specified, only routes with the specified label are shown.
.Pp
If
.Fl priority
is specified, only routes with the specified priority are shown.
It may be specified by number or one of
.Cm local ,
.Cm connected ,
.Cm static ,
.Cm ospf ,
.Cm rip ,
or
.Cm bgp .
If the priority is negative, then routes that do not match the numeric
priority are shown.
.El
.Pp
.Bl -tag -width Fl -compact
.It Xo
.Ic route
.Op Fl T Ar rtable
.Tg
.Cm sourceaddr
.Op Fl inet Ns | Ns Fl inet6
.Op Ar address
.Xc
.It Xo
.Ic route
.Op Fl T Ar rtable
.Tg
.Cm sourceaddr
.Op Fl inet Ns | Ns Fl inet6
.Fl ifp
.Ar interface
.Xc
Set the preferred source address.
If
.Ar address
is the word "default", 0.0.0.0 or ::, source address will
be chosen by the kernel for the matching address family.
When
.Ar address
is omitted, preferred source address is printed if set.
If
.Fl ifp
is used, source will use IP assigned to
.Ar interface .
The preferred source will not be used when:
.Pp
.Bl -bullet -compact
.It
destination is on-link
.It
source address is assigned to a disabled interface
.El
.El
.Pp
.Tg destination
.Tg gateway
The other commands relating to adding, changing, or deleting routes
have the syntax:
.Pp
.Bl -tag -width Fl -compact
.It Xo
.Nm route
.Op Fl dnqtv
.Op Fl T Ar rtable
.Tg
.Cm add
.Op Ar modifiers
.Ar destination gateway
.Xc
.It Xo
.Nm route
.Op Fl dnqtv
.Op Fl T Ar rtable
.Tg
.Cm change
.Op Ar modifiers
.Ar destination gateway
.Xc
.It Xo
.Nm route
.Op Fl dnqtv
.Op Fl T Ar rtable
.Tg delete
.Tg
.Cm del Ns Op Cm ete
.Op Ar modifiers
.Ar destination gateway
.Xc
.El
.Pp
.Ar destination
is the destination host or network;
.Ar gateway
is the next-hop intermediary via which packets should be routed.
Routes to a particular host may be distinguished from those to
a network by interpreting the Internet address specified as the
.Ar destination
argument.
The optional modifiers
.Tg
.Fl net
and
.Tg
.Fl host
cause the destination to be interpreted as a network or a host, respectively.
Otherwise, type is chosen based on the following rules:
.Pp
.Tg default
The route is assumed to be to a network if any of the following apply to
.Ar destination :
.Pp
.Bl -bullet -compact
.It
it is the word "default", equivalent to 0/0
.It
it is an IPv4 address with less than 3 dots
.It
it is an IPv4 address with a
.Dq / Ns Em XX
suffix (where
.Em XX
is the number of bits in the network portion of the address
and is less than 32)
.It
it is an IPv6 address with a
.Dq / Ns Em XX
suffix (where
.Em XX
is the number of bits in the network portion of the address
and is less than 128)
.It
it is the symbolic name of a network.
.El
.Pp
If
.Ar destination
is a valid IP address or host name, it is presumed to be a route to a host.
.Pp
For example,
.Li 192.168.1.1
is interpreted as
.Fl host Li 192.168.1.1
and
.Li 192.168.1
is interpreted as
.Fl net Li 192.168.1 .
Note, however, that
.Li 192.168.2.0
will be interpreted as
.Fl host Li 192.168.2.0
since it is a complete IP address with 3 dots.
In this case the number of bits in the network portion of the address must
be explicitly listed, for example
.Li 192.168.2.0/24 ,
.Li 192.168.2/24 ,
or alternately
.Li 192.168.2 .
.Pp
If the destination is directly reachable
via an interface requiring
no intermediary system to act as a gateway, the
.Tg
.Fl iface
modifier should be specified;
the gateway given is the address of this host on the common network,
indicating the interface to be used for transmission.
.Pp
To allow addresses to be interpreted as belonging to a particular address
family (as well as for use in the
.Tg
.Ar family
arguments to some commands), the following modifiers may be used:
.Pp
.Bl -tag -width -inet6 -compact
.It Fl inet
Internet Protocol version 4 (IPv4) addresses
(see
.Xr ip 4 )
.It Fl inet6
Internet Protocol version 6 (IPv6) addresses
(see
.Xr ip6 4 )
.It Fl link
Hardware (link-level) addresses
.It Fl mpls
MPLS addresses
.It Fl sa
Actual
.Vt sockaddr
data, in hexadecimal format
.El
.Pp
In the absence of modifiers, an address is assumed to be IPv4,
unless containing a
.Sq :\&
character, when it is treated as IPv6.
.Pp
The optional modifier
.Fl link
specifies that all subsequent addresses are specified as link-level addresses,
and the names must be numeric specifications rather than
symbolic names.
.Pp
The optional
.Tg
.Fl netmask
qualifier is intended to manually add subnet routes with
netmasks different from that of the implied network interface
(as would otherwise be communicated using a routing protocol).
One specifies an additional ensuing address parameter
(to be interpreted as a network mask).
The implicit network mask generated in the
.Dv AF_INET
case
can be overridden by making sure this option follows the
.Ar destination
parameter.
.Tg
.Fl prefixlen
is also available for a similar purpose, for IPv6/v4.
.Pp
A specific routing priority can be specified with the optional
.Tg
.Fl priority
qualifier.
If no priority is specified, the kernel will set a priority depending on the
.Dv RTF_STATIC
flag to either
.Dv RTP_STATIC
or
.Dv RTP_DEFAULT .
Note that priority 1 is reserved for kernel use.
.Pp
The optional
.Tg
.Fl mpath
modifier needs to be specified with the
.Cm add
command to be able to enter multiple gateways for the same destination address
(multipath).
When multiple routes exist for a destination, one route is selected based
on the source address of the packet.
The
.Xr sysctl 8
variables
.Va net.inet.ip.multipath
and
.Va net.inet6.ip6.multipath
are used to control multipath routing.
If set to 1,
multiple routes with the same priority are used equally;
if set to 0,
the first route selected will be used for subsequent packets to that
destination regardless of source.
.Pp
When inserting MPLS routes,
particular modifiers must be used.
The
.Tg
.Fl mplslabel
modifier needs to be specified in an ingress LSR to associate a particular
label to an IPv4/IPv6 route.
The MPLS traffic
.Fl in
and
.Fl out
modifiers are intended to identify the ingress label and, optionally,
the outgoing one.
Additionally, one of the following operations must be used:
.Fl push ,
.Fl pop
and
.Fl swap .
Route's nexthop can be specified with the modifier
.Fl inet .
.Pp
Routes have associated flags which influence operation of the protocols
when sending to destinations matched by the routes.
These flags may be set (or sometimes cleared)
by indicating the following corresponding modifiers:
.Bl -column "-blackhole" "RTF_BLACKHOLE" "description"
.It Fl blackhole Ta Dv RTF_BLACKHOLE Ta "silently discard pkts (during updates)"
.It Fl cloning   Ta Dv RTF_CLONING   Ta "generates a new route on use"
.It Fl iface     Ta Pf ~ Dv RTF_GATEWAY Ta "destination is directly reachable"
.It Fl llinfo    Ta Dv RTF_LLINFO    Ta "validly translates proto addr to link addr"
.It Fl mpath     Ta Dv RTF_MPATH     Ta "multiple gateways for a destination exist"
.It Fl nostatic  Ta Pf ~ Dv RTF_STATIC Ta "pretend route added by kernel or daemon"
.It Fl proto1    Ta Dv RTF_PROTO1    Ta "set protocol specific routing flag #1"
.It Fl proto2    Ta Dv RTF_PROTO2    Ta "set protocol specific routing flag #2"
.It Fl reject    Ta Dv RTF_REJECT    Ta "emit an ICMP unreachable when matched"
.It Fl static    Ta Dv RTF_STATIC    Ta "manually added route"
.El
.Pp
The optional modifiers
.Fl expire
and
.Fl mtu
provide initial values to quantities maintained in the routing entry
by transport level protocols, such as TCP (see
.Xr tcp 4 ) .
They have the following meanings:
.Pp
.Bl -tag -width "-priority n" -compact
.It Fl expire Ar n
Lifetime for route (e.g., if generated by a redirect).
.It Fl mtu Ar n
Maximum transmission unit (MTU) size for this path.
.El
.Pp
These may be individually locked by preceding each such modifier to
be locked by
the
.Tg
.Fl lock
meta-modifier, or one can
specify that all ensuing metrics may be locked by the
.Fl lockrest
meta-modifier.
.Pp
In a
.Cm change
or
.Cm add
command where the destination and gateway are not sufficient to specify
the route, the
.Tg
.Fl ifp
or
.Tg
.Fl ifa
modifiers may be used to determine the interface name or interface address.
.Pp
The optional
.Tg
.Fl label
modifier specifies on route addition or modification that the route
should have the given
.Em label
associated with it.
Route labels can be used to attach arbitrary information to a route.
.Pp
All symbolic names specified for a
.Ar destination
or
.Ar gateway
are looked up using
.Xr gethostbyname 3 .
.Pp
.Nm
uses a routing socket (see
.Xr route 4 )
and the message types
.Dv RTM_ADD ,
.Dv RTM_DELETE ,
.Dv RTM_GET ,
and
.Dv RTM_CHANGE .
As such, only the superuser may modify
the routing tables.
.Sh FILES
.Bl -tag -width "/etc/mygate" -compact
.It Pa /etc/hosts
host and network name database
.It Pa /etc/mygate
default gateway address
.El
.Sh EXAMPLES
Add a static
.Xr inet 4
route to the 192.168.5.0/24 network via the 192.168.0.1 gateway:
.Pp
.Dl # route add -inet 192.168.5.0/24 192.168.0.1
.Pp
Amend the
.Xr inet 4
route to the 192.168.5.0/24 network to use the 192.168.0.2 gateway:
.Pp
.Dl # route change -inet 192.168.5.0/24 192.168.0.2
.Pp
Delete the
.Xr inet 4
route to the 192.168.5.0/24 network:
.Pp
.Dl # route delete -inet 192.168.5.0/24
.Sh DIAGNOSTICS
.Bl -diag
.It "%s: gateway %s flags %x"
The specified route is being added to or deleted from the tables.
If the gateway address used was not the primary address of the gateway
(the first one returned by
.Xr gethostbyname 3 ) ,
the gateway address is printed numerically as well as symbolically.
.It "%s %s done"
When the
.Cm flush
command is specified, each routing table entry deleted
is indicated with a message of this form.
.It "Network is unreachable"
An attempt to add a route failed because the gateway listed was not
on a directly connected network.
The next-hop gateway must be given.
.It "not in table"
A
.Cm delete
operation was attempted for an entry which
wasn't present in the tables.
.It "routing table overflow"
An
.Cm add
operation was attempted, but the system was
low on resources and was unable to allocate memory
to create the new entry.
.El
.Sh SEE ALSO
.Xr id 1 ,
.Xr netstat 1 ,
.Xr gethostbyname 3 ,
.Xr netintro 4 ,
.Xr route 4 ,
.Xr rtable 4 ,
.Xr tcp 4 ,
.Xr hosts 5 ,
.Xr mygate 5 ,
.Xr resolv.conf 5 ,
.Xr bgpd 8 ,
.Xr ospfd 8 ,
.Xr resolvd 8 ,
.Xr ripd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
IPv6 support was added by WIDE/KAME project.
.Pp
The
.Fl recvpipe ,
.Fl hopcount ,
.Fl sendpipe ,
.Fl ssthres ,
.Fl rtt ,
and
.Fl rttvar
modifiers used to be used to initialize various quantities in routing
table entries.
The routing system no longer uses these values and the modifiers
exist now only for compatibility with other operating systems.
.Sh BUGS
Some uses of the
.Fl ifa
or
.Fl ifp
modifiers with the
.Cm add
command will incorrectly fail with a
.Dq Network is unreachable
message if there is no default route.
See case
.Dv RTM_ADD
in
.Fn route_output
from
.Pa sys/net/rtsock.c
for details.
