openbsd/src/usr.sbin/rarpd/rarpd.8
.\"	$NetBSD: rarpd.8,v 1.7 1998/04/15 15:06:06 mrg Exp $
.\" Copyright (c) 1988-1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that: (1) source code distributions
.\" retain the above copyright notice and this paragraph in its entirety, (2)
.\" distributions including binary code include the above copyright notice and
.\" this paragraph in its entirety in the documentation or other materials
.\" provided with the distribution, and (3) all advertising materials mentioning
.\" features or use of this software display the following acknowledgement:
.\" ``This product includes software developed by the University of California,
.\" Lawrence Berkeley Laboratory and its contributors.'' Neither the name of
.\" the University nor the names of its contributors may be used to endorse
.\" or promote products derived from this software without specific prior
.\" written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR IMPLIED
.\" WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\" @(#) $Id: rarpd.8,v 1.8 1999/12/03 01:25:44 millert Exp $
.\"
.Dd October 26, 1990
.Dt RARPD 8
.Os
.Sh NAME
.Nm rarpd
.Nd reverse ARP daemon
.Sh SYNOPSIS
.Nm rarpd
.Op Fl adfl
.Op Ar interface
.Sh DESCRIPTION
.Nm
services Reverse ARP requests on the Ethernet connected to
.Ar interface .
Upon receiving a request,
.Nm
maps the target hardware address to an IP address via its name, which
must be present in both the
.Xr ethers 5
and
.Xr hosts 5
databases.
If a host does not exist in both databases, the translation cannot
proceed and a reply will not be sent.
.\" .Pp
.\" Additionally, a request is honored only if the server
.\" (i.e., the host that rarpd is running on)
.\" can "boot" the target; that is, if the directory
.\" .Pa /tftpboot/ Ns Em ipaddr
.\" exists, where
.\" .Rm ipaddr
.\" is the target IP address.
.Pp
In normal operation,
.Nm
forks a copy of itself and runs in
the background.  Anomalies and errors are reported via
.Xr syslog 3 .
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl a
Listen on all the Ethernets attached to the system.
If
.Fl a
is omitted, an
.Ar interface
must be specified.
.It Fl d
Run in debug mode, with all the output to stderr.
This option implies the
.Fl f
option.
.It Fl f
Run in the foreground.
.It Fl l
Log all requests to
.Xr syslog 3 .
.El
.Sh FILES
.Bl -tag -width /var/run/rarpd.pid -compact
.It Pa /etc/ethers
Ethernet host name data base
.It Pa /etc/hosts
host name data base
.It Pa /var/run/rarpd.pid
process id of
.Nm
.\" .It Pa /tftpboot
.El
.Sh SEE ALSO
.Xr bpf 4 ,
.Xr diskless 8
.Rs
.%R A Reverse Address  Resolution Protocol
.%N RFC 903
.%A Finlayson, R.
.%A Mann, T.
.%A Mogul, J.C.
.%A Theimer, M.
.Re
.Sh AUTHORS
Craig Leres (leres@ee.lbl.gov) and Steven McCanne (mccanne@ee.lbl.gov).
Lawrence Berkeley Laboratory, University of California, Berkeley, CA.
