openbsd/src/libexec/login_krb5/login_krb5.8
.\" $OpenBSD: login_krb5.8,v 1.11 2003/06/17 21:56:24 millert Exp $
.\"
.\" Copyright (c) 2000 Todd C. Miller <Todd.Miller@courtesan.com>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd December 11, 2000
.Dt LOGIN_KERBEROS 8
.Os
.Sh NAME
.Nm login_krb5
.Nd provide KerberosV authentication type
.Sh SYNOPSIS
.Nm login_krb5
.Op Fl s Ar service
.Op Fl v Ar ignored
.Ar user
.Op Ar class
.Sh DESCRIPTION
The
.Nm
utility implements the KerberosV authentication mechanism.
It is called by
.Xr login 1 ,
.Xr su 1 ,
.Xr ftpd 8 ,
and others to authenticate the
.Ar user
with KerberosV.
.Pp
The
.Ar user
argument is the user's name to be authenticated.
.Pp
The
.Ar service
argument specifies which protocol to use with the
invoking program.
The allowed protocols are
.Em login ,
.Em challenge ,
and
.Em response .
(The
.Em challenge
protocol is silently ignored but will report success as KerberosV
authentication is not challenge-response based).
.Pp
The
.Ar ignored
argument is ignored for compatibility with other login scripts.
.Pp
.Nm
will prompt the user for a password and report back to the
invoking program whether or not the authentication was
successful.
.Pp
.Nm
also supports KerberosIV ticket retrieval if krb4_get_tickets in the
[libdefaults] section of the 
.Pa /etc/kerberosIV/krb5.conf
is set to yes.
.Sh SEE ALSO
.Xr login 1 ,
.Xr passwd 1 ,
.Xr su 1 ,
.Xr login.conf 5 ,
.Xr ftpd 8 ,
.Xr login_krb5-or-pwd 8
