openbsd/src/kerberosIV/src/man/kprop.8
.\" $KTH: kprop.8,v 1.2 1996/06/15 17:03:22 assar Exp $
.\"
.Dd June 7, 1996
.Dt KPROP 8
.Os KTH-KRB
.Sh NAME
.Nm kprop
.Nd
the kerberos slave server update client
.Sh SYNOPSIS
.Nm
.Op Fl force
.Op Fl realm Ar realm
.Op Ar dump-file
.Op Ar slave-file
.Sh DESCRIPTION
Changes to the database, such as changed passwords, are only made to
the master server through the
.Nm kadmind
service. To propagate these changes to the slave servers, 
.Nm 
should be run regularly on the master server.

The following options are recognised.

.Bl -tag -width -force
.It Fl force
Propagate even if there hasn't been an update to the dump file since
last time.
.It Fl realm
Realm if other than the default.
.It dump-file
Is a file created with 
.Ic kdb_util slave_dump ,
default is
.Pa /etc/kerberosIV/slave_dump .
.It slave-file
Contains the names of the slave servers. Default is
.Pa /etc/kerberosIV/slaves .
.El

.Nm
will use the principal 
.Nm rcmd.kerberos
to authenticate to the master servers. This principal has to be added
to the database, and it should also be put into the service key file
on the master server.

.Sh FILES
.Bl -tag -width indent -compact
.It Pa /etc/kerberosIV/slave_dump
.It Pa /etc/kerberosIV/slaves
.It Pa /etc/kerberosIV/srvtab
.El
.Sh SEE ALSO
.Xr kpropd 8 ,
.Xr kerberos 8 ,
.Xr kadmind 8
