openbsd/src/kerberosIV/src/man/krb.extra.5
.\" $KTH: krb.extra.5,v 1.4 1999/11/25 05:30:42 assar Exp $
.\"
.Dd June 24, 1999
.Dt KRB.EXTRA 5
.Os KTH-KRB
.Sh NAME
.Nm krb.extra
.Nd
Kerberos misc configuration file
.Sh DESCRIPTION
.Nm
contains a number of settings that are used by the kerberos library,
or directly by applications. Each line in the file consists of a
variable, an equal sign, and a value. Lines beginning with hash are
ignored.
.Pp
Currently defined variables are:
.Bl -tag -width foo
.It Ar kdc_timeout
Time in seconds to wait for an answer from the KDC (default is 4
seconds).
.It Ar kdc_timesync
If this is enabled, the time differential between the client and the
KDC will be stored, and used later on when computing the correct time;
this is useful if the client's clock is drifting.
.It Ar firewall_address
The outside address of the firewall; this is used in some places to
compute a direction bit, and this might break if the server has a
different idea about which address to use than the client.
.It Ar krb4_proxy
Address of a web-proxy to use when connecting to the KDC via HTTP.
.It Ar krb_default_tkt_root
The default prefix for ticket files. E.g., if your uid is 42 and the
prefix is
.Pa /tmp/tkt
then your default ticket file will be
.Pa /tmp/tkt42 .
.It Ar krb_default_keyfile
The default keyfile, normally
.Pa /etc/kerberosIV/srvtab .
.It Ar nat_in_use
If a Network Address Translator (NAT) is being used.
.El
.Sh EXAMPLES
.Bd -literal
# this is a comment
krb_default_tkt_root = /tkt/tkt_
kdc_timesync = yes
firewall_address = 10.0.0.1
krb_default_keyfile = /etc/kerberosIV/srvtab
.Ed
.Sh SEE ALSO
.Xr krb.conf 5 ,
.Xr krb.equiv 5 ,
.Xr krb.realms 5
