openbsd/src/lib/libc/time/zdump.8
.\"	$OpenBSD: zdump.8,v 1.16 2012/09/13 11:14:20 millert Exp $
.Dd $Mdocdate: September 13 2012 $
.Dt ZDUMP 8
.Os
.Sh NAME
.Nm zdump
.Nd time zone dumper
.Sh SYNOPSIS
.Nm zdump
.Op Fl v
.Oo
.Fl c
.Oo Ar loyear , Oc Ar hiyear
.Oc
.Ar zonename ...
.Sh DESCRIPTION
.Nm
prints the current time in each
.Ar zonename
named on the command line.
.Pp
These options are available:
.Bl -tag -width Fl
.It Xo
.Fl c
.Oo Ar loyear , Oc Ar hiyear
.Xc
Cut off verbose output near the start of the given year(s).
By default,
the program cuts off verbose output near the start of the years -500 and 2500.
.It Fl v
For each
.Ar zonename
on the command line,
print the time at the lowest possible time value,
the time one day after the lowest possible time value,
the times both one second before and exactly at
each detected time discontinuity,
the time at one day less than the highest possible time value,
and the time at the highest possible time value.
Each line ends with
.Dq isdst=1
if the given time is Daylight Saving Time or
.Dq isdst=0
otherwise.
.El
.Sh LIMITATIONS
The
.Fl v
option may not be used on systems with floating-point
.Li time_t
values that are neither float nor double.
.Pp
Time discontinuities are found by sampling the results returned by localtime
at twelve-hour intervals.
This works in all real-world cases;
.\" @(#)zdump.8	8.1
.Sh SEE ALSO
.Xr ctime 3 ,
.Xr tzfile 5 ,
.Xr zic 8
.\" This file is in the public domain, so clarified as of
.\" 2009-05-17 by Arthur David Olson.
