openbsd/src/libexec/tcpd/tcpdchk/tcpdchk.8
.\"	$OpenBSD: tcpdchk.8,v 1.12 2007/05/31 19:19:41 jmc Exp $
.\"
.\" Copyright (c) 1997, Jason Downs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt TCPDCHK 8
.Os
.Sh NAME
.Nm tcpdchk
.Nd tcp wrapper configuration checker
.Sh SYNOPSIS
.Nm tcpdchk
.Op Fl a
.Op Fl d
.Op Fl i Ar inet_conf
.Op Fl v
.Sh DESCRIPTION
.Nm
examines your tcp wrapper configuration and reports all
potential and real problems it can find.
The program examines the
.Xr tcpd 8
access control files (by default, these are
.Pa /etc/hosts.allow
and
.Pa /etc/hosts.deny ) ,
and compares the
entries in these files against entries in the
.Xr inetd 8
network configuration file.
.Pp
.Nm
reports problems such as non-existent pathnames; services
that appear in
.Xr tcpd 8
access control rules, but are not controlled by
.Xr tcpd 8 ;
services that should not be wrapped; non-existent host
names or non-internet address forms; occurrences of host aliases
instead of official host names; hosts with a name/address conflict;
inappropriate use of wildcard patterns; inappropriate use of NIS
netgroups or references to non-existent NIS netgroups; references to
non-existent options; invalid arguments to options; and so on.
.Pp
Where possible,
.Nm
provides a helpful suggestion to fix the problem.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl a
Report access control rules that permit access without an explicit
ALLOW keyword.
.\" This applies only when the extended access control
.\" language is enabled (build with -DPROCESS_OPTIONS).
.It Fl d
Examine
.Pa hosts.allow
and
.Pa hosts.deny
files in the current directory instead of the default ones.
.It Fl i Ar inet_conf
Specify this option when
.Nm
is unable to find your
.Pa inetd.conf
network configuration file, or when you wish to test with a non-default one.
.It Fl v
Display the contents of each access control rule.
Daemon lists, client lists, shell commands and options are shown in a
pretty-printed format; this makes it easier for you to spot any
discrepancies between what you want and what the program understands.
.El
.Sh FILES
.Bl -tag -width /etc/hosts.allow -compact
.It Pa /etc/hosts.allow
access control table (allow list)
.It Pa /etc/hosts.deny
access control table (deny list)
.El
.Sh SEE ALSO
.Xr hosts_access 5 ,
.Xr hosts_options 5 ,
.Xr inetd.conf 5 ,
.Xr tcpdmatch 8
.Sh AUTHORS
.Bd -unfilled -offset indent
Wietse Venema (wietse@wzv.win.tue.nl),
Department of Mathematics and Computing Science,
Eindhoven University of Technology
Den Dolech 2, P.O. Box 513,
5600 MB Eindhoven, The Netherlands
.Ed
.\" @(#) tcpdchk.8 1.3 95/01/08 17:00:30
