openbsd/src/kerberosV/src/kdc/hpropd.8
.\" $KTH: hpropd.8,v 1.7 2001/06/08 21:35:32 joda Exp $
.\"
.Dd August 27, 1997
.Dt HPROPD 8
.Os HEIMDAL
.Sh NAME
.Nm hpropd
.Nd receive a propagated database
.Sh SYNOPSIS
.Nm hpropd
.Bk -words
.Oo Fl d Ar file \*(Ba Xo
.Fl -database= Ns Ar file
.Xc
.Oc
.Op Fl n | Fl -stdin
.Op Fl -print
.Op Fl i | Fl -no-inetd
.Oo Fl k Ar keytab \*(Ba Xo
.Fl -keytab= Ns Ar keytab
.Xc
.Oc
.Op Fl 4 | Fl -v4dump
.Ek
.Sh DESCRIPTION
.Nm
receives a database sent by
.Xr hprop 8
and writes it as a local database.
.Pp
By default,
.Nm
expects to be started from
.Nm inetd
if stdin is a socket and expects to receive the dumped database over
stdin otherwise.
If the database is sent over the network, it is authenticated and
encrypted.
Only connections authenticated with the principal
.Li kadmin/hprop
are accepted.
.Pp
Options supported:
.Bl -tag -width Ds
.It Xo
.Fl d Ar file Ns ,
.Fl -database= Ns Ar file
.Xc
database
.It Xo
.Fl n Ns ,
.Fl -stdin
.Xc
read from stdin
.It Xo
.Fl -print
.Xc
print dump to stdout
.It Xo
.Fl i Ns ,
.Fl -no-inetd
.Xc
not started from inetd
.It Xo
.Fl k Ar keytab Ns ,
.Fl -keytab= Ns Ar keytab
.Xc
keytab to use for authentication
.It Xo
.Fl 4 Ns ,
.Fl -v4dump
.Xc
create v4 type DB
.El
.Sh SEE ALSO
.Xr hprop 8
