openbsd/src/usr.sbin/ssio/set_scanner.1
.\" $Id: set_scanner.1,v 1.2 1999/06/05 22:18:14 aaron Exp $
.\"
.\" Copyright (c) 1996 Kenneth Stailey
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by Kenneth Stailey
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.TH set_scanner 1 "25 October 1994"
.SH NAME
set_scanner - change the parameter settings for the scanner
.SH SYNOPSIS
.B set_scanner
.RI [ -w width ]
.RI [ -h height]
.RI [ -x x_origin ]
.RI [ -y y_origin ]
.RI [ -r resolution ]
.RI [ -l logical_name ]
.RI [ -i image_mode ]
.RI [ \-b brightness ]
.RI [ -c contrast ]
.RI [ -d ]
.SH DESCRIPTION
Changes one or more of the scanner's attributes.  Changes are stored
in the ODM if you use the -d flag (for setting default values), but
leaving off the -d is faster.
.SH FLAGS
.B \-w
.I width.
Sets the width of the scanner active area to the given value in inches.
Decimal fractions of inches are acceptable for this and all other size
values.
.PP
.B \-h
.I height.
Sets the height of the scanner active area to the given value in inches.
.PP
.B \-x
.I x_origin.
Sets the upper left hand corner x coordinate of the scanner active area to
the given value in inches.
.PP
.B \-y
.I y_origin.
Sets the upper left hand corner y coordinate of the scanner active area to
the given value in inches.
.PP
.B \-r
.I resolution.
Sets the resolution to the given value in dots-per-inch.  To see
acceptable values for
.I resolution
use "lsattr -R -l scan0 -a x_resolution"
.PP
.B \-l
.I logical name of scanner.
Specifies what scanner to use.  The default is "scan0"
.PP
.B \-i
.I image mode.
Change the type of image data sent by the scanner.  The flag is followed
by a one-letter code representing the image mode.  Use "m" for binary
monochrome (solid black or white), "d" for dithered monochrome (halftoned),
"g" for grayscale, "c" for color, "R" for red only, "G" for green only or
"B" for blue only.  Not all scanners support all formats.
.PP
.B \-b
.I brightness
Set the hardware brightness control inside the scanner, if any.  This flag
is followed by a decimal integer that specifies how bright the image is to be.
To see acceptable values for
.I brightness
use the command "lsattr -R -l scan0 -a brightness".
.PP
.B \-c
.I contrast
Set the hardware contrast control inside the scanner, if any.  This flag
is followed by a decimal integer that specifies the level of contrast used.
To see acceptable values for
.I contrast
use the command "lsattr -R -l scan0 -a contrast".
.I
.PP
.B \-d
Set the defaults.  Scanner settings will be remembered even after the system
reboots.
.B set_scanner
will use "chdev" to alter the ODM instead of the ioctl(2) system call on the
device special file.
.SH EXAMPLES
.PP
the command:
.PP
set_scanner -w 5.5 -h 3.75 -r 300
.PP
will set the active area of the scanner to 5 1/2" x 3 3/4" at 300 dots-per-inch
resolution
.SH "SEE ALSO"
get_scanner(1)
.SH BUGS
Probably should support Metric measurement units too.
.SH AUTHOR
.nf
Kenneth Stailey (kstailey@gnu.ai.mit.edu, kstailey@leidecker.gsfc.nasa.gov)
.fi
