openbsd/src/usr.sbin/ypserv/yptest/yptest.8
.\"	$OpenBSD: yptest.8,v 1.14 2013/07/16 11:13:34 schwarze Exp $
.\"
.\" Copyright (c) 1994 Mats O Jansson <moj@stacken.kth.se>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt YPTEST 8
.Os
.Sh NAME
.Nm yptest
.Nd calls different YP routines
.Sh SYNOPSIS
.Nm yptest
.\".Op Fl u Ar file
.\".Nm /usr/sbin/makedbm
.\".Op Fl bls
.\".Op Fl i Ar yp_input_file
.\".Op Fl o Ar yp_output_file
.\".Op Fl d Ar yp_domain_name
.\".Op Fl m Ar yp_master_name
.\".Ar infile
.\".Ar outfile
.Sh DESCRIPTION
.Nm
checks various YP functions to see if the YP server works as expected.
.\".Pp
.\"The options are as follows:
.\".Bl -tag -width Ds
.\".It Fl d Ar yp_domain_name
.\"Include an entry the in the map with the key YP_DOMAIN_NAME and the argument
.\"as value.
.\".El
.Sh SEE ALSO
.Xr yp 8 ,
.Xr ypserv 8
.Sh AUTHORS
.An Mats O Jansson Aq Mt moj@stacken.kth.se
