openbsd/src/usr.sbin/ldpctl/ldpctl.8
.\"	$OpenBSD: ldpctl.8,v 1.2 2009/10/27 16:22:15 sobrado Exp $
.\"
.\" Copyright (c) 2009 Michele Marchetto <michele@openbsd.org>
.\" Copyright (c) 2004, 2005 Esben Norby <norby@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 27 2009 $
.Dt LDPCTL 8
.Os
.Sh NAME
.Nm ldpctl
.Nd control the Label Distribution Protocol daemon
.Sh SYNOPSIS
.Nm
.Ar command
.Op Ar argument ...
.Sh DESCRIPTION
The
.Nm
program controls the
.Xr ldpd 8
daemon.
.Pp
The following commands are available:
.Bl -tag -width Ds
.It Cm lfib couple
Insert the learned routes into the Label Forwarding Information Base a.k.a.
the kernel routing table.
.It Cm lfib decouple
Remove the learned routes from the Label Forwarding Information Base a.k.a.
the kernel routing table.
.It Cm show lfib Op Ar destination | filter
Show the Label Forwarding Information Base.
.Ar destination
can be specified to show the route matching a destination IP address.
.Ar filter
can be any of the following:
.Pp
.Bl -tag -width "interfaceXXinterfaceXX" -compact
.It Cm connected
Show only connected routes.
.It Cm interface
Show only interfaces.
.It Cm static
Show only static routes.
.El
.Pp
.Cm connected ,
and
.Cm static
may be specified together.
.It Cm show interfaces
Show details for all interfaces.
.It Cm show neighbor
Show neighbors.
.It Cm show lib
Show the Label Information Base.
.El
.Sh FILES
.Bl -tag -width "/var/run/ldpd.sockXX" -compact
.It /var/run/ldpd.sock
.Ux Ns -domain
socket used for communication with
.Xr ldpd 8 .
.El
.Sh SEE ALSO
.Xr ldpd.conf 5 ,
.Xr ldpd 8
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 4.6 .
