openbsd/src/usr.sbin/gpioctl/gpioctl.8
.\"	$OpenBSD: gpioctl.8,v 1.14 2008/11/24 15:27:52 jmc Exp $
.\"
.\" Copyright (c) 2004 Alexander Yurchenko <grange@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 24 2008 $
.Dt GPIOCTL 8
.Os
.Sh NAME
.Nm gpioctl
.Nd control GPIO devices
.Sh SYNOPSIS
.Nm gpioctl
.Op Fl q
.Op Fl d Ar device
.Op Ar pin
.Op Ar 0 | 1 | 2
.Nm gpioctl
.Op Fl q
.Op Fl d Ar device
.Fl c
.Ar pin
.Op Ar flags
.Nm gpioctl
.Fl A Ar device
.Fl o Ar offset
.Fl m Ar mask
.Nm gpioctl
.Fl D Ar device
.Sh DESCRIPTION
The
.Nm
program allows manipulation of GPIO
(General Purpose Input/Output) device pins.
Such devices can be either part of the chipset or embedded CPU,
or a separate chip.
The usual way of using GPIO
is to connect some simple devices such as LEDs and 1-wire thermal sensors
to its pins.
.Pp
Each GPIO device has an associated device file in the
.Pa /dev
directory.
By default
.Nm
uses
.Pa /dev/gpio0 ,
which corresponds to the first found
GPIO device in the system.
.Pp
GPIO pins can be either
.Dq read
or
.Dq written
with the values of logical 0 or 1.
If only a
.Ar pin
number is specified on the command line, the pin state will be read
from the GPIO controller and displayed.
To write to a pin, a value must be specified after the
.Ar pin
number.
Values can be either 0 or 1.
A value of 2 has a special meaning: it
.Dq toggles
the pin, i.e. changes its state to the opposite.
.Pp
The following configuration
.Ar flags
are supported by the GPIO framework:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It in
input direction
.It out
output direction
.It inout
bi-directional
.It od
open-drain output
.It pp
push-pull output
.It tri
tri-state (output disabled)
.It pu
internal pull-up enabled
.It pd
internal pull-down enabled
.It iin
invert input
.It iout
invert output
.El
.Pp
Note that not all the flags can be supported by the particular GPIO controller.
.Pp
When executed without any arguments,
.Nm
reads information about the
GPIO device and displays it.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl A Ar device
Attach
.Ar device
at this gpiobus.
An
.Fl o Ar offset
(a pin number) and
.Fl m Ar mask
(a binary mask)
must also be specified.
.It Fl c Ar pin
Configure
.Ar pin
with any of the various flags,
as documented above.
The list of supported flags is always displayed when executing
.Nm
with this option.
To change pin flags,
a new flags set separated by spaces must be specified
after the pin number.
.It Fl D Ar device
Detach
.Ar device
from this gpiobus.
Only devices that have been attached using the
.Fl a
option can be detached.
.It Fl d Ar device
If more than one GPIO device is present,
an alternative
.Ar device
file can be specified with the
.Fl d
option in order to access a particular GPIO device.
.It Fl m Ar mask
Specify a binary mask,
.Ar mask ,
for the device being attached
.Pq Fl A .
.It Fl o Ar offset
Specify a pin number,
.Ar offset ,
for the device being attached
.Pq Fl A .
.It Fl q
Operate quietly i.e. nothing is printed to stdout.
.El
.Sh FILES
.Bl -tag -width "/dev/gpiou" -compact
.It /dev/gpio Ns Ar u
GPIO device unit
.Ar u
file.
.El
.Sh EXAMPLES
Configure pin 20 to have push-pull output:
.Pp
.Dl # gpioctl -c 20 out pp
.Pp
Write logical 1 to pin 20:
.Pp
.Dl # gpioctl 20 1
.Pp
Attach a
.Xr onewire 4
bus on a
.Xr gpioow 4
device on pin 4:
.Pp
.Dl # gpioctl -A gpioow -o 4 -m 0x01
.Pp
Detach the gpioow0 device:
.Pp
.Dl # gpioctl -D gpioow0
.Sh SEE ALSO
.Xr gpio 4
.Sh HISTORY
The
.Nm
command first appeared in
.Ox 3.6 .
.Sh AUTHORS
The
.Nm
program was written by
.An Alexander Yurchenko Aq grange@openbsd.org .
Device attachment was added by
.An Marc Balmer Aq mbalmer@openbsd.org .
