openbsd/src/usr.sbin/altq/altqd/altq.conf.5
.\"	$OpenBSD: altq.conf.5,v 1.1.1.1 2001/06/27 18:23:17 kjc Exp $
.\"	$KAME: altq.conf.5,v 1.8 2001/04/09 16:26:28 thorpej Exp $
.\"
.\" Copyright (C) 2000
.\" Sony Computer Science Laboratories Inc.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY SONY CSL AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL SONY CSL OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd September 28, 1999
.Dt ALTQ.CONF 5
.Os KAME
.\"
.Sh NAME
.Nm altq.conf
.Nd ALTQ configuration file
.\"
.Sh DESCRIPTION
The
.Nm altq.conf
file contains a number of lines specifying the behavior of queueing
disciplines.  Comments start with a # and extend to the end of the line.
.Pp
The
.Xr altqd 8
program reads
.Pa /etc/altq.conf
at startup and sets up queueing disciplines.
BLUE, CBQ (Class-Based Queueing), FIFOQ (First-In First-Out Queue),
HFSC (Hierarchical Fair Service Curve), PRIQ (Priority Queueing),
RED (Random Early Detection), RIO (RED with IN/OUT),
WFQ (Weighted Fair Queueing),
and CDNR (Diffserv Traffic Conditioner) can be configured in this file.
.Pp
.Sh Interface Commands
.Bl -tag -width interface -offset indent
.It Nm interface
.Ar if_name
.Op Cm bandwidth Ar bps
.Op Cm tbrsize Ar bytes
.Op Ar sched_type
.Op Ar discipline-specific-options
.El
.Pp
The
.Sy interface
command specifies a network interface to be under control of ALTQ.
One interface specification is provided for each network interface
under control of ALTQ.  A system configured as a router may have
multiple interface specifications.
.\"
.Bl -tag -width 8n -offset indent
.It Em if_name
specifies the name of a network interface (e.g., fxp0).
.It Sy bandwidth
specifies the interface bandwidth in bits per second.
This is the maximum rate that the queueing discipline will allow on this
interface.
.It Sy tbrsize
specifies the bucket size of a token bucket regulator in bytes.
When
.Sy tbrsize
is omitted, the system automatically sets the bucket size
using heuristics.
The token rate is set to the interface bandwidth specified by the
.Sy interface
command.
.It Em sched_type
Type of a queueing discipline.  It must be either
.Sy blue ,
.Sy cbq ,
.Sy fifoq ,
.Sy hfsc ,
.Sy priq ,
.Sy red ,
.Sy rio ,
or
.Sy wfq .
If the interface has only traffic conditioners and no queueing
discipline, sched_type can be omitted.
.El
.Pp
.Sh Class Command
.Bl -tag -width class -offset indent
.It Nm class
.Ar sched_type
.Ar if_name
.Ar class_name
.Ar parent_name
.Op Cm red|rio
.Op Cm ecn
.Op Cm cleardscp
.Op Ar discipline-specific-options
.El
.Pp
The
.Sy class
command specifies a packet scheduling class for CBQ, HFSC, or PRIQ.
A class specifier must be provided for each packet scheduling class.
.Bl -tag -width 8n -offset indent
.It Em sched_type
Type of queueing discipline.  Must correspond to the discipline name
in interface specification.
.It Em if_name
Interface name. Must correspond to name in interface specification.
.It Em class_name
Arbitrary name for this class.  Must be unique for this interface.
.It Em parent_name
The name of the parent class for this class (for CBQ or HFSC).
Parent class must have been previously defined.
PRIQ does not have class hierarchy and parent_name must be ``NULL''
for PRIQ classes.
.It Sy red
Use RED (Random Early Detection) on this class queue.
RED drops packets with the probability propotional to the average
queue length.
.It Sy rio
Use RIO (RED with In/Out bit) on this class queue.
RIO runs triple RED algorithms at the same time.
.It Sy ecn
Use RED/ECN (Explicit Congestion Notification) on this
class queue (experimental implementation).  ECN implies RED.
.It Sy cleardscp
Clear diffserv codepoint in the IP header.
.El
.Pp
.Sh Filter Commands
.Bl -tag -width filter -offset indent
.It Nm filter
.Ar if_name
.Ar class_name
.Op Cm name Ar fltr_name
.Op Cm ruleno Ar num
.Ar filter_values
.El
.Pp
The
.Sy filter
command specifies a filter to classify packets into
a scheduling class.
A filter specifier determines any statically-defined packet
classification rules.
.Bl -tag -width 10n -offset indent
.It Em if_name
Name of a network interface (e.g., fxp0).
.It Em class_name
Name of a class or a conditioner to which matching packets are directed.
.It Sy name
Add an arbitrary name to the filter for a future refenece.
.It Sy ruleno
Specifies explicit order of filter matching.  Filter matching is performed
from a filter with a larger ruleno.  Default is 0.
.El
.Pp
.Em filter_value
should be in the following format:
.Bl -tag -width filter -offset indent
.It filter_values :
.Ad dst_addr Op Cm netmask Ar mask
.Ar dport
.Ad src_addr Op Cm netmask Ar mask
.Ar sport
.Ar proto
.Oo
.Sy tos
.Ar value
.Op Cm tosmask Ar value
.Oc
.Op Cm gpi Ar value
.El
.Pp
Here
.Ad dst_addr
and
.Ad src_addr
are dotted-decimal addresses of
the destination and the source respectively.  An address may be
followed by
.Sy netmask
keyword.
.Em dport
and
.Em sport
are port numbers of the destination and the source respectively.
.Em proto
is a protocol number defined for IP packets (e.g. 6 for TCP).
.Sy tos
keyword can be used to specify the type of service field value.
.Sy gpi
keyword can be used to specify the Security Parameter Index value for
IPSec.
.Pp
When filter value 0 is used, it is taken as a wildcard.
.Bl -tag -width filter6 -offset indent
.It Nm filter6
.Ar if_name
.Ar class_name
.Op Cm name Ar fltr_name
.Op Cm ruleno Ar num
.Ar filter6_values
.El
.Pp
The
.Sy filter6
command is for IPv6.
.Em filter6_value
should be in the following format:
.Bl -tag -width filter6 -offset indent
.It filter6_values :
.Ad dst_addr[/prefix_len]
.Ar dport
.Ad src_addr[/prefix_len]
.Ar sport
.Ar proto
.Op Cm flowlabel Ar value
.Oo
.Sy tclass
.Ar value
.Op Cm tclassmask Ar value
.Oc
.Op Cm gpi Ar value
.El
.Pp
Here
.Ad dst_addr
and
.Ad src_addr
are IPv6 addresses of the destination and the source respectively.
An address may be followed by an optional
.Sy address prefix length .
.Em dport
and
.Em sport
are port numbers of the destination and the source respectively.
.Em proto
is a protocol number defined for IPv6 packets (e.g. 6 for TCP).
.Sy flowlabel
keyword can be used to specify the flowlabel field value.
.Sy tclass
keyword can be used to specify the traffic class field value.
.Sy gpi
keyword can be used to specify the Security Parameter Index value for
IPSec.
.Pp
When filter value 0 is used, it is taken as a wildcard.
.Pp
.Sh CBQ Commands
CBQ (Class Based Queueing) achieves both partitioning and sharing of
link bandwidth  by hierarchically structured classes.
Each class has its own queue and is assigned its share of bandwidth.
A child class can borrow bandwidth from its parent class as long as
excess bandwidth is available.
.Bl -tag -width interface -offset indent
.It Nm interface
.Ar if_name
.Op Cm bandwidth Ar bps
.Op Cm tbrsize Ar bytes
.Op Ar sched_type
.Op Cm efficient
.El
.Pp
.Bl -tag -width 8n -offset indent
.It Em if_name
specifies the name of a network interface (e.g., fxp0).
.It Sy bandwidth
specifies the interface bandwidth in bits per second.
.It Sy tbrsize
specifies the bucket size of a token bucket regulator in bytes.
.It Em sched_type
must be either
.Sy cbq ,
.Sy cbq-wrr
(weighted-round robin) or
.Sy cbq-prr
(packet-by-packet round robin).
.Sy cbq
is equivalent to
.Sy cbq-wrr .
.It Sy efficient
Enables CBQ's link efficiency mode.  This means that
the scheduler will send a packet from the first overlimit
class it encounters of all classes of the link-sharing
structure when all classes are overlimit.
This will also cause the scheduler to use greater than it's assigned
bandwidth, if the link is capable of more than the assigned bandwidth.
By default, this mode is turned off.  By adding the keyword
.Sy efficient
to the interface specification line, enables this mode.
.El
.Pp
.Bl -tag -width class -offset indent
.It Nm class
.Ar sched_type
.Ar if_name
.Ar class_name
.Ar parent_name
.Op Cm admission cntlload|none
.Op Cm priority Ar pri
.Op Cm pbandwidth Ar percent
.Op Cm exactbandwidth Ar bps
.Op Cm borrow
.Op Cm default
.Op Cm control
.Op Cm maxburst Ar count
.Op Cm minburst Ar count
.Bk -words
.Op Cm maxdelay Ar msec
.Ek
.Op Cm packetsize Ar bytes
.Op Cm maxpacketsize Ar bytes
.Op Cm red|rio
.Op Cm ecn
.Op Cm flowvalve
.Op Cm cleardscp
.El
.Pp
The
.Sy class
command specifies a CBQ class.
The classes are organized as a hierarchy, and every class, except
for the root class, has a parent.
.Bl -tag -width 8n -offset indent
.It Em sched_type
must be
.Sy cbq
for a CBQ class.
.It Em if_name
Interface name. Must correspond to name in interface specification.
.It Em class_name
Arbitrary name for this class.  Must be unique within the class
hierarchy for this interface.  The name
.Sy ctl_class
is a reserved class name.
.It Em parent_name
The name of the parent class for this class or
.Sy NULL
if this is the root class.  Parent class must have been previously defined.
.It Sy admission
The type of admission control and QoS type.
.Sy cntlload
is controlled load service for
.Em RSVP ,
otherwise, it should be
.Sy none .
The default is
.Sy none .
.It Sy priority
High numbers are higher priority.  Max value is 7 and Min value is 0.
Default is 1.
.It Sy pbandwidth
The percentage of the interface bandwidth allocated to this class.
Generally should add up to 100 percent at each level of the class
hierarchy, although other amounts can be specified for purposes of
experimentation.
.It Sy exactbandwidth
Specify the bandwidth in bits-per-second instead of
.Sy pbandwidth .
Note that the bandwidth allocation of CBQ is not so precise but this
is just a way to pass a parameter to CBQ; the user is supposed to know
the detailed internals of CBQ.
.Sy pbandwidth
is a preferred way to specify the bandwidth of a class.
.It Sy borrow
The class can borrow bandwidth from its parent class when this class
is overlimit.
If this keyword is not present, then no borrowing is done, and the
packet is delayed or dropped when the class is overlimit.
.It Sy default
Specify the default class.  When this keyword is present, all packets
that do not match some classification criteria are assigned to this
class.  Must be exactly one class on each interface defined as the
default class.
.It Sy control
Specify the control class.  When this keyword is present, the predefined
control class packets (RSVP, IGMP, and ICMP) are assigned to this
class.
Note that when the control class is not specified by the time the
default class is created, one is automatically created with default
parameters.  Thus, if the control class is specified, it must be
listed before the default class.
Must be exactly one class on each interface defined as the
control class.
.It Sy maxburst
The maximum burst of back-to-back packets allowed in this class.
Default is 16 but the default value is automatically reduced to 4 when
the class bandwidth is small (about less than 1Mbps).
.It Sy minburst
The minimum burst is used to obtain the steady state burst size.  It's
the parameter to help compute offtime for the class.  Offtime is the
amount of time a class is to wait between packets. Default is 2.
.It Sy maxdelay
The maxdelay is specified in millisecond and used to obtain the max
queue size of the class.
If not specified, the default max queue size (30 packets) is used.
.It Sy packetsize
The average packet size in bytes to be used in CBQ over-/under-limit
computations.  Default value is MTU of the interface.
.It Sy maxpacketsize
The maxium packet size in bytes for the class.
Default value is MTU of the interface.
.It Sy red
enables RED on this class queue.
.It Sy rio
enables RIO on this class queue.
.It Sy ecn
enables RED/ECN on this class queue.
.It Sy flowvalve
enables RED/flow-valve (a.k.a. red-penalty-box) on this class queue.
.It Sy cleardscp
clears diffserv codepoint in the IP header.
.El
.Pp
.Sh HFSC Commands
HFSC (Hierarchical Fair Service Curve) supports both link-sharing and
guaranteed real-time services.  H-FSC employs a service curve based QoS
model, and its unique feature is an ability to decouple delay and
bandwidth allocation.
HFSC has 2 independent scheduling mechanisms.
Real-time scheduling is used to guarantee the delay and the
bandwidth allocation at the same time.
Hierarchical link-sharing is used to distribute the excess
bandwidth.
When dequeueing a packet, HFSC always tries real-time scheduling
first.  If no packet is eligible for real-time scheduling,
link-sharing scheduling is performed.
HFSC does not use class hierarchy for real-time scheduling.
.Bl -tag -width interface -offset indent
.It Nm interface
.Ar if_name
.Op Cm bandwidth Ar bps
.Op Cm tbrsize Ar bytes
.Op Ar sched_type
.El
.Pp
.Bl -tag -width 8n -offset indent
.It Em if_name
specifies the name of a network interface (e.g., fxp0).
.It Sy bandwidth
specifies the interface bandwidth in bits per second.
.It Sy tbrsize
specifies the bucket size of a token bucket regulator in bytes.
.It Em sched_type
must be
.Sy hfsc
for HFSC.
.El
.Pp
.Bl -tag -width class -offset indent
.It Nm class
.Ar sched_type
.Ar if_name
.Ar class_name
.Ar parent_name
.Op Cm admission cntlload|none
.Op Bq Cm sc Em m1 d m2
.Op Bq Cm rt Em m1 d m2
.Op Bq Cm ls Em m1 d m2
.Op Cm pshare Ar percent
.Op Cm grate Ar bps
.Op Cm default
.Op Cm qlimit Ar count
.Op Cm red|rio
.Op Cm ecn
.Op Cm cleardscp
.El
.Pp
The
.Sy class
command specifies a HFSC class.
The classes are organized as a hierarchy, and every class, except
for the root class, has a parent.
.Pp
Each HFSC class has 2 service curves, the real-time service curve and
the link-sharing service curve.  Service curves are specified by
.Bq Em type m1 d m2
\&.
.Em type
should be either
.Sy sc, rt
or
.Sy ls .
.Sy sc
(service curve) is used to set the same values to both service curves.
.Sy rt
(real-time) is used to specify the real-time service curve.
.Sy ls
(link-sharing) is used to specify the link-sharing service curve.
.Em m1
is the slope of the first segment specified in bits-per-second.
.Em d
is the x-projection of the intersection point of the 2 segments
specified in milli-second.
.Em m2
is the slope of the second segment specified in bits-per-second.
.Bl -tag -width 8n -offset indent
.It Em sched_type
must be
.Sy hfsc
for a HFSC class.
.It Em if_name
Interface name. Must correspond to name in interface specification.
.It Em class_name
Arbitrary name for this class.  Must be unique within the class
hierarchy for this interface.  The name
.Sy root
is a reserved class name for the root class.  The root class for the
interface is automatically created by the
.Sy interface
command.
.It Em parent_name
The name of the parent class for this class.  Keyword
.Sy root
is used when the parent is the root class.  Parent class must
have been previously defined.
.It Sy admission
The type of admission control and QoS type.
.Sy cntlload
is controlled load service for
.Em RSVP ,
otherwise, it should be
.Sy none .
The default is
.Sy none .
.It Sy pshare
Percent of the link share.  This specifies a linear link-sharing
service curve as a fraction of the link bandwidth.
It is a short hand of [ls 0 0 (link-bandwidth * percent / 100)].
.It Sy grate
Guaranteed rate.  This specifies a linear real-time service curve.
It is a short hand of [rt 0 0 bps].
.It Sy default
Specify the default class.  When this keyword is present, all packets
that do not match some classification criteria are assigned to this
class.  Must be exactly one class on each interface defined as the
default class.
.It Sy qlimit
The maxium queue size in number of packets.
Default value is 50.
.It Sy red
enables RED on this class queue.
.It Sy rio
enables RIO on this class queue.
.It Sy ecn
enables RED/ECN on this class queue.
.It Sy cleardscp
clears diffserv codepoint in the IP header.
.El
.Pp
.Sh PRIQ Commands
PRIQ (Priority Queueing) implements a simple priority-based queueing.
A higher priority class is always served first.
Up to 16 priorities can be used with PRIQ.
.Bl -tag -width interface -offset indent
.It Nm interface
.Ar if_name
.Op Cm bandwidth Ar bps
.Op Cm tbrsize Ar bytes
.Op Ar sched_type
.El
.Pp
.Bl -tag -width 8n -offset indent
.It Em if_name
specifies the name of a network interface (e.g., fxp0).
.It Sy bandwidth
specifies the interface bandwidth in bits per second.
.It Sy tbrsize
specifies the bucket size of a token bucket regulator in bytes.
.It Em sched_type
must be
.Sy priq
for PRIQ.
.El
.Pp
.Bl -tag -width class -offset indent
.It Nm class
.Ar sched_type
.Ar if_name
.Ar class_name
.Ar parent_name
.Op Cm priority Ar pri
.Op Cm default
.Op Cm qlimit Ar count
.Op Cm red|rio
.Op Cm ecn
.Op Cm cleardscp
.El
.Pp
.Bl -tag -width 8n -offset indent
.It Em sched_type
must be
.Sy priq
for a PRIQ class.
.It Em if_name
Interface name. Must correspond to name in interface specification.
.It Em class_name
Arbitrary name for this class.  Must be unique for this interface.
.It Em parent_name
Parent class must be ``NULL'' for PRIQ.
.It Sy priority
High numbers are higher priority.
Max value is 15 and Min value is 0.  Default is 0.
A higher priority class is always served first in PRIQ.
Priority must be unique for the interface.
.It Sy default
Specify the default class.  When this keyword is present, all packets
that do not match some classification criteria are assigned to this
class.  Must be exactly one class on each interface defined as the
default class.
.It Sy qlimit
The maxium queue size in number of packets.
Default value is 50.
.It Sy red
enables RED on this class queue.
.It Sy rio
enables RIO on this class queue.
.It Sy ecn
enables RED/ECN on this class queue.
.It Sy cleardscp
clears diffserv codepoint in the IP header.
.El
.Pp
.Sh WFQ Commands
WFQ (Weighted Fair Queueing) implements a weighted-round robin
scheduler for a set of queue.
A weight can be assigned to each queue to give a
different proportion of the link capacity.
A hash function is used to map a flow to one of a set of queues, and
thus, it is possible for two different flows to be mapped into the same
queue.
.Bl -tag -width interface -offset indent
.It Nm interface
.Ar if_name
.Op Cm bandwidth Ar bps
.Op Cm tbrsize Ar bytes
.Op Ar sched_type
.Op Cm nqueues Ar count
.Op Cm qsize Ar bytes
.Op Cm hash Ar policy
.El
.Pp
.Bl -tag -width 8n -offset indent
.It Em if_name
specifies the name of a network interface (e.g., fxp0).
.It Sy bandwidth
specifies the interface bandwidth in bits per second.
.It Sy tbrsize
specifies the bucket size of a token bucket regulator in bytes.
.It Em sched_type
must be
.Sy wfq
for WFQ.
.It Sy nqueues
The number of queues in WFQ.  Default value is 256.
.It Sy qsize
The size of each queue in number of bytes.  Default value is 64K bytes.
.It Sy hash
Type of hash policy to select a queue.
.Sy dstaddr
specifies a hashing policy by IP destination address.
.Sy full
specifies a hashing policy by IP addresses and ports.
.Sy srcport
specifies a hashing policy by IP source port number.  Default is
.Sy dstaddr
.El
.Pp
.Sh FIFOQ Commands
FIFOQ (First-In First-Out Queueing) is a simple tail-drop FIFO queue.
FIFOQ is the simplest possible implementation of a queueing discipline
in ALTQ, and can be used to compare with other queueing disciplines.
FIFOQ can be also used as a template for those who want to write their
own queueing disciplines.
.Bl -tag -width interface -offset indent
.It Nm interface
.Ar if_name
.Op Cm bandwidth Ar bps
.Op Cm tbrsize Ar bytes
.Op Ar sched_type
.Op Cm qlimit Ar count
.El
.Pp
.Bl -tag -width 8n -offset indent
.It Em if_name
specifies the name of a network interface (e.g., fxp0).
.It Sy bandwidth
specifies the interface bandwidth in bits per second.
.It Sy tbrsize
specifies the bucket size of a token bucket regulator in bytes.
.It Em sched_type
must be
.Sy fifoq
for FIFOQ.
.It Sy qlimit
The maxium queue size in number of packets.
Default value is 50.
.El
.Pp
.Sh RED Commands
RED (Random Early Detection) is an implicit congestion notification
mechanism that exercises packet dropping or packet marking
stochastically according to the average queue length.
RED can be viewed as a buffer management mechanism
and can be integrated into other packet scheduling schemes.
.Bl -tag -width red -offset indent
.It Nm red
.Ar min_th
.Ar max_th
.Ar inv_pmax
.El
.Pp
The
.Sy red
command sets the default RED paramters.
.Em min_th
and
.Em max_th
are the minimum and the maximum threshold values.
.Em inv_pmax
is the inverse (reciprocal) of the maximum drop probability.
For example, 10 means the maximum drop probability of 1/10.
.Bl -tag -width interface -offset indent
.It Nm interface
.Ar if_name
.Op Cm bandwidth Ar bps
.Op Cm tbrsize Ar bytes
.Op Ar sched_type
.Op Cm qlimit Ar count
.Op Cm packetsize Ar bytes
.Op Cm weight Ar n
.Op Cm thmin Ar n
.Op Cm thmax Ar n
.Op Cm invpmax Ar n
.Op Cm ecn
.Op Cm flowvalve
.El
.Pp
.Bl -tag -width 8n -offset indent
.It Em if_name
specifies the name of a network interface (e.g., fxp0).
.It Sy bandwidth
specifies the interface bandwidth in bits per second.
.It Sy tbrsize
specifies the bucket size of a token bucket regulator in bytes.
.It Em sched_type
must be
.Sy red
for RED.
.It Sy qlimit
The maxium queue size in number of packets.
Default value is 60.
.It Sy packetsize
The average packet size in number of bytes.  This parameter is used to
calibrate the idle period.  Default value is 1000.
.It Sy weight
The inverse of the weight of EWMA (exponentially weighted moving average).
.It Sy thmin
The minimum threshold.
.It Sy thmax
The maximum threshold.
.It Sy invpmax
The inverse of the maximum drop probability.
.It Sy ecn
enables ECN.
.It Sy flowvalve
enables flowvalve.
.El
.Pp
.Sh RIO Commands
ALTQ/RIO has 3 drop precedence levels defined for the Assured
Forwarding of DiffServ (RFC2597).
Since adaptive flows are likely to stay under
the medium drop precedence level under congestion, the medium drop
precedence would protect adaptive flows from unadaptive flows.
.Pp
The original RIO has 2 sets of RED parameters; one for in-profile
packets and the other for out-of-profile packets.
At the ingress of the network, profile meters tag packets as IN
or OUT based on contracted profiles for customers.
Inside the network, IN packets receive preferential treatment by
the RIO dropper.
It is possible to provision the network not to drop IN packets
at all by providing enough capacity for the total volume of IN
packets.
Thus, RIO can be used to provide a service that statistically assures
capacity allocated for users.
This mechanism can be extended to support an arbitrary number of drop
precedence levels.  ALTQ supports 3 drop precedence levels.
.Bl -tag -width rio -offset indent
.It Nm rio
.Ar low_min_th
.Ar low_max_th
.Ar low_inv_pmax
.Ar medium_min_th
.Ar medium_max_th
.Ar medium_inv_pmax
.Ar high_min_th
.Ar high_max_th
.Ar high_inv_pmax
.El
.Pp
The
.Sy rio
command sets the default RIO paramters.  The parameters are
RED parameters for 3 (low, medium, high) drop precedence.
.Bl -tag -width interface -offset indent
.It Nm interface
.Ar if_name
.Op Cm bandwidth Ar bps
.Op Cm tbrsize Ar bytes
.Op Ar sched_type
.Op Cm qlimit Ar count
.Op Cm packetsize Ar bytes
.Op Cm weight Ar n
.Op Cm lo_thmin Ar n
.Op Cm lo_thmax Ar n
.Op Cm lo_invpmax Ar n
.Op Cm med_thmin Ar n
.Op Cm med_thmax Ar n
.Op Cm med_invpmax Ar n
.Op Cm hi_thmin Ar n
.Op Cm hi_thmax Ar n
.Op Cm hi_invpmax Ar n
.Op Cm ecn
.El
.Pp
.Bl -tag -width 8n -offset indent
.It Em if_name
specifies the name of a network interface (e.g., fxp0).
.It Sy bandwidth
specifies the interface bandwidth in bits per second.
.It Sy tbrsize
specifies the bucket size of a token bucket regulator in bytes.
.It Em sched_type
must be
.Sy rio
for RIO.
.It Sy qlimit
The maxium queue size in number of packets.
Default value is 60.
.It Sy packetsize
The average packet size in number of bytes.  This parameter is used to
calibrate the idle period.  Default value is 1000.
.It Sy weight
The inverse of the weight of EWMA (exponentially weighted moving average).
.It Sy lo_thmin
The minimum threshold for low drop precedence.
.It Sy lo_thmax
The maximum threshold for low drop precedence.
.It Sy lo_invpmax
The inverse of the maximum drop probability for low drop precedence.
.It Sy med_thmin
The minimum threshold for medium drop precedence.
.It Sy med_thmax
The maximum threshold for medium drop precedence.
.It Sy med_invpmax
The inverse of the maximum drop probability for medium drop precedence.
.It Sy hi_thmin
The minimum threshold for high drop precedence.
.It Sy hi_thmax
The maximum threshold for high drop precedence.
.It Sy hi_invpmax
The inverse of the maximum drop probability for high drop precedence.
.It Sy ecn
enables ECN.
.El
.Pp
.Sh BLUE Commands
.Bl -tag -width interface -offset indent
.It Nm interface
.Ar if_name
.Op Cm bandwidth Ar bps
.Op Cm tbrsize Ar bytes
.Op Ar sched_type
.Op Cm qlimit Ar count
.Op Cm packetsize Ar bytes
.Op Cm maxpmark Ar n
.Op Cm holdtime Ar usec
.Op Cm ecn
.El
.Pp
.Bl -tag -width 8n -offset indent
.It Em if_name
specifies the name of a network interface (e.g., fxp0).
.It Sy bandwidth
specifies the interface bandwidth in bits per second.
.It Sy tbrsize
specifies the bucket size of a token bucket regulator in bytes.
.It Em sched_type
must be
.Sy blue
for BLUE.
.It Sy qlimit
The maxium queue size in number of packets.
Default value is 60.
.It Sy packetsize
The average packet size in number of bytes.  Default value is 1000.
.It Sy maxpmark
specifies the precision of marking probability.
.It Sy holdtime
specifies the hold time in usec.
.It Sy ecn
enables ECN.
.El
.Pp
.Sh CDNR Commands
The
.Sy conditioner
command specifies a diffserv traffic conditioner.  A traffic
conditioner is not a queueing discipline but a component to meter,
mark or drop incoming packets according to some rules.
.Pp
As opposed to a queueing discipline, a traffic conditioner handles
incoming packets at an input interface.
If no queueing discipline (e.g., CBQ) is used for the interface,
a null interface command should be used to specify an input network
interface.
.Bl -tag -width interface -offset indent
.It Nm interface
.Ar if_name
.Op Cm bandwidth Ar bps
.Op Cm tbrsize Ar bytes
.El
.Pp
The
.Sy conditioner
command has the following syntax.
.Bl -tag -width conditioner -offset indent
.It Nm conditioner
.Ar if_name
.Ar cdnr_name
.Aq action
.El
.Pp
.Bl -tag -width 10n -offset indent
.It Em if_name
Interface name. Must correspond to name in interface specification.
.It Em cdnr_name
Arbitrary name for this conditioner.  Must be unique for this
interface.
.It Em action
Action of the conditioner.
.El
.Pp
An action can be a recursively defined action. The following actions
are defined.
.Bl -tag -width pass -offset indent
.It Nm pass
.Bl -inset -offset indent
.It Sy pass
allows the packet to go through without any modification to the packet.
.El
.El
.Pp
.Bl -tag -width drop -offset indent
.It Nm drop
.Bl -inset -offset indent
.It Sy drop
rejects the packet.  The packet is immediately discarded.
.El
.El
.Pp
.Bl -tag -width mark -offset indent
.It Nm mark
.Ar value
.Bl -inset -offset indent
.It Sy mark
sets the specified value to the ds field in the IP header.  Then, the
packet is allowed to go through.
.El
.El
.Pp
.Bl -tag -width tbmeter -offset indent
.It Nm tbmeter
.Ar rate depth
.Aq in_action
.Aq out_action
.Pp
.Bl -inset -offset indent
.It Sy tbmeter
is a token bucket meter configured with rate and depth parameters.
Rate is token rate in bits-per-second.  Depth is bucket depth in KB.
When an incoming packet is in profile (available token is more than
the packet size), tbmeter takes in_action.
Otherwise, tbmeter takes out_action.
.El
.El
.Pp
.Bl -tag -width trtcm -offset indent
.It Nm trtcm
.Ar cmtd_rate cmtd_depth peak_rate peak_depth
.Aq green_action
.Aq yellow_action
.Aq red_action
.Op Cm coloraware|colorblind
.Bl -inset -offset indent
.It Sy trtcm
is a 2-rate 3 color marker for Assured Forwarding.
A trtcm consists of 2 token buckets, one for a committed rate and the
other for a peak rate.
When an incoming packet is in the committed profile, trtcm takes
green_action.  When the packet is out of the committed profile but in
the peak profile, trtcm takes yellow_action.  Otherwise, tbtcm takes
red_action.
A trtcm is either color-aware or color-blind.  A color-aware trtcm do
not raise the color (ds field value), that is, a yellow packet can be
yellow or red but can not be blue.  Default is color-blind.
.El
.El
.Pp
.Bl -tag -width tswtcm -offset indent
.It Nm tswtcm
.Ar cmtd_rate peak_rate avg_interval
.Aq green_action
.Aq yellow_action
.Aq red_action
.Bl -inset -offset indent
.It Sy tswtcm
is a time sliding window 3 color marker for Assured Forwarding.
A tswtcm differs from trtcm in that a tswtcm probabilistically marks
packets.
A tswtcm consists of 2 rates, one for a committed rate and the
other for a peak rate.
When an incoming packet is in the committed profile, tswtcm takes
green_action.  When the packet is out of the committed profile but in
the peak profile, tswtcm takes yellow_action.  Otherwise, tswtcm takes
red_action.
cmtd_rate and peak_rate are specified in bits per seccond.
avg_interval provides the size of time window for averaging incoming
rate, and is specified in milli-second.  500 msec is ok for normal
settings.
.El
.El
.Pp
.Sh EXAMPLES
.nf

CBQ Example:

#
# cbq configuration for vx0 (10Mbps ether)
# give at least 40% to TCP
# limit HTTP from network 133.138.1.0 up to 10%, use RED.
# other traffic goes into default class
#
interface vx0 bandwidth 10M cbq
#
class cbq vx0 root_class NULL priority 0 pbandwidth 100
class cbq vx0 def_class root_class borrow pbandwidth 95 default
class cbq vx0 tcp_class def_class borrow pbandwidth  40
        filter vx0 tcp_class 0 0 0 0 6
class cbq vx0 csl_class tcp_class pbandwidth  10   red
        filter vx0 csl_class 0 0 133.138.1.0 netmask 0xffffff00 80 6
        filter vx0 csl_class 133.138.1.0 netmask 0xffffff00 0 0 80 6
#
# sample filter6 command
#
                filter6 vx0 csl_class ::0 0 d000:a:0:123::/64 80 6

HFSC Example:

#
# hfsc configuration for hierachical sharing
#
interface pvc0 bandwidth 45M hfsc
#
# (10% of the bandwidth share goes to the default class)
class hfsc pvc0 def_class root pshare 10 default
#
#          bandwidth share    guaranteed rate
#    CMU:       45%             15Mbps
#    PITT:      45%             15Mbps
#
class hfsc pvc0 cmu  root pshare 45 grate 15M
class hfsc pvc0 pitt root pshare 45 grate 15M
#
# CMU      bandwidth share    guaranteed rate
#    CS:        20%             10Mbps
#    other:     20%              5Mbps
#
class hfsc pvc0 cmu_other cmu  pshare 20 grate 10M
        filter pvc0 cmu_other   0 0 128.2.0.0   netmask 0xffff0000 0 0
class hfsc pvc0 cmu_cs    cmu  pshare 20 grate  5M
        filter pvc0 cmu_cs      0 0 128.2.242.0 netmask 0xffffff00 0 0
#
# PITT     bandwidth share    guaranteed rate
#    CS:        20%             10Mbps
#    other:     20%              5Mbps
#
class hfsc pvc0 pitt_other pitt  pshare 20 grate 10M
        filter pvc0 pitt_other  0 0 136.142.0.0  netmask 0xffff0000 0 0
class hfsc pvc0 pitt_cs    pitt  pshare 20 grate  5M
        filter pvc0 pitt_cs     0 0 136.142.79.0 netmask 0xffffff00 0 0


PRIQ Example:

#
# priq configuration for fxp0 (100Mbps ether)
#     icmp: high priority
#     tcp:  medium priority
#     others: low priority
#
interface fxp0 bandwidth 100M priq
#
class priq fxp0 high_class NULL priority 2
        filter fxp0 high_class 0 0 0 0 1
class priq fxp0 med_class NULL priority 1
        filter fxp0 high_class 0 0 0 0 6
class priq fxp0 low_class NULL priority 0 default


WFQ Example:

interface pvc0 bandwidth 134000000 wfq


FIFOQ Example:

interface rl0 bandwidth 10M fifoq


Conditioner Example:

#
interface fxp0
#
# a simple dropper
# discard all packets from 192.168.0.83
#
conditioner fxp0 dropper <drop>
        filter fxp0 dropper 0 0 192.168.0.83 0 0

#
# EF conditioner
# mark EF to all packets from 192.168.0.117
#
conditioner pvc1 ef_cdnr <tbmeter 6M 64K <mark 0xb8><drop>>
        filter fxp0 ef_cdnr 0 0 192.168.0.117 0 0

#
# AF1x conditioner
# mark AF1x to packets from 192.168.0.178
#       AF11 (low drop precedence):    less than 3Mbps
#       AF12 (medium drop precedence): more than 3Mbps and less than 10Mbps
#       AF13 (high drop precedence):   more than 10Mbps
#
conditioner fxp0 af1x_cdnr <trtcm 3M 32K 10M 64K <mark 0x28><mark 0x30><mark 0x38>>
        filter fxp0 af1x_cdnr 0 0 192.168.0.178 0 0

.fi
.Pp
.Sh SEE ALSO
.Xr altqd 8
.Sh BUGS
This man page is incomplete. For more information read the source.
