openbsd/src/sys/arch/hp300/stand/isolif/isolif.8
.\"	$OpenBSD: isolif.8,v 1.4 1999/07/08 22:56:03 deraadt Exp $
.\"
.\" Copyright (c) 1997, Jason Downs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jason Downs for the
.\"      OpenBSD system.
.\" 4. Neither the name(s) of the author(s) nor the name OpenBSD
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd September 14, 1997
.Dt ISOLIF 8 hp300
.Os
.Sh NAME
.Nm isolif
.Nd make an ISO9660 filesystem bootable on an hp300
.Sh SYNOPSIS
.Nm /usr/mdec/isolif
.Op Fl a
.Fl s Ar isostart
.Fl e Ar isoend
.Fl n Ar name
.Fl r Ar rawfile
.Fl o Ar output
.Sh DESCRIPTION
.Nm isolif
writes an appriopate LIF header to an ISO9660 filesystem, making it bootable
an hp300.
.Pp
The ISO9660 filesystem must contain a
.Em raw
hp300 boot block file; this is normally found in
.Pa /usr/mdec/uboot.raw .
The position of that file within the ISO9660 filesystem image is then passed
to
.Nm
and a LIF header is output to a file (which may be the actual ISO9660
filesystem).  When written to a CD or other media, this filesystem is then
bootable.
.Sh OPTIONS
.Bl -tag -width XxXXXXXXXXX
.It Fl a
The
.Fl a
flag specifies that
.Nm
should not truncate it's output file; this allows the output file to be
the actual ISO9660 filesystem image.
.It Fl s Ar isostart
The
.Fl s
option specifies the begining block in the ISO9660 filesystem of the
.Em raw
bootblock file.
.It Fl e Ar isoend
.Fl e
specifies the ending block number of the boot block file.  Both
.Fl s
and
.Fl e
values are taken from the verbose output of
.Xr mkisofs 8 .
.It Fl n Ar name
The
.Fl n
option specifies the name of the boot block within the LIF header; this will
be displayed by the ROM at boot time, in all capital letters and with
.Dq SYS_
prepended.
.It Fl r Ar rawfile
The name of the
.Em raw
boot file must be specified; data is required from it's header in order to
build the LIF header.
.It Fl o Ar outfile
This specifies the output file name for the LIF header.  Normally it is
created if needed and truncated.
.El
.Sh BUGS
The
.Fl e
option is not currently actually used by the program.
.Sh SEE ALSO
.Xr mkisofs 8 .
.Sh HISTORY
.Nm
first appeared in
.Ox 2.2 .
