openbsd/src/libexec/spamd/spamd-setup.8
.\"	$OpenBSD: spamd-setup.8,v 1.1 2003/02/14 05:32:02 jason Exp $
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jason L. Wright
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd Febuary 14, 2003
.Dt spamd-setup 1
.Os
.Sh NAME
.Nm spamd-setup
.Nd parse and load file of spammer addresses
.Sh SYNOPSIS
.Nm spamd-setup
.Op Fl 1
.Op Fl 2
.Op Fl f Ar file
.Sh DESCRIPTION
The
.Nm
utility loads the
.Xr pf 4
table
.Aq spamd
with IP addresses to be redirected to
.Xr spamd 8
from one of several sources:
.Bl -tag -width XXXXXXXXXX
.It Fl 1
The SPEWS level 1 database is fetched via
.Xr ftp 1 .
.It Fl 2
The SPEWS level 2 database is fetched via
.Xr ftp 1 .
.It Fl f Ar file
The local file specified is used.
.El
.Pp
The arguments are processed in the order they are given and the resulting
output is concatenated to build up a single large table for
.Xr pf 4 .
The input file is expected to consist of one IP address per line (optionally
followed by a space and text that is ignored).
Comment lines beginning with
.Li #
are ignored.
.Sh SEE ALSO
.Xr ftp 1 ,
.Xr pf 4 ,
.Xr spamd 8
