openbsd/src/libexec/spamd/spamd.8
.\"	$OpenBSD: spamd.8,v 1.4 2002/12/25 10:14:20 deraadt Exp $
.\"
.\" Copyright (c) 2002 Theo de Raadt.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd Dec 18, 2002
.Dt SPAMD 8
.Os
.Sh NAME
.Nm spamd
.Nd spam deferral daemon
.Sh SYNOPSIS
.Nm spamd
.Op Fl 45d
.Op Fl r Ar reply
.Op Fl c Ar maxcon
.Op Fl p Ar port
.Op Fl n Ar name
.Sh DESCRIPTION
.Nm
is a a fake
.Xr sendmail 8 Ns -like
daemon which absorbs false mail.
If the
.Xr pf 4
packet filter is configured to redirect port 25 (SMTP) to this daemon,
it will attempt to waste the time and resources of the spam sender.
.Pp
The options are as follows:
.Bl -tag -width Ds
.Pp
.It Fl 4
Return error code 450 to the spammer.
.It Fl 5
Return error code 550 to the spammer.
.It Fl d
Debug mode.
.Nm
does not
.Xr fork 2
into the background.
.It Fl r
The SMTP error to return to the spammer, ie 450, 451, 550.  This defaults
to 450.
.It Fl c
the Maximum number of concurrent connections to allow.
.It Fl p
Specify the port number that
.Nm
should operate on.
.It Fl n
The SMTP version banner that is reported upon initial connection.
.El
.Pp
.Nm
is designed to be very efficient so that it does not slow down the
receiving machine.  SPAM is never accepted, but always rejected with
either a 450 or 550 error message.  The normal way that SPAM has been
dealt with in the way is to either acccept and drop, or outright block.
When configured to use 450 responses,
.Nm
takes neither of these actions: it rejects the mail back to the senders'
queue.
.Pp
.Nm
is best started from
.Xr rc 8
and is used in conjuction with
.Xr spamd-setup 8
which proceses a list of spammers addresses, and applies appropriate
.Xr pfctl 8
rdr rules.
.Pp
.Sh SEE ALSO
.Xr spamd-setup 8 ,
.Xr pfctl 8
.Sh HISTORY
The
.Nm
command
appeared in
.Tn OpenBSD 3.3.
