openbsd/src/share/man/man8/man8.macppc/boot_macppc.8
.\"	$OpenBSD: boot_macppc.8,v 1.1 2002/09/23 00:23:59 drahn Exp $
.\"
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)boot_macppc.8	
.\"
.Dd Sep 22, 2002
.Dt BOOT_MACPPC 8 macppc
.Os
.Sh NAME
.Nm boot
.Nd
.Tn macppc-specific
system bootstrapping procedures
.Sh DESCRIPTION
.Ss Power fail and crash recovery
Normally, the system will reboot itself at power-up or after crashes.
An automatic consistency check of the file systems will be performed
(as described in
.Xr fsck 8 ) ,
and unless this fails, the system will resume multi-user operations.
.Ss Cold starts
System boot blocks are installed either in a HFS parition or in a
MSDOS partition on the disk. If MBR parititioning is chosen for
the disk, the boot block will be installed automatically, for
HFS shared disks, the
.Dq ofwboot
program must be installed manually.
The ofwboot program can be loaded from any openfirmware recognized 
disk or network device.
.Pp
The
.Fl s
flag to the bootloader will bring the system up in single-user mode.
The
.Fl a
flag instructs the system to prompt for the location of the root filesystem
and the primary swap partition.
The
.Fl c
flag instructs the system to enter the
.Dq User Kernel Config
mode upon startup (see
.Xr boot_config 8 ).
Other flags are currently ignored.
.Pp
The Apple OpenFirmware will normally load the kernel from the device and
filename as instructed by the
.Dq boot-device
and
.Dq boot-file
variables.
If the
.Dq boot-file
variable is empty, the
.Ox
bootloader will look for a kernel named
.Dq bsd ,
unless a different filename has been specified in the boot command.
To reset this variable to its default, empty, value, type the following:
.Pp
.Em \	ok
set-default boot-device
.Ss Accessing the PROM
The prom can only be accessed during system reset, or at power-up.
To enter OpenFirmware, press and hold 
.Dq Cntrl
.Dq Cmd
.Dq o
.Dq f
as the machine resets until it enters the openfirmware debugger.
.Sh FILES
.Bl -tag -width /usr/mdec/ofwboot -compact
.It Pa /bsd
system code
.It Pa /usr/mdec/ofwboot
system bootstrap
.El
.Sh SEE ALSO
.Xr boot_config 8 ,
.Xr crash 8 ,
.Xr disklabel 8 ,
.Xr fsck 8 ,
.Xr halt 8 ,
.Xr init 8 ,
.Xr installboot 8 ,
.Xr rc 8 ,
.Xr shutdown 8 ,
.Xr syslogd 8
