openbsd/src/share/man/man8/man8.macppc/boot_macppc.8
.\"	$OpenBSD: boot_macppc.8,v 1.3 2002/10/17 23:18:51 miod Exp $
.\"
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)boot_macppc.8	
.\"
.Dd Sep 22, 2002
.Dt BOOT_MACPPC 8 macppc
.Os
.Sh NAME
.Nm boot
.Nd macppc system bootstrapping procedures
.Sh DESCRIPTION
.Ss System startup
When powered on, after a panic, or if the system is rebooted via
.Xr reboot 8
or
.Xr shutdown 8 ,
the
.Tn Open Firmware
will proceed to its initialization, and will boot an operating system
if the
.Ev Em auto-boot?
variable is set to
.Dq true ,
or will wait for interactive commands otherwise.
.Ss Boot process description
The Apple OpenFirmware will normally load the kernel from the device and
filename as instructed by the
.Ev Em boot-device
and
.Ev Em boot-file
variables.
If the
.Ev Em boot-file
variable is empty, the
.Ox
bootloader will look for a kernel named
.Pa bsd ,
unless a different filename has been specified in the boot command.
To reset this variable to its default, empty, value, type the following:
.Pp
.Em \	ok
set-default
.Ev Em boot-device
.Pp
The
.Ox
bootstrap program is named
.Dq ofwboot .
It can be installed either in a HFS partition or in a
MSDOS partition on the disk. If MBR partitioning is chosen for
the disk, the bootstrap program will be installed automatically during the
.Ox
installation procedure. For HFS shared disks, the
.Pa ofwboot
file must be installed manually.
The ofwboot program can be loaded from any openfirmware recognized 
disk or network device.
.Ss Boot process options
If invoked manually without parameters, or if the specified kernel could
not be loaded, the
.Ox
bootloader will let the user enter a boot device, kernel
filename and boot options.
.Pp
If the special line
.Ic exit
is entered, the bootloader will attempt to restart the machine.
.Pp
The file specification used is of the form:
.Dl promdev:partition/filename options
where:
.Dq promdev
is an optional
.Tn Open Firmware
device name (such as
.Dq hd
or
.Dq ide )
and
.Dq partition
is an optional disk partition number.
Normal line editing characters can be used when typing the file
specification.
.Pp
The following options are recognized:
.Bl -tag -width "-XXX" -offset indent -compact
.It -a
Prompt for the root filesystem and swap devices after the devices have
been configured.
.It -c
Enter the
.Dq User Kernel Config
mode upon startup
.Pq see Xr boot_config 8 .
.It -d
Enter the debugger,
.Xr ddb 4 ,
as soon as the kernel console has been initialized.
.It -s
Boot the system single-user.
The system will be booted multi-user unless this option is specified.
.El
.Ss Abnormal system termination
In case of system crashes, the kernel will usually enter the kernel
debugger,
.Xr ddb 4 ,
unless it is not present in the kernel, or it is disabled via the
.Em ddb.panic
sysctl.
Upon leaving ddb, or if ddb was not entered, the kernel will halt the system
if it was still in device configuration phase, or attempt a dump to the
configured dump device, if possible.
The crash dump will then be recovered by
.Xr savecore 8
during the next multi-user boot cycle.
It is also possible to force other behaviours from ddb.
.Ss Accessing the PROM
The prom can only be accessed during system reset, or at power-up.
To enter OpenFirmware, press and hold 
.Dq Cntrl
.Dq Cmd
.Dq o
.Dq f
as the machine resets until it enters the openfirmware debugger.
.Sh FILES
.Bl -tag -width /usr/mdec/ofwboot -compact
.It Pa /bsd
default system kernel
.It Pa /usr/mdec/ofwboot
system bootstrap (usually installed on a standalone FAT partition or an
.Tn Apple
HFS partition, to be readable by openfirmware).
.El
.Sh SEE ALSO
.Xr ddb 4 ,
.Xr boot_config 8 ,
.Xr halt 8 ,
.Xr init 8 ,
.Xr installboot 8 ,
.Xr reboot 8 ,
.Xr savecore 8 ,
.Xr shutdown 8
