openbsd/src/share/man/man8/man8.macppc/MAKEDEV.8
.\" $OpenBSD: MAKEDEV.8,v 1.10 2004/02/16 19:05:06 miod Exp $
.\"
.\" THIS FILE AUTOMATICALLY GENERATED.  DO NOT EDIT.
.\" generated from:
.\"
.\"	OpenBSD: etc.macppc/MAKEDEV.md,v 1.16 2004/02/16 19:01:01 miod Exp 
.\"	OpenBSD: MAKEDEV.common,v 1.1 2004/02/16 18:58:54 miod Exp 
.\"	OpenBSD: MAKEDEV.man,v 1.1 2004/02/16 19:03:30 miod Exp 
.\"	OpenBSD: MAKEDEV.mansub,v 1.1 2004/02/16 19:03:30 miod Exp 
.\"
.\" Copyright (c) 2004, Miodrag Vallat
.\" Copyright (c) 2001-2004 Todd T. Fries <todd@OpenBSD.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd February 16, 2004
.Dt MAKEDEV 8 macppc
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Op Ar ...
.Sh DESCRIPTION
The shell script
.Nm ,
found in the
.Pa /dev
directory, is used to create various special files.
See
.Xr intro 4
for a more complete discussion of special files.
.Pp
.Nm
takes any number of device names as arguments, where the names are
the common abbreviation for the device or group of devices.
.Pp
Where a device name is followed by a star
.Sq * ,
the star must be replaced by a unit number.
If units are expected for a device but not provided,
.Nm
will supply the standard numbers in most cases.
.Pp
The macppc supports the following devices:
.Pp
.Pp
.Sy Special device names
.Bl -tag -width tenletters -compact
.It Ar all
Creates special files for all devices on macppc.
.It Ar ramdisk
Ramdisk kernel devices.
.It Ar std
Creates the
.Sq standard
devices (console, drum, klog, kmem, ksyms, mem, null,
stderr, stdin, stdout, tty, zero)
which are absolutely necessary for the system to function properly.
.It Ar local
Creates configuration-specific devices.
.El
.Pp
.Sy Disks
.Bl -tag -width tenletters -compact
.It Ar ccd*
Concatenated disk devices.
.It Ar cd*
SCSI cdrom drives.
.It Ar raid*
RAIDframe disk devices.
.It Ar rd*
.Dq rd
pseudo-disks.
.It Ar sd*
SCSI disks.
.It Ar vnd*
.Dq file
pseudo-disk devices.
.It Ar wd*
.Dq winchester
disk drives (ST506, IDE, ESDI, RLL, ...).
.El
.Pp
.Sy Tapes
.Bl -tag -width tenletters -compact
.It Ar ch*
SCSI media changers.
.It Ar st*
SCSI tape drives.
.El
.Pp
.Sy Terminal ports
.Bl -tag -width tenletters -compact
.It Ar tty[0-7][0-9a-f]
NS16x50 serial ports.
.El
.Pp
.Sy Pseudo terminals
.Bl -tag -width tenletters -compact
.It Ar ptm
pty master device.
.It Ar pty*
Set of 16 master pseudo terminals.
.It Ar tty*
Set of 16 slave pseudo terminals.
.El
.Pp
.Sy Console ports
.Bl -tag -width tenletters -compact
.It Ar ttyC0
Minimal wscons devices.
.It Ar ttyC-F*
wscons display devices.
.It Ar wskbd*
wscons keyboards.
.It Ar wsmux
wscons keyboard/mouse mux devices.
.El
.Pp
.Sy Pointing devices
.Bl -tag -width tenletters -compact
.It Ar wsmouse*
wscons mice.
.El
.Pp
.Sy USB devices
.Bl -tag -width tenletters -compact
.It Ar usbs
All USB devices.
.It Ar ttyU*
USB serial ports.
.It Ar ugen*
Generic USB devices.
.It Ar uhid*
Generic HID devices.
.It Ar ulpt*
Printer devices.
.It Ar urio*
Diamond Multimedia Rio 500.
.It Ar usb*
Bus control devices used by usbd for attach/detach.
.It Ar uscanner*
Scanners.
.El
.Pp
.Sy Special purpose devices
.Bl -tag -width tenletters -compact
.It Ar apm
Power management device.
.It Ar audio*
Audio devices.
.It Ar bktr*
Video frame grabbers.
.It Ar bpf*
Berkeley Packet Filter.
.It Ar crypto
Hardware crypto access driver.
.It Ar fd
fd/* nodes for fdescfs.
.It Ar iop*
I2O controller devices.
.It Ar lkm
Loadable kernel modules interface.
.It Ar pci
PCI bus device.
.It Ar pf*
Packet Filter.
.It Ar radio*
FM tuner devices.
.It Ar *random
In-kernel random data source.
.It Ar ss*
SCSI scanners.
.It Ar systrace*
System call tracing device.
.It Ar tun*
Network tunnel driver.
.It Ar tuner*
Tuner devices.
.It Ar uk*
SCSI unknown devices.
.It Ar xfs*
XFS filesystem node.
.Sh FILES
.Bl -tag -width /dev -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
