openbsd/src/share/man/man7/hier.7
.\"	$OpenBSD: hier.7,v 1.34 2002/12/25 00:10:52 pvalchev Exp $
.\"	$NetBSD: hier.7,v 1.7 1994/11/30 19:07:10 jtc Exp $
.\"
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)hier.7	8.1 (Berkeley) 6/5/93
.\"
.Dd June 5, 1993
.Dt HIER 7
.Os
.Sh NAME
.Nm hier
.Nd layout of filesystems
.Sh DESCRIPTION
A sketch of the filesystem hierarchy.
.Bl -tag -width "/altroot/"
.It Li /
Root directory.
.It Li /altroot/
Alternate (backup) location for the root
.Pq Sq /
filesystem.
.It Li /bin/
User utilities fundamental to both single and multi-user environments.
These programs are statically compiled and therefore do not depend on any
system libraries to run.
.It Li /bsd
Pure kernel executable (the operating system loaded into memory
at boot-time).
.It Li /dev/
Block and character device files.
.Pp
.Bl -tag -width MAKEDEV -compact
.It Li MAKEDEV
Script for creating device files (see
.Xr MAKEDEV 8 ) .
.It Li fd/
File descriptor files (see
.Xr fd 4 ) .
.El
.It Li /emul/
Base directory for alternate areas searched first when system call
emulation is in effect (see
.Xr compat_bsdos 8 ,
.Xr compat_freebsd 8 ,
.Xr compat_ibcs2 8 ,
.Xr compat_linux 8 ,
.Xr compat_sunos 8 ,
.Xr compat_svr4 8 ,
.Xr compat_ultrix 8 ) .
.It Li /etc/
System configuration files and scripts.
.Pp
.Bl -tag -width "disklabels/" -compact
.It Li localtime
Local timezone information (see
.Xr ctime 3 ) .
.It Li amd/
Contains map files for
.Xr amd 1 .
.It Li authpf/
Configuration files for the authenticating gateway user shell (see
.Xr authpf 8 ) .
.It Li disklabels/
Backup disklabels (see
.Xr disklabel 8 ) .
.It Li kerberosIV/
Configuration files for the Kerberos version IV system (see
.Xr kerberos 1 ) .
.It Li kerberosV/
Configuration files for the Kerberos version V system (see
.Xr kerberos 1 ) .
.It Li mail/
.Xr sendmail 8
configuration files (including
.Xr aliases 5 ) .
.It Li mtree/
.Xr mtree
configuration files (see
.Xr mtree 8 ) .
.It Li ppp/
.Xr pppd
configuration files (see
.Xr pppd 8 ) .
.It Li skel/
Example
.Dq \&.
(dot) files for new accounts.
.It Li ssh/
Configuration files for
.Xr ssh 1
and
.Xr sshd 1 .
.It Li ssl/
OpenSSL configuration files (see
.Xr openssl 1 ) .
.It Li systrace/
Sample
.Xr systrace 1
policies.
.El
.It Li /home/
Default location for user home directories.
.It Li /mnt/
Empty directory commonly used by
system administrators as a temporary mount point.
.It Li /root/
Default home directory for the superuser.
.It Li /sbin/
System programs and administration utilities
fundamental to both single and multi-user environments.
.It Li /stand/
Programs used in a stand-alone environment.
.It Li /tmp/
Temporary files, usually an
.Xr mfs 8
memory-based filesystem (the contents
of
.Pa /tmp
are usually
.Em not
preserved across a system reboot).
.It Li /usr/
Contains the majority of user utilities and applications.
.Pp
.Bl -tag -width "libdata/" -compact
.It Li X11R6/
Files required for the X11 window system.
.Pp
.Bl -tag -width "include/" -compact
.It Li bin/
X11 binaries.
.It Li include/
X11-specific C include files.
.It Li lib/
X11 archive libraries.
.Pp
.Bl -tag -width "X11/" -compact
.It Li X11/
Default configuration files for X11 and companion applications (see 
.Xr xdm 1 ,
.Xr xkb 1 ,
.Xr twm 1 ) .
.Pp
.El
.It Li man/
X11 manual pages.
.El
.Pp
.It Li bin/
Common utilities, programming tools, and applications.
.It Li games/
Useful and semi-frivolous programs.
.It Li include/
Standard C include files.
.Pp
.Bl -tag -width "kerberosIV/" -compact
.It Li arpa/
C include files for Internet service protocols.
.It Li kerberosIV/
C include files for Kerberos IV authentication package (see
.Xr kerberos 1 ) .
.It Li kerberosV/
C include files for Kerberos V authentication package (see
.Xr kerberos 1 ) .
.It Li crypto/
C include files for the cryptographic libraries.
.It Li ddb/
C include files for the kernel debugger (see
.Xr ddb 4 ) .
.It Li g++/
Include files for the GNU C++ compiler.
.It Li isofs/
C include files for the ISO standard file systems (currently only cd9660).
.It Li miscfs/
C include files for miscellaneous file systems.
.It Li netatalk/
C include files for the AppleTalk protocol.
.It Li netccitt/
.It Li netipx/
C include files for the IPX protocol.
.It Li netnatm/
.It Li objc/
C include files for GNU Objective-C.
.It Li ssl/
C include files for the OpenSSL library (see
.Xr ssl 8 ) .
.It Li readline/
.It Li rpc/
C include files for remote procedure calling (see
.Xr rpc 5 ) .
.It Li rpcsvc/
.It Li scsi/
SCSI-specific C include files.
.It Li uvm/
C include files for the virtual memory interface.
.It Li xfs/ 
C include files for the XFS file system.
.It Li dev/
Device-specific C include files.
.It Li machine/
Machine specific C include files.
.It Li net/
Miscellaneous network C include files.
.It Li netinet/
C include files for Internet standard protocols (see
.Xr inet 4 ) .
.It Li netinet6/
C include files for Internet protocol version 6 (see
.Xr inet6 4 ) .
.It Li netiso/
C include files for ISO standard protocols (see
.Xr iso 4 ) .
.It Li netns/
C include files for XNS standard protocols (see
.Xr ns 4 ) .
.It Li nfs/
C include files for NFS (Network File System).
.It Li protocols/
C include files for Berkeley service protocols.
.It Li sys/
System C include files (kernel data structures).
.It Li ufs/
C include files for UFS (the U-word File System).
.El
.Pp
.It Li lib/
Archive libraries.
.It Li libdata/
Miscellaneous utility data files.
.It Li libexec/
System daemons and utilities (executed by other programs).
.Pp
.Bl -tag -width "auth/" -compact
.It Li auth/
Login scripts used to authenticate users (for BSD authentication).
.El
.Pp
.It Li lkm/
.It Li mdec/
.It Li local/
Local executables, libraries, etc.
.It Li obj/
Architecture specific target tree produced by building the
.Pa /usr/src
tree.
.It Li ports/
The
.Ox
ports collection (see
.Xr ports 7 ) .
.It Li sbin/
System daemons and utilities (executed by users).
.It Li share/
Architecture independent data files.
.Pp
.Bl -tag -width "groff_font/" -compact
.It Li calendar/
Variety of pre-fab calendar files (see
.Xr calendar 1 ) .
.It Li dict/
Word lists (see
.Xr look 1 ) .
.Pp
.Bl -tag -width propernames -compact
.It Li words
Common words.
.It Li web2
Words from Webster's 2nd International.
.It Li web2a
Additional words from Webster's.
.It Li propernames
List of proper names.
.It Li eign
.It Li papers/
Reference databases (see
.Xr refer 1 ) .
.It Li special/
Custom word lists.
.El
.Pp
.It Li doc/
Miscellaneous documentation;
source for most of the printed
.Bx 4.3
manuals (available
from the
.Tn USENIX
association).
.It Li games/
ASCII text files used by various games.
.It Li groff_font/
GNU troff shared fonts.
.It Li info/
Texinfo source files.
.It Li ipsec/
IPsec example files.
.It Li lkm/
Example source code implementing several lkm module types (see
.Xr lkm 4 ) .
.It Li locale/
.It Li man/
Manual pages.
.It Li misc/
Miscellaneous system-wide ASCII text files.
.Bl -tag -width Fl
.It Li termcap
Terminal characteristics database (see
.Xr termcap 5 ) .
.El
.Pp
.It Li mk/
Templates for
.Xr make
(see
.Xr make 1 ) .
.It Li nls/
.It Li sendmail/
Example files for 
.Xr sendmail 8 .
.It Li vi/catalog/
Catalog files for the 
.Xr vi 1
text editor.
.It Li tabset/
Tab description files for a variety of terminals; used in
the termcap file (see
.Xr termcap 5 ) .
.It Li tmac/
Text processing macros (see
.Xr nroff 1
and
.Xr troff 1 ) .
.It Li zoneinfo/
Timezone configuration information (see
.Xr tzfile 5 ) .
.El
.Pp
.It Li src/
BSD and/or local source files.
.Pp
.Bl -tag -width "kerberosIV/" -compact
.It Li bin/
Source for files in
.Pa /bin .
.It Li etc/
Source for files in
.Pa /etc .
.It Li games/
Source for files in
.Pa /usr/games .
.It Li gnu/
Source for files under GPL or other restrictive licenses.
.It Li include/
Source for files in
.Pa /usr/include .
.It Li kerberosIV/
Source for Kerberos version IV.
.It Li kerberosV/
Source for Kerberos version V.
.It Li lib/
Source for files in
.Pa /usr/lib .
.It Li libexec/
Source for files in
.Pa /usr/libexec .
.It Li lkm/
Source for files in
.Pa /usr/lkm .
.It Li sbin/
Source for files in
.Pa /sbin .
.It Li share/
Source for files in
.Pa /usr/share .
.It Li sys/
Kernel source files.
.It Li usr.bin/
Source for files in
.Pa /usr/bin .
.It Li usr.sbin/
Source for files in
.Pa /usr/sbin .
.El
.El
.It Li /var/
Multi-purpose log, temporary, transient, and spool files.
.Pp
.Bl -tag -width "preserve/" -compact
.It Li account/
System accounting files.
.Pp
.Bl -tag -width Fl -compact
.It Li acct
Execution accounting file (see
.Xr acct 5 ) .
.El
.Pp
.It Li at/
.Xr timed 8
command scheduling files (see
.Xr at 1 ) .
.It Li backups/
Miscellaneous backup files.
.It Li db/
Miscellaneous automatically generated system-specific database files.
.It Li games/
Miscellaneous game status and log files.
.It Li log/
Miscellaneous system log files.
.Pp
.Bl -tag -width Fl -compact
.It Li wtmp
Login/logout log (see
.Xr wtmp 5 ) .
.El
.Pp
.It Li mail/
User mailbox files.
.It Li named/
.Xr named 8
configuration files.
.Pp
.Bl -tag -width Fl -compact
.It Li namedb/
Zone files.
.El
.Pp
.It Li preserve/
Temporary home of files preserved after an accidental death
of an editor (see
.Xr ex 1 ) .
.It Li quotas/
Filesystem quota information files.
.It Li run/
System information files describing various info about the
system since it was booted.
.Pp
.Bl -tag -width Fl -compact
.It Li utmp
Database of current users (see
.Xr utmp 5 ) .
.El
.Pp
.It Li rwho/
.Xr rwho
data files (see
.Xr rwhod 8 ,
.Xr rwho 1 ,
and
.Xr ruptime 1 ) .
.It Li spool/
Miscellaneous printer and mail system spooling directories.
.Pp
.Bl -tag -width "clientmqueue/" -compact
.It Li clientmqueue/
Mail messages awaiting to be processed by the sendmail clientmqueue helper
task (see
.Xr sendmail 8 ) .
.It Li ftp/
Commonly ~ftp; the anonymous ftp root directory.
.It Li mqueue/
Undelivered mail queue (see
.Xr sendmail 8 ) .
.It Li output/
Line printer spooling directories.
.It Li uucp/
.Xr uucp
spool directory.
.It Li uucppublic/
Commonly ~uucp; public uucp temporary directory.
.El
.Pp
.It Li tmp/
Temporary files that are kept between system reboots.
.El
.El
.Sh SEE ALSO
.Xr apropos 1 ,
.Xr find 1 ,
.Xr locate 1 ,
.Xr whatis 1 ,
.Xr whereis 1 ,
.Xr which 1
.Sh HISTORY
A
.Nm
manual page appeared in
.At v7 .
