openbsd/src/share/man/man7/hier.7
.\"	$OpenBSD: hier.7,v 1.7 1998/06/28 02:38:50 art Exp $
.\"	$NetBSD: hier.7,v 1.7 1994/11/30 19:07:10 jtc Exp $
.\"
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)hier.7	8.1 (Berkeley) 6/5/93
.\"
.Dd June 5, 1993
.Dt HIER 7
.Os
.Sh NAME
.Nm hier
.Nd layout of filesystems
.Sh DESCRIPTION
A sketch of the filesystem hierarchy.
.Bl -tag -width "/stand/"
.It Li /
root directory of the filesystem
.It Li /bin/
user utilities fundamental to both single-user and multi-user environments
.It Li /bsd
pure kernel executable (the operating system loaded into memory
at boot time).  
.It Li /dev/
block and character device files
.Pp
.Bl -tag -width MAKEDEV -compact
.It Li MAKEDEV
script for creating device files;
see
.Xr makedev 8
.It Li fd/ 
file descriptor files;
see
.Xr \&fd 4
.El
.It Li /emul/
base directory for alternate areas searched first when system call
emulation is in effect; see
.Xr compat_freebsd 8 ,
.Xr compat_linux 8 ,
.Xr compat_sunos 8 ,
.Xr compat_svr4 8 .
.It Li /etc/
system configuration files and scripts 
.Pp
.Bl -tag -width "disklabels/" -compact
.It Li localtime
local timezone information;
see
.Xr ctime 3
.It Li disklabels/
backup disklabels;
see
.Xr disklabel 8
.It Li kerberosIV/ 
configuration files for the kerberos version IV;
see
.Xr kerberos 1
.It Li mtree/ 
mtree configuration files;
see
.Xr mtree 1
.It Li namedb/ 
named configuration files;
see
.Xr named 8
.It Li uucp/
UUCP configuration files;
.El
.It Li /mnt/
empty directory commonly used by
system administrators as a temporary mount point
.It Li /sbin/
system programs and administration utilities
fundamental to both single-user and multi-user environments
.It Li /stand/
programs used in a standalone environment
.It Li /tmp/ 
temporary files, usually a
.Xr mfs 8
memory-based filesystem (the contents
of /tmp are usually NOT preserved across a system reboot)
.It Li /usr/
contains the majority of user utilities and applications 
.Pp
.Bl -tag -width "libdata/" -compact
.It Li bin/
common utilities, programming tools, and applications 
.It Li games/
useful and semi-frivolous programs
.It Li include/
standard C include files
.Pp
.Bl -tag -width "kerberosIV/" -compact
.It Li X11/
C include files for X11 window system
.It Li arpa/
C include files for Internet service protocols
.It Li kerberosIV/
C include files for kerberos authentication package;
see
.Xr kerberos 1
.It Li machine/
machine specific C include files
.It Li net/
misc network C include files
.It Li netimp/
C include files for IMP protocols;
see
.Xr imp 4
.It Li netinet/
C include files for Internet standard protocols;
see
.Xr inet 4
.It Li netiso/
C include files for ISO standard protocols;
see
.Xr iso 4
.It Li netns/
C include files for XNS standard protocols;
see
.Xr \&ns 4
.It Li nfs/
C include files for NFS (Network File System)
.It Li pascal/
include files for pc 1
.It Li protocols/
C include files for Berkeley service protocols
.It Li sys/
system C include files (kernel data structures)
.It Li ufs/
C include files for UFS (The U-word File System)
.El
.Pp
.It Li lib/
archive libraries
.It Li libdata/
misc. utility data files
.It Li libexec/
system daemons & system utilities (executed by other programs)
.It Li local/
local executables, libraries, etc.
.It Li obj/
architecture-specific target tree produced by building the /usr/src tree
.It Li old/
programs from past lives of BSD which may disappear in future
releases
.It Li sbin/
system daemons & system utilities (executed by users)
.It Li share/
architecture-independent data files
.Pp
.Bl -tag -width "calendar/" -compact
.It Li calendar/
a variety of pre-fab calendar files;
see
.Xr calendar 1
.It Li dict/
word lists;
see
.Xr look 1
.Pp
.Bl -tag -width Fl -compact
.It Li words
common words
.It Li web2
words from Webster's 2nd International
.It Li papers/
reference databases;
see
.Xr refer 1
.It Li special/
custom word lists;
see
.Xr spell 1
.El
.Pp
.It Li doc/
misc documentation;
src for most of the printed
.Bx 4.3
manuals (available
from the
.Tn USENIX
association)
.It Li games/
ascii text files used by various games
.It Li man/
manual pages 
.It Li me/
macros for use with the me macro package
.It Li misc/
misc system-wide ascii text files
.Bl -tag -width Fl -compact
.It Li termcap
terminal characteristics database;
see
.Xr termcap 5
.El
.It Li mk/
templates for make;
see
.Xr make 1
.It Li ms/
macros for use with the ms macro package
.It Li skel/
example . (dot) files for new accounts
.It Li tabset/
tab description files for a variety of terminals; used in 
the termcap file;
see
.Xr termcap 5
.It Li tmac/
text processing macros;
see
.Xr nroff 1
and 
.Xr troff 1
.It Li zoneinfo/
timezone configuration information;
see
.Xr tzfile 5
.El
.Pp
.It Li src/
BSD and/or local source files
.Pp
.Bl -tag -width "kerberosIV/" -compact
.It Li bin/
src for files in /bin 
.It Li etc/
src for files in /etc
.It Li games/
src for files in /usr/games
.It Li gnu/
src for files with GPL license
.It Li include/
src for files in /usr/include
.It Li kerberosIV/
src for kerberos version IV
.It Li lib/
src for files in /usr/lib
.It Li libexec/
src for files in /usr/libexec
.It Li lkm/
src for files in /usr/lkm
.It Li sbin/
src for files in /sbin
.It Li share/
src for files in /usr/share
.It Li sys/
kernel src files
.It Li usr.bin/
src for files in /usr/bin
.It Li usr.sbin/
src for files in /usr/sbin
.El
.El
.It Li /var/
multi-purpose log, temporary, transient, and spool files
.Pp
.Bl -tag -width "preserve/" -compact
.It Li account/ 
system accounting files
.Pp
.Bl -tag -width Fl -compact
.It Li acct
execution accounting file;
see
.Xr acct 5
.El
.Pp
.It Li at/
timed command scheduling files;
see
.Xr \&at 1
.It Li backups/
misc. backup files
.It Li db/ 
misc. automatically generated system-specific database files
.It Li games/ 
misc. game status and log files
.It Li log/ 
misc. system log files
.Pp
.Bl -tag -width Fl -compact
.It Li wtmp
login/logout log;
see
.Xr wtmp 5
.El
.Pp
.It Li mail/ 
user mailbox files
.It Li preserve/
temporary home of files preserved after an accidental death
of an editor;
see
.Xr \&ex 1 
.It Li quotas/ 
filesystem quota information files
.It Li run/
system information files describing various info about
system since it was booted
.Pp
.Bl -tag -width Fl -compact
.It Li utmp
database of current users;
see
.Xr utmp 5
.El
.Pp
.It Li rwho/ 
rwho data files;
see
.Xr rwhod 8 ,
.Xr rwho 1 ,
and
.Xr ruptime 1
.It Li spool/ 
misc. printer and mail system spooling directories
.Pp
.Bl -tag -width Fl -compact
.It Li ftp/ 
commonly ~ftp; the anonymous ftp root directory
.It Li mqueue/ 
undelivered mail queue;
see
.Xr sendmail 8
.It Li output/
line printer spooling directories
.It Li uucp/ 
uucp spool directory
.It Li uucppublic/
commonly ~uucp; public uucp temporary directory
.El
.Pp
.It Li tmp/ 
temporary files that are kept between system reboots
.El
.El
.Sh SEE ALSO
.Xr \&ls 1 ,
.Xr apropos 1 ,
.Xr whatis 1 ,
.Xr whereis 1 ,
.Xr finger 1 ,
.Xr which 1 ,
.Xr find 1 ,
.Xr grep 1  ,
.Xr fsck 8 
.Sh HISTORY
A
.Nm hier
manual page appeared in
.At v7 .
