openbsd/src/share/man/man7/intro.7
.\"	$OpenBSD: intro.7,v 1.15 2013/08/05 06:59:49 jmc Exp $
.\"	$NetBSD: intro.7,v 1.3 1994/11/30 19:07:15 jtc Exp $
.\"
.\" Copyright (c) 1983, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)intro.7	8.1 (Berkeley) 6/5/93
.\"
.Dd $Mdocdate: August 5 2013 $
.Dt INTRO 7
.Os
.Sh NAME
.Nm intro
.Nd miscellaneous information pages
.Sh DESCRIPTION
The manual pages in section 7 section contain miscellaneous documentation.
.Pp
.Bl -tag -width "mirroring-ports" -compact
.It Xr ascii
Map of ASCII character set.
.It Xr environ
User environment.
.It Xr eqn
Language reference for
.Xr mandoc 1 .
.It Xr glob
Shell-style pattern matching.
.It Xr hier
File system hierarchy.
.It Xr hostname
Hostname resolution rules.
.It Xr kgdb
Remote kernel debugging with gdb.
.It Xr library-specs
Shared library name specifications.
.It Xr mailaddr
Mail addressing description.
.It Xr man
Man language reference.
.It Xr mandoc_char
Mandoc special characters.
.It Xr mdoc
Mdoc language reference.
.It Xr mirroring-ports
How to build a mirror for ports distfiles.
.It Xr operator
C operator precedence.
.It Xr packages
Overview of the binary package system.
.It Xr packages-specs
Binary package names specifications.
.It Xr pkgpath
Ports tree location for a package build.
.It Xr ports
Contributed applications.
.It Xr re_format
POSIX regular expressions.
.It Xr roff
Roff language reference for
.Xr mandoc 1 .
.It Xr script
Interpreter script execution.
.It Xr securelevel
The securelevel kernel state and its effects.
.It Xr sndio
Interface to audio and MIDI.
.It Xr symlink
Symbolic link handling.
.It Xr tbl
Tbl language reference for
.Xr mandoc 1 .
.It Xr term
Conventions for naming terminal types.
.El
.Sh HISTORY
An
.Nm
manual page appeared in
.Bx 4.2 .
