openbsd/src/share/man/man7/utf8.7
.\"	$OpenBSD: utf8.7,v 1.5 2017/05/31 17:16:48 schwarze Exp $
.\"
.\" Copyright (c) 2017 Ted Unangst <tedu@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2017 $
.Dt UTF8 7
.Os
.Sh NAME
.Nm utf8
.Nd UTF-8 text encoding
.Sh DESCRIPTION
UTF-8 is a multibyte encoding for Unicode text.
It is the preferred format for non ASCII text.
.Pp
The length of a UTF-8 sequence varies depending on the encoded value.
If the high bit of the first byte is zero, the sequence length is one and
the value is the remaining seven bits.
If the high bit is set, then the number of high bits set, followed by a zero
bit, indicates the length of the sequence and the value is formed by combining
the low bits of each byte.
Continuation bytes all have the same format, with the top two bits set and
unset, respectively, and six value bits.
.Pp
Unicode ranges and their encoding formats:
.Bl -tag -width Ds
.It 0x0 - 0x7f
One byte.
0.......
.It 0x80 - 0x7ff
Two bytes.
110..... 10.......
.It 0x800 - 0xffff
Three bytes.
1110.... 10...... 10......
.It 0x1000 - 0x10ffff
Four bytes.
11110... 10...... 10...... 10......
.El
.Sh SEE ALSO
.Xr ascii 7
.Sh STANDARDS
.Rs
.%A F. Yergeau
.%D November 2003
.%R RFC 3629
.%T UTF-8, a transformation format of ISO 10646
.Re
.Pp
The Unicode Standard.
.Sh CAVEATS
Beware of overlong encodings.
