openbsd/src/share/man/man8/man8.i386/boot.com.8
.\"     $OpenBSD: boot.com.8,v 1.2 1997/10/03 20:01:31 deraadt Exp $
.\"
.\" Copyright (c) 1989, 1990, 1993
.\"     The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Institute of Electrical and Electronics Engineers, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"     This product includes software developed by the University of
.\"     California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)cat.1       8.3 (Berkeley) 5/2/95
.\"
.Dd April 28, 1997
.Dt boot.com 8 i386
.Os OpenBSD
.Sh NAME
.Nm boot.com
.Nd Boot an OpenBSD kernel from MS-DOS
.Sh SYNOPSIS
.Nm BOOT
.Sh DESCRIPTION
The
.Nm
utility, executed from an MS-DOS prompt, will load a kernel stored
in the DOS partition, effectively booting OpenBSD.  There are no
command line arguments.
.Pp
.Nm
functions identically to the standalone bootblocks, except that it
only loads files on a DOS partition.  After printing the `Boot:'
prompt, there is a timeout of several seconds.  If no key is pressed in
that time, the default kernel
.Em bsd
is loaded from the root directory of the DOS C: partition.
.Sh CAVEATS
The file 
.Pa /usr/mdec/boot.com
and a valid kernel file must be copied to the root directory
of the DOS C: partition.
.Pp
If the desired FFS root filesystem is not on the first drive in the
system, the
.Fl r
flag (use the kernel's compiled-in default root device)
must be supplied when booting the kernel, i.e.:
.Pp
.Bd -literal -offset indent
Boot: [[[wd(0,a)]bsd][-abcdrs]] : bsd -r
.Ed
.Sh BUGS
.Nm
will not load kernels compressed with
.Xr gzip 1 ,
or ramdisk kernels larger than 3M in size.
.Pp
.Nm
always assumes the kernel is in the root directory of the DOS drive; to
load a kernel from the current directory, the name must be entered at
the `Boot:' prompt with no leading slashes.
.Pp
Loading a kernel from anywhere
other than the root directory or the current directory is not supported.
.Sh FILES
.Pa /usr/mdec/boot.com
