openbsd/src/share/man/man8/man8.i386/MAKEDEV.8
.\"	$OpenBSD: MAKEDEV.8,v 1.12 1999/09/23 04:12:07 alex Exp $
.\"
.\" Copyright (c) 1997, Jason Downs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jason Downs for the
.\"      OpenBSD system.
.\" 4. Neither the name(s) of the author(s) nor the name OpenBSD
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" Copyright (c) 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)MAKEDEV.8	5.2 (Berkeley) 3/22/91
.\"
.Dd July 27, 1997
.Dt MAKEDEV 8
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Ar ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the
.Pa /dev
directory, is used to create the common special files.
See
.Xr special 8
for a more complete discussion of special files.
.Pp
.Nm MAKEDEV
takes any number of device names as arguments, where the names are
the common abbreviation for the device.
There are two special devices,
.Ar std
and
.Ar local .
The former creates the standard devices for the architecture.
The latter is for devices specific to the local site, and
executes the shell file
.Pa MAKEDEV.local .
.Pp
The i386 supports the following devices.
Where a device name is followed by a hash sign (``#''), the hash sign
must be replaced by a unit number.
.Pp
.Bl -tag -width XXXXXXXXXX
.It Ar std
the standard devices (console, drum, fd/*, klog, kmem, mem, null,
stderr, stdin, stdout, tty)
.It Ar local
configuration specific devices
.It Ar ttyC0
pccons console or pcvt screen 0
.It Ar ttyC#
pcvt console screens
.It Ar tty#
standard PC COM ports
.It Ar cd#
SCSI CD-ROM drives
.It Ar mcd#
Mitsumi CD-ROM drives
.It Ar fd#
.Dq floppy
disk drives (3 1/2, 5 1/4)
.It Ar pty#
set of 16 master and slave pseudo terminals
.It Ar sd#
SCSI disk drives
.It Ar st#
SCSI tape drives
.It Ar wd#
.Dq winchester
disk drives (ST506, IDE, ESDI, RLL etc.)
.It Ar wt#
QIC-interfaced (e.g. not SCSI) 3M cartridge tape
.It Ar vnd#
.Dq file
pseudo-disks
.It Ar rd#
.Dq ramdisk
pseudo-disks
.It Ar ccd#
concatenated disk devices
.It Ar mms#
Microsoft bus mouse
.It Ar lms#
Logitech bus mouse
.It Ar pms#
PS/2 mouse
.It Ar lpt#
stock parallel port device driver
.It Ar lpa#
interruptless parallel port driver
.It Ar bpf#
packet filter
.It Ar speaker
pc speaker
.It Ar lkm
loadable kernel modules interface
.It Ar audio
audio device
.It Ar apm
power management device
.It Ar tun#
network tunnel driver
.It Ar joy#
joystick driver
.It Ar pcmcia#
PCMCIA card drivers
.It Ar random
inkernel random number generator
.It Ar uk#
.Dq unknown SCSI
devices
.It Ar ss#
SCSI scanners
.It Ar bktr#
Brooktree 848 driver
.It Ar wdt#
watchdog timer
.El
.Pp
.Sh FILES
.Bl -tag -width XXXX -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8 ,
.Xr special 8
