openbsd/src/share/man/man8/man8.i386/MAKEDEV.8
.\"	$OpenBSD: MAKEDEV.8,v 1.25 2004/01/13 19:27:19 jmc Exp $
.\"
.\" Copyright (c) 1997, Jason Downs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" Copyright (c) 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)MAKEDEV.8	5.2 (Berkeley) 3/22/91
.\"
.Dd July 27, 1997
.Dt MAKEDEV 8 i386
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Op Ar ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the
.Pa /dev
directory, is used to create the common special files.
See
.Xr intro 4
for a more complete discussion of special files.
.Pp
.Nm MAKEDEV
takes any number of device names as arguments, where the names are
the common abbreviation for the device.
There are four special device names,
.Ar all ,
.Ar std ,
.Ar local
and
.Ar wscons .
If
given,
.Ar all
creates device files for all devices on the i386.
If units are expected for a device,
.Nm MAKEDEV
will supply the standard numbers.
The
.Ar std
argument creates only the standard devices for the i386.
Finally
.Ar local
is for devices specific to the local site, and executes the shell file
.Pa MAKEDEV.local .
.Pp
The i386 supports the following devices.
Where a device name is followed by a hash sign ("#"), the hash sign
must be replaced by a unit number.
.Pp
.Sy Pseudo-names
.Bl -tag -width wsmouse -compact
.It Ar all
All known devices for the i386.
.It Ar std
The standard devices (console, drum, fd/*, klog, kmem, mem, null, stderr,
stdin, stdout, tty, zero).
.It Ar local
Configuration specific devices.
.It Ar wscons
All wscons-related devices.
.El
.Pp
.Sy Device-names
.Bl -tag -width wsmouse -compact
.It Ar apm
Power management devices.
.It Ar audio
Audio device.
.It Ar bktr#
Brooktree 848 driver.
.It Ar bpf#
Berkeley packet filters.
.It Ar ccd#
.Dq Concatenated
disk devices.
.It Ar cd#
SCSI CD-ROM drives.
.It Ar fd#
.Dq Floppy
disk drives (3 1/2, 5 1/4).
.It Ar joy#
Joystick driver.
.It Ar lkm
Loadable kernel modules interface.
.It Ar lpa#
Interruptless parallel port driver.
.It Ar lpt#
Stock parallel port device driver.
.It Ar mcd#
Mitsumi CD-ROM drives.
.It Ar pty#
Set of 16 master and slave pseudo terminals.
.It Ar random
In-kernel random number generator.
.It Ar rd#
.Dq Ramdisk
pseudo-disks.
.It Ar sd#
SCSI disk drives.
.It Ar speaker
Pc speaker.
.It Ar ss#
SCSI scanners.
.It Ar st#
SCSI tape drives.
.It Ar tty#
Standard PC COM ports.
.It Ar ttyC#
Wscons console screens.
.It Ar ttyU#
USB serial ports.
.It Ar tun#
Network tunnel driver.
.It Ar uk#
.Dq Unknown SCSI
devices.
.It Ar vnd#
.Dq File
pseudo-disks.
.It Ar wd#
.Dq Winchester
disk drives (ST506, IDE, ESDI, RLL etc.).
.It Ar wdt#
Watchdog timer.
.It Ar wskbd
Keyboard devices for wscons.
.It Ar wsmouse
Mouse devices for wscons.
.It Ar wsmux
Multiplexor devices for wscons.
.It Ar wt#
QIC-interfaced (i.e. not SCSI) 3M cartridge tape.
.El
.Sh FILES
.Bl -tag -width /dev -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
