openbsd/src/usr.sbin/smtpd/aliases.5
.\"	$OpenBSD: aliases.5,v 1.3 2012/09/14 06:27:27 jmc Exp $
.\"
.\" Copyright (c) 2012 Gilles Chehade <gilles@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 14 2012 $
.Dt ALIASES 5
.Os
.Sh NAME
.Nm aliases
.Nd aliases file for smtpd
.Sh SYNOPSIS
.Nm aliases
.Sh DESCRIPTION
This manual page describes the format of the
.Nm
file, as used by
.Xr smtpd 8 .
An alias in its simplest form is used to assign an arbitrary name
to an email address, or a group of email addresses.
This provides a convenient way to send mail.
For example an alias could refer to all users of a group:
email to that alias would be sent to all members of the group.
Much more complex aliases can be defined however:
an alias can refer to other aliases,
be used to send mail to a file instead of another person,
or to execute various commands.
.Pp
Within the file,
.Ql #
is a comment delimiter; anything placed after it is discarded.
The file consists of key/value mappings of the form:
.Bd -filled -offset indent
key: value1, value2, value3, ...
.Ed
.Pp
.Em key
is always folded to lowercase before alias lookups to ensure that
there can be no ambiguity.
The key is expanded to the corresponding values,
which consist of one or more of the following:
.Bl -tag -width Ds
.It Em username
The username must be available via
.Xr getpwnam 3 .
.It Em filename
/path/to/filename
.Pp
Messages are appended to the file specified by the absolute pathname.
.It Em command
|command
.Pp
A command starts with a pipe and receives the message on its
standard input.
.Pp
Note that aliasing is done under the privileges of
the daemon's unprivileged account.
.It Em include file
:include:/path/to/filename
.Pp
Values in filename are added as aliases for
.Em key .
The file format consists of one value per line,
each value being any of those described in this man page.
.It Em external address
user-part@domain-part
.Pp
An email address in RFC 5322 format.
If an address extension is appended to the user-part,
it is stripped so that an address such as user+ext@example.com
will only use the part that precedes
.Sq +
as a
.Em key .
.El
.Sh FILES
.Bl -tag -width "/etc/mail/aliasesXXX"
.It Pa /etc/mail/aliases
Default
.Nm
file.
.El
.Sh SEE ALSO
.Xr smtpd.conf 5 ,
.Xr makemap 8 ,
.Xr newaliases 8 ,
.Xr smtpd 8
.Sh HISTORY
The
.Nm
file format appeared in
.Bx 4.0 .
