openbsd/src/usr.sbin/smtpd/mail.file.8
.\"	$OpenBSD: mail.file.8,v 1.2 2017/02/14 20:36:41 gilles Exp $
.\"
.\" Copyright (c) 2017 Gilles Chehade <gilles@poolp.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 14 2017 $
.Dt MAIL.FILE 8
.Os
.Sh NAME
.Nm mail.file
.Nd deliver mail to file
.Sh SYNOPSIS
.Nm mail.file
.Ar filename
.Sh DESCRIPTION
.Nm
reads the standard input up to an end-of-file and appends content
to destination filename.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Ar filename
Mandatory destination file where content will be appended.
.El
.Sh EXIT STATUS
.Ex -std mail.file
.Sh SEE ALSO
.Xr mail 1 ,
.Xr smtpd 8
