openbsd/src/usr.sbin/smtpd/mail.maildir.8
.\"	$OpenBSD: mail.maildir.8,v 1.4 2018/05/30 09:31:57 gilles Exp $
.\"
.\" Copyright (c) 2017 Gilles Chehade <gilles@poolp.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 30 2018 $
.Dt MAIL.MAILDIR 8
.Os
.Sh NAME
.Nm mail.maildir
.Nd store mail in a maildir
.Sh SYNOPSIS
.Nm mail.maildir
.Op Fl j
.Op Ar pathname
.Sh DESCRIPTION
.Nm
reads the standard input up to an end-of-file and adds it to the
mail directory located in
.Ar pathname
or to the mail directory Maildir located in the user home directory.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl j
Scan message for X-Spam and move to Junk folder if result is positive,
.El
.Sh EXIT STATUS
.Ex -std mail.maildir
.Sh SEE ALSO
.Xr mail 1 ,
.Xr smtpd 8
