openbsd/src/usr.sbin/smtpd/makemap.8
.\"	$OpenBSD: makemap.8,v 1.12 2009/11/03 23:10:31 gilles Exp $
.\"
.\" Copyright (c) 2009 Jacek Masiulaniec <jacekm@openbsd.org>
.\" Copyright (c) 2008-2009 Gilles Chechade <gilles@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 3 2009 $
.Dt MAKEMAP 8
.Os
.Sh NAME
.Nm makemap
.Nd create database maps for smtpd
.Sh SYNOPSIS
.Nm makemap
.Op Fl o Ar dbfile
.Op Fl t Ar type
.Ar file
.Sh DESCRIPTION
Maps provide a generic interface for associating textual key to a value.
Such associations may be accessed through a plaintext file, database, or DNS.
The format of these file types is described below.
.Nm
itself creates the database maps used by keyed map lookups specified in
.Xr smtpd.conf 5 .
.Pp
.Nm
reads input from
.Ar file
and writes data to a file whose name is made by adding a
.Dq .db
suffix to
.Ar file .
In all cases,
.Nm
reads lines consisting of words separated by whitespace.
The first word of a line is the database key;
the remainder represents the mapped value.
The database key and value may optionally be separated
by the colon character.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl o Ar dbfile
Write the generated database to
.Ar dbfile .
.It Fl t Ar type
Specify the format of the resulting map file.
The default map format is suitable for storing simple, unstructured,
key-to-value string associations.
However, if the mapped value has special meaning,
as in the case of the virtual domains file,
a suitable
.Ar type
must be provided.
The available output types are:
.Bl -tag -width "aliases"
.It Cm aliases
The mapped value is a comma-separated list of mail destinations.
This format can be used for building user aliases and
virtual domains files.
.It Cm set
There is no mapped value, a map of this type will only allow for
the lookup of keys. This format can be used for building primary
domains maps.
.El
.Pp
.El
.Ex -std makemap
.Sh PRIMARY DOMAINS
Primary domains can be kept in maps.
To create a primary domain map, add each primary domain on a
single line by itself.
.Pp
In addition to adding an entry to the primary domain map,
one must add a filter rule that accepts mail for the domain
map, for example:
.Bd -literal -offset indent
map "primary" { source db "/etc/mail/primary.db" }

accept for domain map "primary" deliver to mbox
.Ed
.Sh VIRTUAL DOMAINS
Virtual domains are kept in maps.
To create single virtual address, add
.Dq user@example.com	user
to the virtual map.
To handle all mail destined to any user at example.com, add
.Dq @example.com	user
to the virtual map.
.Pp
In addition to adding an entry to the virtual map,
one must add a filter rule that accepts mail for virtual domains,
for example:
.Bd -literal -offset indent
map "vdomains" { source db "/etc/mail/vdomains.db" }

accept for virtual "vdomains" deliver to mbox
.Ed
.Sh FILES
.Bl -tag -width "/etc/mail/aliasesXXX" -compact
.It Pa /etc/mail/aliases
List of user mail aliases.
.It Pa /etc/mail/virtual
List of hosted virtual domains.
.It Pa /etc/mail/secrets
List of remote host credentials.
.El
.Sh SEE ALSO
.Xr aliases 5 ,
.Xr smtpd.conf 5 ,
.Xr editmap 8 ,
.Xr newaliases 8 ,
.Xr smtpd 8
.Sh HISTORY
The
.Nm
command first appeared in
.Ox 4.6
as a replacement for the equivalent command shipped with sendmail.
