openbsd/src/usr.sbin/smtpd/makemap.8
.\"	$OpenBSD: makemap.8,v 1.3 2008/12/17 22:59:36 jacekm Exp $
.\" Copyright (c) 1998-2002 Sendmail, Inc. and its suppliers.
.\"	All rights reserved.
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"     $Sendmail: makemap.8,v 8.30 2002/06/27 23:41:04 gshapiro Exp $
.\"
.Dd $Mdocdate: December 17 2008 $
.Dt MAKEMAP 8
.Os
.Sh NAME
.Nm makemap ,
.Nm newaliases
.Nd create database maps for smtpd
.Sh SYNOPSIS
.Nm makemap
.Ar file
.Nm newaliases
.Sh DESCRIPTION
.Nm
creates the database maps used by the keyed map lookups in
.Xr smtpd 8 .
It reads input from
.Ar file
and outputs them to
.Ar file.db .
.Pp
In all cases,
.Nm
reads lines from 
.Ar file
consisting of words separated by whitespace.
The first is the database key,
the remaining specify mapped value.
.Pp
.Ex -std makemap
.Pp
.Nm newaliases 
rebuilds the random access database for the mail aliases file
.Pa /etc/mail/aliases .
It must be run each time this file is changed
in order for the change to take effect.
.Pp
.Ex -std newaliases
.Sh FILES
.Bl -tag -width "/etc/mail/aliasesXXX" -compact
.It Pa /etc/mail/aliases
The mail aliases file.
.El
.Sh SEE ALSO
.Xr editmap 8 ,
.Xr smtpd 8 ,
.Xr aliases 5 ,
.Xr mailer.conf 5
.Sh HISTORY
These
.Nm
and
.Nm newaliases
commands first appeared in
.Ox 4.5
as the replacement for equivalent commands shipped with sendmail.
