openbsd/src/usr.sbin/smtpd/makemap.8
.\"	$OpenBSD: makemap.8,v 1.8 2009/09/22 13:05:20 jmc Exp $
.\"
.\" Copyright (c) 2009 Jacek Masiulaniec <jacekm@openbsd.org>
.\" Copyright (c) 2008-2009 Gilles Chechade <gilles@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 22 2009 $
.Dt MAKEMAP 8
.Os
.Sh NAME
.Nm makemap
.Nd create database maps for smtpd
.Sh SYNOPSIS
.Nm makemap
.Op Fl o Ar dbfile
.Op Fl t Ar type
.Ar file
.Sh DESCRIPTION
Maps provide a generic interface for associating textual key to a value.
Such associations may be accessed through a plaintext file, database, or DNS.
The format of these file types is described below.
.Nm
itself creates the database maps used by keyed map lookups specified in
.Xr smtpd.conf 5 .
.Pp
.Nm
reads input from
.Ar file
and writes data to a file whose name is made by adding a
.Dq .db
suffix to
.Ar file .
In all cases,
.Nm
reads lines consisting of words separated by whitespace.
The first word of a line is the database key;
the remainder represents the mapped value.
The database key and value may optionally be separated
by the colon character.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl o Ar dbfile
Write the generated database to
.Ar dbfile .
.It Fl t Ar type
Specify the format of the resulting map file.
The default map format is suitable for storing simple, unstructured,
key-to-value string associations.
However, if the mapped value has special meaning,
as in the case of the virtual domains file,
a suitable
.Ar type
must be provided.
The available output types are:
.Bl -tag -width "aliases"
.It Cm aliases
The mapped value is a comma-separated list of mail destinations.
This format can be used for building user aliases and
virtual domains files.
.El
.Pp
.El
.Ex -std makemap
.Sh MAP TYPES
There are three types of map known to
.Xr smtpd 8 :
.Bl -tag -width Ds
.It alias
Map queried when resolving mail aliases.
Query key is the user part of mail address.
.It virtual
Map used for creating virtual domains.
See the
.Sx VIRTUAL DOMAINS
section below.
.It secrets
Map queried for credentials
when relaying mail via server that requires SMTPAUTH
before accepting mail for relaying.
Query key is the domain name of the server acting as relay.
.El
.Pp
The configuration directives that are valid in the
.Ic map
context are described below:
.Bl -tag -width Ds
.It Ic type Ar maptype
Specifies method of accessing data.
The following map types are supported:
.Bl -tag -width Ds
.It db
Mappings are stored in a file created using
.Nm .
This is the default type if none is specified.
.It dns
Not implemented yet.
.It file
Not implemented yet.
.El
.It Ic source Ar mapsource
Specifies the source of mapping data.
It must be absolute path to a file in case of
.Dq file
and
.Dq db
.Ar maptype ,
and a domain name in case of
.Dq dns .
.El
.Sh VIRTUAL DOMAINS
Virtual domains are kept in the virtual map.
To create single virtual address, add
.Dq user@example.com
to the virtual map.
To handle all mail destined to any user at example.com, add
.Dq @example.com
to the virtual map.
.Pp
In addition to adding an entry to the virtual map,
one must add a filter rule that accepts mail for the virtual domain,
for example:
.Bd -literal -offset indent
accept for domain "example.com" deliver to mbox
.Ed
.Sh FILES
.Bl -tag -width "/etc/mail/aliasesXXX" -compact
.It Pa /etc/mail/aliases
List of user mail aliases.
.It Pa /etc/mail/virtual
List of hosted virtual domains.
.It Pa /etc/mail/secrets
List of remote host credentials.
.El
.Sh SEE ALSO
.Xr aliases 5 ,
.Xr smtpd.conf 5 ,
.Xr editmap 8 ,
.Xr newaliases 8 ,
.Xr smtpd 8
.Sh HISTORY
The
.Nm
command first appeared in
.Ox 4.6
as a replacement for the equivalent command shipped with sendmail.
