openbsd/src/usr.sbin/smtpd/makemap.8
.\"	$OpenBSD: makemap.8,v 1.6 2009/03/16 20:43:29 gilles Exp $
.\"
.\" Copyright (c) 2009 Jacek Masiulaniec <jacekm@openbsd.org>
.\" Copyright (c) 2008-2009 Gilles Chechade <gilles@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 16 2009 $
.Dt MAKEMAP 8
.Os
.Sh NAME
.Nm makemap
.Nd create database maps for smtpd
.Sh SYNOPSIS
.Nm makemap
.Op Fl o Ar dbfile
.Op Fl t Ar type
.Ar file
.Sh DESCRIPTION
.Nm
creates the database maps used by keyed map lookups in
.Xr smtpd 8 .
It reads input from
.Ar file
and writes database to a file
whose name is made by adding .db suffix to
.Ar file .
.Pp
In all cases,
.Nm
reads lines consisting of words separated by whitespace.
The first is the database key,
the remaining specify mapped value.
Database key and value may optionally be separated
by the colon character.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl o Ar dbfile
Write generated database to
.Ar dbfile .
.It Fl t Ar type
Specify format of resulting map file.
Default map format is suitable for storing simple, unstructured
key-to-value string associations.
However, if mapped value has special meaning,
as in case of virtual domains definition file,
suitable
.Ar type
argument must be provided.
Available output types are:
.Bl -tag -width "aliases"
.It Cm aliases
Mapped value is comma-separated list of mail destinations.
This format can be used for building user aliases and
virtual domains database files.
.El
.Pp
.El
.Ex -std makemap
.Sh FILES
.Bl -tag -width "/etc/mail/aliasesXXX" -compact
.It Pa /etc/mail/aliases
List of user mail aliases.
.It Pa /etc/mail/virtual
List of hosted virtual domains.
.It Pa /etc/mail/secrets
List of remote hosts credentials.
.El
.Sh SEE ALSO
.Xr aliases 5 ,
.Xr mailer.conf 5 ,
.Xr editmap 8 ,
.Xr newaliases 8 ,
.Xr smtpd 8
.Sh HISTORY
The
.Nm
command first appeared in
.Ox 4.6
as the replacement for equivalent command shipped with sendmail.
