openbsd/src/usr.sbin/smtpd/makemap.8
.\" Copyright (c) 1998-2002 Sendmail, Inc. and its suppliers.
.\"	All rights reserved.
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"     $Sendmail: makemap.8,v 8.30 2002/06/27 23:41:04 gshapiro Exp $
.\"
.Dd October 21, 2008
.Dt MAKEMAP 8
.Os
.Sh NAME
.Nm makemap
.Nd create database maps for smtpd
.Sh SYNOPSIS
.Nm makemap
.Ar mapdesc
.Sh DESCRIPTION
.Nm
creates the database maps used by the keyed map lookups in
.Xr smtpd 8 .
It reads input from the
.Ar mapdesc
file and outputs them to
.Ar mapdesc.db .
.Pp
In all cases,
.Nm
reads lines from the standard input consisting of two
words separated by whitespace.
The first is the database key,
the second is the value.
.Pp
Notice: do
.Em not
use
.Nm
to create the aliases data base, but
.Xr newaliases 8
as the input formats differ for historical reasons.
.Sh SEE ALSO
.Xr editmap 8 ,
.Xr newaliases 8 ,
.Xr smtpd 8
.Sh HISTORY
The
.Nm
command appeared in
.Ox 4.5
as a replacement for the
.Nm
command that was shipped with sendmail.
