openbsd/src/usr.sbin/smtpd/newaliases.8
.\"	$OpenBSD: newaliases.8,v 1.2 2008/12/04 06:22:05 jmc Exp $
.\" Copyright (c) 1998-2001 Sendmail, Inc. and its suppliers.
.\"	All rights reserved.
.\" Copyright (c) 1983, 1997 Eric P. Allman.  All rights reserved.
.\" Copyright (c) 1985, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"     $Sendmail: newaliases.1,v 8.19 2001/10/10 03:23:17 ca Exp $
.\"
.Dd $Mdocdate: December 4 2008 $
.Dt NEWALIASES 8
.Os
.Sh NAME
.Nm newaliases
.Nd rebuild the database for the mail aliases file
.Sh SYNOPSIS
.Nm newaliases
.Sh DESCRIPTION
.Nm
rebuilds the random access database for the mail aliases file
.Pa /etc/mail/aliases .
It must be run each time this file is changed
in order for the change to take effect.
.Pp
.Ex -std newaliases
.Sh FILES
.Bl -tag -width "/etc/mail/aliasesXXX" -compact
.It Pa /etc/mail/aliases
The mail aliases file.
.El
.Sh SEE ALSO
.Xr aliases 5 ,
.Xr mailer.conf 5 ,
.Xr makemap 8 ,
.Xr smtpd 8
.Sh HISTORY
This
.Nm
command first appeared in
.Ox 4.5
as a replacement for the
.Nm
command that was shipped with sendmail.
