openbsd/src/usr.sbin/smtpd/newaliases.8
.\"	$OpenBSD: newaliases.8,v 1.8 2010/09/03 11:22:36 jmc Exp $
.\"
.\" Copyright (c) 2009 Jacek Masiulaniec <jacekm@openbsd.org>
.\" Copyright (c) 2008-2009 Gilles Chechade <gilles@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 3 2010 $
.Dt NEWALIASES 8
.Os
.Sh NAME
.Nm newaliases
.Nd rebuild the database for the mail aliases file
.Sh SYNOPSIS
.Nm newaliases
.Op Fl f Ar file
.Sh DESCRIPTION
.Nm
rebuilds the random access database for the mail aliases file,
the location of which is defined in
.Xr smtpd.conf 5 ,
and which by default is
.Pa /etc/mail/aliases .
This utility must be run each time the aliases file is changed
in order for the change to take effect.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl f Ar file
Use
.Ar file
as the configuration file,
instead of the default
.Pa /etc/mail/smtpd.conf .
.El
.Pp
Note: this utility is provided for sendmail compatibility.
The preferred way of rebuilding the database is with
.Xr makemap 8 :
.Bd -literal -offset indent
# makemap -t aliases /etc/mail/aliases
.Ed
.Sh FILES
.Bl -tag -width "/etc/mail/aliasesXXX" -compact
.It Pa /etc/mail/aliases
List of local user mail aliases.
.It Pa /etc/mail/virtual
List of virtual host aliases.
.El
.Sh EXIT STATUS
.Ex -std newaliases
.Sh SEE ALSO
.Xr smtpd.conf 5 ,
.Xr makemap 8
.Sh HISTORY
The
.Nm
command first appeared in
.Ox 4.6
as a replacement for the equivalent command shipped with sendmail.
