openbsd/src/usr.sbin/smtpd/smtpd.8
.\"	$OpenBSD: smtpd.8,v 1.12 2010/05/24 19:44:23 jmc Exp $
.\"
.\" Copyright (c) 2008, Gilles Chehade <gilles@openbsd.org>
.\" Copyright (c) 2008, Pierre-Yves Ritschard <pyr@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 24 2010 $
.Dt SMTPD 8
.Os
.Sh NAME
.Nm smtpd
.Nd Simple Mail Transfer Protocol daemon
.Sh SYNOPSIS
.Nm
.Op Fl dnv
.Op Fl D Ar macro Ns = Ns Ar value
.Op Fl f Ar file
.Sh DESCRIPTION
.Nm
is a Simple Mail Transfer Protocol
.Pq SMTP
daemon which can be used as a machine's primary mail system.
.Nm
can listen on a network interface and handle SMTP
transactions; it can also be fed messages through the standard
.Xr sendmail 8
interface.
It can relay messages through remote mail transfer agents or store them
locally using either the mbox or maildir format.
This implementation supports SMTP as defined by RFC 5321 as well as several
extensions.
A running
.Nm
can be controlled through
.Xr smtpctl 8 .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl D Ar macro Ns = Ns Ar value
Define
.Ar macro
to be set to
.Ar value
on the command line.
Overrides the definition of
.Ar macro
in the configuration file.
.It Fl d
Do not daemonize.
If this option is specified,
.Nm
will run in the foreground and log to
.Em stderr .
.It Fl f Ar file
Specify an alternative configuration file.
.It Fl n
Configtest mode.
Only check the configuration file for validity.
.It Fl v
Produce more verbose output.
.El
.Pp
.Nm
is not enabled by default.
In order to use it as the system mailer,
ensure the mail queue is empty,
then stop
.Xr sendmail 8 :
.Bd -literal -offset indent
# pkill sendmail
.Ed
.Pp
Modify the current
.Xr mailwrapper 8
settings by editing
.Pa /etc/mailer.conf :
.Bd -literal -offset indent
sendmail	/usr/sbin/smtpctl
send-mail	/usr/sbin/smtpctl
mailq		/usr/sbin/smtpctl
makemap		/usr/libexec/smtpd/makemap
newaliases	/usr/libexec/smtpd/makemap
.Ed
.Pp
Rebuild the aliases database,
and enable the daemon:
.Bd -literal -offset indent
# newaliases
# echo "sendmail_flags=NO" \*(Gt\*(Gt /etc/rc.conf.local
# echo "smtpd_flags=" \*(Gt\*(Gt /etc/rc.conf.local
# smtpd
.Ed
.Sh FILES
.Bl -tag -width "/var/run/smtpd.sockXXX" -compact
.It /etc/mail/smtpd.conf
Default
.Nm
configuration file.
.It /var/run/smtpd.sock
.Ux Ns -domain
socket used for communication with
.Xr smtpctl 8 .
.El
.Sh SEE ALSO
.Xr smtpd.conf 5 ,
.Xr mailwrapper 8 ,
.Xr smtpctl 8
.Rs
.%R RFC 5321
.%T "Simple Mail Transfer Protocol"
.%D October 2008
.Re
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 4.6 .
