openbsd/src/kerberosIV/src/admin/kdb_util.8
.\" $KTH: kdb_util.8,v 1.1 2000/11/08 17:34:07 joda Exp $
.\" Copyright 1989 by the Massachusetts Institute of Technology.
.\"
.\" For copying and distribution information,
.\" please see the file <mit-copyright.h>.
.\"
.TH KDB_UTIL 8 "Kerberos Version 4.0" "MIT Project Athena"
.SH NAME
kdb_util \-  Kerberos key distribution center database utility
.SH SYNOPSIS
kdb_util 
.B operation filename
.SH DESCRIPTION
.I kdb_util
allows the Kerberos key distribution center (KDC) database administrator to
perform utility functions on the database.
.PP
.I Operation
must be one of the following:
.TP 10n
.I load
initializes the KDC database with the records described by the
text contained in the file
.IR filename .
Any existing database is overwritten.
.TP
.I dump
dumps the KDC database into a text representation in the file
.IR filename .
.TP
.I slave_dump
performs a database dump like the
.I dump
operation, and additionally creates a semaphore file signalling the
propagation software that an update is available for distribution to
slave KDC databases.
.TP
.I merge
merges in the entries from
.IR filename
into the database.
.TP
.I new_master_key
prompts for the old and new master key strings, and then dumps the KDC
database into a text representation in the file
.IR filename .
The keys in the text representation are encrypted in the new master key.
.TP
.I convert_old_db
prompts for the master key string, and then dumps the KDC database into
a text representation in the file
.IR filename .
The existing database is assumed to be encrypted using the old format
(encrypted by the key schedule of the master key); the dumped database
is encrypted using the new format (encrypted directly with master key).
.PP
.SH DIAGNOSTICS
.TP 20n
"verify_master_key: Invalid master key, does not match database."
The master key string entered was incorrect.
.SH FILES
.TP 20n
/kerberos/principal.pag, /kerberos/principal.dir
DBM files containing database
.TP
.IR filename .ok
semaphore file created by
.IR slave_dump.
