openbsd/src/kerberosIV/src/admin/kstash.8
.\" $KTH: kstash.8,v 1.1 2000/11/08 17:34:07 joda Exp $
.\" Copyright 1989 by the Massachusetts Institute of Technology.
.\"
.\" For copying and distribution information,
.\" please see the file <mit-copyright.h>.
.\"
.TH KSTASH 8 "Kerberos Version 4.0" "MIT Project Athena"
.SH NAME
kstash \- stash Kerberos key distribution center database master key
.SH SYNOPSIS
kstash
.SH DESCRIPTION
.I kstash
saves the Kerberos key distribution center (KDC) database master key in
the master key cache file.
.PP
The user is prompted to enter the key, to verify the authenticity of the
key and the authorization to store the key in the file.
.SH DIAGNOSTICS
.TP 20n
"verify_master_key: Invalid master key, does not match database."
The master key string entered was incorrect.
.TP
"kstash: Unable to open master key file"
The attempt to open the cache file for writing failed (probably due to a
system or access permission error).
.TP
"kstash: Write I/O error on master key file"
The 
.BR write (2)
system call returned an error while
.I kstash
was attempting to write the key to the file.
.SH FILES
.TP 20n
/var/kerberos/principal.pag, /var/kerberos/principal.dir
DBM files containing database
.TP
/.k
Master key cache file.
