openbsd/src/share/man/man4/man4.macppc/adb.4
.\" $OpenBSD: adb.4,v 1.12 2006/01/02 12:37:51 jmc Exp $
.\"
.\" Copyright (c) 2001 Peter Philipp
.\" Copyright (c) 1997 Colin Wood
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Colin Wood
.\"      for the NetBSD Project.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 30, 2001
.Dt ADB 4 macppc
.Os
.Sh NAME
.Nm adb
.Nd Apple Desktop Bus driver
.Sh SYNOPSIS
.Cd "adb at macobio?"
.Cd "abtn* at adb?"
.Cd "akbd* at adb?"
.Cd "ams* at adb?"
.Cd "apm0 at adb?"
.Cd "pi2c0 at adb?"
.Sh DESCRIPTION
The Apple Desktop Bus
.Pq Tn ADB
is the single-master, multiple-slave, low-speed serial bus
interface used by Macintosh computers to connect input devices
such as keyboards, mice, trackballs, and graphics tablets
to the machine.
.Pp
Originally developed for the Mac68K port, the
.Nm
driver was heavily modified when it was ported to the PowerPC architecture.
During this port it seems that the original
.Nm
event device was split into many smaller subsystems, namely:
.Pp
.Bl -enum -compact
.It
Apple Keyboard driver
.Pq Xr akbd 4 .
.It
Apple Mouse Support driver
.Pq Xr ams 4 .
.El
.Pp
New
.Nm
devices such as the Apple Brightness / Volume Control Button
.Pq Xr abtn 4 ,
some energy control
.Pq Xr apm 4 ,
and I2C controller
.Pq Xr pi2c
were added to the PowerPC port later to complement the ADB system.
.Sh SEE ALSO
.Xr abtn 4 ,
.Xr akbd 4 ,
.Xr ams 4 ,
.Xr apm 4 ,
.Xr intro 4 ,
.Xr pi2c 4
.Sh HISTORY
The
.Nm
interface first appeared in
.Nx 0.9 .
It has been under development ever since.
The original
.Nm adb
manpage was written by Colin Wood for
.Nx Ns / Ns Mac68K.
.Sh AUTHORS
Original ADB support was written by Bradley A. Grantham.
The direct ADB routines were written by John P. Wittkoski.
