openbsd/src/share/man/man4/man4.macppc/akbd.4
.\"
.\" Copyright (c) 2001 Peter Philipp
.\" Copyright (c) 1997 Colin Wood
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Colin Wood
.\"      for the NetBSD Project.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$OpenBSD: akbd.4,v 1.1 2001/10/03 04:32:37 drahn Exp $
.\"	$NetBSD: adb.4,v 1.1 1997/07/18 02:13:42 ender Exp $
.\"
.Dd July 17, 1997
.Dt AKBD 4 macppc
.Os
.Sh NAME
.Nm akbd
.Nd Apple Keyboard Device
.Sh SYNOPSIS
.Cd "akbd* at adb?"
.Sh DESCRIPTION
The following is a partial list of supported
.Tn AKBD
devices:
.Bd -filled -offset indent
.Bl -item -compact
.It
Apple Standard Keyboard
.It
Apple Extended Keyboard
.It
Apple Adjustable Keyboard
.It
Apple PowerBook Keyboard
.It
Apple iBook Keyboard
.It
.El
.Ed
.Sh HISTORY
The
.Nm
interface first appeared in
.Nx 0.9 .
It has been under development ever since.
.Sh AUTHORS
Bradley A. Grantham wrote the original
.Nm
driver, including the
.Tn MRG
support.
The hardware direct interface was written by John P. Wittkowski.
