openbsd/src/share/man/man4/man4.macppc/asms.4
.\"	$OpenBSD: asms.4,v 1.6 2013/07/16 16:05:49 schwarze Exp $
.\"
.\" Copyright (c) 2005 Xavier Santolaria <xsa@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt ASMS 4 macppc
.Os
.Sh NAME
.Nm asms
.Nd Apple sudden motion sensor
.Sh SYNOPSIS
.Cd "asms* at iic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Apple sudden motion sensor found
in some laptops.
.Pp
The sensors currently exposed via the
.Xr sysctl 8
interface are:
.Bl -column "Sensor" "Units" "Typical" -offset indent
.It Sy "Sensor" Ta Sy "Units" Ta Sy "Typical Use"
.It Li "X_ACCEL" Ta "Unknown" Ta "X Acceleration"
.It Li "Y_ACCEL" Ta "Unknown" Ta "Y Acceleration"
.It Li "Z_ACCEL" Ta "Unknown" Ta "Z Acceleration"
.El
.Sh HARDWARE
Machines supported by the
.Nm
driver include:
.Pp
.Bl -dash -offset indent -compact
.It
PowerBook5,8
.It
PowerBook6,7
.It
PowerBook6,8
.El
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.9 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Xavier Santolaria Aq Mt xsa@openbsd.org .
