openbsd/src/share/man/man4/man4.macppc/awacs.4
.\" $OpenBSD: awacs.4,v 1.11 2008/06/26 05:42:07 ray Exp $
.\" $NetBSD: awacs.4,v 1.2 2001/05/09 22:16:12 he Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: June 26 2008 $
.Dt AWACS 4 macppc
.Os
.Sh NAME
.Nm awacs
.Nd Apple awacs audio device
.Sh SYNOPSIS
.Cd "awacs* at macobio?"
.Cd "audio* at awacs?"
.Sh DESCRIPTION
The
.Nm
(audio waveform amplifier and converter for sound)
driver provides support for the audio hardware found in many Apple
PowerMacs.
.Sh HARDWARE
Machines supported by the
.Nm
driver include:
.Pp
.Bl -dash -offset indent -compact
.It
PowerBook3,2
.It
PowerMac1,1
.It
PowerMac2,1
.It
PowerMac2,2
.It
PowerMac3,1
.It
PowerMac3,3
.El
.Sh SEE ALSO
.Xr audio 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 1.5.1
and was imported in
.Ox 3.0 .
.Sh AUTHORS
The
.Nm
driver was written by Tsubai Masanari.
.Sh BUGS
This driver needs more testing.
.Pp
This manual page needs more precision and detail.
