openbsd/src/share/man/man4/man4.macppc/esp.4
.\"	$OpenBSD: esp.4,v 1.3 2012/08/14 01:08:19 dlg Exp $
.\"
.\" Copyright (c) 2006 Gordon Willem Klok <gwk@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 14 2012 $
.Dt ESP 4 macppc
.Os
.Sh NAME
.Nm esp
.Nd NCR 53c94 on-board SCSI interface
.Sh SYNOPSIS
.Cd "esp* at macobio?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the on-board NCR 53c94 SCSI controller found on
many old world Apple Macintosh systems and clones.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr macobio 4 ,
.Xr scsi 4
