openbsd/src/share/man/man4/man4.macppc/intro.4
.\"	$OpenBSD: intro.4,v 1.1 2001/09/01 16:58:45 drahn Exp $
.\"
.\" Copyright (c) 2001 Peter Valchev.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Peter Valchev.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd August 3, 2001
.Dt INTRO 4 PowerPC
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files, 
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the PowerPC
platform.
Software support for these devices comes in two forms.  A hardware
device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Character and block
devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.  When the resultant system is booted, the
autoconfiguration facilities in the system probe for the device
and, if found, enable the software support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system must be rebooted.
.Pp
A list of the supported devices is given below.
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh SUPPORTED SYSTEMS
The following PowerPC models are 
.Em supported:
.Pp
PowerMac G4
.br
PowerMac Dual G4
.br
PowerMac G4 Cube
.br
iMac Rev A
.br
iMac Rev B
.br
iMac Rev C
.br
iMac DV
.br
iMac DV+
.br
PowerBook G3 (FireWire)
.br
PowerBook G4
.br
iBook (only limited testing)
.br
StarMax (development in progress)
.Pp
The following are 
.Em not supported:
.Pp
Support for older PREP style machines has been removed; lack of availability
of the hardware and relatively slow speed compared to more recent machines has
contributed to this decision.
.Pp
Apple PowerMac systems with a 601 processor or lack OpenFirmware will likely
never be supported.
.Pp
At the current time, older OpenFirmware machines are not supported. This is
mostly due to lack of developer resources to work onthe support in addition
to limited availability of hardware.
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.  Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width adb/mouse
.It abtn
ADB button
.It aed
ADB Event Device
.It akbd
ADB keyboard
.It ams
ADB mouse
.It an
Cisco/Aironet
.It aue
USB ethernet
.It awacs
Apple audio device
.It bm
BMAC ethernet
.It gm
GMAC ethernet
.It gpio
PMU interrupt router
.It iop
I2O processor, arrays, SCSI pass-through
.It kue
Kawasaki KL5KUSB101B
.It ohci
Open Host Controller, Opti RM861HA
.It ugen
USB Generic Driver
.It uhid
USB Generic HID devices
.It ukbd
USB HID Keyboard devices
.It ulpt
USB Printer
.It umass
USB Mass Storage Device
.It ums
USB Mice
.It uscanner
USB Scanner
.It usscanner
USB SCSI Scanner
.It vgafb
PCI VGA graphics
.It wi
WaveLAN
.El
.Sh UNSUPPORTED DEVICES
The following are recognized, but not supported:
.Bl -tag -width powerpc
.It Texas Instruments TSB12LV23 FireWire
.El
.Sh HISTORY
The
PowerPC
.Nm
first appeared with
.Ox 3.0 .
