openbsd/src/share/man/man4/man4.macppc/kauaiata.4
.\"	$OpenBSD: kauaiata.4,v 1.2 2003/06/12 17:53:25 jmc Exp $
.\"
.\" Copyright (c) 2003 Dale Rahn.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd June 11, 2003
.Dt KAUAIATA 4 macppc
.Os
.Sh NAME
.Nm kauaiata
.Nd ATA100 HD controller on PCI bus
.Sh SYNOPSIS
.Cd "kauaiata* at pci?"
.Sh DESCRIPTION
The
.Nm
device serves as a bridge to wdc_obio.
The DBDMA based controller logic which was on the
.Xr macobio 4
was copied and placed on the PCI bus.
This driver adapts the PCI configuration data into the form expected
by wdc_obio.
.Sh SEE ALSO
.Xr macobio 4 ,
.Xr wdc 4
.Sh HISTORY
The
.Nm
first appeared in
.Ox 3.4
