openbsd/src/share/man/man4/man4.macppc/macgpio.4
.\"	$OpenBSD: macgpio.4,v 1.5 2007/11/17 10:19:20 jmc Exp $
.\"
.\" Copyright (c) 2007 Gordon Willem Klok <gwk@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 17 2007 $
.Dt MACGPIO 4 macppc
.Os
.Sh NAME
.Nm macgpio
.Nd support for on-board GPIO controllers
.Sh SYNOPSIS
.Cd "macgpio* at macobio?"
.Cd "macgpio* at macgpio?"
.Sh DESCRIPTION
The
.Nm
device provides support for GPIO controllers found on many
Apple machines.
.Pp
.Ox
provides support for the following devices:
.Pp
.Bl -tag -width 14n -offset -indent -compact
.It Xr sysbutton 4
Xserve G4 and G5 front system identifier button
.El
.Sh SEE ALSO
.Xr gpio 4 ,
.Xr intro 4 ,
.Xr macobio 4 ,
.Xr gpioctl 8
