openbsd/src/share/man/man4/man4.macppc/maciic.4
.\"   $OpenBSD: maciic.4,v 1.2 2005/11/15 22:58:12 deraadt Exp $
.\"
.\" Copyright (c) 2005 Mark Kettenis
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd November 11, 2005
.Dt MACIIC 4 macppc
.Os
.Sh NAME
.Nm maciic
.Nd Apple Inter IC (I2C) bus
.Sh SYNOPSIS
.Cd "maciic* at smu?"
.Cd "maciic* at ki2c?"
.Sh DESCRIPTION
The
.Nm
driver provides support for I2C busses on Apple
.Tn Macintosh
machines.
.Pp
The
.Nm
driver enables direct configuration of the I2C bus by using
information from OpenFirmware.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr ki2c 4 ,
.Xr smu 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.9 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
