openbsd/src/share/man/man4/man4.macppc/memc.4
.\"     $OpenBSD: memc.4,v 1.1 2008/05/01 19:15:01 xsa Exp $
.\"
.\" Copyright (c) 2008 Xavier Santolaria <xsa@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 1 2008 $
.Dt MEMC 4 macppc
.Os
.Sh NAME
.Nm memc
.Nd UniNorth interface
.Sh SYNOPSIS
.Cd "memc* at mainbus0"
.Sh DESCRIPTION
The
.Nm
device is an interface to the UniNorth bridge chip.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr kiic 4 ,
.Xr macobio 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.0 .
.Sh AUTHORS
The
.Nm
driver was written by Dale Rahn.
