openbsd/src/share/man/man4/man4.macppc/pgs.4
.\"	$OpenBSD: pgs.4,v 1.1 2010/04/09 19:25:38 jasper Exp $
.\"
.\" Copyright (c) 2010 Jasper Lievisse Adriaanse <jasper@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 9 2010 $
.Dt PGS 4 macppc
.Os
.Sh NAME
.Nm pgs
.Nd programmer's switch
.Sh SYNOPSIS
.Cd "pgs* at macgpio?"
.Sh DESCRIPTION
The
.Nm
provides support for the "Programmer's Switch" found on some macppc machines.
If the
.Va ddb.console
.Xr sysctl 8
is set, pressing the button will cause the machine to enter
.Xr ddb 4 .
The "Programmers Switch" can be identified by the V-like symbol on it.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr macgpio 4 ,
.Xr sysctl 8
.Sh HISTORY
Support for the
.Nm
driver first appeared in
.Ox 4.7 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Jasper Lievisse Adriaanse Aq jasper@openbsd.org .
