openbsd/src/share/man/man4/man4.macppc/smu.4
.\"   $OpenBSD: smu.4,v 1.3 2005/11/20 04:49:19 brad Exp $
.\"
.\" Copyright (c) 2005 Mark Kettenis
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd October 19, 2005
.Dt SMU 4 macppc
.Os
.Sh NAME
.Nm smu
.Nd System Management Unit driver
.Sh SYNOPSIS
.Cd "smu? at mainbus0"
.Sh DESCRIPTION
The
.Nm
driver provides support for the System Management Unit found on Apple
.Tn iMac G5
and some
.Tn Power Mac G5
machines.
.Pp
The System Management Unit controls the fans in these systems.
It also contains the real time clock.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr iic 4 ,
.Xr maciic 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.9 .
.Sh AUTHORS
The
.Nm
driver was written by Mark Kettenis.
.Sh BUGS
Currently only the real time clock functionality is supported.
