openbsd/src/share/man/man4/man4.macppc/tumbler.4
.\"	$OpenBSD: tumbler.4,v 1.3 2006/04/04 23:30:38 martin Exp $
.\"
.\" Copyright (c) 2005 Joris Vink.
.\" Copyright (c) 2004 Dale Rahn.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd October 30, 2005
.Dt TUMBLER 4 macppc
.Os
.Sh NAME
.Nm tumbler
.Nd Apple "tumbler" audio device driver
.Sh SYNOPSIS
.Cd "tumbler* at macobio?"
.Cd "audio* at tumbler?"
.Sh DESCRIPTION
The
.Nm
driver provides support for audio hardware using the TAS3001 chip
found in some macppc machines.
.Sh HARDWARE
Machines supported by the
.Nm
driver include:
.Pp
.Bl -dash -offset indent -compact
.It
PowerBook3,3
.It
PowerBook4,1
.It
PowerMac3,4
.It
PowerMac3,5
.El
.Sh SEE ALSO
.Xr audio 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.9 .
.Sh AUTHORS
The
.Nm
driver was written by Tsubai Masanari and ported to
.Ox
by Brad Smith.
.Sh BUGS
This driver needs more testing.
.Pp
This manual page needs more precision and detail.
