openbsd/src/sbin/bioctl/bioctl.8
.\"	$OpenBSD: bioctl.8,v 1.28 2005/08/18 12:19:08 dlg Exp $
.\"
.\" Copyright (c) 2004, 2005 Marco Peereboom
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE FOR
.\" ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd December 27, 2004
.Dt BIOCTL 8
.Os
.Sh NAME
.Nm bioctl
.Nd RAID management interface
.Sh SYNOPSIS
.Nm bioctl
.Bk -words
.Op Fl Dhiv
.Op Fl a Ar alarm-function
.Op Fl b Ar target
.Op Fl H Ar channel:target[.lun]
.Ar device
.Ek
.Sh DESCRIPTION
.Nm
provides a generic interface for RAID management.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl a Ar alarm-function
Control the RAID card's alarm functionality, if supported.
.Ar function
may be one of:
.Bl -tag -width Ds
.It Ar get
Retrieve the current alarm state (enabled or disabled)
.It Ar enable
Enable the alarm on the RAID controller
.It Ar disable
Disable the alarm on the RAID controller
.It Ar silence | Ar quiet
Silence the alarm if it is currently beeping
.El
.Pp
The
.Ar alarm-function
may be specified as given above,
or by the first letter only
(e.g. -a e).
.It Fl b Ar target
Instructs the slot in the enclosure containing the device specified by
.Ar target
to blink.
.Ar device
is the enclosure.
.It Fl D
Enable debug output.
.It Fl H Ar channel:target[.lun]
Make a hot spare out of disk
.Ar channel:target[.lun]
on the specified controller
(e.g. bioctl -H 0:15).
.It Fl h
Where neccessary, produce "human-readable" output.
Use unit suffixes: Byte, Kilobyte, Megabyte,
Gigabyte, Terabyte, Petabyte, Exabyte in order to reduce the number of
digits to four or less.
.It Fl i
Enumerate the selected RAID devices.
.It Fl v
Be more verbose in output.
.It Ar device
Select a drive by name (e.g. sd0) or a RAID controller by name (e.g. ami0).
.El
.Sh SEE ALSO
.Xr ami 4 ,
.Xr bio 4 ,
.Xr ciss 4 ,
.Xr mpt 4 ,
.Xr scsi 4
.Sh HISTORY
The
.Nm
command appeared in
.Ox 3.8 .
.Sh AUTHORS
The
.Nm
interface was written by
.An Marco Peereboom Aq marco@openbsd.org .
