openbsd/src/sbin/bioctl/bioctl.8
.\"	$OpenBSD: bioctl.8,v 1.15 2005/08/02 11:53:28 marco Exp $
.\"
.\" Copyright (c) 2004, 2005 Marco Peereboom
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE FOR
.\" ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd December 27, 2004
.Dt BIOCTL 8
.Os
.Sh NAME
.Nm bioctl
.Nd RAID management interface
.Sh SYNOPSIS
.Nm bioctl
.Bk -words
.Op Fl aDhi
.Fl d Ar device |
.Fl f Ar device
.Ek
.Sh DESCRIPTION
.Nm
provides a generic interface for RAID management.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl a Ar function
Control the RAID card's alarm functionality,
if it supports it.
.Ar function
may be one of:
.Dq get
(retrieve the current state of the alarm (enabled or disabled)),
.Dq enable
(enable the alarm on the RAID controller),
.Dq disable
(disable the alarm on the RAID controller),
.Dq silence
or
.Dq quiet
(silence the alarm if it is currently beeping).
.Pp
.Ar function
may be specified as given above,
or by the first letter only
(e.g. -a e).
.It Fl D
Enable debug output.
.It Fl d Ar device
Select RAID controller e.g. ami0.
Use the
.Fl d
option for controller operations that impact all disk devices.
.It Fl f Ar device
Select RAID disk e.g. sd0.
.It Fl h
Online help.
.It Fl i
Depending on whether
.Fl d
or
.Fl f
was specified, enumerate all or only selected RAID device(s), respectively.
.El
.Sh SEE ALSO
.Xr ami 4 ,
.Xr gdt 4 ,
.Xr mpt 4 ,
.Xr bio 4 ,
.Xr scsi 4
.Sh HISTORY
The
.Nm
command appeared in
.Ox 3.8 .
.Sh AUTHORS
The
.Nm
interface was written by
.An Marco Peereboom Aq marco@openbsd.org .
