openbsd/src/usr.bin/encrypt/encrypt.1
.\"	$OpenBSD: encrypt.1,v 1.24 2014/09/03 07:47:50 giovanni Exp $
.\"
.\" Copyright (c) 1996, Jason Downs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: September 3 2014 $
.Dt ENCRYPT 1
.Os
.Sh NAME
.Nm encrypt
.Nd encrypt passwords from the command line or standard input
.Sh SYNOPSIS
.Nm encrypt
.Op Fl k
.Op Fl b Ar rounds
.Op Fl c Ar class
.Op Fl p | Ar string
.Op Fl s Ar salt
.Nm makekey
.Sh DESCRIPTION
.Nm
prints the encrypted form of
.Ar string
to the standard output.
This is mostly useful for encrypting passwords from within scripts.
.Pp
When invoked as
.Nm makekey ,
a single combined key and salt are read from standard
input and the DES encrypted result is written to standard output without a
terminating newline.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl b Ar rounds
Encrypt the string using Blowfish hashing with the specified number of
.Ar rounds .
May also specify 'a' to request a variable number of rounds scaled to the
machine's CPU capabilities.
.It Fl c Ar class
Use the cipher type specified in the given user login class.
See
.Xr login.conf 5
for more information.
.It Fl k
Run in
.Nm makekey
compatible mode.
.It Fl p
Prompt for a single string with echo turned off.
.It Fl s Ar salt
Encrypt the string using DES, with the specified
.Ar salt .
.El
.Pp
If no
.Ar string
is specified,
.Nm
reads one string per line from standard input, encrypting each one
with the chosen algorithm from above.
In the case where no specific algorithm or specific user login class was given
as a command line option, the algorithm specified in the default class in
.Pa /etc/login.conf
will be used.
.Pp
For Blowfish, a new random salt is automatically generated for each
password.
.Pp
Specifying the
.Ar string
on the command line should be discouraged; using the
standard input is more secure.
.Sh FILES
.Bl -tag -width /etc/login.conf -compact
.It Pa /etc/login.conf
.El
.Sh SEE ALSO
.Xr crypt 3 ,
.Xr login.conf 5
.Sh HISTORY
.Nm
first appeared in
.Ox 1.2 .
.Pp
A
.Nm makekey
command appeared in
.At v7 .
