openbsd/src/usr.bin/encrypt/encrypt.1
.\"	$OpenBSD: encrypt.1,v 1.4 1996/08/26 08:41:25 downsj Exp $
.\"
.\" Copyright (c) 1996, Jason Downs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 7, 1996
.Dt ENCRYPT 1
.Os OpenBSD
.Sh NAME
.Nm encrypt
.Nd encrypt passwords from the command line or standard input
.Sh SYNOPSIS
.Nm encrypt
.Op Fl k
.Op Fl m
.Op Fl s Ar salt
.Op Ar string
.Nm makekey
.Sh DESCRIPTION
.Nm encrypt
prints the encrypted form of
.Ar string
to the standard output.  This is mostly useful for encrypting passwords
from within scripts.
.Pp
The following options are supported:
.Bl -tag -width XxXXXXX
.It Fl k
Run in
.Nm makekey
compatible mode; a single combined key and salt are read from standard
input and the DES encrypted result is written to standard output without a
terminating newline.
.It Fl m
Encrypt the string using MD5.
.It Fl s Ar salt
Encrypt the string using DES, with the specified
.Ar salt .
.El
.Pp
If no
.Ar string
is specified,
.Nm encrypt
reads one string per line from standard input, encrypting each one with
the same
.Ar salt .
Specifing the 
.Ar string
on the command line should be discouraged; using the
standard input is more secure.
.Sh SEE ALSO
.Xr crypt 3
.Sh HISTORY
.Nm encrypt
first appeared in OpenBSD 1.2.
.Pp
A
.Nm makekey
command appeared in 
.At v7 .
