openbsd/src/usr.sbin/wsmoused/wsmoused.8
.\"	$OpenBSD: wsmoused.8,v 1.6 2002/03/27 18:54:09 jbm Exp $
.\"
.Dd April 8, 2001
.Dt WSMOUSED 8 i386
.Os
.Sh NAME
.Nm wsmoused
.Nd wsmouse daemon
.Sh SYNOPSIS
.Nm wsmoused
.Op Fl 2df
.Op Fl t Ar type
.Op Fl C Ar thresh
.Op Fl I Ar pid_file
.Op Fl M Ar N=M
.Op Fl p Ar device
.Nm wsmoused
.Op Fl i
.Op Fl p Ar device
.Sh DESCRIPTION
.Nm
listens for mouse events on the specified
.Ar device
and communicates them to the
.Xr wscons 4
driver through the
.Pa /dev/ttyCcfg
interface.
Its purpose is to provide copy/paste functionality on the PC console.
.Pp
By default, the left mouse button is used to select text (in the familiar
click-and-drag fashion), the right button is used to extend the selection,
and the middle button pastes.
This behavior can be modified through the use of
.Fl M ,
i.e.,
.Fl M
.Ar 2=3
maps the right mouse button to paste.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl 2
Indicate that the mouse has two-buttons. In that case, the right button pastes.
.It Fl C Ar thresh
Set double click speed as the maximum interval in msec between button clicks.
If omitted, the default value of 500 msec will be assumed.
This option will have effect only on the cut and paste operations
in the text mode console.
.It Fl I Ar file
Write the process ID of
.Nm
to the specified
.Ar file .
If omitted, the process ID will be stored in
.Pa /var/run/wsmoused.pid .
.It Fl M Ar N=M
Assign the physical button
.Ar M
to the logical button
.Ar N .
You may specify as many instances of this option as you like.
More than one
physical button may be assigned to a logical button at the same time.
In this case the logical button will be down, if either of the assigned
physical buttons is held down.
Do not put space around
.Ql = .
.It Fl d
Enable debugging messages.
.It Fl f
Do not become a daemon and instead run as a foreground process.
Useful for testing and debugging.
.It Fl i
Print the type and the protocol of the mouse and exit.
.It Fl p Ar device
Use device
.Ar device
to communicate with the mouse. If this option is not present, the device opened
is
.Pa /dev/wsmouse
(the multiplexer device that receive all mouse events from all wsmouse
compatible mice on the system). For a serial mouse, you have to explicitly
specify the serial port, i.e.
.device port
must be one of
.Pa /dev/cua0[0-3]
.It Fl t Ar type
This options only applies to serial mice. It specifies the protocol used by the
serial mice.
You may explicitly specify a type listed below or use
.Em auto
to let
.Nm
to automatically select an appropriate protocol for the given mouse, if the
serial mouse respects the PnP COM specification.
.Pp
If this option is not specified,
.Em auto
is assumed.
Under normal circumstances, you need to use this option only if
the mouse is not PnP compatible.
.Pp
Valid protocol types for this option are the following:
.Bl -tag -width thinkingmouse
.It microsoft
Microsoft serial mouse protocol.
Most 2-button serial mice use this protocol.
.It intellimouse
Microsoft IntelliMouse protocol.
Genius NetMouse, ASCII Mie Mouse, Logitech MouseMan+, and FirstMouse+ use
use this protocol as well.
Other mice with a roller/wheel may be compatible with this protocol.
.It mousesystems
MouseSystems 5-byte protocol.
3-button mice may use this protocol.
.It mmseries
MM Series mouse protocol.
.It logitech
Logitech mouse protocol.
Note that this is for old Logitech models
.Em mouseman
or
.Em intellimouse
should be specified for newer models.
.It mouseman
Logitech MouseMan and TrackMan protocol.
Some 3-button mice may be compatible with this protoco.
Note that MouseMan+ and FirstMouse+ use
.Em intellimouse
protocol rather than this one.
.It glidepoint
ALPS GlidePoint protocol.
.It thinkingmouse
Kensington ThinkingMouse protocol.
.It mmhitab
Hitachi tablet protocol.
.El
.El

.Nm 
will happily coexist with X-Window, provided that the mouse device is 
supported by 
.Xr wsmouse 4 .
Serial mice do not have a 
.Xr wsmouse 4 
compatible driver, so 
.Nm
has to be killed before starting X-Window.
.Sh SEE ALSO
.Xr wscons 4 ,
.Xr wsmouse 4
.Sh HISTORY
The
.Nm
daemon is a slightly modified version of the moused daemon from the
.Fx
project, written by Michael Smith <msmith@FreeBSD.org>.
Both inherit code from the XFree Project.
