openbsd/src/usr.sbin/afs/src/appl/bos/bos.8
.\" Copyright (c) 2000 Kungliga Tekniska Högskolan
.\" $KTH: bos.8,v 1.4 2000/08/30 06:27:00 lha Exp $
.Dd Aug 29, 2000
.Dt bos 8
.Os Arla
.Sh NAME
.Nm bos
.Nd is the client part of the Basic overseer daemon that manage AFS server processes.
.Sh SYNOPSIS
.Nm bos
.Op Ar addhost | addkey | adduser | create
.Op Ar args
.Nm bos
.Op Ar delete | exec | getdate | getlog
.Op Ar args
.Nm bos
.Op Ar getrestart | install | listhosts | listkeys
.Op Ar args
.Nm bos
.Op Ar listusers | prune | removehost | removekey
.Op Ar args
.Nm bos
.Op Ar removeuser | restart | salvage | setauth
.Op Ar args
.Nm bos
.Op Ar setcellname | setrestart | shutdown | start
.Op Ar args
.Nm bos
.Op Ar stop | uninstall
.Op Ar args
.Sh DESCRIPTION
The
.Nm
utility is the client part of the Basic overseer daemon that manage
AFS server processes.
.Pp
.Pp
Most
.Nm
commands accept the following general arguments:
.Pp
.Bd -filled -offset indent -compact
.Op Fl cell Ar cellname
Specifies which AFS cell to use, if the default cell is not to be used.
.Pp
.Op Fl noauth
Specifies that
.Nm
should not try to authenticate the connection to the server.
This may be
useful with shell scripts, or if there is a problem with the AFS cell.
Note that the server will reject many commands if
.Fl noauth
is specified.
.Pp
.Op Fl localauth
Create a ticket using the AFS server key, that is, you don't need a token.
This will generally only work on AFS servers, and is very useful for
performing automatic tasks.
.Ed
.Pp
.Nm
has several subcommands:
.Pp
.Ic addhost
.Fl server Ar server
.Fl host Ar host
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
.Bd -filled -offset indent -compact
Add a new
.Ar host
to the CellServDB on the
.Ar server Ns .
This makes the database server consider
.Ar host
as a peer and will use when they synchronize their databases (the
database servers) need to be restarted.
.Ed
.Pp
.Ic addkey
.Fl server Ar server
.Op Fl key Ar key
.Op Fl kvno Ar keyversionnumber
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
.Bd -filled -offset indent -compact
Add a new afs-key to the KeyFile.
Add the ticket specified in
.Ar key
with
.Ar keyversionnumber
to the
.Ar server .
.Ed
.Pp
.Ic adduser
.Fl server Ar server
.Fl user Ar user
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
.Bd -filled -offset indent -compact
Add a new user the the SuperUser file on the fileserver
.Ar server ,
thus giving that user the right to manage volumes and bosserver.
.Ed
.Pp
.Ic create
.Fl server Ar server
.Fl instance Ar serverprocessname
.Fl type Ar servertype
.Fl cmd Ar command
.Op Fl notifier Ar program
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
.Bd -filled -offset indent -compact
Create a new service
.Ar instance
at the
.Ar server
of
.Ar type.
The instance will depending on type run the
.Ar command
command.
.Ed
.Pp
.Ic delete
.Fl server Ar server
.Fl instance Ar instance
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
.Bd -filled -offset indent -compact
Delete the
.Ar instance
from the
.Ar server .
.Ed
.Pp
.Ic exec
.Bd -filled -offset indent -compact
.Fl server Ar server
.Fl cmd Ar command
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
Execute
.Ar command
on the server
.Ar server .
.Ed
.Pp
.Ic getdate
.Fl server Ar server
.Fl files Ar checkfiles
.Op Fl dir Ar dir
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
.Bd -filled -offset indent -compact
Get dates for
.Ar checkfiles
in server-root directory (that can be specified with
.Ar dir
if that is needed) on
.Ar server.
.Ed
.Pp
.Ic getlog
.Fl server Ar server
.Fl file Ar logfile
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
.Bd -filled -offset indent -compact
List the content of the
.Ar logfile
that resides on the
.Ar server.
.Ed
.Pp
.Ic getrestart
.Fl server Ar server
.Op Fl dir Ar dest
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
.Bd -filled -offset indent -compact
Get the restart time from
.Ar server.
.Ed
.Pp
.Ic install
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic listhosts
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic listkeys
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic listusers
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic prune
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic removehost
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic removekey
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic removeuser
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic restart
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic salvage
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic setauth
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic setcellname
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic setrestart
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic shutdown
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic start
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic stop
.Bd -filled -offset indent -compact
.Ed
.Pp
.Ic uninstall
.Bd -filled -offset indent -compact
.Ed
.Pp
.Sh SEE ALSO
.Xr fs 1 ,
.Xr pts 1 ,
.Xr vos 8 ,
.Xr arlad 8
.Sh BUGS
Quite a lot of commands are not implemented yet.
