openbsd/src/share/man/man8/man8.zaurus/boot_zaurus.8
.\"	$OpenBSD: boot_zaurus.8,v 1.2 2007/05/31 19:20:00 jmc Exp $
.\"
.\" Copyright (c) 2005 Uwe Stuehler
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt BOOT_ZAURUS 8 zaurus
.Os
.Sh NAME
.Nm boot_zaurus
.Nd zaurus system bootstrapping procedures
.Sh DESCRIPTION
.Ss System starts
When powered on, or if the system is rebooted via
.Xr reboot 8
or
.Xr shutdown 8 ,
the processor begins executing code at physical address 0.
The early startup code is preinstalled by the manufacturer,
and will load a minimal UNIX-like operating system from internal
flash memory (our primary bootstrap loader, for now).
.Ss Boot process options
On most systems, booting
.Ox
from the primary bootstrap loader will eventually load the
.Ox Ns -specific
zaurus bootstrapping code.
This versatile program is described in a separate document,
.Xr boot 8 .
.Ss Abnormal system termination
In case of system crashes, the kernel will usually enter the kernel
debugger,
.Xr ddb 4 ,
unless it is not present in the kernel, or it is disabled via the
.Em ddb.panic
sysctl.
Upon leaving ddb, or if ddb was not entered, the kernel will halt the system
if it was still in device configuration phase, or attempt a dump to the
configured dump device, if possible.
The crash dump will then be recovered by
.Xr savecore 8
during the next multi-user boot cycle.
It is also possible to force other behaviours from ddb.
.Sh FILES
.Bl -tag -width /usr/mdec/zbsdmod.o -compact
.It Pa /bsd
default system kernel
.It Pa /bsd.rd
standalone installation kernel, suitable for disaster recovery
.It Pa /usr/mdec/zboot
system bootstrap
.It Pa /usr/mdec/zbsdmod.o
kernel module for the primary bootstrap loader that must be
loaded before the system bootstrap
.El
.Sh SEE ALSO
.Xr ddb 4 ,
.Xr boot 8 ,
.Xr halt 8 ,
.Xr init 8 ,
.\" .Xr installboot 8 ,
.Xr reboot 8 ,
.Xr savecore 8 ,
.Xr shutdown 8
