openbsd/src/share/man/man4/man4.landisk/shpcic.4
.\"	$OpenBSD: shpcic.4,v 1.2 2007/05/31 19:19:55 jmc Exp $
.\"
.\" Copyright (c) 2004 Martin Reindl
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt SHPCIC 4 landisk
.Os
.Sh NAME
.Nm shpcic 
.Nd landisk SuperH PCI-Host Bridge
.Sh SYNOPSIS
.Cd "shpcic* at mainbus?"
.Cd "pci0 at shpcic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the landisk on-board PCI bus.
This device is largely transparent and provides no user accessible entry points.
.Sh SEE ALSO
.Xr mainbus 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.1 .
