openbsd/src/kerberosIV/kdb_edit/kdb_edit.8
.\"
.\" This software may now be redistributed outside the US.
.\"
.\"Copyright (C) 1989 by the Massachusetts Institute of Technology
.\"
.\"Export of this software from the United States of America is assumed
.\"to require a specific license from the United States Government.
.\"It is the responsibility of any person or organization contemplating
.\"export to obtain such a license before exporting.
.\"
.\"WITHIN THAT CONSTRAINT, permission to use, copy, modify, and
.\"distribute this software and its documentation for any purpose and
.\"without fee is hereby granted, provided that the above copyright
.\"notice appear in all copies and that both that copyright notice and
.\"this permission notice appear in supporting documentation, and that
.\"the name of M.I.T. not be used in advertising or publicity pertaining
.\"to distribution of the software without specific, written prior
.\"permission.  M.I.T. makes no representations about the suitability of
.\"this software for any purpose.  It is provided "as is" without express
.\"or implied warranty.
.\"
.\"	$OpenBSD: kdb_edit.8,v 1.3 1998/02/18 11:53:49 art Exp $
.TH KDB_EDIT 8 "Kerberos Version 4.0" "MIT Project Athena"
.SH NAME
kdb_edit \-  Kerberos key distribution center database editing utility
.SH SYNOPSIS
kdb_edit [
.B \-n
]
.SH DESCRIPTION
.I kdb_edit
is used to create or change principals stored in the Kerberos key
distribution center (KDC) database.
.PP
When executed,
.I kdb_edit
prompts for the master key string and verifies that it matches the
master key stored in the database.
If the
.B \-n
option is specified, the master key is instead fetched from the master
key cache file.
.PP
Once the master key has been verified,
.I kdb_edit
begins a prompt loop.  The user is prompted for the principal and
instance to be modified.  If the entry is not found the user may create
it.
Once an entry is found or created, the user may set the password,
expiration date, maximum ticket lifetime, and attributes.
Default expiration dates, maximum ticket lifetimes, and attributes are
presented in brackets; if the user presses return the default is selected.
There is no default password.
The password RANDOM is interpreted specially, and if entered
the user may have the program select a random DES key for the
principal.
.PP
Upon successfully creating or changing the entry, ``Edit O.K.'' is
printed.
.SH DIAGNOSTICS
.TP 20n
"verify_master_key: Invalid master key, does not match database."
The master key string entered was incorrect.
.SH FILES
.TP 20n
/etc/kerberosIV/principal.pag, /etc/kerberosIV/principal.dir
DBM files containing database
.TP
/etc/kerberosIV/master_key
Master key cache file.
