openbsd/src/usr.bin/less/less.1
.\"	$OpenBSD: less.1,v 1.60 2024/04/14 18:11:54 guenther Exp $
.\"
.\" Copyright (C) 1984-2012  Mark Nudelman
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice in the documentation and/or other materials provided with
.\"    the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
.\" OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
.\" BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
.\" OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN
.\" IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: April 14 2024 $
.Dt LESS 1
.Os
.Sh NAME
.Nm less
.Nd view files
.Sh SYNOPSIS
.Nm less
.Op Fl ?~AaBCcdEeFfGgIiJKLMmNnQqRrSsUuVWwX
.Op Fl b Ar n
.Op Fl h Ar n
.Op Fl j Ar n
.Op Fl k Ar keyfile
.Op Fl O | o Ar logfile
.Op Fl P Ar prompt
.Op Fl p Ar pattern
.Op Fl T Ar tagsfile
.Op Fl t Ar tag
.Op Fl x Ar n , Ns Ar ...
.Op Fl y Ar n
.Op Fl z Ar n
.Op Fl # Ar n
.Op Ar
.Sh DESCRIPTION
.Nm
displays text one screenful at a time.
After showing each screenful, it prompts the user for a command,
as described in
.Sx COMMANDS .
When showing the last line of a file,
.Nm
displays a prompt indicating end of file and the name of the next file
to examine, if any.
It then waits for input from the user.
.Pp
.Nm
is similar to the traditional
.Xr more 1 ,
but with many more features.
.Nm
will behave like
.Xr more 1
if it is called as
.Nm more ,
or if the
.Ev LESS_IS_MORE
environment variable is set.
The main differences between the two are summarized in the
.Sx COMPATIBILITY WITH MORE
section, below.
.Pp
A long option name may be abbreviated as long as the abbreviation is
unambiguous.
Such option names need only have their first letter capitalized;
the remainder of the name may be in either case.
For example,
.Fl -Quit-at-eof
is equivalent to
.Fl -QUIT-AT-EOF .
.Pp
The options are as follows:
.Bl -tag -width XXXX
.It Fl \&? | -help
This option displays a summary of the commands accepted by
.Nm
(the same as the
.Ic h
command).
(Depending on how your shell interprets the question mark,
it may be necessary to quote the question mark, thus:
.Ql Fl Ns \e? . )
.It Fl A | -SEARCH-SKIP-SCREEN
Causes all forward searches (not just non-repeated searches)
to start just after the target line, and all backward searches
to start just before the target line.
Thus, forward searches will skip part of the displayed screen
(from the first line up to and including the target line).
Similarly backwards searches will skip the displayed screen
from the last line up to and including the target line.
This was the default behavior in
.Nm
versions prior to 441.
.It Fl a | -search-skip-screen
By default, forward searches start at the top of the displayed screen
and backwards searches start at the bottom of the displayed screen
(except for repeated searches invoked by the
.Ic n
or
.Ic N
commands,
which start after or before the
.Dq target
line respectively; see the
.Fl j
option for more about the target line).
The
.Fl a
option causes forward searches to instead start at the bottom of the screen
and backward searches to start at the top of the screen,
thus skipping all lines displayed on the screen.
.It Fl B | -auto-buffers
By default, when data is read from a pipe,
buffers are allocated automatically as needed.
If a large amount of data is read from the pipe, this can cause
a large amount of memory to be allocated.
The
.Fl B
option disables this automatic allocation of buffers for pipes,
so that only 64K (or the amount of space specified by the
.Fl b
option) is used for the pipe.
.Sy Warning :
use of
.Fl B
can result in erroneous display, since only the
most recently viewed part of the piped data is kept in memory;
any earlier data is lost.
.It Fl b Ar n | Fl -buffers Ns = Ns Ar n
Specifies the amount of buffer space
.Nm
will use for each file, in units of kilobytes (1024 bytes).
By default 64K of buffer space is used for each file
(unless the file is a pipe; see the
.Fl B
option).
The
.Fl b
option specifies instead that
.Ar n
kilobytes of buffer space should be used for each file.
If
.Ar n
is -1, buffer space is unlimited; that is,
the entire file can be read into memory.
.It Fl C | -CLEAR-SCREEN
Same as
.Fl c ,
for compatibility with older versions of
.Nm .
.It Fl c | -clear-screen
Causes full screen repaints to be painted from the bottom of the screen.
By default, full screen repaints are done from the top line down
to avoid the position of the display being moved
when using interactive commands.
.It Fl d | -dumb
The
.Fl d
option suppresses the error message normally displayed if the terminal is dumb;
that is, if the terminal lacks some important capability,
such as the ability to clear the screen or scroll backward.
The
.Fl d
option does not otherwise change the behavior of
.Nm
on a dumb terminal.
.It Fl E | -QUIT-AT-EOF
Causes
.Nm
to automatically exit the first time it reaches end-of-file.
.It Fl e | -quit-at-eof
Causes
.Nm
to automatically exit the second time it reaches end-of-file.
By default, the only way to exit
.Nm
is via the
.Ic q
command.
.It Fl F | -quit-if-one-screen
Causes
.Nm
to automatically exit if the entire file can be displayed on the first screen.
.It Fl f | -force
Forces non-regular files to be opened.
(A non-regular file is a directory or a device special file.)
Also suppresses the warning message when a binary file is opened.
By default,
.Nm
will refuse to open non-regular files.
.It Fl G | -HILITE-SEARCH
The
.Fl G
option suppresses all highlighting of strings found by search commands.
.It Fl g | -hilite-search
Normally,
.Nm
will highlight all strings which match the last search command.
The
.Fl g
option changes this behavior to highlight only the particular string
which was found by the last search command.
This can cause
.Nm
to run somewhat faster than the default.
.It Fl h Ar n | Fl -max-back-scroll Ns = Ns Ar n
Specifies a maximum number of lines to scroll backward.
If it is necessary to scroll backward more than n lines,
the screen is repainted in a forward direction instead.
(If the terminal does not have the ability to scroll backward,
.Sq Fl h Ns 0
is implied.)
.It Fl I | -IGNORE-CASE
Like
.Fl i ,
but searches ignore case even if the pattern contains uppercase
letters.
.It Fl i | -ignore-case
Causes searches to ignore case; that is,
uppercase and lowercase are considered identical.
This option is ignored if any uppercase letters appear in the search pattern;
in other words,
if a pattern contains uppercase letters, then that search does not ignore case.
.It Fl J | -status-column
Displays a status column at the left edge of the screen.
The status column shows the lines that matched the current search.
The status column is also used if the
.Fl w
or
.Fl W
option is in effect.
.It Fl j Ar n | Fl -jump-target Ns = Ns Ar n
Specifies a line on the screen where the
.Dq target
line is to be positioned.
The target line is the line specified by any command to
search for a pattern, jump to a line number,
jump to a file percentage or jump to a tag.
The screen line may be specified by a number: the top line on the screen
is 1, the next is 2, and so on.
The number may be negative to specify a line relative to the bottom
of the screen: the bottom line on the screen is -1, the second
to the bottom is -2, and so on.
Alternately, the screen line may be specified as a fraction of the height
of the screen, starting with a decimal point: .5 is in the middle of the
screen, .3 is three tenths down from the first line, and so on.
If the line is specified as a fraction, the actual line number
is recalculated if the terminal window is resized, so that the
target line remains at the specified fraction of the screen height.
If any form of the
.Fl j
option is used,
forward searches begin at the line immediately after the target line,
and backward searches begin at the target line,
unless changed by
.Fl a
or
.Fl A .
For example, if
.Sq Fl j Ns 4
is used, the target line is the fourth line on the screen,
so forward searches begin at the fifth line on the screen.
.It Fl K | -quit-on-intr
Causes
.Nm
to exit immediately (with status 2) when an interrupt character (usually
.Ic ^C )
is typed.
Normally, an interrupt character causes
.Nm
to stop whatever it is doing and return to its command prompt.
Note that use of this option makes it impossible to return to the
command prompt from the
.Ic F
command.
.It Fl k Ar keyfile | Fl -lesskey-file Ns = Ns Ar keyfile
Causes
.Nm
to open and interpret the named file as a
.Xr lesskey 1
file.
Multiple
.Fl k
options may be specified.
If the
.Ev LESSKEY
or
.Ev LESSKEY_SYSTEM
environment variable is set, or if a lesskey file is found in a standard place
(see
.Sx KEY BINDINGS ) ,
it is also used as a lesskey file.
.It Fl M | -LONG-PROMPT
Causes
.Nm
to prompt even more verbosely than
.Xr more 1 .
.It Fl m | -long-prompt
Causes
.Nm
to prompt verbosely, like
.Xr more 1 ,
with the percent into the file.
By default,
.Nm
prompts with a colon.
.It Fl N | -LINE-NUMBERS
Causes a line number to be displayed at the beginning of each line in the
display.
.It Fl n | -line-numbers
Suppresses line numbers.
The default (to use line numbers) may cause
.Nm
to run more slowly in some cases, especially with a very large input file.
Suppressing line numbers with the
.Fl n
option will avoid this problem.
Using line numbers means: the line number will be displayed in the verbose
prompt and in the
.Ic =
command, and the
.Ic v
command will pass the current line
number to the editor (see also the discussion of
.Ev LESSEDIT
in
.Sx PROMPTS
below).
.It Fl O Ar logfile | Fl -LOG-FILE Ns = Ns Ar logfile
The
.Fl O
option is like
.Fl o ,
but it will overwrite an existing file without asking for confirmation.
.Pp
If no log file has been specified,
the
.Fl o
and
.Fl O
options can be used from within
.Nm
to specify a log file.
Without a file name, they will simply report the name of the log file.
The
.Ic s
command is equivalent to specifying
.Fl o
from within
.Nm .
.It Fl o Ar logfile | Fl -log-file Ns = Ns Ar logfile
Causes
.Nm
to copy its input to the named file as it is being viewed.
This applies only when the input file is a pipe, not an ordinary file.
If the file already exists,
.Nm
will ask for confirmation before overwriting it.
.It Fl P Ar prompt | Fl -prompt Ns = Ns Ar prompt
Provides a way to tailor the three prompt styles to your own preference.
This option would normally be put in the
.Ev LESS
environment variable, rather than being typed in with each
.Nm
command.
Such an option must either be the last option in the
.Ev LESS
variable, or be terminated by a dollar sign.
.Bl -item
.It
.Fl Ps Ar string
changes the default (short) prompt to
.Ar string .
.It
.Fl Pm
changes the medium
.Pq Fl m
prompt.
.It
.Fl PM
changes the long
.Pq Fl M
prompt.
.It
.Fl Ph
changes the prompt for the help screen.
.It
.Fl P=
changes the message printed by the
.Ic =
command.
.It
.Fl Pw
changes the message printed while waiting for data (in the
.Ic F
command).
.El
All prompt strings consist of a sequence of letters and special escape
sequences.
See the section on
.Sx PROMPTS
for more details.
.It Fl p Ar pattern | Fl -pattern Ns = Ns Ar pattern
The
.Fl p
option on the command line is equivalent to specifying
.Cm +/ Ns Ar pattern ;
that is, it tells
.Nm
to start at the first occurrence of pattern in the file.
.It Fl Q | -QUIET | -SILENT
Causes totally quiet operation: the terminal bell is never rung.
.It Fl q | -quiet | -silent
Causes moderately quiet operation:
the terminal bell is not rung if an attempt is made to scroll past the end
of the file or before the beginning of the file.
If the terminal has a visual bell, it is used instead.
The bell will be rung on certain other errors,
such as typing an invalid character.
The default is to ring the terminal bell in all such cases.
.It Fl R | -RAW-CONTROL-CHARS
Like
.Fl r ,
but only ANSI color escape sequences are output in raw form.
Unlike
.Fl r ,
the screen appearance is maintained correctly in most cases.
ANSI color escape sequences are sequences of the form:
.Pp
.Dl ESC \&[ ... m
.Pp
where the
.Dq ...
is zero or more color specification characters.
For the purpose of keeping track of screen appearance,
ANSI color escape sequences are assumed to not move the cursor.
You can make
.Nm
think that characters other than
.Sq m
can end ANSI color escape sequences by setting the environment variable
.Ev LESSANSIENDCHARS
to the list of characters which can end a color escape sequence.
And you can make
.Nm
think that characters other than the standard ones may appear between
the
.Cm ESC
and the
.Cm m
by setting the environment variable
.Ev LESSANSIMIDCHARS
to the list of characters which can appear.
.It Fl r | -raw-control-chars
Causes raw control characters to be displayed.
The default is to display control characters using the caret notation;
for example, a control-A (octal 001) is displayed as
.Sq ^A .
.Sy Warning :
when the
.Fl r
option is used,
.Nm
cannot keep track of the actual appearance of the screen
(since this depends on how the screen responds to
each type of control character).
Thus, various display problems may result,
such as long lines being split in the wrong place.
.It Fl S | -chop-long-lines
Display only the beginning of lines that exceed the screen width.
The remainder can be shown by scrolling horizontally.
The default is to wrap long lines; that is, display the remainder
on the next line.
.It Fl s | -squeeze-blank-lines
Causes consecutive blank lines to be squeezed into a single blank line.
.It Fl T Ar tagsfile | Fl -tag-file Ns = Ns Ar tagsfile
Specifies a tags file to be used instead of
.Pa tags .
.It Xo
.Fl t Ar tag |
.Fl -tag Ns = Ns Ar tag
.Xc
The
.Fl t
option, followed immediately by a
.Ar tag ,
will edit the file containing that tag.
For this to work, tag information must be available;
for example, there may be a file in the current directory called
.Pa tags ,
which was previously built by
.Xr ctags 1
or an equivalent command.
The
.Fl t
option may also be specified from within
.Nm
(using the
.Ic -
command) as a way of examining a new file.
The command
.Ic :t
is equivalent to specifying
.Fl t
from within
.Nm .
.It Fl U | -UNDERLINE-SPECIAL
Causes backspaces, tabs and carriage returns to be
treated as control characters;
that is, they are handled as specified by the
.Fl r
option.
.Pp
By default, if neither
.Fl u
nor
.Fl U
is given, backspaces which appear adjacent
to an underscore character are treated specially:
the underlined text is displayed
using the terminal's hardware underlining capability.
Also, backspaces which appear between two identical characters
are treated specially:
the overstruck text is printed
using the terminal's hardware boldface capability.
Other backspaces are deleted, along with the preceding character.
Carriage returns immediately followed by a newline are deleted.
Other carriage returns are handled as specified by the
.Fl r
option.
Text which is overstruck or underlined can be searched for
if neither
.Fl u
nor
.Fl U
is in effect.
.It Fl u | -underline-special
Causes backspaces and carriage returns to be treated as printable characters;
that is, they are sent to the terminal when they appear in the input.
.It Fl V | -version
Displays the version number of
.Nm .
.It Fl W | -HILITE-UNREAD
Like
.Fl w ,
but temporarily highlights the first new line after any
forward movement command larger than one line.
.It Fl w | -hilite-unread
Temporarily highlights the first new line after a forward movement
of a full page.
The first new line is the line immediately following the line previously
at the bottom of the screen.
Also highlights the target line after a
.Ic g
or
.Ic p
command.
The highlight is removed at the next command which causes movement.
The entire line is highlighted, unless the
.Fl J
option is in effect,
in which case only the status column is highlighted.
.It Fl X | -no-init
Disables sending the termcap initialization and deinitialization strings
to the terminal.
This is sometimes desirable if the deinitialization string does
something unnecessary, like clearing the screen.
.It Xo
.Fl x Ar n , Ns Ar ... |
.Fl -tabs Ns = Ns Ar n , Ns Ar ...
.Xc
Sets tab stops.
If only one
.Ar n
is specified, tab stops are set at multiples of
.Ar n .
If multiple values separated by commas are specified, tab stops are set at
those positions, and then continue with the same spacing as the last two.
For example,
.Sq Fl x Ns 9,17
will set tabs at positions 9, 17, 25, 33, etc.
The default for
.Ar n
is 8.
.It Fl y Ar n | Fl -max-forw-scroll Ns = Ns Ar n
Specifies a maximum number of lines to scroll forward.
If it is necessary to scroll forward more than n lines,
the screen is repainted instead.
The
.Fl c
or
.Fl C
option may be used to repaint from the top of the screen if desired.
By default, any forward movement causes scrolling.
.It Fl z Ar n | Fl -window Ns = Ns Ar n
Changes the default scrolling window size to
.Ar n
lines.
The default is one screenful.
The
.Ic z
and
.Ic w
commands can also be used to change the window size.
The
.Cm z
may be omitted for compatibility with some versions of
.Xr more 1 .
If the number
.Ar n
is negative, it indicates
.Ar n
lines less than the current screen size.
For example, if the screen is 24 lines,
.Fl z Ns -4
sets the scrolling window to 20 lines.
If the screen is resized to 40 lines,
the scrolling window automatically changes to 36 lines.
.It Fl -follow-name
Normally, if the input file is renamed while an
.Ic F
command is executing,
.Nm
will continue to display the contents of the original file despite
its name change.
If
.Fl -follow-name
is specified, during an
.Ic F
command
.Nm
will periodically attempt to reopen the file by name.
If the reopen succeeds and the file is a different file from the original
(which means that a new file has been created
with the same name as the original (now renamed) file),
.Nm
will display the contents of that new file.
.It Fl -no-keypad
Disables sending the keypad initialization and deinitialization strings
to the terminal.
This is sometimes useful if the keypad strings make the numeric
keypad behave in an undesirable manner.
.It Fl -use-backslash
This option changes the interpretations of options which follow this one.
After the
.Fl -use-backslash
option, any backslash in an option string is
removed and the following character is taken literally.
This allows a dollar sign to be included in option strings.
.It Fl \&" Ar cc | Fl -quotes Ns = Ns Ar cc
Changes the filename quoting character.
This may be necessary if you are trying to name a file
which contains both spaces and quote characters.
If
.Ar cc
is a single character, this changes the quote character to that character.
Filenames containing a space should then be surrounded by that character
rather than by double quotes.
If
.Ar cc
consists of two characters, this changes the open quote to the first character,
and the close quote to the second character.
Filenames containing a space should then be preceded by the open quote
character and followed by the close quote character.
Note that even after the quote characters are changed, this option
remains
.Fl \&"
(a dash followed by a double quote).
.It Fl ~ | -tilde
Normally lines after end of file are displayed as a single tilde (~).
This option causes lines after end of file to be displayed as blank lines.
.It Fl # Ar n | Fl -shift Ns = Ns Ar n
Specifies the default number
.Ar n
of positions to scroll horizontally
in the RIGHTARROW and LEFTARROW commands.
If
.Ar n
is zero, it sets the default number of
positions to one half of the screen width.
Alternately, the number may be specified as a fraction of the width
of the screen, starting with a decimal point: .5 is half of the
screen width, .3 is three tenths of the screen width, and so on.
If the number is specified as a fraction, the actual number of
scroll positions is recalculated if the terminal window is resized,
so that the actual scroll remains at the specified fraction
of the screen width.
.It Fl -
A command line argument of
.Fl -
marks the end of option arguments.
Any arguments following this are interpreted as filenames.
This can be useful when viewing a file whose name begins with a
.Sq -
or
.Sq + .
.It Cm +
If a command line option begins with +,
the remainder of that option is taken to be an initial command to
.Nm .
For example,
.Cm +G
tells
.Nm
to start at the end of the file rather than the beginning,
and
.Cm +/xyz
tells it to start at the first occurrence of
.Dq xyz
in the file.
As a special case,
.Cm + Ns Ar number
acts like
.Cm + Ns Ar number Ns g ;
that is, it starts the display at the specified line number
(however, see the caveat under the
.Ic g
command below).
If the option starts with
.Cm ++ ,
the initial command applies to every file being viewed, not just the first one.
The
.Cm +
command described previously
may also be used to set (or change) an initial command for every file.
.El
.Sh COMMANDS
Commands are based on both traditional
.Xr more 1
and
.Xr vi 1 .
Commands may be preceded by a decimal number,
called
.Ar N
in the descriptions below.
In the following descriptions, ^X means control-X.
ESC stands for the ESCAPE key; for example ESC-v means the
two character sequence "ESCAPE", then "v".
.Bl -tag -width XXXX
.It Ic h | H
Help: display a summary of these commands.
If you forget all the other commands, remember this one.
.It Ic SPACE | ^V | f | ^F
Scroll forward N lines, default one window (see option
.Fl z
above).
If N is more than the screen size, only the final screenful is displayed.
Warning: some systems use ^V as a special literalization character.
.It Ic z
Like SPACE, but if N is specified, it becomes the new window size.
.It Ic ESC-SPACE
Like SPACE, but scrolls a full screenful, even if it reaches
end-of-file in the process.
.It Ic ENTER | RETURN | ^N | e | ^E | j | ^J
Scroll forward N lines, default 1.
The entire N lines are displayed, even if N is more than the screen size.
.It Ic d | ^D
Scroll forward N lines, default one half of the screen size.
If N is specified, it becomes the new default for subsequent d and u commands.
.It Ic b | ^B | ESC-v
Scroll backward N lines, default one window (see option
.Fl z
above).
If N is more than the screen size, only the final screenful is displayed.
.It Ic w
Like ESC-v, but if N is specified, it becomes the new window size.
.It Ic y | ^Y | ^P | k | ^K
Scroll backward N lines, default 1.
The entire N lines are displayed, even if N is more than the screen size.
Warning: some systems use ^Y as a special job control character.
.It Ic u | ^U
Scroll backward N lines, default one half of the screen size.
If N is specified, it becomes the new default for subsequent d and u commands.
.It Ic ESC-) | RIGHTARROW
Scroll horizontally right N characters, default half the screen width
(see the
.Fl #
option).
If a number N is specified, it becomes the default for future
RIGHTARROW and LEFTARROW commands.
While the text is scrolled, it acts as though the
.Fl S
option (chop lines) were in effect.
.It Ic ESC-( | LEFTARROW
Scroll horizontally left N
characters, default half the screen width (see the
.Fl #
option).
If a number N is specified, it becomes the default for future
RIGHTARROW and LEFTARROW commands.
.It Ic r | ^R | ^L
Repaint the screen.
.It Ic R
Repaint the screen, discarding any buffered input.
Useful if the file is changing while it is being viewed.
.It Ic F
Scroll forward, and keep trying to read when the end of file is reached.
Normally this command would be used when already at the end of the file.
It is a way to monitor the tail of a file which is growing
while it is being viewed.
(The behavior is similar to the "tail -f" command.)
.It Ic ESC-F
Like F, but as soon as a line is found which matches
the last search pattern, the terminal bell is rung
and forward scrolling stops.
.It Ic g | < | ESC-<
Go to line N in the file, default 1 (beginning of file).
(Warning: this may be slow if N is large.)
.It Ic G | > | ESC->
Go to line N in the file, default the end of the file.
(Warning: this may be slow if N is large,
or if N is not specified and standard input, rather than a file,
is being read.)
.It Ic p | %
Go to a position N percent into the file.
N should be between 0 and 100, and may contain a decimal point.
.It Ic P
Go to the line containing byte offset N in the file.
.It Ic {
If a left curly bracket appears in the top line displayed
on the screen, the { command will go to the matching right curly bracket.
The matching right curly bracket is positioned on the bottom
line of the screen.
If there is more than one left curly bracket on the top line, a number N
may be used to specify the N-th bracket on the line.
.It Ic }
If a right curly bracket appears in the bottom line displayed on the screen,
the } command will go to the matching left curly bracket.
The matching left curly bracket is positioned on the top
line of the screen.
If there is more than one right curly bracket on the bottom line,
a number N may be used to specify the N-th bracket on the line.
.It Ic \&(
Like {, but applies to parentheses rather than curly brackets.
.It Ic \&)
Like }, but applies to parentheses rather than curly brackets.
.It Ic \&[
Like {, but applies to square brackets rather than curly brackets.
.It Ic \&]
Like }, but applies to square brackets rather than curly brackets.
.It Ic ESC-^F
Followed by two characters, acts like {,
but uses the two characters as open and close brackets, respectively.
For example, "ESC ^F < >" could be used to
go forward to the > which matches the < in the top displayed line.
.It Ic ESC-^B
Followed by two characters, acts like },
but uses the two characters as open and close brackets, respectively.
For example, "ESC ^B < >" could be used to
go backward to the < which matches the > in the bottom displayed line.
.It Ic m
Followed by any lowercase letter, marks the current position with that letter.
.It Ic '
(Single quote.)
Followed by any lowercase letter, returns to the position which
was previously marked with that letter.
Followed by another single quote, returns to the position at
which the last "large" movement command was executed.
Followed by a ^ or $, jumps to the beginning or end of the file respectively.
Marks are preserved when a new file is examined,
so the ' command can be used to switch between input files.
.It Ic ^X^X
Same as single quote.
.It Ic /pattern
Search forward in the file for the N-th line containing the pattern.
N defaults to 1.
The pattern is a regular expression, as recognized by
the regular expression library supplied by your system.
The search starts at the first line displayed
(but see the
.Fl a
and
.Fl j
options, which change this).
.Pp
Certain characters are special if entered at the beginning of the pattern;
they modify the type of search rather than become part of the pattern:
.Bl -tag -width Ds
.It Ic ^N | \&!
Search for lines which do NOT match the pattern.
.It Ic ^E | *
Search multiple files.
That is, if the search reaches the END of the current file
without finding a match,
the search continues in the next file in the command line list.
.It Ic ^F | @
Begin the search at the first line of the FIRST file
in the command line list,
regardless of what is currently displayed on the screen
or the settings of the
.Fl a
or
.Fl j
options.
.It Ic ^K
Highlight any text which matches the pattern on the current screen,
but don't move to the first match (KEEP current position).
.It Ic ^R
Don't interpret regular expression metacharacters;
that is, do a simple textual comparison.
.El
.It Ic ?pattern
Search backward in the file for the N-th line containing the pattern.
The search starts at the line immediately before the top line displayed.
.Pp
Certain characters are special, as in the / command:
.Bl -tag -width Ds
.It Ic ^N | \&!
Search for lines which do NOT match the pattern.
.It Ic ^E | *
Search multiple files.
That is, if the search reaches the beginning of the current file
without finding a match,
the search continues in the previous file in the command line list.
.It Ic ^F | @
Begin the search at the last line of the last file
in the command line list,
regardless of what is currently displayed on the screen
or the settings of the
.Fl a
or
.Fl j
options.
.It Ic ^K
As in forward searches.
.It Ic ^R
As in forward searches.
.El
.It Ic ESC-/pattern
Same as "/*".
.It Ic ESC-?pattern
Same as "?*".
.It Ic n
Repeat previous search, for N-th line containing the last pattern.
If the previous search was modified by ^N, the search is made for the
N-th line NOT containing the pattern.
If the previous search was modified by ^E, the search continues
in the next (or previous) file if not satisfied in the current file.
If the previous search was modified by ^R, the search is done
without using regular expressions.
There is no effect if the previous search was modified by ^F or ^K.
.It Ic N
Repeat previous search, but in the reverse direction.
.It Ic ESC-n
Repeat previous search, but crossing file boundaries.
The effect is as if the previous search were modified by *.
.It Ic ESC-N
Repeat previous search, but in the reverse direction
and crossing file boundaries.
.It Ic ESC-u
Undo search highlighting.
Turn off highlighting of strings matching the current search pattern.
If highlighting is already off because of a previous ESC-u command,
turn highlighting back on.
Any search command will also turn highlighting back on.
(Highlighting can also be disabled by toggling the
.Fl G
option;
in that case search commands do not turn highlighting back on.)
.It Ic &pattern
Display only lines which match the pattern;
lines which do not match the pattern are not displayed.
If pattern is empty (if you type & immediately followed by ENTER),
any filtering is turned off, and all lines are displayed.
While filtering is in effect, an ampersand is displayed at the
beginning of the prompt,
as a reminder that some lines in the file may be hidden.
.Pp
Certain characters are special as in the / command:
.Bl -tag -width Ds
.It Ic ^N | !
Display only lines which do NOT match the pattern.
.It Ic ^R
Don't interpret regular expression metacharacters;
that is, do a simple textual comparison.
.El
.It Ic :e Op Ar filename
Examine a new file.
If the filename is missing, the "current" file (see the :n and :p commands
below) from the list of files in the command line is re-examined.
A percent sign (%) in the filename is replaced by the name of the
current file.
A pound sign (#) is replaced by the name of the previously examined file.
However, two consecutive percent signs are simply
replaced with a single percent sign.
This allows you to enter a filename that contains a percent sign
in the name.
Similarly, two consecutive pound signs are replaced with a single pound sign.
The filename is inserted into the command line list of files
so that it can be seen by subsequent :n and :p commands.
If the filename consists of several files, they are all inserted into
the list of files and the first one is examined.
If the filename contains one or more spaces,
the entire filename should be enclosed in double quotes
(also see the
.Fl \&"
option).
.It Ic ^X^V | E
Same as :e.
Warning: some systems use ^V as a special literalization character.
On such systems, you may not be able to use ^V.
.It Ic :n
Examine the next file (from the list of files given in the command line).
If a number N is specified, the N-th next file is examined.
.It Ic :p
Examine the previous file in the command line list.
If a number N is specified, the N-th previous file is examined.
.It Ic :t
Go to the specified tag.
.It Ic :x
Examine the first file in the command line list.
If a number N is specified, the N-th file in the list is examined.
.It Ic :d
Remove the current file from the list of files.
.It Ic t
Go to the next tag, if there were more than one matches for the current tag.
See the
.Fl t
option for more details about tags.
.It Ic T
Go to the previous tag, if there were more than one matches for the current tag.
.It Ic = | ^G | :f
Prints some information about the file being viewed, including its name
and the line number and byte offset of the bottom line being displayed.
If possible, it also prints the length of the file,
the number of lines in the file
and the percent of the file above the last displayed line.
.It Ic \-
Followed by one of the command line option letters (see
.Sx DESCRIPTION
above),
this will change the setting of that option
and print a message describing the new setting.
If a ^P (CONTROL-P) is entered immediately after the dash,
the setting of the option is changed but no message is printed.
If the option letter has a numeric value (such as
.Fl b
or
.Fl h ) ,
or a string value (such as
.Fl P
or
.Fl t ) ,
a new value may be entered after the option letter.
If no new value is entered, a message describing
the current setting is printed and nothing is changed.
.It Ic \-\-
Like the \- command, but takes a long option name (see
.Sx DESCRIPTION
above)
rather than a single option letter.
You must press ENTER or RETURN after typing the option name.
A ^P immediately after the second dash suppresses printing of a
message describing the new setting, as in the \- command.
.It Ic \-+
Followed by one of the command line option letters this will reset the
option to its default setting and print a message describing the new setting.
(The "\-+X" command does the same thing as
.Sq Fl + Ns X
on the command line.)
This does not work for string-valued options.
.It Ic \-\-+
Like the \-+ command, but takes a long option name
rather than a single option letter.
.It Ic \-!
Followed by one of the command line option letters, this will reset the
option to the "opposite" of its default setting and print a message
describing the new setting.
This does not work for numeric or string-valued options.
.It Ic \-\-!
Like the \-! command, but takes a long option name
rather than a single option letter.
.It Ic _
(Underscore.)
Followed by one of the command line option letters,
this will print a message describing the current setting of that option.
The setting of the option is not changed.
.It Ic __
(Double underscore.)
Like the _ (underscore) command, but takes a long option name
rather than a single option letter.
You must press ENTER or RETURN after typing the option name.
.It Ic +cmd
Causes the specified cmd to be executed each time a new file is examined.
For example, +G causes
.Nm
to initially display each file starting at the end rather than the beginning.
.It Ic V
Prints the version number of
.Nm
being run.
.It Ic q | Q | :q | :Q | ZZ
Exits
.Nm less .
.El
.Pp
The following
four
commands may or may not be valid, depending on your particular installation.
.Bl -tag -width XXXX
.It Ic v
Invokes an editor to edit the current file being viewed.
The editor is taken from the environment variable
.Ev VISUAL ,
if defined,
or
.Ev EDITOR
if
.Ev VISUAL
is not defined,
or defaults to "vi" if neither
.Ev VISUAL
nor
.Ev EDITOR
is defined.
See also the discussion of LESSEDIT under the section on
.Sx PROMPTS
below.
.It Ic | <m> Ar shell-command
<m> represents any mark letter.
Pipes a section of the input file to the given shell command.
The section of the file to be piped is between the first line on
the current screen and the position marked by the letter.
<m> may also be ^ or $ to indicate beginning or end of file respectively.
If <m> is . or newline, the current screen is piped.
.It Ic s Ar filename
Save the input to a file.
This only works if the input is a pipe, not an ordinary file.
.El
.Sh LINE EDITING
When entering command line at the bottom of the screen
(for example, a filename for the :e command,
or the pattern for a search command),
certain keys can be used to manipulate the command line.
Most commands have an alternate form in [ brackets ] which can be used if
a key does not exist on a particular keyboard.
Any of these special keys may be entered literally by preceding
it with the "literal" character, either ^V or ^A.
A backslash itself may also be entered literally by entering two backslashes.
.Bl -tag -width Ds
.It LEFTARROW [ ESC-h ]
Move the cursor one space to the left.
.It RIGHTARROW [ ESC-l ]
Move the cursor one space to the right.
.It ^LEFTARROW [ ESC-b or ESC-LEFTARROW ]
(That is, CONTROL and LEFTARROW simultaneously.)
Move the cursor one word to the left.
.It ^RIGHTARROW [ ESC-w or ESC-RIGHTARROW ]
(That is, CONTROL and RIGHTARROW simultaneously.)
Move the cursor one word to the right.
.It HOME [ ESC-0 ]
Move the cursor to the beginning of the line.
.It END [ ESC-$ ]
Move the cursor to the end of the line.
.It BACKSPACE
Delete the character to the left of the cursor,
or cancel the command if the command line is empty.
.It DELETE or [ ESC-x ]
Delete the character under the cursor.
.It ^BACKSPACE [ ESC-BACKSPACE ]
(That is, CONTROL and BACKSPACE simultaneously.)
Delete the word to the left of the cursor.
.It ^DELETE [ ESC-X or ESC-DELETE ]
(That is, CONTROL and DELETE simultaneously.)
Delete the word under the cursor.
.It UPARROW [ ESC-k ]
Retrieve the previous command line.
If you first enter some text and then press UPARROW,
it will retrieve the previous command which begins with that text.
.It DOWNARROW [ ESC-j ]
Retrieve the next command line.
If you first enter some text and then press DOWNARROW,
it will retrieve the next command which begins with that text.
.It TAB
Complete the partial filename to the left of the cursor.
If it matches more than one filename, the first match
is entered into the command line.
Repeated TABs will cycle through the other matching filenames.
If the completed filename is a directory, a "/" is appended to the filename.
The environment variable
.Ev LESSSEPARATOR
can be used to specify a different character to append to a directory name.
.It BACKTAB [ ESC-TAB ]
Like TAB, but cycles in the reverse direction through the matching filenames.
.It ^L
Complete the partial filename to the left of the cursor.
If it matches more than one filename, all matches are entered into
the command line (if they fit).
.It ^U
Delete the entire command line,
or cancel the command if the command line is empty.
If you have changed your line-kill character to something
other than ^U, that character is used instead of ^U.
.It "^G"
Delete the entire command line and return to the main prompt.
.El
.Sh KEY BINDINGS
You may define your own
.Nm
commands by using the program
.Xr lesskey 1
to create a lesskey file.
This file specifies a set of command keys and an action
associated with each key.
You may also use lesskey
to change the line-editing keys (see
.Sx LINE EDITING ) ,
and to set environment variables.
If the environment variable
.Ev LESSKEY
is set,
.Nm
uses that as the name of the lesskey file.
Otherwise,
.Nm
looks for a lesskey file called "$HOME/.less".
See the
.Xr lesskey 1
manual page for more details.
.Pp
A system-wide lesskey file may also be set up to provide key bindings.
If a key is defined in both a local lesskey file and in the
system-wide file, key bindings in the local file take precedence over
those in the system-wide file.
If the environment variable
.Ev LESSKEY_SYSTEM
is set,
.Nm
uses that as the name of the system-wide lesskey file.
Otherwise,
.Nm
looks in a standard place for the system-wide lesskey file:
On
.Ox ,
the system-wide lesskey file is
.Pa /etc/sysless .
.Sh NATIONAL CHARACTER SETS
There are three types of characters in the input file:
.Bl -tag -width "control characters"
.It normal characters
Can be displayed directly to the screen.
.It control characters
Should not be displayed directly, but are expected to be found
in ordinary text files (such as backspace and tab).
.It binary characters
Should not be displayed directly and are not expected to be found
in text files.
.El
.Pp
A "character set" is simply a description of which characters are to
be considered normal, control, and binary.
.Nm
will determine the character set to use from the environment (see
.Xr locale 1 ) .
.Pp
Control and binary characters are displayed in standout (reverse video).
Each such character is displayed in caret notation if possible
(e.g. ^A for control-A).
Caret notation is used only if inverting the 0100 bit results in a
normal printable character.
Otherwise, the character is displayed as a hex number in angle brackets.
This format can be changed by setting the
.Ev LESSBINFMT
environment variable.
LESSBINFMT may begin with a "*" and one character to select
the display attribute:
"*k" is blinking, "*d" is bold, "*u" is underlined, "*s" is standout,
and "*n" is normal.
If LESSBINFMT does not begin with a "*", normal attribute is assumed.
The remainder of LESSBINFMT is a string which may include one
printf-style escape sequence (a % followed by x, X, o, d, etc.).
For example, if LESSBINFMT is "*u[%x]", binary characters
are displayed in underlined hexadecimal surrounded by brackets.
The default if no LESSBINFMT is specified is "*s<%02X>".
Warning: the result of expanding the character via LESSBINFMT must
be less than 31 characters.
.Pp
When the character set is utf-8, the
.Ev LESSUTFBINFMT
environment variable
acts similarly to LESSBINFMT but it applies to Unicode code points
that were successfully decoded but are unsuitable for display (e.g.,
unassigned code points).
Its default value is "<U+%04lX>".
Note that LESSUTFBINFMT and LESSBINFMT share their display attribute
setting ("*x") so specifying one will affect both;
LESSUTFBINFMT is read after LESSBINFMT so its setting, if any,
will have priority.
Problematic octets in a UTF-8 file (octets of a truncated sequence,
octets of a complete but non-shortest form sequence, illegal octets,
and stray trailing octets)
are displayed individually using LESSBINFMT so as to facilitate diagnostic
of how the UTF-8 file is ill-formed.
.Sh PROMPTS
The
.Fl P
option allows you to tailor the prompt to your preference.
The string given to the
.Fl P
option replaces the specified prompt string.
Certain characters in the string are interpreted specially.
The prompt mechanism is rather complicated to provide flexibility,
but the ordinary user need not understand the details of constructing
personalized prompt strings.
.Pp
A percent sign followed by a single character is expanded
according to what the following character is:
.Bl -tag -width Ds
.It %b Ns Ar X
Replaced by the byte offset into the current input file.
The b is followed by a single character (shown as
.Ar X
above) which specifies the line whose byte offset is to be used.
If the character is a "t", the byte offset of the top line in the
display is used,
an "m" means use the middle line,
a "b" means use the bottom line,
a "B" means use the line just after the bottom line,
and a "j" means use the "target" line, as specified by the
.Fl j
option.
.It \&%B
Replaced by the size of the current input file.
.It %c
Replaced by the column number of the text appearing in the first
column of the screen.
.It %d Ns Ar X
Replaced by the page number of a line in the input file.
The line to be used is determined by the
.Ar X ,
as with the %b option.
.It \&%D
Replaced by the number of pages in the input file,
or equivalently, the page number of the last line in the input file.
.It %E
Replaced by the name of the editor (from the
.Ev VISUAL
environment variable, or the
.Ev EDITOR
environment variable if
.Ev VISUAL
is not defined).
See the discussion of the LESSEDIT feature below.
.It %f
Replaced by the name of the current input file.
.It %F
Replaced by the last component of the name of the current input file.
.It %i
Replaced by the index of the current file in the list of
input files.
.It %l Ns Ar X
Replaced by the line number of a line in the input file.
The line to be used is determined by the
.Ar X ,
as with the %b option.
.It %L
Replaced by the line number of the last line in the input file.
.It %m
Replaced by the total number of input files.
.It %p Ns Ar X
Replaced by the percent into the current input file, based on byte offsets.
The line used is determined by the
.Ar X ,
as with the %b option.
.It \&%P Ns Ar X
Replaced by the percent into the current input file, based on line numbers.
The line used is determined by the
.Ar X ,
as with the %b option.
.It %s
Same as %B.
.It %t
Causes any trailing spaces to be removed.
Usually used at the end of the string, but may appear anywhere.
.It %x
Replaced by the name of the next input file in the list.
.El
.Pp
If any item is unknown (for example, the file size if input is a pipe),
a question mark is printed instead.
.Pp
The format of the prompt string can be changed depending on certain conditions.
A question mark followed by a single character acts like an "IF":
depending on the following character, a condition is evaluated.
If the condition is true, any characters following the question mark
and condition character, up to a period, are included in the prompt.
If the condition is false, such characters are not included.
A colon appearing between the question mark and the
period can be used to establish an "ELSE": any characters between
the colon and the period are included in the string, if and only if
the IF condition is false.
Condition characters (which follow a question mark) may be:
.Bl -tag -width Ds
.It ?a
True if any characters have been included in the prompt so far.
.It ?b Ns Ar X
True if the byte offset of the specified line is known.
.It ?B
True if the size of the current input file is known.
.It ?c
True if the text is horizontally shifted (%c is not zero).
.It ?d Ns Ar X
True if the page number of the specified line is known.
.It ?e
True if at end-of-file.
.It ?f
True if there is an input filename
(that is, if input is not a pipe).
.It ?l Ns Ar X
True if the line number of the specified line is known.
.It ?L
True if the line number of the last line in the file is known.
.It ?m
True if there is more than one input file.
.It ?n
True if this is the first prompt in a new input file.
.It ?p Ns Ar X
True if the percent into the current input file, based on byte offsets,
of the specified line is known.
.It ?P Ns Ar X
True if the percent into the current input file, based on line numbers,
of the specified line is known.
.It ?s
Same as "?B".
.It ?x
True if there is a next input file
(that is, if the current input file is not the last one).
.El
.Pp
Any characters other than the special ones
(question mark, colon, period, percent, and backslash)
become literally part of the prompt.
Any of the special characters may be included in the prompt literally
by preceding it with a backslash.
.Pp
Some examples:
.Pp
.Dl ?f%f:Standard input.
.Pp
This prompt prints the filename, if known;
otherwise the string "Standard input".
.Pp
.Dl ?f%f .?ltLine %lt:?pt%pt\e%:?btByte %bt:-...
.Pp
This prompt would print the filename, if known.
The filename is followed by the line number, if known,
otherwise the percent if known, otherwise the byte offset if known.
Otherwise, a dash is printed.
Notice how each question mark has a matching period,
and how the % after the %pt
is included literally by escaping it with a backslash.
.Pp
.Dl ?n?f%f\ .?m(file\ %i\ of\ %m)\ ..?e(END)\ ?x-\ Next\e:\ %x..%t
.Pp
This prints the filename if this is the first prompt in a file,
followed by the "file N of N" message if there is more
than one input file.
Then, if we are at end-of-file, the string "(END)" is printed
followed by the name of the next file, if there is one.
Finally, any trailing spaces are truncated.
This is the default prompt.
For reference, here are the defaults for
the other two prompts
.Po
.Fl m
and
.Fl M
respectively
.Pc .
Each is broken into two lines here for readability only.
.Bd -literal -offset indent
?f%f\ .?m(file\ %i\ of\ %m)\ .?e(END)\ ?x-\ Next\e:\ %x.:
	?pB%pB\e%:byte\ %bB?s/%s...%t

?f%f\ .?n?m(file\ %i\ of\ %m)\ ..?ltlines\ %lt-%lb?L/%L.\ :
	byte\ %bB?s/%s.\ .?e(END)\ ?x-\ Next\e:\ %x.:?pB%pB\e%..%t
.Ed
.Pp
And here is the default message produced by the = command:
.Bd -literal -offset indent
?f%f\ .?m(file\ %i\ of\ %m)\ .?ltlines\ %lt-%lb?L/%L.\ .
	byte\ %bB?s/%s.\ ?e(END)\ :?pB%pB\e%..%t
.Ed
.Pp
The prompt expansion features are also used for another purpose:
if an environment variable
.Ev LESSEDIT
is defined, it is used as the command to be executed when the v command
is invoked.
The LESSEDIT string is expanded in the same way as the prompt strings.
The default value for LESSEDIT is:
.Pp
.Dl %E\ ?lm+%lm.\ %f
.Pp
Note that this expands to the editor name, followed by a + and the
line number, followed by the file name.
If your editor does not accept the "+linenumber" syntax, or has other
differences in invocation syntax, the
.Ev LESSEDIT
variable can be changed to modify this default.
.Sh SECURITY
When the environment variable
.Ev LESSSECURE
is set to 1,
.Nm
runs in a "secure" mode.
This means these features are disabled:
.Bl -tag -width Ds
.It |
The pipe command.
.It :e
The examine command.
.It v
The editing command.
.It s -o
Log files.
.It Fl k
Use of lesskey files.
.It Fl t
Use of tags files.
.It " "
Use of history file.
.It " "
Metacharacters in filenames, such as "*".
.It " "
Filename completion (TAB, ^L).
.El
.Sh COMPATIBILITY WITH MORE
If the environment variable
.Ev LESS_IS_MORE
is set to 1,
or if the program is invoked via a file link named "more",
.Nm
behaves (mostly) in conformance with the POSIX "more" command specification.
In this mode, less behaves differently in these ways:
.Pp
The sense of the
.Fl c
option is inverted:
when
.Xr more 1
changes the display,
the default is to scroll from the bottom of the screen,
and the
.Fl c
option causes it to paint from the top line down.
.Pp
The
.Fl e
option works differently:
it causes
.Xr more 1
to exit the first time it reaches EOF,
not the second.
.Pp
The
.Fl i
option acts like the
.Fl I
option.
The normal behavior of the
.Fl i
option is unavailable in this mode.
.Pp
The
.Fl m
option works differently:
if it is not specified, the medium prompt is used;
if it is specified, the short prompt is used.
.Pp
The
.Fl n
option acts like the
.Fl z
option.
The normal behavior of the
.Fl n
option is unavailable in this mode.
.Pp
The parameter to the
.Fl p
option is taken to be a
command rather than a search pattern.
.Pp
Options to suppress error messages when the terminal is dumb
.Pq Fl d ,
suppress highlighting of strings in search results
.Pq Fl G ,
and disable termcap initialization
.Pq Fl X
are on by default.
.Pp
The
.Ev LESS
environment variables are ignored, and the
.Ev MORE
environment variable is used in its place.
.Sh ENVIRONMENT
Environment variables may be specified either in the system environment
as usual, or in a
.Xr lesskey 1
file.
If environment variables are defined in more than one place,
variables defined in a local lesskey file take precedence over
variables defined in the system environment, which take precedence
over variables defined in the system-wide lesskey file.
.Bl -tag -width LESSANSIENDCHARS
.It Ev COLUMNS
Sets the number of columns on the screen.
Takes precedence over the number of columns specified by the
.Ev TERM
variable,
but may be overridden by window systems which support
.Dv TIOCGWINSZ .
.It Ev EDITOR
Specifies the default editor if
.Ev VISUAL
is not set.
If neither are set,
.Xr vi 1
is used.
.It Ev HOME
Name of the user's home directory
(used to find a lesskey file).
.It Ev LANG
Language for determining the character set.
.It Ev LC_CTYPE
The character encoding
.Xr locale 1 .
It decides which byte sequences form characters, what their display
width is, and which characters are composing characters.
.It Ev LESS
Options which are passed to
.Nm
automatically.
Command line options override the
.Ev LESS
environment variable.
.Pp
Some options like
.Fl k
require a string to follow the option letter.
The string for that option is considered to end when a dollar sign ($) is found.
For example, to separate a prompt value from any other options
with dollar sign between them:
.Pp
.Dl LESS="-Ps--More--$-C -e"
.Pp
If the
.Fl -use-backslash
option appears earlier in the options, then
a dollar sign or backslash may be included literally in an option string
by preceding it with a backslash.
If the
.Fl -use-backslash
option is not in effect, then backslashes are
not treated specially, and there is no way to include a dollar sign
in the option string.
.It Ev LESSANSIENDCHARS
Characters which may end an ANSI color escape sequence
(default "m").
.It Ev LESSANSIMIDCHARS
Characters which may appear between the ESC character and the
end character in an ANSI color escape sequence
(default "0123456789;[?!"'#%()*+\ ").
.It Ev LESSBINFMT
Format for displaying non-printable, non-control characters.
.It Ev LESSEDIT
Editor prototype string (used for the v command).
See discussion under
.Sx PROMPTS .
.It Ev LESSHISTFILE
Name of the history file used to remember search commands and
shell commands between invocations of
.Nm less .
If set to "-" or "/dev/null", a history file is not used.
The default is "-".
.It Ev LESSHISTSIZE
The maximum number of commands to save in the history file.
The default is 100.
.It Ev LESSKEY
Name of the default
.Xr lesskey 1
file.
.It Ev LESSKEY_SYSTEM
Name of the default system-wide
.Xr lesskey 1
file.
.It Ev LESSMETACHARS
List of characters which are considered "metacharacters" by the shell.
.It Ev LESSMETAESCAPE
Prefix which
.Nm
will add before each metacharacter in a command sent to the shell.
If LESSMETAESCAPE is an empty string, commands containing
metacharacters will not be passed to the shell.
.It Ev LESSSECURE
Runs less in "secure" mode.
See discussion under
.Sx SECURITY .
.It Ev LESSSEPARATOR
String to be appended to a directory name in filename completion.
.It Ev LESSUTFBINFMT
Format for displaying non-printable Unicode code points.
.It Ev LESS_IS_MORE
Emulate the
.Xr more 1
command.
.It Ev LINES
Sets the number of lines on the screen.
Takes precedence over the number of lines specified by the TERM variable,
but may be overridden by window systems which support
.Dv TIOCGWINSZ .
.It Ev MORE
Options which are passed to
.Nm
automatically when running in
.Xr more 1
compatible mode.
.It Ev SHELL
The shell used to expand filenames.
.It Ev TERM
Specifies the terminal type.
Used by
.Nm
to get the terminal characteristics necessary to manipulate the screen.
.It Ev VISUAL
Specifies the default editor.
If not set,
.Ev EDITOR
is used;
if that is not set,
.Xr vi 1
is used.
.El
.Sh SEE ALSO
.Xr lesskey 1 ,
.Xr more 1
.Sh HISTORY
.Nm
was first published in 1985 and has been available since
.Ox 2.0 .
.Sh AUTHORS
.An Mark Nudelman
