openbsd/src/sbin/atactl/atactl.8
.\"	$OpenBSD: atactl.8,v 1.2 2000/02/02 02:52:05 deraadt Exp $
.\"	$NetBSD: atactl.8,v 1.5 1999/02/24 18:49:14 jwise Exp $
.\"
.\" Copyright (c) 1998 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Ken Hornstein.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 18, 1998
.Dt ATACTL 8
.Os NetBSD
.Sh NAME
.Nm atactl
.Nd a program to manipulate ATA (IDE) devices
.Sh SYNOPSIS
.Nm
.Ar device
.Ar command
.Oo
.Ar arg Oo ...
.Oc
.Oc
.Sh DESCRIPTION
.Nm
allows a user or system administrator to issue commands to and otherwise
control devices which reside on standard IDE and ATA controllers.  It is
used by specifying
a device to manipulate, the command to perform, and any arguments
the command may require.
.Sh DEVICE COMMANDS
The following commands may be used on IDE and ATA devices.  Note
that not all devices support all commands.
.Pp
If the
.Ar device
is specified without a
.Ar command ,
the
.Cm identify
command is implied. 
.Pp
.Cm identify
.Pp
Identify the specified device, displaying the device's vendor, product,
revision strings, and the device's capabilities.
.Pp
.Cm idle
.Pp
Place the specified device into Idle mode.  This mode may consume less
power than Active mode.
.Pp
.Cm standby
.Pp
Place the specified device into Standby mode.  This mode will consume
less power than Idle mode.
.Pp
.Cm sleep
.Pp
Place he specified device into Sleep mode.  This mode will consume
less power than Standby mode, but requires a device reset to resume
operation.  Typically the
.Xr wd 4
driver performs this reset automatically, but this should still be
used with caution.
.Pp
.Cm setidle
.Ar standby-timer
.Pp
Places the specified device into Idle mode, and sets the Standby timer
to
.Ar standby-timer
seconds.  A value of 0 will disable the Standby timer.
.Pp
.Cm setstandby
.Ar standby-timer
.Pp
Places the specified device into Standby mode, and sets the Standby timer
to
.Ar standby-timer
seconds.  A value of 0 will disable the Standby timer.
.Pp
.Cm checkpower
.Pp
Will print out if the device is in Active, Idle, or Standby power
management mode.
.Sh BUGS
The output from the
.Cm identify
command is rather ugly.
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr wd 4
.Sh AUTHOR
The
.Nm
command was written by Ken Hornstein.  It was based heavily on the
.Xr scsictl 8
command written by Jason R. Thorpe.
.Sh HISTORY
The
.Nm
command first appeared in
.Ox 2.6 .
