openbsd/src/usr.sbin/rdconfig/rdconfig.8
.\"	$OpenBSD: rdconfig.8,v 1.9 2007/05/31 19:20:28 jmc Exp $
.\"	$NetBSD: rdconfig.8,v 1.1.1.1 1995/10/08 22:40:41 gwr Exp $
.\"
.\" Copyright (c) 1995 Gordon W. Ross
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt RDCONFIG 8
.Os
.Sh NAME
.Nm rdconfig
.Nd configure RAM disks
.Sh SYNOPSIS
.Nm rdconfig
.Ar special_file
.Ar 512-byte-blocks
.Sh DESCRIPTION
The
.Nm rdconfig
command configures RAM disk devices.
It will associate the special file
.Ar special_file
with a range of user-virtual memory allocated by the
.Nm rdconfig
process itself.
The
.Nm rdconfig
command should be run in the background.
If successful, the command will not return.
Otherwise, an error message will be printed.
.Pp
To "unconfigure" the ramdisk, just kill the background
.Nm rdconfig
process started earlier.
.Sh FILES
.Bl -tag -width /etc/rrd?? -compact
.It Pa /dev/rrd??
.It Pa /dev/rd??
.El
.Sh EXAMPLES
.Dl # rdconfig /dev/rd0a 2048 &
.Pp
Configures the RAM disk
.Pa rd0a
with one megabyte of user-space memory.
.Sh SEE ALSO
.Xr mount 8 ,
.Xr swapon 8 ,
.Xr umount 8
.Sh BUGS
The special device will become inoperative if the
.Nm rdconfig
process is killed while the special device is open.
