openbsd/src/usr.sbin/bootpd/bootpef.8
.\" bootpef.8
.\" 
.\"           Copyright 1988, 1991 by Carnegie Mellon University
.\" 
.\"                           All Rights Reserved
.\" 
.\" Permission to use, copy, modify, and distribute this software and its
.\" documentation for any purpose and without fee is hereby granted, provided
.\" that the above copyright notice appear in all copies and that both that
.\" copyright notice and this permission notice appear in supporting
.\" documentation, and that the name of Carnegie Mellon University not be used
.\" in advertising or publicity pertaining to distribution of the software
.\" without specific, written prior permission.
.\" 
.\" CARNEGIE MELLON UNIVERSITY DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS
.\" SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS.
.\" IN NO EVENT SHALL CMU BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL
.\" DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
.\" PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS
.\" ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS
.\" SOFTWARE.
.Dd June 12, 1999
.Dt BOOTPEF 8
.Os
.Sh NAME
.Nm bootpef
.Nd BOOTP Extension File compiler
.Sh SYNOPSIS
.Nm bootpef
.Op Fl c Ar chdir
.Op Fl d Ar debug-level
.Op Fl f Ar config-file
.Op Ar client-name Op Ar ...
.Sh DESCRIPTION
.Nm
builds the
.Sy Extension Path
files described by
.Tn RFC 2132
(tag 18).
If any
.Ar client-name
arguments are specified, then
.Nm
compiles the extension files for only those clients.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl c Ar chdir-path
Sets the current directory used by
.Nm
while creating extension files.
This is useful when the
extension file names are specified as relative pathnames, and
.Nm
needs to use the same current directory as the TFTP server
(typically
.Pa /tftpboot ) .
.It Fl d Ar debug-level
Sets the
.Ar debug-level
variable that controls the amount of debugging messages generated.
For example,
.Fl d Ns 4
or
.Fl d No 4
will set the debugging level to 4.
.It Fl f Ar config-file
Sets the name of the config file that specifies the option
data to be sent to each client.
.El
.Sh SEE ALSO
.Xr bootpd 8 ,
.Xr tftpd 8
.Pp
.Bl -tag -width "RFC 2132" -compact
.It Tn RFC 951
Bootstrap Protocol (BOOTP),
.It RFC 2132
DHCP Options and BOOTP Vendor Extensions
.El
