openbsd/src/usr.sbin/bootpd/bootptest.8
.\" bootptest.8
.Dd June 12, 1999
.Dt BOOTPTEST 8
.Os
.Sh NAME
.Nm bootptest
.Nd send BOOTP queries and print responses
.Sh SYNOPSIS
.Nm bootptest
.Op Fl f Ar bootfile
.Op Fl h
.Op Fl m Ar magic_number
.Ar server-name
.Op Ar template-file
.Sh DESCRIPTION
.Nm
sends BOOTP requests to the host specified as
.Ar server-name
at one-second intervals until either a response is received,
or until ten requests have gone unanswered.
After a response is received,
.Nm
will wait one more second listening for additional responses.
.Sh OPTIONS
.Bl -tag -width "-m magic_number"
.It Fl f Ar bootfile
Fill in the boot file field of the request with
.Ar bootfile .
.It Fl h
Use the hardware (Ethernet) address to identify the client.
By default, the IP address is copied into the request
indicating that this client already knows its IP address.
.It Fl m Ar magic_number
Initialize the first word of the vendor options field with
.Ar magic_number .
.El
.Pp
A
.Ar template-file
may be specified, in which case
.Nm
uses the (binary) contents of this file to initialize the
.Fa options
area of the request packet.
.Sh CREDITS
The bootptest program is a combination of original and derived works.
The main program module (bootptest.c) is original work by
Gordon W. Ross <gwr@mc.com>.
The packet printing module (print-bootp.c) is a slightly modified
version of a file from the BSD tcpdump program.
.Pp
This program includes software developed by the University of
California, Lawrence Berkeley Laboratory and its contributors.
(See the copyright notice in print-bootp.c)
.Sh SEE ALSO
.Xr bootpd 8
.Pp
.Bl -tag -width "RFC 2132" -compact
.It Tn RFC 951
Bootstrap Protocol (BOOTP)
.It RFC 2132
DHCP Options and BOOTP Vendor Extensions
.El
