openbsd/src/usr.sbin/bootpd/bootpef.8
.\" bootpef.8
.Dd June 12, 1999
.Dt BOOTPEF 8
.Os
.Sh NAME
.Nm bootpef
.Nd BOOTP Extension File compiler
.Sh SYNOPSIS
.Nm bootpef
.Op Fl c Ar chdir
.Op Fl d Ar debug-level
.Op Fl f Ar config-file
.Op Ar client-name Op Ar ...
.Sh DESCRIPTION
.Nm
builds the
.Sy Extension Path
files described by
.Tn RFC 2132
(tag 18).
If any
.Ar client-name
arguments are specified, then
.Nm
compiles the extension files for only those clients.
.Sh OPTIONS
.Bl -tag -width "-d debug-level"
.It Fl c Ar chdir-path
Sets the current directory used by
.Nm
while creating extension files.
This is useful when the
extension file names are specified as relative pathnames, and
.Nm
needs to use the same current directory as the TFTP server
(typically
.Pa /tftpboot ) .
.It Fl d Ar debug-level
Sets the
.Ar debug-level
variable that controls the amount of debugging messages generated.
For example,
.Fl d Ns 4
or
.Fl d No 4
will set the debugging level to 4.
.It Fl f Ar config-file
Sets the name of the config file that specifies the option
data to be sent to each client.
.Sh SEE ALSO
.Xr bootpd 8 ,
.Xr tftpd 8
.Pp
.Bl -tag -width "RFC 2132" -compact
.It Tn RFC 951
Bootstrap Protocol (BOOTP),
.It RFC 2132
DHCP Options and BOOTP Vendor Extensions
.El
