openbsd/src/sbin/fdisk/fdisk.8
.\"	$OpenBSD: fdisk.8,v 1.46 2005/04/30 07:05:31 deraadt Exp $
.\"
.\" Copyright (c) 1997 Tobias Weingartner
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 3, 2002
.Dt FDISK 8
.Os
.Sh NAME
.Nm fdisk
.Nd MBR partition maintenance program
.Sh SYNOPSIS
.Nm fdisk
.Op Fl ieu
.Op Fl f Ar mbrname
.Op Fl c Ar cylinders
.Op Fl h Ar heads
.Op Fl s Ar sectors
.Ar device
.Sh DESCRIPTION
On the i386 and other architectures, sector 0 of a bootable hard disk
must contain MBR bootcode, the MBR partition table containing 4 slots,
and a specific magic number (0xAA55).
The 4 slots in the MBR partition table allow a disk drive to be
sub-divided up into chunks known as MBR partitions.
.Pp
On the i386, the BIOS loads sector 0 of the boot disk into memory,
verifies the magic number, and begins executing the MBR bootcode
at the first byte.
The MBR bootcode then searches the MBR partition table for an
.Dq active
MBR partition (indicated by a
.Ql \&*
in the first column), and if one
is found, the boot block from that MBR partition is loaded and executed in
place of the original (MBR) boot block.
.Pp
Some other architectures (like the zaurus), consider sector 0 of the disk
to contain the MBR partition table, but do not use the MBR bootcode at all.
.Pp
.Sh TYPICAL LAYOUT
When called with no special flags,
.Nm
prints the MBR partition table of the specified device, i.e.,
.Bd -literal
  # fdisk wd0
  Disk: wd0       geometry: 5168/240/63 [78140160 Sectors]
  Offset: 0       Signature: 0xAA55
           Starting       Ending       LBA Info:
   #: id    C   H  S -    C   H  S [       start:      size   ]
  ------------------------------------------------------------------------
   0: 04    0   1  1 -  169 239 63 [          63:     2570337 ] DOS FAT-16  
   1: 00    0   0  0 -    0   0  0 [           0:           0 ] unused      
   2: 00    0   0  0 -    0   0  0 [           0:           0 ] unused      
  *3: A6  170   1  1 - 5167 239 63 [     2570463:    75569697 ] OpenBSD     
.Ed
.Pp
This 78140160 sector (38154MB) disk drive is divided into two MBR
partitions that span the whole disk.
The first MBR partition is a 1225MB FAT-16 DOS partition
(in this case containing a Phoenix BIOS Laptop Suspend-to-Disk file),
the second is a 36GB OpenBSD MBR partition using the remainder of the disk.
The fields of the output are thus:
.Pp
.Bl -tag -width "start/size"
.It Em "#"
Number identifying each MBR partition table entry.
There are a total of four slots.
.Dq \&*
denotes the MBR partition which is declared bootable.
.It Em "id"
MBR partition type identifier.
.Ox
reserves the
magic number hexadecimal A6 (166 decimal).
If no A6 MBR partition is found,
.Ox
can use an older
.Fx
MBR partition (with a magic number of hexadecimal A5).
.It Em "cyl/hd/sec"
These fields provide the starting and ending address of the MBR partition
in BIOS geometry.
.It Em "start/size"
These fields provide the starting sector and size in sectors of the
MBR partition in linear block addresses.
.El
.Pp
.Em NOTE :
The BIOS geometry sectors field is
.Dq 1 based ,
but the start field is
.Dq 0 based .
The CHS values will need to be in the BIOS's geometry
for the system to be able to boot and use the drive correctly.
These values must be kept correctly syncronized or a variety of
problems develop which are very difficult to diagnose.
.Pp
The OpenBSD MBR partition shown above is subdivided further using the
functionality provided by
.Xr disklabel 8 Ns ,
which provides
.Ox
partitions.
.Bd -literal
  # using MBR partition 3: type A6 off 2570463 size 75569697 
  # /dev/rwd0c:
  type: ESDI
  disk: ESDI/IDE disk
  label: HITACHI_DK13FA-4
  flags:
  bytes/sector: 512
  sectors/track: 63
  tracks/cylinder: 16
  sectors/cylinder: 1008
  cylinders: 16383
  total sectors: 78140160
  rpm: 3600
  interleave: 1
  trackskew: 0
  cylinderskew: 0
  headswitch: 0           # microseconds
  track-to-track seek: 0  # microseconds
  drivedata: 0 
  
  16 partitions:
  #             size        offset  fstype [fsize bsize  cpg]
    a:       1740753       2570463  4.2BSD   2048 16384  328 # Cyl  2550*-  4276 
    b:        819504       4311216    swap                   # Cyl  4277 -  5089 
    c:      78140160             0  unused      0     0      # Cyl     0 - 77519 
    d:       2097648       5130720  4.2BSD   2048 16384  328 # Cyl  5090 -  7170 
    e:        614880       7228368  4.2BSD   2048 16384  328 # Cyl  7171 -  7780 
    g:       2097648       7843248  4.2BSD   2048 16384  328 # Cyl  7781 -  9861 
    h:        921312       9940896  4.2BSD   2048 16384  328 # Cyl  9862 - 10775 
    i:       2570337            63   MSDOS                   # Cyl     0*-  2549 
    j:       3355632      10862208  4.2BSD   2048 16384  328 # Cyl 10776 - 14104 
    k:       2097648      14217840  4.2BSD   2048 16384  328 # Cyl 14105 - 16185 
    l:       2097648      16315488  4.2BSD   2048 16384  328 # Cyl 16186 - 18266 
    m:      59727024      18413136  4.2BSD   2048 16384  328 # Cyl 18267 - 77519 
.Ed
.Pp
These
.Ox
partitions are then mounted as follows using
.Pa /etc/fstab Ns :
.Bd -literal
  /dev/wd0a / ffs rw,softdep 1 1
  /dev/wd0m /home ffs rw,softdep,nodev,nosuid 1 2
  /dev/wd0d /tmp ffs rw,softdep,nodev,nosuid 1 2
  /dev/wd0g /usr ffs rw,softdep,nodev 1 2
  /dev/wd0h /usr/X11R6 ffs rw,softdep,nodev 1 2
  /dev/wd0j /usr/local ffs rw,softdep,nodev 1 2
  /dev/wd0k /usr/obj ffs rw,softdep,nodev,nosuid 1 2
  /dev/wd0l /usr/src ffs rw,softdep,nodev,nosuid 1 2
  /dev/wd0e /var ffs rw,softdep,nodev,nosuid 1 2
.Ed
.Pp
.Sh OPTIONS
The options are as follows:
.Bl -tag -width Ds
.It Xo Fl c Ar cylinders ,
.Fl h Ar heads ,
.Fl s Ar sectors
.Xc
Specifies an alternate BIOS geometry for
.Nm
to use.
By default, an automatic calculation of disk size will be built
using heuristics.
These figures are taken from the in-core disklabel
(see
.Xr disklabel 8 Ns ),
or values that
.Em /boot
has passed to the kernel.
.It Fl e
Use the interactive edit of
.Nm
to modify a MBR partition table.
The editor permits configuration of the MBR partition, as well as
extended MBR partitions.
.It Fl f Ar mbrname
Specifies an alternate MBR template file.
The default file is
.Pa /usr/mdec/mbr .
.It Fl i
Requests that the MBR partition data be re-initialized.
In this mode,
.Nm
will completely overwrite the primary MBR bootcode and MBR partition table
using the default MBR template
.Pa /usr/mdec/mbr
(or the one optionally specified by the
.Fl f
flag).
In the default template, MBR partition number 3 will be configured as an
.Ox
MBR partition spanning from cylinder 0, head 1, sector 1, and extending
to the end of the disk.
This mode is designed to initialize the MBR the very first time.
.It Fl u
Update MBR bootcode, preserving existing MBR partition table.
The MBR bootcode extends from offset 0x000 to the start of the MBR partition table
at offset 0x1BE.
It is similar to the
.Fl i
flag, except the existing MBR partition table is preserved.
This is useful for writing new MBR bootcode onto an existing drive, and is
equivalent to the DOS command
.Dq FDISK /MBR .
Note that this option will overwrite the NT disk signature, if present.
.El
.Pp
.Sh COMMAND MODE
The
.Fl e
flag causes
.Nm
to enter an interactive command mode.
The prompt contains information about the state of the edit
process.
.Bd -literal
    fdisk:*0>
.Ed
.Pp
* means that the in-memory copy of the boot block has been modified, but
not yet written to disk.
.Pp
0 is the disk offset of the currently selected boot block being edited.
This number could be something other than zero when extended MBR partitions
are being edited (using the
.Em select
subcommand).
.Pp
The list of commands and their explanations are given below.
.Bl -tag -width Ds
.It help
Display a list of commands that
.Nm
understands in the interactive edit mode.
.It manual
Display this manual page.
.It reinit
Initialize the currently selected, in-memory copy of the
boot block.
.It disk
Display the current drive geometry that
.Nm
probed using kernel provided information and various heuristics.
The disk geometry may be changed at this point.
.It edit Ar #
Edit a given table entry in the memory copy of
the current boot block.
Sizes may be adjusted using either in BIOS geometry mode or
sector offsets and sizes.
.It flag Ar #
Make the given MBR partition table entry bootable.
Only one entry can be marked bootable.
.\" If you wish to boot from an extended
.\" MBR partition, you will need to mark the MBR partition table entry for the
.\" extended MBR partition as bootable.
.\" If an optional value is given, the MBR partition is marked with the given
.\" value, and other MBR partitions are not touched.
.It update
Update the machine MBR bootcode and 0xAA55 signature in the memory copy
of the currently selected boot block.
Note that this option will overwrite the NT disk
signature, if present.
.It select Ar #
Select and load into memory the boot block pointed
to by the extended MBR partition table entry in the current boot block.
.It setpid Ar #
Change the MBR partition
identifier of the given MBR partition table entry.
This command is particularly useful for reassigning
an existing MBR partition to
.Ox .
.It swap Ar # Ar #
Swap two MBR entries.
.It print
Print the currently selected in-memory copy of the boot
block and its MBR table to the terminal.
.It write
Write the in-memory copy of the boot block to disk.
.It exit
Exit the current level of
.Nm fdisk ,
either returning to the
previously selected in-memory copy of a boot block, or exiting the
program if there is none.
.It quit
Exit the current level of
.Nm fdisk ,
either returning to the
previously selected in-memory copy of a boot block, or exiting the
program if there is none.
Unlike
.Em exit
it does write the modified block out.
.It abort
Quit program without saving current changes.
.El
.Sh NOTES
.Pp
Hand crafted disk layouts can be highly error prone;
ensure that
.Ox
MBR partition starts on a cylinder boundary.
(This restriction may be changed in the future.)
.Sh FILES
.Bl -tag -width /usr/mdec/mbr -compact
.It Pa /usr/mdec/mbr
default MBR template
.El
.Sh SEE ALSO
.Xr boot_alpha 8 ,
.Xr boot_amd64 8 ,
.Xr boot_cats 8 ,
.Xr boot_i386 8 ,
.Xr boot_macppc 8 ,
.Xr boot_zaurus 8 ,
.Xr disklabel 8
