openbsd/src/sbin/pcmcia_cntrl/pcmcia_cntrl.8
.\"     $OpenBSD: pcmcia_cntrl.8,v 1.3 1998/09/17 04:15:00 aaron Exp $
.\" Copyright (c) 1994 Stefan Grefen 
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Institute of Electrical and Electronics Engineers, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"     This product includes software developed by the University of
.\"     California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)pwd.1 6.5 (Berkeley) 6/27/91
.\"
.Dd May 31, 1994
.Dt PCMCIA_CNTRL 8
.Os
.Sh NAME
.Nm pcmcia_cntrl
.Nd Change the status of a pcmcia slot
.Sh SYNOPSIS
.Nm pcmcia_cntrl
.Ar slotid
.Op on | off | unmap | probe
.Sh DESCRIPTION
.Nm pcmcia_cntrl
controls the operation of a PCMCIA card. It operates on the card in slot
.Ar slotid .
\.
.Pp
The options are as follows:
.Bl -tag -width flag
.It Fl on
Turns power on
.It Fl off
Turns power off
.It Fl unmap
Unmaps and unconfigures a active card (not all drivers may support this).
.It Fl probe
Probes and attaches the card found in the slot. Works only for devices that
have kernel support for mapping.
Use config_slot for other devices.
.El
.Pp
If an error occurs,
.Nm pcmcia_cntrl
exits with a value >0.
.Sh SEE ALSO
.Xr pcmcia 4
.Sh BUGS
Too numerous to mention.
