openbsd/src/usr.sbin/ospfd/ospfd.8
.\"	$OpenBSD: ospfd.8,v 1.21 2007/10/25 16:10:12 jmc Exp $
.\"
.\" Copyright (c) 2004, 2005, 2007 Esben Norby <norby@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 25 2007 $
.Dt OSPFD 8
.Os
.Sh NAME
.Nm ospfd
.Nd "Open Shortest Path First daemon"
.Sh SYNOPSIS
.Nm
.Op Fl dnv
.Oo Xo
.Fl D Ar macro Ns = Ns Ar value Oc
.Xc
.Op Fl f Ar file
.Sh DESCRIPTION
.Nm
is an Open Shortest Path First
.Pq OSPF
daemon which manages routing tables.
This implementation supports OSPF version 2, thus it is only capable of
maintaining IPv4 routing tables.
.Pp
OSPF is an interior gateway protocol designed to supersede RIP.
The OSPF daemon maintains a Link State Database
.Pq LSDB
consisting of routers and networks.
.Pp
Dijkstra's shortest path first algorithm is used to compute the Route
Information Base using the LSDB as input.
The Forwarding Information Base a.k.a. the kernel route table is updated
with information from the RIB.
.Pp
OSPF routers communicate via two multicast groups: 224.0.0.5 all Shortest
Path First routers and 224.0.0.6 all Designated Routers.
The IP protocol number 89 is reserved for OSPF, furthermore OSPF packets
omit the use of TCP and UDP.
.Pp
OSPF has several advantages over RIP.
For example every router has a complete network topology.
Response to changes in the network are faster.
Furthermore fail detection is much improved.
.Pp
All routers in an OSPF network spend most of their time keeping each others
LSDBs in sync.
All routers must have the same information in the LSDB at all times.
Every time the LSDB is updated the RIB is updated; if needed the FIB is
also updated.
.Pp
OSPF aware routers discover each other via OSPF hello packets.
.Pp
In a multiaccess network such as Ethernet it is unfeasible for all routers
to synchronize with all other routers in the network.
In such networks a Designated Router
.Pq DR
and a Backup Designated Router
.Pq BDR
is elected.
The DR's responsibility is to synchronize with all routers; the BDR will
not do much until the DR fails.
The first router in a network is automatically elected DR, the second
router BDR.
All routers have a FULL adjacency with the DR and the BDR.
A router not elected either DR or BDR will have 2-WAY adjacency with all
routers but the DR and BDR.
Routers that form 2-WAY adjacency recognize that they know each other.
In case a DR or BDR should fail another router is elected and all routers
change state on the newly elected router and synchronize to it.
.Pp
When routers are connected via point to point links, the DR and BDR
election is skipped since only two routers are connected.
.Pp
To limit the impact changes in the network have on the LSDB it is possible
to segment an OSPF network into areas.
Area 0.0.0.0 a.k.a. the backbone area must always be present.
Routers can be configured as Area Border Router
.Pq ABR ,
being part of multiple areas.
Every area must have direct access to the backbone area.
ABRs not directly connected to the backbone area need to establish a
virtual link to a router in the backbone area.
Virtual links are currently not available in
.Nm .
.Pp
AS Border Routers
.Pq ASBR
are connected to an OSPF network and other external networks, BGP, RIP,
or statically routed.
.Pp
.Nm
is usually started at boot time, and can be enabled by
setting the following in
.Pa /etc/rc.conf.local :
.Pp
.Dl ospfd_flags=\&"\&"
.Pp
See
.Xr rc 8
and
.Xr rc.conf 8
for more information on the boot process
and enabling daemons.
.Pp
A running
.Nm
can be controlled with the
.Xr ospfctl 8
utility.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl D Ar macro Ns = Ns Ar value
Define
.Ar macro
to be set to
.Ar value
on the command line.
Overrides the definition of
.Ar macro
in the configuration file.
.It Fl d
Do not daemonize.
If this option is specified,
.Nm
will run in the foreground and log to
.Em stderr .
.It Fl f Ar file
Specify an alternative configuration file.
.It Fl n
Configtest mode.
Only check the configuration file for validity.
.It Fl v
Produce more verbose output.
.El
.Sh FILES
.Bl -tag -width "/var/run/ospfd.sockXX" -compact
.It /etc/ospfd.conf
Default
.Nm
configuration file.
.It /var/run/ospfd.sock
Unix-domain socket used for communication with
.Xr ospfctl 8 .
.El
.Sh SEE ALSO
.Xr ospfd.conf 5 ,
.Xr ospfctl 8
.Rs
.%R RFC 2328
.%T "OSPF Version 2"
.%D April 1998
.Re
.Rs
.%R RFC 3137
.%T "OSPF Stub Router Advertisement"
.%D June 2001
.Re
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 3.7 .
