openbsd/src/usr.sbin/slaacdctl/slaacdctl.8
.\"	$OpenBSD: slaacdctl.8,v 1.1 2017/03/18 17:33:13 florian Exp $
.\"
.\" Copyright (c) 2017 Florian Obser <florian@openbsd.org>
.\" Copyright (c) 2016 Kenneth R Westerback <kwesterback@gmail.com>
.\" Copyright (c) 2004, 2005 Esben Norby <norby@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 18 2017 $
.Dt SLAACDCTL 8
.Os
.Sh NAME
.Nm slaacdctl
.Nd control the slaacd daemon
.Sh SYNOPSIS
.Nm
.Op Fl s Ar socket
.Ar command
.Op Ar argument ...
.Sh DESCRIPTION
The
.Nm
program controls the
.Xr slaacd 8
daemon.
.Pp
The following options are available:
.Bl -tag -width Ds
.It Fl s Ar socket
Use
.Ar socket
instead of the default
.Pa /var/run/slaacd.sock
to communicate with
.Xr slaacd 8 .
.El
.Pp
The following commands are available:
.Bl -tag -width Ds
.It Cm log brief
Disable verbose debug logging.
.It Cm log verbose
Enable verbose debug logging.
.It Cm send solicitation Ar interfacename
Send a router solicitation on interface
.Ar interfacename
.It Cm show interface Op Ar interfacename
Display status about network interfaces.
.Pp
If
.Ar interfacename
is specified only information relative to
.Ar interfacename
is shown.
.Pp
Otherwise information on all interfaces is shown.
.El
.Sh FILES
.Bl -tag -width "/var/run/slaacd.sockXX" -compact
.It Pa /var/run/slaacd.sock
.Ux Ns -domain
socket used for communication with
.Xr slaacd 8 .
.El
.Sh SEE ALSO
.Xr slaacd.conf 5 ,
.Xr slaacd 8
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 6.2 .
