openbsd/src/sbin/ttyflags/ttyflags.8
.\"	$NetBSD: ttyflags.8,v 1.2 1995/03/18 15:01:22 cgd Exp $
.\"
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 30, 1994
.Dt TTYFLAGS 8
.Os NetBSD 0.9a
.Sh NAME
.Nm ttyflags
.Nd set device-specific flags for terminals
.Sh SYNOPSIS
.Nm ttyflags
.Op Fl v
.Op Fl a | Ar tty ...
.Sh DESCRIPTION
.Nm Ttyflags
sets the device-specific flags for terminals, based on the flags
found on the terminal's line in
.Pa /etc/ttys .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl a
Set the flags for all terminals in
.Pa /etc/ttys .
.It Fl v
Be verbose about what the terminals' flags will be set to.
.El
.Pp
The
.Ar tty
arguments are optional, but must not be specified if the
.Fl a
flag is used.  If specified, the
.Ar tty
arguments should be the base names of
the ttys, as found in
.Pa /etc/ttys .
.Sh FILES
.Bl -tag -width /etc/ttys -compact
.It Pa /etc/ttys
.El
.Sh SEE ALSO
.Xr getttyent 3 ,
.Xr ttys 5
.Sh HISTORY
The
.Nm ttyflags
utility appeared in
.Nx 0.9a .
.Sh BUGS
The conditions on which to report an error are ill-defined.
.Nm Ttyflags
tries to report all significant errors, perhaps going over-board
at times.
