openbsd/src/usr.sbin/ztsscale/ztsscale.8
.\"	$OpenBSD: ztsscale.8,v 1.2 2005/04/25 08:08:56 jmc Exp $
.\"
.\" Copyright (c) CCYY YOUR NAME HERE <user@your.dom.ain>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd April 24, 2005
.Dt ZTSSCALE 8
.Os
.Sh NAME
.Nm ztsscale
.Nd Zaurus touch screen calibration tool
.Sh SYNOPSIS
.Nm ztsscale
.Sh DESCRIPTION
The Zaurus
.Xr lcd 4
screen and
.Xr zts 4
touch point scanning logic is poorly
aligned and requires calibration.
.Nm
is used interactively (and at installation time) to calculate both
the scaling and offset values which will make the pointer act at
the indicated location on the screen.
.Pp
When run as root from the raw console,
.Nm
temporarily takes over the Zaurus
.Xr wsdisplay 4
attached to the
.Xr lcd 4 ,
and prompts for five crosshairs to be touched.
.Pp
When good deviations are calculated from the selections made at these
points,
.Nm
will exit and provide on standard output
a result like the following:
.Pp
.Dl machdep.ztsscale=200,3400,312,3672
.Pp
This result should be placed into
.Pa /etc/sysctl.conf
for future use, or can be immediately applied using:
.Pp
.Dl # sysctl machdep.ztsscale=200,3400,312,3672
.Sh SEE ALSO
.Xr lcd 4 ,
.Xr zts 4 ,
.Xr sysctl.conf 5 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
command appeared in
.Ox 3.8 .
