openbsd/src/share/man/man4/man4.zaurus/intro.4
.\"	$OpenBSD: intro.4,v 1.17 2014/09/19 12:24:38 schwarze Exp $
.\"
.\" Copyright (c) 1983, 1986, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: September 19 2014 $
.Dt INTRO 4 zaurus
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files,
related driver functions, and networking support
available in the system.
In this part of the manual, the SYNOPSIS section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The DIAGNOSTICS section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the zaurus platform.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system will have to be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.
Pseudo-devices are not listed.
.\" Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width lotsofletters -compact -offset indent
.It Xr apm 4
advanced power management device interface
.It Xr cd 4
ATAPI and SCSI CD-ROM driver
.It Xr com 4
serial communications interface
.\" cpu
.It Xr lcd 4
Zaurus LCD display
.It Xr pxadmac 4
PXA2x0 DMA controller
.It Xr pxagpio 4
PXA2x0 GPIO interface
.It Xr pxaintc 4
PXA2x0 interrupt controller
.It Xr pxaip 4
PXA2x0 Integrated Peripheral Bus
.It Xr pxammc 4
MMC/SD/SDIO controller
.It Xr pxaost 4
PXA2x0 OS timer
.It Xr pxapcic 4
PXA2x0 PCMCIA interface
.It Xr pxaudc 4
PXA27x USB device controller
.It Xr scoop 4
Compact Flash and GPIO controller
.It Xr sd 4
SCSI disk driver
.It Xr wd 4
WD100x compatible hard disk driver
.It Xr wdc 4
WD100x compatible hard disk controller driver
.It Xr zaudio 4
Zaurus audio device
.It Xr zkbd 4
Zaurus keyboard support
.It Xr zrc 4
Zaurus remote control support
.It Xr zssp 4
SSP for inter-chip communication
.It Xr zts 4
Zaurus touchscreen support
.El
.Pp
A further list of available devices is contained within the pages
describing the system buses and controllers.
For example, a PCMCIA device would be listed in the
.Xr pcmcia 4
man page.
The following buses and controllers list these devices:
.Pp
.Bl -tag -width "cardbus(4)XX" -offset 3n -compact
.It Xr onewire 4
1-Wire bus
.It Xr pcmcia 4
introduction to PCMCIA (PC Card) support
.It Xr usb 4
introduction to Universal Serial Bus support
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HISTORY
The
zaurus
.Nm intro
first appeared in
.Ox 3.7 .
