openbsd/src/share/man/man4/man4.zaurus/intro.4
.\"	$OpenBSD: intro.4,v 1.8 2005/11/17 05:31:09 uwe Exp $
.\"
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 15, 2005
.Dt INTRO 4 zaurus
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files,
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the zaurus platform.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system will have to be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.
Pseudo-devices are not listed.
.\" Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width lotsofletters -compact -offset indent
.It Xr apm 4
On-board power management.
.It Xr atu 4
Atmel AT76C50x IEEE 802.11b wireless network interfaces.
.It Xr aue 4
ADMtek AN986-based USB Ethernet adapters.
.It Xr axe 4
ASIX Electronics AX88172/AX88178 USB Ethernet adapters.
.It Xr cd 4
ATAPI or SCSI CD drives.
.It Xr cdce 4
USB Communication Device Class Ethernet adapters.
.It Xr com 4
NS16550-compatible asynchronous serial ports.
.\" cpu
.It Xr cue 4
CATC USB-EL1201A based USB Ethernet adapters.
.It Xr kue 4
Kawasaki LSI KL5KUSB101B-based USB Ethernet.
.It Xr lcd 4
On-board LCD display.
.It Xr ne 4
NE2000 and compatible Ethernet devices.
.It Xr ohci 4
USB host controller.
.It Xr pxadmac 4
On-board DMA controller.
.It Xr pxagpio 4
On-board GPIO controller.
.It Xr pxaintc 4
On-board interrupt controller.
.It Xr pxaip 4
Integrated peripheral bus.
.It Xr pxapcic 4
On-board CF/PCMCIA controller.
.It Xr pxaudc 4
USB client controller.
.It Xr saost 4
On-board timer.
.It Xr scoop 4
On-board CF/PCMCIA and GPIO controller.
.It Xr sd 4
SCSI disks.
.It Xr uaudio 4
USB audio devices.
.It Xr ubsa 4
USB Belkin serial adapter.
.It Xr udav 4
Davicom DM9601 USB Ethernet adapters.
.It Xr udsbr 4
D-Link DSB-R100 radio.
.It Xr uftdi 4
USB FTDI FT8U100AX serial adapters.
.It Xr uhid 4
USB human interface devices.
.It Xr uhub 4
USB hubs.
.It Xr ukbd 4
USB keyboards.
.It Xr ulpt 4
USB printers..
.It Xr umass 4
USB mass storage.
.It Xr umct 4
USB MCT RS232 serial adapters.
.It Xr umidi 4
USB MIDI devices.
.It Xr umodem 4
USB modems.
.It Xr ums 4
USB mouses.
.It Xr upl 4
Prolific PL2301/PL2302-based host-to-host USB connectors.
.It Xr uplcom 4
USB Prolific PL2303 serial adapters.
.It Xr ural 4
Ralink Technology RT2500 USB 2.0 IEEE 802.11a/b/g wireless network adapters.
.It Xr urio 4
Diamond Multimedia Rio 500.
.It Xr url 4
Realtek RTL8150L USB Ethernet adapters.
.It Xr uscanner 4
USB scanners.
.It Xr usscanner 4
USB SCSI scanners.
.It Xr uvisor 4
Handspring Visor.
.It Xr uvscom 4
USB SUNTAC Slipper U VS-10U serial adapter.
.It Xr wd 4
IDE disks.
.It Xr wdc 4
IDE disk controller.
.It Xr wi 4
WaveLAN/IEEE, PRISM 2-3 and Spectrum24 IEEE 802.11b wireless network adapters.
.It Xr zaudio 4
On-board audio.
.It Xr zkbd 4
System keyboard.
.It Xr zrc 4
Remote control.
.It Xr zssp 4
SSP for inter-chip communication.
.It Xr zts 4
System touch-screen.
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HISTORY
The
zaurus
.Nm intro
first appeared in
.Ox 3.7 .
