openbsd/src/share/man/man4/man4.zaurus/obio.4
.\" 	$OpenBSD: obio.4,v 1.2 2005/01/04 22:29:22 jmc Exp $
.\" 
.\" Copyright (c) 2005, Miodrag Vallat.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 4, 2005
.Dt OBIO 4 zaurus
.Os
.Sh NAME
.Nm obio
.Nd PXA2x0 On-Board Peripherals
.Sh SYNOPSIS
.Cd "obio0    at pxaip? intr 8"
.Cd "lcd0     at obio?"
.Sh DESCRIPTION
The
.Nm
driver provides a generic interface to the on-board peripherals found
on the Intel PXA210, PXA250, PXA260 and PXA270 processors.
.Pp
It provides interrupt handler registration and interrupt dispatching
to its children drivers.
.Pp
On the Zaurus, these are:
.Pp
.Bl -tag -compact -width tenletters -offset indent
.It Xr lcd 4
On-board LCD display.
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr lcd 4 ,
.Xr pxaip 4 ,
.Xr config 8
