openbsd/src/share/man/man4/man4.zaurus/pxadmac.4
.\" 	$OpenBSD: pxadmac.4,v 1.3 2007/05/31 19:19:57 jmc Exp $ */
.\"
.\" Copyright (c) 2005 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt PXADMAC 4 zaurus
.Os
.Sh NAME
.Nm pxadmac
.Nd PXA2x0 DMA controller
.Sh SYNOPSIS
.Cd "pxadmac0 at pxaip?"
.Sh DESCRIPTION
The
.Nm
driver manages the integrated DMA controller found
on the Intel PXA210, PXA250, PXA260 and PXA270 processor boards.
.Pp
It provides DMA handler registration for service requests to other drivers.
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr pxaip 4 ,
.Xr config 8
