openbsd/src/share/man/man4/man4.zaurus/pxaip.4
.\" 	$OpenBSD: pxaip.4,v 1.11 2007/03/19 20:55:36 jmc Exp $
.\"
.\" Copyright (c) 2005, Miodrag Vallat.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 4, 2005
.Dt PXAIP 4 zaurus
.Os
.Sh NAME
.Nm pxaip
.Nd PXA2x0 Integrated Peripheral Bus
.Sh SYNOPSIS
.Cd "pxaip0   at mainbus?"
.Pp
.Cd "pxaintc0 at pxaip?"
.Cd "pxagpio0 at pxaip?"
.Cd "pxadmac0 at pxaip?"
.Cd "scoop0   at pxaip?"
.Cd "scoop1   at pxaip?"
.Cd "saost0   at pxaip? addr 0x40a00000 size 0x20"
.Cd "zts0     at pxaip?"
.Cd "zkbd0    at pxaip?"
.Cd "pxaudc0  at pxaip?"
.Cd "ohci0    at pxaip?"
.Cd "com0     at pxaip? addr 0x40100000 intr 22"
.Cd "com1     at pxaip? addr 0x40200000 intr 21"
.Cd "com2     at pxaip? addr 0x40700000 intr 20"
.Cd "pxapcic0 at pxaip?"
.Cd "lcd0     at pxaip?"
.Cd "zssp0    at pxaip?"
.Cd "apm0     at pxaip?"
.Cd "zaudio0  at pxaip?"
.Cd "zrc0     at pxaip?"
.Cd "pxammc0  at pxaip?"
.Sh DESCRIPTION
The
.Nm
driver provides a generic interface to the integrated peripheral bus found
on the Intel PXA210, PXA250, PXA260 and PXA270 processors.
.Pp
Companion drivers provide access to the various resources:
.Pp
.Bl -tag -compact -width "pxadmac(4)XXX" -offset indent
.It Xr apm 4
advanced power management device interface
.It Xr com 4
serial communications interface
.It Xr lcd 4
Zaurus LCD display
.It Xr ohci 4
USB Open Host Controller Interface
.It Xr pxadmac 4
PXA2x0 DMA controller
.It Xr pxagpio 4
PXA2x0 GPIO interface
.It Xr pxaintc 4
PXA2x0 interrupt controller
.It Xr pxammc 4
MMC/SD/SDIO controller
.It Xr pxapcic 4
PXA2x0 PCMCIA interface
.It Xr pxaudc 4
PXA27x USB device controller
.It Xr saost 4
SA-11x0 OS timer
.It Xr scoop 4
Compact Flash and GPIO controller
.It Xr zaudio 4
Zaurus audio device
.It Xr zkbd 4
Zaurus keyboard support
.It Xr zrc 4
Zaurus remote control support
.It Xr zssp 4
SSP for inter-chip communication
.It Xr zts 4
Zaurus touchscreen support
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr intro 4 ,
.Xr config 8
.Sh HISTORY
Support for the PXA2x0 family appeared in
.Ox 3.7 .
