openbsd/src/share/man/man4/man4.zaurus/pxaintc.4
.\" 	$OpenBSD: pxaintc.4,v 1.1 2005/01/04 16:39:13 miod Exp $
.\" 
.\" Copyright (c) 2005, Miodrag Vallat.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 4, 2005
.Dt PXAINTC 4 zaurus
.Os
.Sh NAME
.Nm pxaintc
.Nd PXA2x0 Interrupt Controller
.Sh SYNOPSIS
.Cd "pxaintc0 at pxaip?"
.Sh DESCRIPTION
The
.Nm
driver manages the integrated interrupt controller found
on the Intel PXA210, PXA250, PXA260 and PXA270 processor boards.
.Pp
It provides interrupt handler registration and interrupt dispatching services
to other drivers.
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr pxaip 4 ,
.Xr config 8
