openbsd/src/share/man/man4/man4.zaurus/pxaip.4
.\" 	$OpenBSD: pxaip.4,v 1.1 2005/01/04 16:39:13 miod Exp $
.\" 
.\" Copyright (c) 2005, Miodrag Vallat.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 4, 2005
.Dt PXAIP 4 zaurus
.Os
.Sh NAME
.Nm pxaip
.Nd PXA2x0 Integrated Peripheral Bus
.Sh SYNOPSIS
.Cd "pxaip0   at mainbus?"
.Pp
.Cd "pxaintc0 at pxaip?"
.Cd "pxagpio0 at pxaip?"
.Cd "com0     at pxaip? addr 0x40100000 intr 22"
.Cd "com1     at pxaip? addr 0x40200000 intr 21"
.Cd "saost0   at pxaip? addr 0x40a00000 size 0x20"
.Cd "ohci0    at pxaip? addr 0x4c000000 size 0x70 intr 3"
.Cd "pxapcic0 at pxaip?"
.Cd "obio0    at pxaip? intr 8"
.Sh DESCRIPTION
The
.Nm
driver provides a generic interface to the integrated perpiheral bus found
on the Intel PXA210, PXA250, PXA260 and PXA270 processors.
.Pp
Companion drivers provide access to the various resources:
.Bl -tag -compact -width tenletters
.It Xr com 4
NS16550-compatible asynchronous serial ports.
.It Xr obio 4
On-board peripherals.
.It Xr ohci 4
OHCI USB controller.
.It Xr pxagpio 4
GPIO controller.
.It Xr pxaintc 4
INTC interrupt controller.
.It Xr pxapcic 4
PCMCIA controller.
.It Xr saost 4
Built-in timer, compatible with the SA-1110 processor timer.
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr com 4 ,
.Xr obio 4 ,
.Xr ohci 4 ,
.Xr pxagpio 4 ,
.Xr pxaintc 4 ,
.Xr pxapcic 4 ,
.Xr saost 4 ,
.Xr config 8
.Sh HISTORY
Support for the PXA2x0 family appeared in
.Ox 3.7 .
