openbsd/src/share/man/man4/man4.zaurus/pxammc.4
.\" 	$OpenBSD: pxammc.4,v 1.3 2013/07/16 16:05:50 schwarze Exp $
.\"
.\" Uwe Stuehler, 2007. Public Domain.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt PXAMMC 4 zaurus
.Os
.Sh NAME
.Nm pxammc
.Nd MMC/SD/SDIO controller
.Sh SYNOPSIS
.Cd "pxammc0 at pxaip?"
.Cd "sdmmc* at pxammc?"
.Sh DESCRIPTION
The
.Nm
driver supports the MMC/SD/SDIO controller integrated in PXA255 and
PXA27x processors.
.Pp
The
.Xr sdmmc 4
subsystem performs SD/MMC transactions to communicate with whatever
MMC/SD/SDIO devices are inserted into the card slot.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sdmmc 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.2 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Uwe Stuehler Aq Mt uwe@openbsd.org .
.Sh CAVEATS
To work around a problem stated in an errata for the PXA27x processor
family, the driver limits the bus frequency to 9.75 MHz instead of the
theoretically supported maximum frequency of 19.5 MHz.
