openbsd/src/share/man/man4/man4.zaurus/pxaudc.4
.\" 	$OpenBSD: pxaudc.4,v 1.7 2007/02/25 00:43:19 drahn Exp $
.\"
.\" Copyright (c) 2005 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd February 18, 2005
.Dt PXAUDC 4 zaurus
.Os
.Sh NAME
.Nm pxaudc
.Nd PXA27x USB Device Controller
.Sh SYNOPSIS
.Cd "pxaudc0 at pxaip?"
.Sh DESCRIPTION
The PXA27x USB Device Controller is a programmable USB client device.
It is also responsible for dynamically switching the physical ports between
the USB host controller and itself by detecting whether a host or client
cable is plugged into the connector.
.Pp
An appropriate driver can configure the device controller to operate as a
variety of devices, e.g. an Ethernet or mass storage device, when plugged
into a USB host. Currently only ethernet 
.Xr cdcef 4
is supported .
.Pp
Currently, the
.Nm
driver configures
.Xr usbf 4
and 
.Xr cdcef
usb client drivers on boot and enables host mode
.Xr ohci 4
and probes the usb bus when a host cable is connected.
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr ohci 4 ,
.Xr usbf 4 ,
.Xr config 8
