openbsd/src/share/man/man4/man4.zaurus/zrc.4
.\" $OpenBSD: zrc.4,v 1.7 2007/05/31 19:19:57 jmc Exp $
.\"
.\" Copyright (c) 2005 Uwe Stuehler <uwe@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt ZRC 4 zaurus
.Os
.Sh NAME
.Nm zrc
.Nd Zaurus remote control support
.Sh SYNOPSIS
.Cd "zrc0     at pxaip?"
.Cd "wskbd*   at zrc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the CE-RH2 remote control that can be
plugged into the headphone jack of the Zaurus C1000, C3000, C3100, and C3200.
Access to the additional keys generated by the remote control is
through the
.Xr wskbd 4
driver.
.Pp
In translated mode (when not running X) the keys generated by
pressing the buttons on the remote control are:
.Pp
.Bl -tag -width "xxxxxxxxxxxx" -compact -offset indent
.It Li Mute
m
.It Li Volume Down
-
.It Li Volume Up
+
.It Li Rewind
b
.It Li Forward
f
.It Li Play/Pause
p
.It Li Stop
s
.El
.Pp
In raw mode (when running X) the following keycodes are generated:
.Pp
.Bl -tag -width "xxxxxxxxxxxx" -compact -offset indent
.It Li Mute
133
.It Li Volume Down
134
.It Li Volume Up
135
.It Li Rewind
160
.It Li Forward
161
.It Li Play/Pause
162
.It Li Stop
163
.El
.Sh EXAMPLES
Sample
.Pa ~/.Xmodmap
configuration file that can be loaded with
.Xr xmodmap 1 ,
or automatically when
.Xr X 1
starts:
.Bd -literal -offset indent
! Map to xmms control keys; mute becomes "shuffle"
keycode 133 = s
keycode 134 = Down
keycode 135 = Up
keycode 160 = z
keycode 161 = b
keycode 162 = x
keycode 163 = v
.Ed
.Pp
To control applications that handle the standard audio keysyms, this
configuration can be used instead:
.Bd -literal -offset indent
! Map to standard audio keysyms
keycode 133 = XF86AudioMute
keycode 134 = XF86AudioLowerVolume
keycode 135 = XF86AudioRaiseVolume
keycode 160 = XF86AudioPrev
keycode 161 = XF86AudioNext
keycode 162 = XF86AudioPlay
keycode 163 = XF86AudioStop
.Ed
.Sh SEE ALSO
.Xr xmodmap 1 ,
.Xr intro 4 ,
.Xr pxaip 4 ,
.Xr wscons 4 ,
.Xr wskbd 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.9 .
