openbsd/src/share/man/man4/man4.zaurus/zssp.4
.\" 	$OpenBSD: zssp.4,v 1.1 2005/03/03 17:11:24 uwe Exp $
.\" 
.\" Copyright (c) 2005 Uwe Stuehler <uwe@bsdx.de>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd February 28, 2005
.Dt ZSSP 4 zaurus
.Os
.Sh NAME
.Nm zssp
.Nd SSP for inter-chip communication
.Sh SYNOPSIS
.Cd "zssp0    at pxaip?"
.Sh DESCRIPTION
The
.Nm
driver controls the dedicated SSP unit, which is connected to three companion
chips in the zaurus.
.Pp
The three companion chips are:
.Pp
.Bl -tag -compact -width tenletters
.It MAX1111
ADC for reading the battery voltage.
.It ADS7846
Touch-screen controller.
.It LZ9JG18
DAC to adjust the backlight brightness.
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr pxaip 4 ,
.Xr config 8
