openbsd/src/share/man/man4/man4.zaurus/zts.4
.\" $OpenBSD: zts.4,v 1.4 2005/04/24 22:28:26 deraadt Exp $
.\"
.\" Copyright (c) 2005 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd April 17, 2005
.Dt ZTS 4 zaurus
.Os
.Sh NAME
.Nm zts
.Nd Zaurus touchscreen support
.Sh SYNOPSIS
.Cd "zts0     at pxaip?"
.Cd "wsmouse* at zts?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the touchscreen on the Zaurus.
Access to the touchscreen is provided through the
.Xr wscons 4
framework.
.Pp
Touching the screen will emulate mouse button 0 being pressed.
Holding either
.Li \&Fn
or
.Li Alt
while tapping will cause mouse buttons 1 or 2, respectively,
to be "pressed" instead.
.Pp
The touch screen sensor is poorly aligned with respect to the
.Xr lcd 4 ,
therefore
.Xr ztsscale 8
should be used to provide calibration results to the
.Nm
driver.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pxaip 4 ,
.Xr wscons 4 ,
.Xr wsmouse 4
.Xr ztsscale 8 ,
.Sh HISTORY
The
.Nm
driver
appeared in
.Ox 3.7 .
