openbsd/src/usr.sbin/ifmcstat/ifmcstat.8
.\"	$OpenBSD: ifmcstat.8,v 1.4 2001/06/23 00:50:33 deraadt Exp $
.\"
.\" Copyright (c) 1996 WIDE Project. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modifications, are permitted provided that the above copyright notice
.\" and this paragraph are duplicated in all such forms and that any
.\" documentation, advertising materials, and other materials related to
.\" such distribution and use acknowledge that the software was developed
.\" by the WIDE Project, Japan. The name of the Project may not be used to
.\" endorse or promote products derived from this software without
.\" specific prior written permission. THIS SOFTWARE IS PROVIDED ``AS IS''
.\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT
.\" LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
.\" A PARTICULAR PURPOSE.
.Dd May 21, 1998
.Dt IFMCSTAT 8
.Os
.Sh NAME
.Nm ifmcstat
.Nd dump multicast group management statistics per interface
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
The
.Nm ifmcstat
program dumps multicast group information from the kernel.
It is similar but not identical to the output from
.Nm netstat
.Fl inav .
.Pp
There are no command line options.
.Pp
Only root can use
.Nm ifmcstat .
.Sh SEE ALSO
.Xr netstat 8
.Pp
.%R IPng for IPv6
.%N RFC2080
.%A G. Malkin
.%A R. Minnear
