openbsd/src/libexec/tcpd/tcpdmatch/tcpdmatch.8
.\"	$OpenBSD: tcpdmatch.8,v 1.4 1999/04/02 16:21:36 aaron Exp $
.\"
.\" Copyright (c) 1997, Jason Downs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jason Downs for the
.\"      OpenBSD system.
.\" 4. Neither the name(s) of the author(s) nor the name OpenBSD
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 23, 1997
.Dt TCPDMATCH 8
.Os
.Sh NAME
tcpdmatch \- tcp wrapper oracle
.Sh SYNOPSIS
.Nm tcpdmatch
.Op Fl d
.Op Fl i Ar inet_conf
.Ar daemon
.Ar client
.Pp
.Nm tcpdmatch
.Op Fl d
.Op Fl i Ar inet_conf
.Ar daemon Op Ar @server
.Op Ar user@
.Ar client
.Sh DESCRIPTION
.Nm tcpdmatch
predicts how the tcp wrapper would handle a specific request for service.
Examples are given below.
.Pp
The program examines the 
.Xr tcpd 8
access control tables (default
.Pa /etc/hosts.allow
and
.Pa /etc/hosts.deny )
and prints its conclusion.  For maximal accuracy, it extracts additional
information from your
.Xr inetd 8
network configuration file.
.Pp
When
.Nm tcpdmatch
finds a match in the access control tables, it
identifies the matched rule.  In addition, it displays the optional
shell commands or options in a pretty-printed format; this makes it
easier for you to spot any discrepancies between what you want and what
the program understands.
.Sh ARGUMENTS
The following two arguments are always required:
.Pp
.Bl -tag -width XXXXXX -compact
.It Ar daemon
A daemon process name. Typically, the last component of a daemon
executable pathname.
.It Ar client
A host name or network address, or one of the `unknown' or `paranoid'
wildcard patterns.
.El
.Pp
When a client host name is specified,
.Nm tcpdmatch
gives a prediction for each address listed for that client.
.Pp
When a client address is specified,
.Nm tcpdmatch
predicts what
.Xr tcpd 8
would do when client name lookup fails.
.Pp
Optional information specified with the
.Ar daemon@server
form:
.Pp
.Bl -tag -width XXXXXX -compact
.It Ar server
A host name or network address, or one of the `unknown' or `paranoid'
wildcard patterns.  The default server name is `unknown'.
.El
.Pp
Optional information specified with the
.Ar user@client
form:
.Pp
.Bl -tag -width XXXXXX -compact
.It Ar user
A client user identifier. Typically, a login name or a numeric userid.
The default user name is `unknown'.
.El
.Sh OPTIONS
.Bl -tag -width XXXXXXXXXXXX
.It Fl d
Examine
.Pa hosts.allow
and
.Pa hosts.deny
files in the current directory instead of the default ones.
.It Fl i Ar inet_conf
Specify this option when
.Nm tcpdmatch
is unable to find your
.Pa inetd.conf
network configuration file, or when you wish to test with a non-default one.
.El
.Sh EXAMPLES
To predict how
.Xr tcpd 8
would handle a telnet request from the local system:
.Pp
.Bd -unfilled -offset indent
tcpdmatch telnetd localhost
.Ed
.Pp
The same request, pretending that hostname lookup failed:
.Pp
.Bd -unfilled -offset indent
tcpdmatch telnetd 127.0.0.1
.Ed
.Pp
To predict what
.Xr tcpd 8
would do when the client name does not match the client address:
.Pp
.Bd -unfilled -offset indent
tcpdmatch telnetd paranoid
.Ed
.\" .Pp
.\" On some systems, daemon names have no `in.' prefix, or
.\" .Nm tcpdmatch\
.\" may need some help to locate the inetd configuration file.
.Sh FILES
The default locations of the
.Xr tcpd 8
access control tables are:
.Pp
.Bl -tag -width /etc/hosts.allow -compact
.It Pa /etc/hosts.allow
Access control table (allow list)
.It Pa /etc/hosts.deny
Access control table (deny list)
.El
.Sh SEE ALSO
.Xr hosts_access 5 ,
.Xr hosts_options 5 ,
.Xr inetd.conf 5 ,
.Xr tcpdchk 8 .
.Sh AUTHOR
.Bd -unfilled -offset indent
Wietse Venema (wietse@wzv.win.tue.nl),
Department of Mathematics and Computing Science,
Eindhoven University of Technology
Den Dolech 2, P.O. Box 513, 
5600 MB Eindhoven, The Netherlands
.Ed
\" @(#) tcpdmatch.8 1.5 96/02/11 17:01:35
