openbsd/src/share/man/man4/man4.hppa/asp.4
.\"	$OpenBSD: asp.4,v 1.7 2002/04/07 10:33:12 mickey Exp $
.\"
.\"
.\" Copyright (c) 1999 Michael Shalayeff
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Michael Shalayeff.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 1, 1999
.Dt ASP 4
.Os
.Sh NAME
.Nm asp
.Nd "Core" bus controller as present on HP9000
715/33/50/75, 725/50/75, 735/*, 755/*
workstations
.Sh SYNOPSIS
.Cd "asp0    at mainbus? irq 28"
.Cd "gsc* at asp?"
.Sh INTRODUCTION
The supported Core bus controllers are those present on older
.Tn PA-RISC
workstations, and include:
.Bl -bullet -compact
.It
Core bus controller
.It
System Clock
.It
Interrupt Controller
.It
DMA Controller
.It
Real Time Clock Interface
.It
RAM and EEPROM controllers
.El
.Pp
The irq level supplied is hardwired to the cpu pin, so changing the value
would not produce any noticeable results (except lost interrupts for the whole
I/O subsystem).
.Sh SEE ALSO
.Xr lasi 4 ,
.Xr gsc 4 ,
.Xr intro 4
.Rs
"Hardball I/O Subsystem ERS" Revision 1.1, 30 September 1991
.br
Hewlett Packard
.Re
.Sh HISTORY
The
.Nm
driver
appeared in
.Ox 2.4 .
