openbsd/src/share/man/man4/man4.hppa/dino.4
.\"	$OpenBSD: dino.4,v 1.2 2004/01/14 09:58:27 mickey Exp $
.\"
.\" Copyright (c) 2003 Michael Shalayeff
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF MIND,
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 29, 2003
.Dt DINO 4 hppa
.Os
.Sh NAME
.Nm dino
.Nd Dino and Cujo Host/PCI bridges
.Sh SYNOPSIS
.Cd "dino* at phantomas?"
.Cd "pci* at dino?"
.Sh DESCRIPTION
This driver supports
.Tn Dino
and
.Tn Cujo
Host/PCI bridges found on the A, B, and C models of workstations.
.Tn Cujo
is a 64 bit datapath version of
.Tn Dino .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr phantomas 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Ox 3.5 .
.Sh BUGS
.Nm
bridges of revision earlier than three may exhibit data corruption on DMA.
This hardware bug does not affect
.Nm cujo
or card mode
.Nm
bridges.
See HP Service Note Numbers A4190A-01 and A4191A-01 for more details.
Systems affected are those shipped before Aug 20, 1997 and
of models: B132L, B160L, C160, C180, C200, C240.
