openbsd/src/share/man/man4/man4.hppa/gsckbd.4
.\" $OpenBSD: gsckbd.4,v 1.4 2003/03/05 19:50:48 jmc Exp $
.\"
.\" Copyright (c) 2003, Miodrag Vallat.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" Copyright (c) 1999
.\" 	Matthias Drochner.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd February 15, 2003
.Dt GSCKBD 4 hppa
.Os
.Sh NAME
.Nm gsckbd
.Nd PS/2-like keyboard driver for wscons
.Sh SYNOPSIS
.Cd "gsckbd* at gsckbc?"
.Cd "wskbd* at gsckbd? console ?"
.Cd "option GSCKBD_LAYOUT=XXX"
.Sh DESCRIPTION
This driver supports the HP-specific PS/2-like keyboards within the
.Xr wscons 4
console framework.
It doesn't provide direct device driver entry points but makes its
functions available via the internal
.Xr wskbd 4
interface.
.Pp
The
.Nm
driver supports a number of different key mappings which
can be chosen from with the kernel option
.Dq GSCKBD_LAYOUT
at compile time or with the utility
.Xr wsconsctl 8
(variable:
.Dq keyboard.encoding
) at runtime.
Other mappings can be used if the whole keymap is replaced by means of
.Xr wsconsctl 8 .
The built-in mappings are at this time:
.Bl -hang
.It KB_BE
(
.Dq be
) Belgium French.
.It KB_BR
(
.Dq br
) Brazilian.
.It KB_DE
(
.Dq de
) German with
.Dq dead accents .
.It KB_DK
(
.Dq dk
) Danish with
.Dq dead accents .
.It KB_ES
(
.Dq es
) Spanish.
.It KB_FR
(
.Dq fr
) French.
.It KB_IT
(
.Dq it
) Italian.
.It KB_JP
(
.Dq jp
) Japanese.
.It KB_LA
(
.Dq la
) Latinamerican.
.It KB_LT
(
.Dq \&lt
) Lithuanian in
.Dq ISO 8859-13 .
.It KB_NO
(
.Dq no
) Norwegian with
.Dq dead accents .
.It KB_PL
(
.Dq pl
) Polish in
.Dq ISO 8859-2 .
.It KB_PT
(
.Dq pt
) Portuguese.
.It KB_RU
(
.Dq ru
) Russian in
.Dq KOI8 .
.It KB_SF
(
.Dq sf
) Swiss French with
.Dq dead accents .
.It KB_SG
(
.Dq sg
) Swiss German with
.Dq dead accents .
.It KB_SV
(
.Dq sv
) Swedish with
.Dq dead accents .
.It KB_TR
(
.Dq tr
) Turkish in
.Dq ISO 8859-9
with
.Dq dead accents .
.It KB_UA
(
.Dq ua
) Ukrainian in
.Dq KOI8 .
.It KB_UK
(
.Dq uk
) British.
.It KB_US
(
.Dq us
) English / US keyboard mapping (default).
.It KB_US | KB_DECLK
(
.Dq us.declk
) English / US mapping for
.Tn DEC
LK400-style keyboards with PC keyboard interface (eg LK461).
.It KB_US | KB_DVORAK
(
.Dq us.dvorak
) English / US keyboard with
.Dq Dvorak
layout.
.El
.Pp
The KB_DE, KB_DK, KB_NO, KB_SF, KB_SG, KB_SV and KB_TR mappings can be used in
the KB_NODEAD (
.Dq .nodead
) variant.
This switches off the
.Dq dead accents .
.Pp
The KB_BE, KB_FR, KB_JP, KB_US and KB_US | KB_DVORAK mappings can be modified
to swap the left Control and the Caps Lock keys by the
KB_SWAPCTRLCAPS variant bit or the
.Dq .swapctrlcaps
suffix.
.Pp
The KB_METAESC (
.Dq .metaesc
) option can be applied to any layout.
If set, keys pressed together
with the ALT modifier are prefixed by an ESC character.
(Standard behaviour is to add 128 to the ASCII value.)
.Sh EXAMPLES
To set a german keyboard layout without
.Dq dead accents
and sending an ESC character before the key symbol if the ALT
key is pressed simultaneously, use
.Ic wsconsctl -w keyboard.encoding=de.nodead.metaesc .
To set it at kernel build time, add
.Em option PCKBD_LAYOUT="(KB_DE|KB_NODEAD|KB_METAESC)"
to the kernel configuration file.
.Sh SEE ALSO
.Xr gsc 4 ,
.Xr gsckbc 4 ,
.Xr pckbd 4 ,
.Xr wskbd 4 ,
.Xr wsconsctl 8
.Sh BUGS
.Pp
The list of built-in mappings doesn't follow any logics.
It grew as people submitted what they needed.
.Pp
The
.Dq br
and
.Dq jp
encodings are missing some keys compared to their
.Xr pckbd 4
equivalents.
