openbsd/src/share/man/man4/man4.hppa/gsckbd.4
.\" $OpenBSD: gsckbd.4,v 1.1 2003/01/31 23:03:12 miod Exp $
.\"
.\" Copyright (c) 2003, Miodrag Vallat.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 31, 2003
.Dt GSCKBD 4
.Os
.Sh NAME
.Nm gsckbd
.Nd PS/2-like keyboard driver for wscons
.Sh SYNOPSIS
.Cd "gsckbd* at gsckbc?"
.Cd "wskbd* at gsckbd? console ?"
.Cd "option GSCKBD_LAYOUT=XXX"
.Sh DESCRIPTION
This driver supports the HP-specific PS/2-like keyboards within the
.Xr wscons 4
console framework.
It doesn't provide direct device driver entry points but makes its
functions available via the internal
.Xr wskbd 4
interface.
.Pp
The
.Nm
driver supports a number of different key mappings which
can be chosen from with the kernel option
.Dq GSCKBD_LAYOUT
at compile time or with the utility
.Xr wsconsctl 8
(variable:
.Dq keyboard.encoding
) at runtime.
Other mappings can be used if the whole keymap is replaced by means of
.Xr wsconsctl 8 .
The built-in mappings are at this time:
.Bl -hang
.It KB_UK
(
.Dq uk
) British.
.It KB_US
(
.Dq us
) English / US keyboard mapping (default).
.El
.Pp
The KB_US mapping can be modified
to swap the left Control and the Caps Lock keys by the
KB_SWAPCTRLCAPS variant bit or the
.Dq .swapctrlcaps
suffix.
.Sh EXAMPLES
To set a british keyboard layout, use
.Ic wsconsctl -w keyboard.encoding=uk .
To set it at kernel build time, add
.Em option GSCKBD_LAYOUT="KB_UK"
to the kernel configuration file.
.Sh SEE ALSO
.Xr gsc 4 ,
.Xr gsckbc 4 ,
.Xr wskbd 4 ,
.Xr wsconsctl 8
