openbsd/src/share/man/man4/man4.hppa/harmony.4
.\"     $OpenBSD: harmony.4,v 1.1 2003/01/26 21:59:17 jason Exp $
.\"
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Jason L. Wright
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 26, 2003
.Dt HARMONY 4 hppa
.Os
.Sh NAME
.Nm harmony
.Nd lasi CS4215/AD1849 audio interface
.Sh SYNOPSIS
.Cd "harmony* at gsc? irq 13"
.Cd "audio*  at harmony?"
.Sh DESCRIPTION
The
.Nm
device uses the
.Tn Crystal Semiconductor
.Tn CS4215
16-Bit Multimedia Audio Codec
or
.Tn Analog Devices
.Tn AD1848
chip to implement the audio device interface described in
.Xr audio 4 .
This device is found onboard on some HPPA models.
The
.Nm
has a maximum precision of 16 bits and has a stereo input and stereo output.
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr audio 4 ,
.Xr gsc 4 ,
.Xr intro 4
.Sh HISTORY
.Ox
support for
.Nm
first appeared in
.Ox 3.3 .
