openbsd/src/share/man/man4/man4.hppa/lasi.4
.\"	$OpenBSD: lasi.4,v 1.9 2002/05/23 09:30:34 mpech Exp $
.\"
.\"
.\" Copyright (c) 1999 Michael Shalayeff
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Michael Shalayeff.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 1, 1999
.Dt LASI 4
.Os
.Sh NAME
.Nm lasi
.Nd "Core" bus controller and I/O subsystem as present on HP9000
712/*, 715/64/80/100/100XC, 725/64/80/100, 743/*, 744/*, 745/*
workstations and single-board computers.
.Sh SYNOPSIS
.Cd "lasi0   at mainbus? irq 28"
.Cd "gsc* at lasi?"
.Sh INTRODUCTION
The supported Core bus controllers are those used in conjuction with
.Tn PA7100LC
and
.Tn PA7300LC
CPUs and based upon LSI's macrochip that includes:
.Bl -bullet -compact
.It
Core bus controller
.It
System Clock
.It
Interrupt Controller
.It
Real Time Clock Interface
.It
Power System support
.It
RAM and Flash EEPROM controllers
.It
Two PS/2 ports
.It
RS-232 and Centronics I/O ports
.It
i82596CA Ethernet Controller
.It
NCR53C710 SCSI IO Processor
.It
Serial Interface for the CS4216 Audio Codec
.It
Interface for the WD37C65C floppy drive controller
.It
Optional Telephone interface (voice/modem/fax two channels)
.El
.Sh SEE ALSO
.Xr asp 4 ,
.Xr gsc 4 ,
.Xr intro 4 ,
.Xr wax 4
.Rs
"Precision I/O Architecture Reference Specification"
.br
Hewlett Packard
.Re
.Rs
"712 I/O Subsystem ERS" Revision 1.1, 12 February 1993
.br
Hewlett Packard, Dwg No.
A-A2263-66510-31
.Re
.Rs
Hewlett-Packard Journal
.br
April 1995 Volume 46 Number 2
.Re
.Sh HISTORY
The
.Nm
driver
appeared in
.Ox 2.4 .
