openbsd/src/usr.bin/man/man.1
.\"	$OpenBSD: man.1,v 1.24 2005/11/24 12:08:16 pedro Exp $
.\"
.\" Copyright (c) 1989, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)man.1	8.2 (Berkeley) 1/2/94
.\"
.Dd March 9, 1998
.Dt MAN 1
.Os
.Sh NAME
.Nm man
.Nd display the on-line manual pages
.Sh SYNOPSIS
.Nm man
.Op Fl achw
.Op Fl C Ar file
.Op Fl M Ar path
.Op Fl m Ar path
.Op Fl S Ar subsection
.Op Fl s Ar section
.Op Ar section
.Ar name Op Ar ...
.Nm man
.Fl f Ar command
.Nm man
.Fl k Ar keyword
.Sh DESCRIPTION
The
.Nm
utility
displays the
.Bx
manual pages entitled
.Ar name .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl a
Display all of the manual pages for a specified
.Ar section
and
.Ar name
combination.
(Normally, only the first manual page found is displayed.)
.It Fl C Ar file
Use the specified
.Ar file
instead of the default configuration file.
This permits users to configure their own manual environment.
See
.Xr man.conf 5
for a description of the contents of this file.
.It Fl c
Copy the manual page to the standard output instead of using
.Xr more 1
to paginate it.
This is done by default if the standard output is not a terminal device.
.It Fl f Ar command
Locate man pages matching the
.Ar command
in much the same way
.Xr whatis 1
works.
.It Fl h
Display only the
.Dq SYNOPSIS
lines of the requested manual pages.
.It Fl k Ar keyword
Locate man pages matching
.Ar keyword
in much the same way as
.Xr apropos 1
works (in fact, it runs
.Xr apropos 1 ) .
This can be used to find which man page applies to a particular subsystem
you are interested in.
For instance:
.Pp
.Dl $ man -k mount
.Pp
will list all man pages which contain
.Ar keyword
in the
.Dq NAME
line of the man page;
in this case a list much like this:
.Bd -literal
amd (8) \- automatically mount file systems
amq (8) \- automounter query tool
mount (8) \- mount file systems
mount, unmount (2) \- mount or dismount a filesystem
mount_ados (8) \- mount an AmigaDOS file system
mount_cd9660 (8) \- mount an ISO-9660 filesystem
mount_ext2fs (8) \- mount a ext2fs file system
mount_fdesc (8) \- mount the file-descriptor file system
mount_ffs, mount_ufs (8) \- mount a Berkeley Fast File System
mount_procfs (8) \- mount the process file system
mount_xfs (8) \- mount the xfs filesystem
mountd (8) \- service remote NFS mount requests
newfs, mount_mfs (8) \- construct a new file system
umount (8) \- unmount file systems
\&...
.Ed
.It Fl M Ar path
Override the list of standard directories which
.Nm
searches for manual pages.
The supplied
.Ar path
must be a colon
.Pq Ql \&:
separated list of directories.
This search path may also be set using the environment variable
.Ev MANPATH .
The subdirectories to be searched, and their search order,
are specified by the
.Dq _subdir
line in the
.Nm
configuration file.
.It Fl m Ar path
Augment the list of standard directories which
.Nm
searches for manual pages.
The supplied
.Ar path
must be a colon
.Pq Ql \&:
separated list of directories.
These directories will be searched before the standard directories or
the directories specified using the
.Fl M
option or the
.Ev MANPATH
environment variable.
The subdirectories to be searched, and their search order,
are specified by the
.Dq _subdir
line in the
.Nm
configuration file.
.It Fl S Ar subsection
Specifies the machine-dependent subsection.
This overrides the
.Ev MACHINE
environment variable.
See the
.Sx ENVIRONMENT
section below.
.It Fl s Ar section
Another way of specifying the section, for compatibility with
.Nm
on other operating systems.
.It Fl w
List the pathnames of the manual pages which
.Nm
would display for the specified
.Ar section
and
.Ar name
combination.
.El
.Pp
The optional
.Ar section
argument restricts the directories that
.Nm
will search.
The currently available sections are:
.Pp
.Bl -tag -width "3p " -offset indent -compact
.It 1
General commands
.Pq tools and utilities .
.It 2
System calls and error numbers.
.It 3
Libraries.
.It 3p
.Xr perl 1
programmer's reference guide.
.It 4
Device drivers.
.It 5
File formats.
.It 6
Games.
.It 7
Miscellaneous.
.It 8
System maintenance and operation commands.
.It 9
Kernel internals.
.El
.Pp
The
.Nm
configuration file (see
.Xr man.conf 5 )
specifies the possible
.Ar section
values, and their search order.
If only a single argument is specified, or if the first argument is
not a valid section,
.Nm
assumes that the argument is the name of a manual page to be displayed.
.Pp
Guidelines for
.Ox
man pages can be found in
.Xr mdoc 7 .
A full tutorial for writing man pages is provided in
.Xr mdoc.samples 7 .
.Sh ENVIRONMENT
.Bl -tag -width MANPATHX
.It Ev MACHINE
As some manual pages are intended only for specific architectures,
.Nm
searches any subdirectories,
with the same name as the current architecture,
in every directory which it searches.
Machine specific areas are checked before general areas.
The current machine type may be overridden by setting the environment
variable
.Ev MACHINE
to the name of a specific architecture.
.It Ev MANPAGER
Any non-null value of the environment variable
.Ev MANPAGER
will be used instead of the standard pagination program,
.Xr more 1 .
.It Ev MANPATH
The standard search path used by
.Nm
may be overridden by specifying a path in the
.Ev MANPATH
environment
variable.
The format of the path is a colon
.Pq Ql \&:
separated list of directories.
The subdirectories to be searched, as well as their search order,
are specified by the
.Dq _subdir
line in the
.Nm
configuration file.
.It Ev PAGER
Specifies the pagination program to use when
.Ev MANPAGER
is not defined.
.El
.Sh FILES
.Bl -tag -width /etc/man.conf -compact
.It Pa /etc/man.conf
default man configuration file
.El
.Sh SEE ALSO
.Xr apropos 1 ,
.Xr intro 1 ,
.Xr whatis 1 ,
.Xr whereis 1 ,
.Xr intro 2 ,
.Xr intro 3 ,
.Xr intro 4 ,
.Xr intro 5 ,
.Xr man.conf 5 ,
.Xr intro 6 ,
.Xr intro 7 ,
.Xr mdoc 7 ,
.Xr mdoc.samples 7 ,
.Xr intro 8 ,
.Xr intro 9
.Sh HISTORY
A
.Nm
command appeared in
.At v3 .
.Sh BUGS
The on-line manual pages are, by necessity, forgiving toward stupid
display devices, causing a few manual pages to be not as nicely formatted
as their typeset counterparts.
