openbsd/src/usr.sbin/npppd/npppd/npppd.8
.\"	$OpenBSD: npppd.8,v 1.5 2013/01/29 15:42:20 yasuoka Exp $
.\"
.\" Copyright (c) 2012 YASUOKA Masahiko <yasuoka@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\" The following requests are required for all man pages.
.\"
.Dd $Mdocdate: January 29 2013 $
.Dt NPPPD 8
.Os
.Sh NAME
.Nm npppd
.Nd new Point-to-Point Protocol daemon
.Sh SYNOPSIS
.Nm npppd
.Op Fl dhn
.Op Fl f Ar config_file
.Sh DESCRIPTION
.Nm
is a Point-to-Point Protocol (PPP) and tunneling daemon
capable of L2TP, PPTP, and PPPoE.
.Bl -tag -width Ds
.It Fl d
Do not daemonize.
If this option is specified,
.Nm
will run in the foreground and log to
.Em stderr .
.It Fl f Ar config_file
Specify an alternative configuration file.
.It Fl h
Show the usage.
.It Fl n
Configtest mode.
Only check the configuration file for validity.
.El
.Pp
Normally
.Nm
works with
.Xr pipex 4
to accelerate IP packet forwarding, but
.Xr pipex 4
is disabled by default.
To enable it, set
.Va net.pipex.enable
to
.Sq 1
using
.Xr sysctl 8 .
.Pp
When
.Nm
uses PPTP,
the host system should allow GRE packets, but they are disabled by default.
To enable GRE, set
.Va net.inet.gre.allow
to
.Sq 1
using
.Xr sysctl 8 .
.Sh FILES
.Bl -tag -width "/etc/npppd/npppd.confXXX" -compact
.It Pa /etc/npppd/npppd.conf
Default
.Nm
configuration file.
.El
.Sh SEE ALSO
.Xr gre 4 ,
.Xr pipex 4 ,
.Xr pppx 4 ,
.Xr tun 4 ,
.Xr npppd.conf 5 ,
.Xr npppctl 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
program first appeared in
.Ox
5.3.
.Sh AUTHORS
The
.Nm
program was written by Internet Initiative Japan Inc.
.Sh BUGS
If
.Ic l2tp-require-ipsec
is set to
.Dq yes
with an L2TP tunnel,
all incoming L2TP/IPsec packets are dropped.
