openbsd/src/usr.sbin/rpc.bootparamd/rpc.bootparamd.8
.\" $OpenBSD: rpc.bootparamd.8,v 1.10 1999/07/02 20:11:48 aaron Exp $
.\" @(#)bootparamd.8
.Dd January 8, 1994
.Dt BOOTPARAMD 8
.Os
.Sh NAME
.Nm bootparamd ,
.Nm rpc.bootparamd
.Nd boot parameter server
.Sh SYNOPSIS
.Nm rpc.bootparamd
.Op Fl d
.Op Fl s
.Op Fl r Ar router
.Op Fl f Ar file
.Sh DESCRIPTION
.Nm
is a server process that provides information to diskless clients
necessary for booting. It consults the file
.Pa /etc/bootparams .
It should normally be started from
.Pa /etc/rc .
.Pp
This version will allow the use of aliases on the hostname in the
.Pa /etc/bootparams
file. The hostname returned in response to the booting client's whoami request
will be the name that appears in the config file, not the canonical name.
In this way you can keep the answer short enough
so that machines that cannot handle long hostnames won't fail during boot.
.Pp
While parsing, if a line containing just
.Dq \&+
is found, and the YP subsystem is active, the YP map
.Pa bootparams
will be searched immediately.
.Sh OPTIONS
.Bl -tag -width indent
.It Fl d
Display the debugging information. The daemon does not fork in this
case.
.It Fl s
Log the debugging information with syslog.
.It Fl r
Set the default router (a hostname or IP address).
This defaults to the machine running the server.
.It Fl f
Specify the file to read boot parameters from.  Defaults to
.Pa /etc/bootparams .
.El
.Pp
.Sh FILES
.Bl -tag -width /etc/bootparams -compact
.It Pa /etc/bootparams
default configuration file
.El
.Sh SEE ALSO
.Xr bootparams 5 ,
.Xr diskless 8
.Sh WARNINGS
If
.Nm rpc.bootparamd
is run on a system which is also running YP, your YP
domainname will be made public information.
.Sh BUGS
You may find the syslog loggings too verbose.
.Pp
It's not clear if the non-canonical hack mentioned above is a good idea.
.Sh AUTHOR
Originally written by Klas Heggemann <klas@nada.kth.se>
