openbsd/src/usr.sbin/radiusd/radiusd.conf.5
.\" Copyright (c) 2014 Esdenera Networks GmbH
.\" Copyright (c) 2014 Internet Initiative Japan Inc.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 29 2015 $
.Dt RADIUSD.CONF 5
.Os
.Sh NAME
.Nm radiusd.conf
.Nd RADIUS daemon configuration file
.Sh DESCRIPTION
.Nm
is the configuration file for the RADIUS daemon,
.Xr radiusd 8 .
.Sh SECTIONS
.Nm
is divided into several main sections
.Sh GLOBAL CONFIGURATION
.Bl -tag -width Ds
.It Ic authenticate Ar username
.It Ic client Ar address/mask
.It Xo
.Ic listen on Ar address
.Ic port Ar port
.Xc
Specify an
.Ar address
and a
.Ar port
to listen on.
.It Ic module Ic load Ar name Ar path
Load module
.Ar name
from
.Ar path .
.It Ic module Ic set Ar key Ar value
Configure the module specific configuration by
.Ar key and
.Ar value .
.El
.Sh AUTHENTICATE
.Bl -tag -width Ds
.It Ic authenticate-by Ar module
.It Ic decorate-by Ar label
.El
.Sh CLIENT
.Bl -tag -width Ds
.It Ic secret Qq Ar passphrase
The passphrase for the client.
.It Ic msgauth-required Ar yes Ns | Ns Ar no
Require message authentication if
.Ar yes
is specified.
.El
.Sh FILES
.Bl -tag -width "/etc/radiusd.confXX" -compact
.It Pa /etc/radiusd.conf
Default
.Xr radiusd 8
configuration file.
.El
.Sh EXAMPLES
.Bd -literal -offset indent
include "/etc/radius-section-1.conf"

listen on 127.0.0.1 port 1812
listen on ::1 port 1812

client 127.0.0.1/32    { secret "hogehoge" }
client 0.0.0.0/0 {
	secret "fugafuga"
	msgauth-required yes
}

module load bsdauth "/usr/libexec/radiusd/radiusd_bsdauth"
module load radius  "/usr/libexec/radiusd/radiusd_radius"
module set radius "secret" "testing123"
module set radius "server" "127.0.0.1"

authenticate * {
	authenticate-by radius
}
authenticate *@local {
	authenticate-by bsdauth
}
.Ed
.Sh SEE ALSO
.Xr radiusd 8
