openbsd/src/sbin/pdisk/pdisk.8
.Dd September 26, 1997
.Dt PDISK 8
.Os
.Sh NAME
.Nm pdisk
.Nd HFS(DPME) partition maintenance program
.Sh SYNOPSIS
.Nm pdisk
.Op Fl h
.Op Fl i
.Op Fl l
.Op Fl r
.Op Fl c
.Ar device
.Sh DESCRIPTION
.Nm
is a menu driven program which partitions disks using the standard Apple
disk partitioning scheme described in "Inside Macintosh: Devices".
It does not support the intel/dos partitioning scheme supported by 
.BR fdisk .
The
.Ar device
is usually one of the following:

/dev/sd0c
/dev/sd1c
/dev/sd2c
/dev/sd3c
/dev/sd4c
/dev/sd5c
/dev/sd6c
/dev/wd0c
/dev/wd1c
/dev/wd2c
/dev/wd3c

.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl v
Prints version number of the program.
.It Fl h
Prints a rather lame set of help messages for the
.Nm
program.
.It Fl i
Causes
.Nm
to go into an interactive mode similar to the MacOS version of the program.
.It Fl l
List the partition tables for the specified
.Ar devices
.
.Tp
.It Fl r
Prevents
.Nm
from writing to the device.
.TP
.It Fl c
Causes
.Nm
to always ignore the device size listed in the partition table
and compute the device size by other means.
.SH "Editing Partition Tables"
An argument which is simply the name of a
.I device
indicates that
.Nm
should edit the partition table of that device.
.El
.Sh COMMAND MODE
The list of commands and their explanations are given below.
.Pp
.Bl -tag -width "update"
.It Em h
command help
.It Em p
print the partition table
.It Em P
(print ordered by base address)
.It Em i
initialize partition map
.It Em s
change size of partition map
.It Em c
create new partition (standard OpenBSD type)
.It Em C
create with type also specified
.It Em n
(re)name a partition
.It Em d
delete a partition
.It Em r
reorder partition entry in map
.It Em t
change the type of an existing partition
.It Em w
write the partition table
.It Em q
quit editing (don't save changes)
.El

Commands which take arguments prompt for each argument in turn.
You can also type any number of the arguments separated by spaces
and those prompts will be skipped.
The only exception to typeahead are the confirmation prompts on the
.Em i
and
.Em w
commands.
The idea being that if we expect you to confirm the decision we
shouldn't undermine that by allowing you to be precipitate about it.

Partitions are always specified by their number,
which the index of the partition entry in the partition map.
Most of the commands will change the index numbers of all partitions
after the affected partition.
You are advised to print the table as frequently as necessary.

Creating more than fifteen partitions is not advised, for
compatibility reasons.

The
.Em c
(create new partition) command is the only one with complicated arguments.
The first argument is the base address (in blocks) of the partition.
Besides a raw number, you can also specify a partition number followed
by the letter 'p' to indicate that the first block of the new partition should
be the same as the first block of that existing free  space partition.
The second argument is the length of the partition in blocks.
This can be a raw number or can be a partition number followed by the
letter 'p' to use the size of that partition or can be a number followed
by 'k', 'm', or 'g' to indicate the size in kilobytes, megabytes, or gigabytes
respectively.
(These are powers of 1024, of course, not powers of 1000.)
The last argument is the name of the partition.
This can be a single word without quotes, or a string surrounded by
single or double quotes.
The type of the created partition is the correct type for OpenBSD.

The
.Em C
command is identical to the
.Em c
command, with the addition of a partition type argument after the
other arguments.

The
.Em n
(name) command allows the name of a partition to be changed.
Note that the various "Apple_Driver" partitions depend
on the name field for proper functioning.
I am not aware of any other partition types with this limitation.

The
.Em r
(reorder) command allows the index number of partitions to be changed.
The index numbers are constrained to be a contiguous sequence.

The
.Em t
(change type) command allows the type of an existing partition to be changed.
Examples of valid partition types are: Apple_Free, Apple_HFS, and OpenBSD.

The
.Em i
(initalize) command prompts for the size of the device.
This was done to get around a bug in the kernel where it reports the wrong
size for the device.

The
.Em w
(write) command does write the partition map out,
but there is currently a bug in the interaction between the
disk and the kernel where
.Nm disklabel
.Fl c
.Ar device
must be issued to cause the kernel to reinterpret the new label.

.Sh BUGS
Some people believe there should really be just one disk partitioning utility.
.Pp
.Nm
should be able to create HFS partitions that work.
.br
Even more help should be available during user input.
.Sh SEE ALSO
.Xr fdisk 8 , 
.Xr disklabel 8
.Sh AUTHORS
Eryk Vershen (eryk@apple.com)
