openbsd/src/share/man/man4/man4.vax/cons.4
.\"	$OpenBSD: cons.4,v 1.8 2002/08/29 07:34:31 wcobb Exp $
.\"
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)cons.4	6.3 (Berkeley) 3/27/91
.\"
.Dd March 27, 1991
.Dt CONS 4 vax
.Os
.Sh NAME
.Nm cons
.Nd "VAX console interface"
.Sh DESCRIPTION
The console is available to the processor through the console registers.
It acts like a normal terminal, except that when the local functions are
not disabled, a special command character puts the console in local console
mode.
The character itself is dependent upon the model of VAX and the type
of console in use.
The prompt in console mode is
.Sq Li >>> ,
also called the
.Sq chevron
prompt.
.Pp
The operation of the console in this mode varies
among different VAX models.
.Ss VAX-11/780 or 785
On either the
.Tn VAX
11/780 or 785 the following commands may be used
after placing the console in local mode with
.Ic ^P .
.Pp
.Bl -tag -width continue -compact -offset 4n
.It Ic c
.It Ic continue
Re-enter conversational mode
if the processor was halted.
.Pp
.It Ic h
.It Ic halt
Halt the CPU.
On an 11/780 or 785
the processor is not stopped by entering local console mode.
.Pp
.It Ic set t p
(set terminal program)
Re-enter conversational mode
if the processor is still
running.
.Pp
.It Ic P
(proceed)
Get out of
.Tn ODT
mode.
.Pp
.It Ic <break>
If you hit the break key on the console, then the console
.Tn LSI Ns -11
will go into
.Tn ODT
(console debugger mode).
.El
.Ss VAX-11/750 or 11/730
On an 11/750
or an 11/730
the processor is halted whenever the console is not in conversational mode.
.Pp
.Bl -tag -width continue -compact -offset 4n
.It Ic C
Return to conversational mode.
.Pp
.It Ic ret
Return from remote diagnosis mode to local console
mode.
.Pp
.It Ic \&^D
(11/750 only)
When in console mode on an 11/750 which has a remote diagnosis module,
a
.Ic \&^D
will put you in remote diagnosis mode, where the prompt will be
.Ql RDM> .
.El
.Ss VAX 8600 or 8650
The
.Tn VAX
8600 (8650) console normally works in the same way as the 11/750,
except that there are many additional modes and commands.
.Pp
.Bl -tag -width continue -compact -offset 4n
.It Ic c
.It Ic continue
Return to
conversational mode.
.Pp
.It Ic halt
Halt the processor if
.Tn HEX
debug enabled.
.Pp
.It Ic p
Halt the processor if in normal mode.
.El
.Ss VAX 4000, MicroVAX, VAXstation, others
If the console is a serial console, sending a break will likely cause the
machine to halt and enter console mode.
The set of commands available at the console varies from machine to machine,
although there are several commands which are common to most or all models.
.Bl -tag -width continue -compact -offset 4n
.It Ic c
.It Ic continue
Return to the currently executing program.
.Pp
.It Ic halt
Halt the processor.
.Pp
.It Ic help
Display a list of available console commands.
.Pp
.It Xo
.Oo Ic e Oc Ns
.Ic xamine
.Op Cm /bwl Ns
.Op Cm /ins
.Op Cm /pgiv
.Op Cm /n: Ns Ar n
.Op Ar addr
.Xc
Display the contents at address
.Ar addr
according to the options specified.
.Pp
The options are:
.Pp
.Bl -tag -width 5n -compact
.It Cm /bwl
.It Cm /ins
Size of data to examine.
Your choices are examining values as bytes (8 bits), words (16 bits),
or longwords (32 bits).
On systems that support it, you can use the
.Cm /ins
option to display the mnemonic representation of the instruction located at
.Ar addr .
.Pp
.It Cm /pvgi
These options describe the meaning of
.Ar addr .
With the
.Cm /p
option,
.Ar addr
will be treated as an address in physical memory.
With the
.Cm /v
option,
.Ar addr
will be treated as a virtual address.
The
.Cm /g
option will let you examine the general registers.
From 0 to F (base 16), general registers are R0-R12(AP), FP, SP, and PC.
The
.Cm /i
option will let you view the internal processor registers.
These vary from processor to processor, but a relatively complete description
may be found in
.Pa /usr/include/vax/mtpr.h .
.Pp
.It Cm /n: Ns Ar count
The
.Cm /n
option specifies that the command will repeat
.Ar count
times after executing once, automatically incrementing
.Ar addr
while doing so.
.El
.Pp
.It Xo
.Oo Ic d Oc Ns
.Ic eposit
.Op Cm /bwl
.Op Cm /pgiv
.Op Cm /n: Ns Ar n
.Op Ar addr
.Op Ar value
.Xc
Insert the value
.Ar value
into the address
.Ar addr
according to the options specified.
.Pp
The options are:
.Pp
.Bl -tag -width 5n -compact
.It Cm /bwl
Size of data to insert.
Your choices are inserting values as bytes (8 bits), words (16 bits),
or longwords (32 bits).
.Pp
.It Cm /pvgi
These options describe the meaning of
.Ar addr .
Their meanings are identical to their respective meanings in the
.Cm examine
command.
.Pp
.It Cm /n: Ns Ar count
The
.Cm /n
option specifies that the command will repeat
.Ar count
times after executing once, automatically incrementing
.Ar addr
while doing so.
.El
.Pp
.El
.Pp
With the above provisos the console works like any other
.Ux
terminal.
.Sh FILES
.Bl -tag -width /dev/console -compact
.It Pa /dev/console
.El
.Sh SEE ALSO
.Xr tty 4 ,
.Xr reboot 8
.Rs
.%T "VAX Hardware Handbook"
.Re
.Sh HISTORY
The
.Nm cons
interface
appeared in
.Bx 4.0 .
