openbsd/src/share/man/man4/man4.vax/fwio.4
.\"	$OpenBSD: fwio.4,v 1.1 2008/08/18 23:19:18 miod Exp $
.\"
.\" Copyright (c) 2008 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 18 2008 $
.Dt FWIO 4 vax
.Os
.Sh NAME
.Nm fwio
.Nd Firefox Workstation I/O module
.Sh SYNOPSIS
.Cd "fwio* at mbus?"
.Cd "dz* at fwio?"
.Cd "le* at fwio?"
.Cd "sii* at fwio?"
.Sh DESCRIPTION
The
.Nm
driver supports the M-bus I/O module found in VAXstation 35x0 and 38x0 series.
Multiple modules may be installed in the system, and at least one is
necessary for proper operation.
.Pp
The I/O module provides the following devices:
.Pp
.Bl -tag -width 8n -compact -offset indent
.It Xr dz 4
DZ-11 compatible serial interface, featuring a console or printer port on
line 3, a modem port on line 2, and a keyboard and mouse port on lines 0 and 1.
.It Xr le 4
AMD LANCE Ethernet device
.It Xr sii 4
SII DSSI and SCSI controller
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr mbus 4
