openbsd/src/share/man/man4/man4.vax/ibus.4
.\"	$OpenBSD: ibus.4,v 1.3 2003/03/07 11:03:58 hugh Exp $
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Jason L. Wright
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 6, 2003
.Dt IBUS 4 VAX
.Os
.Sh NAME
.Nm ibus
.Nd VAX internal bus
.Sh SYNOPSIS
.Cd "ibus0 at mainbus0"
.Sh DESCRIPTION
The
.Nm ibus
driver supports the internal I/O bus found on QBUS based or QBUS
capable VAXstation, MicroVAX, and VAX 4000 systems.
It is combined with a
.Xr vsbus 4
on the VAX 4000 100 class and certain later MicroVAX 3100 class systems.
.Sh SUPPORTED DEVICES
The following devices are supported on
.Nm ibus .
.Bl -tag -width uba(4) -compact -offset indent
.It Xr le 4
LANCE ethernet interface.
.It Xr uba 4
Qbus and Unibus adapters.
.It Xr ze 4
SGEC ethernet interface.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr le 4 ,
.Xr uba 4 ,
.Xr ze 4
