openbsd/src/share/man/man4/man4.vax/intro.4
.\"	$OpenBSD: intro.4,v 1.33 2011/07/06 18:32:58 miod Exp $
.\"	$NetBSD: intro.4,v 1.3 1996/03/03 17:13:44 thorpej Exp $
.\"
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)intro.4	6.6 (Berkeley) 3/27/91
.\"
.Dd $Mdocdate: July 6 2011 $
.Dt INTRO 4 vax
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files,
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Sx SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Sx DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the
.Tn DEC
.Tn VAX .
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system will have to be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.
Pseudo-devices are not listed.
Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width mscpbus(4) -compact -offset indent
.It Xr asc 4
VAXstation 4000 SCSI controller
.It Xr cons 4
VAX console interface
.It Xr de 4
DEC DEUNA/DELUA Ethernet device
.It Xr dhu 4
DHU-11/DHV-11 communications multiplexer
.It Xr dz 4
DZ-11 multiplexer device interface
.It Xr fwio 4
Firefox Workstation I/O module
.It Xr gpx 4
GPX color frame buffer
.It Xr ibus 4
VAX internal bus
.It Xr lcg 4
Low-Cost Graphics color frame buffer
.It Xr lcspx 4
Low-Cost SPX color frame buffer
.It Xr le 4
AMD LANCE Ethernet device
.It Xr led 4
VAX LED driver
.It Xr legss 4
Low-End Graphics Subsystem
.It Xr lkkbd 4
LK200/LK400 keyboard driver
.It Xr lkms 4
serial mouse driver
.It Xr mbus 4
VAXstation 35x0 and 38x0 bus
.It Xr mscpbus 4
MSCP device bus
.It Xr mt 4
TM78/ TU-78 MASSBUS magtape interface
.It Xr mtc 4
UNIBUS MSCP tape controller driver
.It Xr ncr 4
VAXstation 2000/3100 SCSI controller
.It Xr qe 4
DEC DEQNA Q-bus Ethernet device
.It Xr qsc 4
SC26C94 quad UART controller
.It Xr ra 4
MSCP disk controller interface
.It Xr rx 4
DEC RX02 floppy disk interface
.It Xr sii 4
SII DSSI and SCSI controller
.It Xr smg 4
Small Monochrome Graphics frame buffer
.It Xr uba 4
UNIBUS/Q-bus controller
.It Xr uda 4
UDA50 disk controller interface
.It Xr vsbus 4
VAXstation bus
.It Xr vxtbus 4
VXT2000 bus
.It Xr ze 4
SGEC Ethernet device
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HISTORY
The
.Tn VAX
.Nm intro
first appeared in
.Bx 4.1 .
