openbsd/src/share/man/man4/man4.vax/intro.4
.\"	$OpenBSD: intro.4,v 1.7 2001/08/22 12:15:46 heko Exp $
.\"	$NetBSD: intro.4,v 1.3 1996/03/03 17:13:44 thorpej Exp $
.\"
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)intro.4	6.6 (Berkeley) 3/27/91
.\"
.Dd March 27, 1991
.Dt INTRO 4 vax
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files, 
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Sh VAX DEVICE SUPPORT
This section describes the hardware supported on the
.Tn DEC
.Tn VAX .
Software support for these devices comes in two forms.  A hardware
device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.  When the resultant system is booted, the
autoconfiguration facilities in the system probe for the device
and, if found, enable the software
support for it.  If a
.Tn UNIBUS
device does not respond at autoconfiguration
time it is not accessible at any time afterwards.  To
enable a
.Tn UNIBUS
device which did not autoconfigure, the system will have to
be rebooted.  If a
.Tn MASSBUS
device comes
.Dq on-line
after the autoconfiguration sequence
it will be dynamically autoconfigured into the running system.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr config 8
.Rs
.%T "Building 4.3 BSD UNIX Systems with Config"
.%B SMM
.%N 2
.Re
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.  Pseudo-devices are not listed.
Devices are indicated by their functional interface.
If second vendor products provide functionally identical interfaces
they should be usable with the supplied software.
.Bf -symbolic
Beware,
however, that we promise the software works
ONLY with the hardware indicated on the appropriate manual page.
.Ef
Occasionally, new devices of a similar type may be added
simply by creating appropriate table entries in the driver.
.Pp
.Bl -tag -width mscpbus -offset indent -compact
.It dz
DZ-11 terminal multiplexer.
.It ibus
Internal bus on MicroVAX, VAX 4000 series, and others
.It le
LANCE ethernet interface.
.It mem
Main memory interface.
.It mscpbus
Mass Storage Control Protocol interface.
.It mt
MSCP tape drive interface.
.It ncr
NCR 5380 SCSI controller
.It rx
DEC floppy interface.
.It vsbus
VAXstation internal
.Dq bus .
.It ze
SGEC ethernet interface.
.El
.Sh HISTORY
The section 4
.Nm intro
appeared in
.Bx 4.1 .
