openbsd/src/share/man/man4/man4.vax/kg.4
.\"	$OpenBSD: kg.4,v 1.5 2001/10/05 14:45:54 mpech Exp $
.\"	$NetBSD: kg.4,v 1.3 1996/03/03 17:13:46 thorpej Exp $
.\"
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)kg.4	6.2 (Berkeley) 3/27/91
.\"
.Dd March 27, 1991
.Dt KG 4 vax
.Os
.Sh NAME
.Nm kg
.Nd
.Tn KL-11 Ns / Tn DL-11W
line clock
.Sh SYNOPSIS
.Cd "device kg0 at uba0 csr 0176500 vector kglock"
.Sh DESCRIPTION
A
.Tn KL-11
or
.Tn DL-11W
can be used as an alternate real
time clock
source.
When configured, certain system statistics and, optionally, system profiling
work will be collected each time the clock interrupts.
For optimum accuracy in profiling, the
.Tn DL-11W
should be
configured to interrupt at the highest possible priority
level.
The
.Nm kg
device driver automatically calibrates itself to the
line clock frequency.
.Sh SEE ALSO
.Xr config 8 ,
.Xr kgmon 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.2 .
