openbsd/src/share/man/man4/man4.vax/lcspx.4
.\"	$OpenBSD: lcspx.4,v 1.4 2007/12/09 21:53:58 miod Exp $
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: December 9 2007 $
.Dt LCSPX 4 vax
.Os
.Sh NAME
.Nm lcspx
.Nd Low-Cost SPX color frame buffer
.Sh SYNOPSIS
.Cd "lcspx0 at vsbus0 csr 0x39302000        " Pq "VAXstation 3100 and 4000/90"
.Cd "lcspx0 at vxtbus0                      " Pq "VXT2000"
.Cd "wsdisplay* at lcspx?"
.Sh DESCRIPTION
The
.Nm
is a 8 bit color frame buffer commonly encountered in VAXstation 3100 model 76
and VAXstation 4000/90 systems, as well as VXT2000 terminals.
It is also available as an option for VAXstation 3100 models 20, 28, 30 and 38
systems.
.Pp
The
.Nm
driver interfaces the frame buffer with the
.Xr wscons 4
console framework.
It does not provide direct device driver entry points
but makes its functions available via the internal
.Xr wsdisplay 4
interface.
.Sh SEE ALSO
.Xr gpx 4 ,
.Xr intro 4 ,
.Xr lcg 4 ,
.Xr smg 4 ,
.Xr vsbus 4 ,
.Xr vxtbus 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
