openbsd/src/share/man/man4/man4.vax/lkkbd.4
.\"     $OpenBSD: lkkbd.4,v 1.5 2006/07/31 21:58:55 miod Exp $
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 31, 2006
.Dt LKKBD 4 vax
.Os
.Sh NAME
.Nm lkkbd
.Nd LK200/LK400 keyboard driver
.Sh SYNOPSIS
.Cd "lkkbd0 at dz0 line 0"
.Cd "wskbd* at lkkbd?"
.Sh DESCRIPTION
The
.Nm
driver provides support for DEC LK201 and LK401 keyboards connected to
.Xr dz 4
serial controllers within the
.Xr wscons 4
framework.
.Sh SEE ALSO
.Xr dz 4 ,
.Xr intro 4 ,
.Xr wscons 4 ,
.Xr wskbd 4
.\" when international layouts are added
.\" .Xr wsconsctl 8
.Sh CAVEATS
The LK-201 keyboard does not have a
.Dq Meta
or
.Dq Alt
key.
For convenience,
.Ox
handles the
.Dq Compose
key as an
.Dq Alt
key, unless the
.Dq Shift
key is pressed as well.
.Pp
LK-401 keyboards have two
.Dq Alt
keys and two
.Dq Compose
keys, and do not exhibit this particular behaviour.
