openbsd/src/share/man/man4/man4.vax/lkkbd.4
.\"     $OpenBSD: lkkbd.4,v 1.12 2011/01/30 07:53:57 jmc Exp $
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" Copyright (c) 1999
.\" 	Matthias Drochner.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: January 30 2011 $
.Dt LKKBD 4 vax
.Os
.Sh NAME
.Nm lkkbd
.Nd LK200/LK400 keyboard driver
.Sh SYNOPSIS
.Cd "lkkbd0 at dz0 line 0 " Pq "VAXstation"
.Cd "lkkbd0 at qsc0 line 2" Pq "VXT2000"
.Cd "wskbd* at lkkbd?"
.Cd "option LKKBD_LAYOUT=XXX"
.Sh DESCRIPTION
The
.Nm
driver provides support for DEC LK201 and LK401 keyboards connected to
.Xr dz 4
or
.Xr qsc 4
serial controllers within the
.Xr wscons 4
framework.
.Pp
The
.Nm
driver supports a number of different key mappings which
can be chosen from with the kernel option
.Dq LKKBD_LAYOUT
at compile time or with the utility
.Xr wsconsctl 8
(variable:
.Dq keyboard.encoding )
at runtime.
Other mappings can be used if the whole keymap is replaced by means of
.Xr wsconsctl 8 .
The built-in mappings are at this time:
.Pp
.Bl -tag -width Ds -offset indent -compact
.\" .It KB_BE
.\" (
.\" .Dq be
.\" ) Belgium French.
.\" .It KB_CF
.\" (
.\" .Dq cf
.\" ) Canadian French.
.It KB_DE
.Pq de
German with
.Dq dead accents .
.\" .It KB_DK
.\" (
.\" .Dq dk
.\" ) Danish with
.\" .Dq dead accents .
.\" .It KB_ES
.\" (
.\" .Dq es
.\" ) Spanish.
.It KB_FR
.Pq fr
French.
.\" .It KB_IT
.\" (
.\" .Dq it
.\" ) Italian.
.\" .It KB_NO
.\" (
.\" .Dq no
.\" ) Norwegian with
.\" .Dq dead accents .
.It KB_PT
.Pq pt
Portuguese.
.\" .It KB_SF
.\" (
.\" .Dq sf
.\" ) Swiss French with
.\" .Dq dead accents .
.\" .It KB_SG
.\" (
.\" .Dq sg
.\" ) Swiss German with
.\" .Dq dead accents .
.\" .It KB_SV
.\" (
.\" .Dq sv
.\" ) Swedish with
.\" .Dq dead accents .
.\" .It KB_UK
.\" (
.\" .Dq uk
.\" ) British.
.It KB_US
.Pq us
English/US keyboard mapping (default).
.El
.Pp
.\" The KB_DE, KB_DK, KB_NO, KB_SF, KB_SG and KB_SV mappings can be used in
The KB_DE mapping can be used in
the KB_NODEAD
.Pq .nodead
variant.
This switches off the
.Dq dead accents .
.Sh EXAMPLES
To set a French keyboard layout, use
.Ic wsconsctl keyboard.encoding=fr .
To set it at kernel build time, add
the following to the kernel configuration file:
.Bd -literal -offset indent
option LKKBD_LAYOUT="KB_FR"
.Ed
.Sh SEE ALSO
.Xr dz 4 ,
.Xr intro 4 ,
.Xr qsc 4 ,
.Xr wscons 4 ,
.Xr wskbd 4 ,
.Xr wsconsctl 8
.Sh CAVEATS
The LK-201 keyboard does not have a
.Dq Meta
or
.Dq Alt
key.
For convenience,
.Ox
handles the
.Dq Compose
key as an
.Dq Alt
key, unless the
.Dq Shift
key is pressed as well.
.Pp
LK-401 keyboards have two
.Dq Alt
keys and two
.Dq Compose
keys, and do not exhibit this particular behaviour.
