openbsd/src/share/man/man4/man4.vax/mscpbus.4
.\"	$OpenBSD: mscpbus.4,v 1.10 2008/03/31 12:43:41 jmc Exp $
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 31 2008 $
.Dt MSCPBUS 4 vax
.Os
.Sh NAME
.Nm mscpbus
.Nd MSCP device bus
.Sh SYNOPSIS
.Cd "mscpbus* at uda?"
.Cd "mscpbus* at mtc?"
.Pp
.Cd "ra* at mscpbus? drive? # MSCP disk"
.Cd "rx* at mscpbus? drive? # MSCP floppy"
.Cd "mt* at mscpbus? drive? # MSCP tape"
.Sh DESCRIPTION
The
.Em mscpbus
system provides a uniform and modular system for the implementation
of drivers to control various MSCP devices.
When the system probes the
.Em MSCP
bus, it attaches any devices it finds to the appropriate
drivers.
.Sh SUPPORTED DEVICES
The following devices are supported on
.Nm :
.Pp
.Bl -tag -width mt(4) -compact -offset indent
.It Xr mt 4
TM78/ TU-78 MASSBUS magtape interface
.It Xr ra 4
MSCP disk controller interface
.It Xr rx 4
DEC RX02 floppy disk interface
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr mtc 4 ,
.Xr uda 4
