openbsd/src/share/man/man4/man4.vax/mt.4
.\"	$OpenBSD: mt.4,v 1.13 2015/09/10 15:16:43 schwarze Exp $
.\"	$NetBSD: mt.4,v 1.3 1996/03/03 17:13:52 thorpej Exp $
.\"
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)mt.4	6.4 (Berkeley) 3/27/91
.\"
.Dd $Mdocdate: September 10 2015 $
.Dt MT 4 vax
.Os
.Sh NAME
.Nm mt
.Nd TM78/TU-78 MASSBUS magtape interface
.Sh SYNOPSIS
.Cd "mt* at mscpbus? drive?"
.Sh DESCRIPTION
The TM78/TU-78 combination provides a standard tape drive
interface as described in
.Xr mtio 4 .
Only 1600 and 6250 BPI are supported; the TU-78 runs at 125 IPS
and autoloads tapes.
.Sh DIAGNOSTICS
.Bl -diag
.It mu0: no write ring.
An attempt was made to write on the tape drive
when no write ring was present; this message is written on the terminal of
the user who tried to access the tape.
.It mu0: not online.
An attempt was made to access the tape while it
was offline; this message is written on the terminal of the user
who tried to access the tape.
.It "mu0: can't change density in mid-tape."
An attempt was made to write
on a tape at a different density than is already recorded on the tape.
This message is written on the terminal of the user who tried to switch
the density.
.It "mu0: hard error bnN mbsr=... er=X ds=...."
A tape error occurred
at block
.Em bn ;
the mt error register and drive status register are
printed in octal with the bits symbolically decoded.
Any error is fatal on non-raw tape; when possible the driver will have retried
the operation which failed several times before reporting the error.
.It mu0: blank tape.
An attempt was made to read a blank tape (a tape without even
end-of-file marks).
.It mu0: offline.
During an i/o operation the device was set offline.
If a non-raw tape was used in the access it is closed.
.El
.Sh SEE ALSO
.Xr mt 1 ,
.Xr intro 4 ,
.Xr mscpbus 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.1 .
.Sh BUGS
If a physical error (non-data) occurs,
.Nm
may hang ungracefully.
.Pp
Because 800 BPI
tapes are not supported, the numbering of minor devices
is inconsistent with triple-density tape units.
Unit 0 is drive 0, 1600 BPI.
