openbsd/src/share/man/man4/man4.vax/qsc.4
.\"	$OpenBSD: qsc.4,v 1.3 2007/05/31 19:19:57 jmc Exp $
.\"
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)dz.4	6.3 (Berkeley) 3/27/91
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt QSC 4 vax
.Os
.Sh NAME
.Nm qsc
.Nd SC26C94 quad UART controller
.Sh SYNOPSIS
.Cd "qsc0 at vxtbus0"
.Cd "lkkbd0 at qsc0 line 2"
.Cd "lkms0  at qsc0 line 3"
.Sh DESCRIPTION
The
.Nm
driver provides support for the SC26C94-driven serial ports on the
VXT2000 terminals.
.Pp
On these machines, line 0 is connected to the serial connector on the back,
while line 2 and line 3 are connected to the keyboard and mouse
connectors, which are driven by the
.Nm lkkbd
and
.Nm lkms
drivers, respectively.
Line 1 is not connected to anything.
.Sh FILES
.Bl -tag -width /dev/ttyb[0-3] -compact
.It Pa /dev/ttyb[0-3]
.El
.Sh DIAGNOSTICS
.Bl -diag
.It qsc%d line %d: receiver overrun
The 8 character input fifo has overflowed and incoming data has been lost.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr lkkbd 4 ,
.Xr lkms 4 ,
.Xr tty 4 ,
.Xr vxtbus 4
