openbsd/src/share/man/man4/man4.vax/sii.4
.\"	$OpenBSD: sii.4,v 1.1 2008/08/18 23:19:18 miod Exp $
.\"
.\" Copyright (c) 2008 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 18 2008 $
.Dt SII 4 vax
.Os
.Sh NAME
.Nm sii
.Nd SII DSSI and SCSI controller
.Sh SYNOPSIS
.Cd "sii* at fwio?"
.Cd "scsibus* at sii?"
.Sh DESCRIPTION
The
.Nm
driver supports the SII controller, found on the I/O module on
VAXstation 35x0 and 38x0 series.
The SII controller can act as a DSSI or a SCSI controller, but not both.
Only SCSI operation is supported under
.Ox .
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr fwio 4 ,
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr ss 4 ,
.Xr st 4 ,
.Xr uk 4
