openbsd/src/share/man/man4/man4.vax/tmscp.4
.\"	$NetBSD: tmscp.4,v 1.3 1996/01/07 20:56:59 ragge Exp $
.\" Copyright (c) 1986, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)tmscp.4	6.2 (Berkeley) 3/27/91
.\"
.Dd January 7, 1996
.Dt TMSCP 4 vax
.Os NetBSD
.Sh NAME
.Nm tmscp
.Nd
.Tn DEC TMSCP
magtape interface
.Sh SYNOPSIS
.Cd "tmscp0 at uba? csr 0174500"
.Cd "tms0 at tmscp0 drive ?"
.Sh DESCRIPTION
Tape controllers compatible with the
.Tn DEC
Tape Mass Storage Control Protocol
.Pq Tn TMSCP
architecture
such as the
.Tn TU81
and the
.Tn TK50
provide a standard tape drive interface 
as described in
.Xr mtio 4 .
The controller communicates with the host through a packet
oriented protocol.
Consult the file
.Aq Pa vax/tmscp.h
for a detailed 
description of this protocol.
.Sh DIAGNOSTICS
.Bl -diag
.It tmscp controller failed to init.
The controller initialization procedure failed.
This probably indicates a hardware problem.
.Pp
.It tmscp%d: sa 0%o, state %d.
(Additional status information given after a hard
.Tn I/O
error.)
The values of the controller status register and the internal
driver state are printed.
.Pp
.It tmscp%d: random interrupt ignored.
An unexpected interrupt was received (e.g. when no
.Tn I/O
was
pending).  The interrupt is ignored.
.Pp
.It tmscp%d:  interrupt in unknown state %d ignored.
An interrupt was received when the driver was in an unknown
internal state.  Indicates a hardware problem or a driver bug.
.Pp
.It tmscp%d:  fatal error (0%o).
The controller detected a ``fatal error'' in the status returned
to the host.  The contents of the status register are displayed.
.Pp
.It OFFLINE.
(Additional status information given after a hard
.Tn I/O
error.)
A hard
.Tn I/O
error occurred because the drive was not on-line.
.Pp
.It tmscp%d: hard error
.It tmscp%d: soft error.
These errors precede an interpretation of a
.Tn TMSCP
error message
returned by the controller to the host.
.Tn TMSCP
errors may be:
.Pp
.Bd -filled -offset indent -compact
.It controller error, event 0%o.
.It host memory access error, event 0%o, addr 0%o.
.It tape transfer error, unit %d, grp 0x%x, event 0%o.
.It STI error, unit %d, event 0%o.
.It STI Drive Error Log, unit %d, event 0%o.
.It STI Formatter Error Log, unit %d, event 0%o.
.It unknown error, unit %d, format 0%o, event 0%o.
.Ed
.El
.Sh SEE ALSO
.Xr mt 1 ,
.Xr tar 1 ,
.Xr tp 1 ,
.Xr mtio 4 ,
.Xr tm 4 ,
.Xr ts 4 ,
.Xr ut 4 ,
.Xr mt 4 ,
.Xr ht 4 ,
.Xr dmesg 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 .
.Sh BUGS
Should be synced together with the
.Tn MSCP
devices.
