openbsd/src/share/man/man4/man4.vax/uba.4
.\"	$OpenBSD: uba.4,v 1.14 2011/07/06 18:32:58 miod Exp $
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: July 6 2011 $
.Dt UBA 4 vax
.Os
.Sh NAME
.Nm uba
.Nd UNIBUS/Q-bus controller
.Sh SYNOPSIS
.Cd "uba0 at ibus0"
.Cd "uba0 at mbus0 mid 0                    " Pq "VAXstation 35x0 and 38x0"
.Sh DESCRIPTION
The
.Nm uba
driver supports UNIBUS and Q-bus controllers found
on many VAX systems.
.Sh SUPPORTED DEVICES
The following devices are supported on
.Nm :
.Pp
.Bl -tag -width mtc(4) -compact -offset indent
.It Xr de 4
DEC DEUNA/DELUA Ethernet device
.It Xr dhu 4
DHU-11/DHV-11 communications multiplexer
.It Xr dz 4
DZ-11 multiplexer device interface
.It Xr mtc 4
UNIBUS MSCP tape controller driver
.It Xr qe 4
DEC DEQNA Q-bus Ethernet device
.It Xr uda 4
UDA50 disk controller interface
.El
.Sh SEE ALSO
.Xr intro 4
