openbsd/src/share/man/man4/man4.vax/uba.4
.\"	$OpenBSD: uba.4,v 1.5 2003/03/07 11:20:32 hugh Exp $
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Jason L. Wright
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 6, 2003
.Dt UBA 4 vax
.Os
.Sh NAME
.Nm uba
.Nd Unibus/Qbus controller
.Sh SYNOPSIS
.Cd "uba0 at ibus0"
.Sh DESCRIPTION
The
.Nm uba
driver supports Unibus and Qbus controllers found
on many VAX systems.
.Sh SUPPORTED DEVICES
The following devices are supported on
.Nm uba .
.Bl -tag -width mtc(4) -compact -offset indent
.It Xr dhu 4
DHU-11 terminal multiplexor.
.It Xr dz 4
DZ-11 terminal multiplexer.
.It Xr mtc 4
MSCP tape controller.
.It Xr uda 4
MSCP disk controller interface.
.Sh SEE ALSO
.Xr dhu 4 ,
.Xr dz 4 ,
.Xr intro 4 ,
.Xr mtc 4 ,
.Xr uda 4
