openbsd/src/share/man/man4/man4.vax/vsbus.4
.\"	$OpenBSD: vsbus.4,v 1.15 2011/09/03 20:46:49 miod Exp $
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: September 3 2011 $
.Dt VSBUS 4 vax
.Os
.Sh NAME
.Nm vsbus
.Nd VAXstation bus
.Sh SYNOPSIS
.Cd "vsbus0 at mainbus0"
.Sh DESCRIPTION
The
.Nm vsbus
driver supports the internal I/O bus found on VAXstation 3100 and
4000 class systems, MicroVAX 3100 class systems, and VAX 4000 100
class systems.
.Sh SUPPORTED DEVICES
The following devices are supported on
.Nm :
.Pp
.Bl -tag -width 8n -compact -offset indent
.It Xr asc 4
VAXstation 4000 SCSI controller
.It Xr dz 4
DZ-11 multiplexer device interface
.It Xr gpx 4
GPX color frame buffer
.It Xr lcg 4
Low-Cost Graphics color frame buffer
.It Xr lcspx 4
Low-Cost SPX color frame buffer
.It Xr le 4
AMD LANCE Ethernet device
.It Xr ncr 4
VAXstation 2000/3100 SCSI controller
.It Xr smg 4
Small Monochrome Graphics frame buffer
.It Xr vsaudio 4
VAXstation audio device
.It Xr ze 4
SGEC Ethernet device
.El
.Sh SEE ALSO
.Xr intro 4
