openbsd/src/share/man/man4/man4.vax/vxtbus.4
.\"	$OpenBSD: vxtbus.4,v 1.4 2008/03/31 12:43:41 jmc Exp $
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 31 2008 $
.Dt VXTBUS 4 vax
.Os
.Sh NAME
.Nm vxtbus
.Nd VXT2000 bus
.Sh SYNOPSIS
.Cd "vxtbus0 at mainbus0"
.Sh DESCRIPTION
The
.Nm
driver is an abstraction for the internal I/O bus found on the VXT2000
terminal.
.Sh SUPPORTED DEVICES
The following devices are supported on
.Nm :
.Pp
.Bl -tag -width 8n -compact -offset indent
.It Xr lcspx 4
Low-Cost SPX color frame buffer
.It Xr qsc 4
SC26C94 quad UART controller
.It Xr ze 4
SGEC Ethernet device
.El
.Sh SEE ALSO
.Xr intro 4
