openbsd/src/usr.sbin/ntpd/ntpctl.8
.\" $OpenBSD: ntpctl.8,v 1.1 2013/10/04 14:28:16 phessler Exp $
.\"
.\" Copyright (c) 2012 Mike Miller <mmiller@mgm51.com>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF MIND, USE, DATA OR PROFITS, WHETHER IN
.\" AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT
.\" OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 4 2013 $
.Dt NTPCTL 8
.Os
.Sh NAME
.Nm ntpctl
.Nd "control program for the Network Time Protocol daemon"
.Sh SYNOPSIS
.Nm ntpctl
.Bk -words
.Op Fl s Ar modifier
.Ek
.Sh DESCRIPTION
The
.Nm
program displays information about the running
.Xr ntpd 8
daemon.
.Pp
The options are as follows:
.Bl -tag -width "-s modifierX"
.It Fl s Ar modifier
Show the data specified by
.Ar modifier :
.Bl -tag -width XXXXXXXXXX -compact
.Pp
.It Fl s Cm status
Show the status of peers and sensors, and whether the system clock is
synced.  When the system clock is synced, the stratum is displayed.
When the system clock is not synced, the offset of the system clock,
as reported by the
.Xr adjtime 2
system call, is displayed.
.Pp
.It Fl s Cm peers
Shows the following information about each peer: weight, trustlevel,
stratum, number of seconds until the next poll, polling interval
in seconds, and offset, network delay and network jitter in
milliseconds.  When the system clock is synced to a peer, an asterisk
is displayed to the left of the weight column for that peer.
.Pp
.It Fl s Cm sensors
Shows the following information about each sensor: weight, sensor "good"
status, stratum, and offset and the configured correction in
milliseconds.
When the system clock is synced to a sensor, an asterisk
is displayed to the left of the weight column for that sensor.
.Pp
.It Fl s Cm all
Shows all of the above.
.El
.Sh FILES
.Bl -tag -width "/var/db/ntpd.driftXXX" -compact
.It Pa /var/run/ntpd.sock
Socket file for communication with
.Xr ntpd 8 .
.El
.Sh SEE ALSO
.Xr adjtime 2 ,
.Xr ntpd 8 ,
.Xr ntpd.conf 5
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 5.3 .
