openbsd/src/usr.sbin/ntpd/ntpd.conf.5
.\" $OpenBSD: ntpd.conf.5,v 1.5 2004/07/09 10:56:35 henning Exp $
.\"
.\" Copyright (c) 2003, 2004 Henning Brauer <henning@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF MIND, USE, DATA OR PROFITS, WHETHER IN
.\" AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT
.\" OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd June 17, 2004
.Dt NTPD.CONF 5
.Os
.Sh NAME
.Nm ntpd.conf
.Nd Network Time Protocol daemon configuration file
.Sh DESCRIPTION
The
.Xr ntpd 8
daemon implements the Network Time Protocol
.Pq NTP
version 4.
This manual page describes the format of its configuration file,
.Nm .
The settings are as follows:
.Bl -tag -width "listenonXX"
.It Ar listen on
Specify a local IP address the
.Xr ntpd 8
daemon should listen on.
It can appear multiple times:
.Xr ntpd 8
will listen on each given address.
If
.Sq *
is given as an address,
.Xr ntpd 8
will listen on all local addresses.
.Xr ntpd 8
does not listen on any address by default.
For example:
.Bd -literal -offset indent
listen on *
listen on 127.0.0.1
listen on ::1
.Ed
.It Ar server
Specify the IP address or the hostname of an NTP
server to syncronize to.
If the hostname resolves to multiple IPv4 and/or IPv6 adresses,
.Xr ntpd 8
uses the first address.
If it does not get a reply,
.Xr ntpd 8
retries with the next address and continues to do so unless a working address
is found.
For example:
.Bd -literal -offset indent
server 10.0.0.2
server ntp.example.org
.Ed
.It Ar servers
As with
.Ar server ,
specify the IP address or hostname of an ntp server to synchronize to.
Should the hostname resolve to multiple IP adresses,
.Xr ntpd 8
will try synchronize to all of them.
For example:
.Bd -literal -offset indent
servers pool.ntp.org
.Ed
.El
.Sh FILES
.Bl -tag -width "/etc/ntpd.conf" -compact
.It Pa /etc/ntpd.conf
.Nm
configuration file
.El
.Sh SEE ALSO
.Xr ntpd 8 ,
.Xr rdate 8
.Sh HISTORY
The
.Nm
file format first appeared in
.Ox 3.6 .
