openbsd/src/sbin/mount_ntfs/mount_ntfs.8
.\" $OpenBSD: mount_ntfs.8,v 1.16 2020/04/23 21:28:09 jmc Exp $
.\" $NetBSD: mount_ntfs.8,v 1.13 2003/02/14 16:21:48 grant Exp $
.\"
.\" Copyright (c) 1993,1994 Christopher G. Demetriou
.\" Copyright (c) 1999 Semen Ustimenko
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	Id: mount_ntfs.8,v 1.3 1999/05/04 11:34:33 jkoshy Exp
.\"
.Dd $Mdocdate: April 23 2020 $
.Dt MOUNT_NTFS 8
.Os
.Sh NAME
.Nm mount_ntfs
.Nd mount an NTFS file system
.Sh SYNOPSIS
.Nm mount_ntfs
.Op Fl ai
.Op Fl g Ar gid
.Op Fl m Ar mask
.Op Fl o Ar options
.Op Fl u Ar uid
.Ar special
.Ar node
.Sh DESCRIPTION
The
.Nm
command attaches the NTFS filesystem residing on the device
.Ar special
to the global filesystem namespace at the location
indicated by
.Ar node .
This command is invoked by
.Xr mount 8
when using the syntax
.Bd -ragged -offset 4h
.Nm mount Op options
-t ntfs
.Ar special node
.Ed
.Pp
The
.Ar special
device is either a
.Xr disklabel 8
UID (DUID) or an entry in
.Pa /dev .
If it is a DUID,
it will be automatically mapped to the appropriate entry in
.Pa /dev .
In either case the partition must be present
in the disklabel loaded from the device.
The partition name is the last letter in the entry name.
For example, /dev/sd0a and 3eb7f9da875cb9ee.a both refer to the
.Sq a
partition.
.Pp
The supported NTFS versions include both NTFS4, as used by Microsoft
Windows NT 4.0, and NTFS5, as used by Microsoft Windows 2000 and XP.
Only read-only operation is permitted, which is automatically enforced.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl a
Force behaviour to return MS-DOS 8.3 names also on
.Fn readdir .
.It Fl g Ar gid
Set the group of the files in the file system to
.Ar gid .
The default group is the group of the directory
on which the file system is being mounted.
.It Fl i
Make name lookup case insensitive for all names except POSIX names.
.It Fl m Ar mask
Specify the maximum file permissions for files
in the file system.
.It Fl o Ar options
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
.It Fl u Ar uid
Set the owner of the files in the file system to
.Ar uid .
The default owner is the owner of the directory
on which the file system is being mounted.
.El
.Sh FEATURES
.Ss NTFS file attributes
NTFS file attributes can be accessed in the following way:
.Bd -literal -offset indent
foo[[:ATTRTYPE]:ATTRNAME]
.Ed
.Pp
.Sq ATTRTYPE
is one of identifier listed in $AttrDef file of volume.
Default is $DATA.
.Sq ATTRNAME
is an attribute name.
Default is none.
.Pp
.Sy Examples :
.Pp
To get volume name (in Unicode):
.Bd -literal -offset indent
# cat /mnt/\e$Volume:\e$VOLUME_NAME
.Ed
.Pp
To read directory raw data:
.Bd -literal -offset indent
# cat /mnt/foodir:\e$INDEX_ROOT:\e$I30
.Ed
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr disklabel 5 ,
.Xr fstab 5 ,
.Xr disklabel 8 ,
.Xr mount 8
.Sh HISTORY
Support for NTFS first appeared in
.Fx 3.0 .
It was later ported to
.Ox
and first appeared in
.Ox 3.4 .
.Sh AUTHORS
.An -nosplit
NTFS kernel implementation,
.Nm mount_ntfs ,
and this manual were originally written by
.An Semen Ustimenko Aq Mt semenu@FreeBSD.org .
.Pp
The
.Ox
port was done by
.An Julien Bordet Aq Mt zejames@greyhats.org .
.Sh BUGS
Only read support is enabled.
.Pp
If the NTFS partition is marked as
.Ql dynamic
under Microsoft Windows XP,
it won't be possible to access it under
.Ox
anymore.
