openbsd/src/usr.bin/which/whereis.1
.\"	$OpenBSD: whereis.1,v 1.19 2019/07/11 06:30:35 deraadt Exp $
.\"	$NetBSD: whereis.1,v 1.4 1995/08/31 21:54:51 jtc Exp $
.\"
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)whereis.1	8.3 (Berkeley) 4/27/95
.\"
.Dd $Mdocdate: July 11 2019 $
.Dt WHEREIS 1
.Os
.Sh NAME
.Nm whereis
.Nd locate programs
.Sh SYNOPSIS
.Nm whereis
.Op Fl a
.Ar name ...
.Sh DESCRIPTION
The
.Nm
utility checks the standard binary directories for the specified
.Ar name ,
printing out the paths of any it finds that are executable by the
user.
.Pp
The path searched is:
.\" The path below should be the expansion of _PATH_STDPATH from <paths.h>
.D1 /usr/bin:/bin:/usr/sbin:/sbin:/usr/X11R6/bin:/usr/local/bin:/usr/local/sbin
.Pp
If the
.Fl a
flag is given,
.Nm
will return a list of all matches instead of just the first match.
.Sh EXIT STATUS
The
.Nm
utility exits with one of the following values:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It 0
All names were successfully resolved.
.It 1
Some names were resolved but not all.
.It 2
No names were resolved.
.El
.Sh SEE ALSO
.Xr apropos 1 ,
.Xr find 1 ,
.Xr locate 1 ,
.Xr which 1
.Sh HISTORY
The
.Nm
command first appeared in
.Bx 2 ,
but the original version was legally tainted
and was not included as part of the
.Bx 4.4
release, such that most of the original functionality was lost.
.Pp
The
.Fl a
option first appeared in
.Ox 2.3 .
.Sh AUTHORS
The original version was written by
.An Bill Joy .
