openbsd/src/usr.bin/which/which.1
.\"	$OpenBSD: which.1,v 1.25 2016/01/14 21:54:24 millert Exp $
.\"
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)which.1	6.3 (Berkeley) 4/23/91
.\"
.Dd $Mdocdate: January 14 2016 $
.Dt WHICH 1
.Os
.Sh NAME
.Nm which
.Nd locate a program file (or files) in the path
.Sh SYNOPSIS
.Nm which
.Op Fl a
.Ar name ...
.Sh DESCRIPTION
.Nm
takes a list of names and looks for the files which would be
executed had these names been given as commands.
Each argument is searched for along the user's path.
.Pp
If the
.Fl a
flag is given,
.Nm
will return a list of all matches instead of just the first match.
.Sh ENVIRONMENT
The following environment variables affect the execution of
.Nm which :
.Bl -tag -width PATH
.It Ev PATH
A colon-separated list of directories in which to find executables.
If
.Ev PATH
is not set or is empty,
.Nm
will use the system's default search path.
.El
.Sh EXIT STATUS
The
.Nm
utility exits with one of the following values:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It 0
All names were successfully resolved.
.It 1
Some names were resolved but not all.
.It 2
No names were resolved.
.El
.Sh DIAGNOSTICS
A diagnostic is given if an executable file with the argument
name was not found in the path.
.Sh SEE ALSO
.Xr csh 1 ,
.Xr find 1 ,
.Xr locate 1 ,
.Xr whereis 1 ,
.Xr environ 7
.Sh STANDARDS
.Nm
also exists as a built-in to
.Xr csh 1 ,
though with a different syntax.
.Sh HISTORY
A
.Nm
command first appeared in
.Bx 3.0 .
.Pp
The
.Fl a
option first appeared in
.Ox 2.3 .
