openbsd/src/usr.bin/pnpinfo/pnpinfo.8
.\"	$OpenBSD: pnpinfo.8,v 1.2 1998/09/27 16:57:49 aaron Exp $
.\" Copyright (c) 1996, Sujal M. Patel
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Sujal M. Patel
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 7, 1996
.Dt PNPINFO 8
.Os
.Sh NAME
.Nm pnpinfo
.Nd reports information about Plug-n-Play ISA devices
.Sh SYNOPSIS
.Nm pnpinfo
.Sh DESCRIPTION
.Nm pnpinfo
reports information about Plug-n-Play ISA devices.  Some of the information,
such as the vendor ID, serial number, I/O ports, IRQ, etc. are useful when
configuring a kernel with ISA PnP devices.
.Sh BUGS
A few of the tags are unimplemented (enough exist for 99% of PnP cards).
.Sh SEE ALSO
.Xr pnp 4
.Sh HISTORY
The
.Nm
utility first appeared in
.Tn FreeBSD
2.2.
.Sh AUTHOR
.Bl -tag
Sujal M. Patel, smpatel@umiacs.umd.edu
.El
