openbsd/src/usr.bin/cvs/cvsrc.5
.\"	$OpenBSD: cvsrc.5,v 1.2 2004/07/26 17:29:49 jfb Exp $
.\"
.\" Copyright (c) 2004 Jean-Francois Brousseau <jfb@openbsd.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL
.\" THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
.\" EXEMPLARY, OR CONSEQUENTIAL  DAMAGES (INCLUDING, BUT NOT LIMITED TO,
.\" PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
.\" OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
.\" ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 14, 2004
.Dt CVSRC 5
.Os
.Sh NAME
.Nm cvsrc
.Nd startup resource file for CVS
.Sh DESCRIPTION
The cvsrc file provides a way to give the
.Xr cvs 1
program implicit global options and command-specific options.
The file is read on startup unless the
.Fl f
option is specified.
.Pp
The format of each line is as follows:
.Pp
.Dl command [arg ...]
.Pp
where
.Ar command
is either the `cvs' keyword to specify global options, one of the supported
.Xr cvs 1
commands or a command alias.
Arguments following
.Ar command
will be added implicitly to the appropriate command's argument vector if it is
run.
Empty lines and lines specifying no optional arguments are ignored.
Lines whose
.Ar command
argument is not a valid command will generate a warning when running without
the
.Fl q
or
.Fl Q
flags.
.Sh EXAMPLES
Need to put in some examples!
.Sh SEE ALSO
.Xr cvs 1
