openbsd/src/usr.bin/signify/signify.1
.\" $OpenBSD: signify.1,v 1.12 2014/01/10 04:34:24 tedu Exp $
.\"
.\"Copyright (c) 2013 Marc Espie <espie@openbsd.org>
.\"Copyright (c) 2013 Ted Unangst <tedu@openbsd.org>
.\"
.\"Permission to use, copy, modify, and distribute this software for any
.\"purpose with or without fee is hereby granted, provided that the above
.\"copyright notice and this permission notice appear in all copies.
.\"
.\"THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\"WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\"MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\"ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\"WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\"ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\"OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.Dd $Mdocdate: January 10 2014 $
.Dt SIGNIFY 1
.Os
.Sh NAME
.Nm signify
.Nd cryptographically sign and verify files
.Sh SYNOPSIS
.Nm signify
.Fl G
.Op Fl n
.Fl p Ar pubkey
.Fl s Ar seckey
.Nm signify
.Fl I
.Op Fl o Ar sigfile
.Op Fl p Ar pubkey
.Op Fl s Ar seckey
.Nm signify
.Fl S
.Op Fl e
.Op Fl o Ar sigfile
.Fl s Ar seckey
.Ar message
.Nm signify
.Fl V
.Op Fl e
.Op Fl o Ar sigfile
.Fl p Ar pubkey
.Ar message
.Sh DESCRIPTION
The
.Nm
utility creates and verifies cryptographic signatures for
an input file
.Ar message .
The mode of operation is selected with the following options:
.Bl -tag -width Dsssigfile
.It Fl G
Generate a new keypair.
.It Fl I
Inspect the specified keys or signature and print their fingerprint.
.It Fl S
Sign the input file.
.It Fl V
Verify the input file and signature match.
.El
.Pp
The other options are as follows:
.Bl -tag -width Dsssignature
.It Fl e
Embed the message after the signature when signing.
For verification, extract the message from the signature.
.It Fl n
Do not ask for a passphrase during key generation.
Otherwise,
.Nm
will prompt the user for a passphrase on the terminal.
.It Fl o Ar sigfile
The signature file to create or verify.
The default is
.Ar message Ns .sig .
.It Fl p Ar pubkey
Public key produced by
.Fl G ,
and used by
.Fl V
to check a signature.
.It Fl s Ar seckey
Secret (private) key produced by
.Fl G ,
and used by
.Fl S
to sign a message.
.El
.Pp
The key and signature files created by
.Nm
have the same format.
The first line of the file is a free form text comment that may be edited,
so long as it does not exceed a single line.
The second line of the file is the actual key or signature base64 encoded.
.Sh EXIT STATUS
.Ex -std signify
It may fail because of one of the following reasons:
.Pp
.Bl -bullet -compact
.It
Some necessary files do not exist.
.It
Entered passphrase is incorrect.
.It
The message file was corrupted and its signature does not match.
.It
The message file is too large.
.El
.Sh EXAMPLES
Create a new keypair:
.Dl $ signify -G -p newkey.pub -s newkey.sec
.Pp
Sign a file, specifying a signature name:
.Dl $ signify -S -s key.sec -o msg.sig message.txt
.Pp
Verify a signature, using the default signature name:
.Dl $ signify -V -p key.pub generalsorders.txt
.Pp
Verify a release directory:
.Dl $ signify -p /etc/signify/55base.pub -V SHA256 && sha256 -c SHA256
.Pp
.Sh SEE ALSO
.Xr fw_update 1 ,
.Xr pkg_add 1 ,
.Xr sha256 1
.Sh HISTORY
The
.Nm
command first appeared in
.Ox 5.5 .
