openbsd/src/usr.bin/signify/signify.1
.\" $OpenBSD: signify.1,v 1.6 2014/01/01 17:50:33 tedu Exp $
.\"
.\"Copyright (c) 2013 Marc Espie <espie@openbsd.org>
.\"Copyright (c) 2013 Ted Unangst <tedu@openbsd.org>
.\"
.\"Permission to use, copy, modify, and distribute this software for any
.\"purpose with or without fee is hereby granted, provided that the above
.\"copyright notice and this permission notice appear in all copies.
.\"
.\"THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\"WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\"MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\"ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\"WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\"ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\"OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.Dd $Mdocdate: January 1 2014 $
.Dt SIGNIFY 1
.Os
.Sh NAME
.Nm signify
.Nd cryptographically sign and verify files
.Sh SYNOPSIS
.Nm signify
.Op Fl n
.Op Fl i Ar input
.Op Fl o Ar output
.Op Fl p Ar pubkey
.Op Fl s Ar seckey
.Fl G | S | V
.Sh DESCRIPTION
The
.Nm
utility creates and verifies cryptographic signatures.
The mode of operation is selected by the
.Fl G ,
.Fl S ,
or
.Fl V
options.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl G
Generate a new keypair.
.It Fl i Ar input
Input file to sign or verify.
.It Fl n
Do not ask for a passphrase during key generation.
Otherwise,
.Nm
will prompt the user for a passphrase on the terminal.
.It Fl o Ar output
The signature file to create or verify.
The default is
.Ar input Ns .sig .
.It Fl p Ar pubkey
Public key produced by
.Ar G ,
and used by
.Ar V
to check a signature.
.It Fl S
Sign the input file.
.It Fl s Ar seckey
Secret (private) key produced by
.Ar G ,
and used by
.Ar S
to sign a message.
.It Fl V
Verify the input file and signature match.
.El
.Pp
The key and signature files created by
.Nm
have the same format.
The first line of the file is a free form text comment that may be edited,
so long as it does not exceed a single line.
The second line of the file is the actual key or signature base64 encoded.
.Sh EXIT STATUS
.Ex -std signify
It may fail because of one of the following reasons:
.Pp
.Bl -bullet -compact
.It
Some necessary files do not exist.
.It
Entered passphrase is incorrect.
.It
The message file was corrupted and its signature does not match.
.It
The message file is too large.
.El
.Sh EXAMPLES
Create a new keypair:
.Dl $ signify -p newkey.pub -s newkey.sec -G
.Pp
Sign a file, specifying a signature name:
.Dl $ signify -s key.sec -i message.txt -o msg.sig -S
.Pp
Verify a signature, using the default signature name:
.Dl $ signify -p key.pub -i generalsorders.txt -V
.Sh SEE ALSO
.Xr cmp 1 ,
.Xr sha256 1 ,
.Xr ssh 1
.Sh HISTORY
The
.Nm
command first appeared in
.Ox 5.5
