openbsd/src/usr.sbin/slstats/slstats.8
.\"	$OpenBSD: slstats.8,v 1.9 2000/11/09 17:53:24 aaron Exp $
.\"	$NetBSD: slstats.8,v 1.2.6.1 1996/06/07 01:42:24 thorpej Exp $
.Dd July 5, 1993
.Dt SLSTATS 8
.Os
.Sh NAME
.Nm slstats
.Nd report slip statistics
.Sh SYNOPSIS
.Nm slstats
.Op Fl M Ar core
.Op Fl N Ar system
.Op Fl v
.Op Fl i Ar interval
.Op Ar unit-number
.Sh DESCRIPTION
The
.Nm slstats
utility reports slip-related statistics for the
.Nm sl Ns
.So
.Ar unit-number
.Sc
interface.
If the
.Nm unit-number
is unspecified, it defaults to 0.
These statistics are displayed at regular intervals.
.Pp
The display is split horizontally into input and output sections
containing columns of statistics describing the properties and volume
of packets received and transmitted by the specified interface.
.Pp
The first report will consist of a snapshot of the interface's present
statistics.
All further output will describe activity between report intervals.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl v
Display additional statistics demonstrating the efficacy of VJ header
compression and providing more explicit information on failure
distribution.
.It Fl i
Specifies the interval between reports.
The default interval is 5 seconds.
.It Fl M Ar core
Extract values associated with the name list from the specified.
.It Fl N Ar system
Extract the name list from the specified system instead of the default
.Pa /bsd .
.El
.Pp
The following fields are printed on the input side:
.Bl -tag -width search
.It Li IN
The total number of bytes received by this interface.
.It Li PACK
The total number of packets received by this interface.
.It Li COMP
The number of compressed TCP packets received by this interface.
.It Li UNCOMP
The number of uncompressed TCP packets received by this interface.
.It Li ERR
The number of packets received by this interface of unknown type.
.It Li TOSS
The number of packets dropped on reception by this interface.
Only reported when the
.Fl v
option is specified.
.It Li IP
The total number of non-TCP packets received by this interface.
Only reported when the
.Fl v
option is specified.
.El
.Pp
The following fields are printed on the output side:
.Bl -tag -width search
.It Li OUT
The total number of bytes transmitted from this interface.
.It Li PACK
The total number of packets transmitted from this interface.
.It Li COMP
The number of TCP packets compressed and then transmitted from this interface.
.It Li UNCOMP
The number of uncompressed TCP packets transmitted from this interface.
.It Li IP
The total number of non-TCP packets transmitted from this interface.
.It Li SEARCH
The number of searches for the cached header entry for a compressed
packet.
Only reported when the
.Fl v
option is specified.
.It Li MISS
The number of failed searches for the cached header entry for a
compressed packet.
Only reported when the
.Fl v
option is specified.
.El
.Sh BUGS
Should take an interface name and not a unit number.
.Sh SEE ALSO
.Xr sliplogin 8
