openbsd/src/usr.sbin/watchdogd/watchdogd.8
.\" $OpenBSD: watchdogd.8,v 1.1 2005/08/08 12:08:56 mbalmer Exp $
.\"
.\" Copyright (c) 2005 Marc Balmer <marc@msys.ch>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd July 7, 2005
.Dt WATCHDOGD 8
.Os
.Sh NAME
.Nm watchdogd
.Nd watchdog timer retrigger daemon
.Sh SYNOPSIS
.Nm watchdogd
.Op Fl d
.Op Fl i Ar interval
.Op Fl p Ar period
.Sh DESCRIPTION
.Nm
is a daemon to periodically retrigger the watchdog timer device from
userland.  The watchdog timeout period and the retrigger
interval can be specified on the command line.  The period defaults to
30 seconds.  If no interval is specified, the value of the period divided
by three is used.  The daemon will detach from the controlling terminal
and run in the background unless the
.Fl d
command line option is set.
.Sh SEE ALSO
.Xr watchdog 4 ,
.Xr elansc 4 ,
.Xr geodesc 4
.Sh HISTORY
The
.Nm
program 
first appeared in
.Ox 3.8 .
