openbsd/src/share/man/man4/man4.aviion/dart.4
.\"	$OpenBSD: dart.4,v 1.2 2013/10/15 20:34:46 jmc Exp $
.\"
.\" Copyright (c) 2013 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 15 2013 $
.Dt DART 4 aviion
.Os
.Sh NAME
.Nm dart
.Nd MC68681 or MC68692 dual UART
.Sh SYNOPSIS
.Cd "dart0 at syscon0 offset 0x82000"
.Cd "dart1 at syscon0 offset 0x82c00"
.Sh DESCRIPTION
The MC68681 and MC68692 dual asynchronous receiver/transmitter
.Pq Tn DUART
component provides two serial ports, as well as a 16-bit programmable
counter/timer.
.Pp
The
.Nm
driver provides support for the two serial ports found on board all
AViiON systems.
.Pp
The
.Nm
serial ports have a two character buffer on the transmit path, and a four
character buffer on the receive path.
.Pp
The following link speeds are supported by the
.Nm
driver:
50, 75, 110, 134.5, 150, 200, 300, 600, 1050, 1200, 1800, 200, 2400, 4800,
7200, 9600, 19200 and 38400 bps.
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/tty[ab] dart0 serial ports
.It Pa /dev/tty[cd] dart1 serial ports
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr tty 4
