openbsd/src/share/man/man4/man4.aviion/le.4
.\"	$OpenBSD: le.4,v 1.6 2013/10/15 18:13:53 miod Exp $
.\"
.\" Copyright (c) 2003 Paul Weissmann
.\" All rights reserved.
.\"
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: October 15 2013 $
.Dt LE 4 aviion
.Os
.Sh NAME
.Nm le
.Nd AMD LANCE or ILACC Ethernet device
.Sh SYNOPSIS
.Cd "le0 at syscon? offset 0x8c000              " Pq "on-board, AV4000 family"
.Cd "le0 at syscon? offset 0xb0100              " Pq "on-board, AV530 family"
.Cd "le1 at syscon? offset 0xb0140              " Pq "on-board, AV530 family"
.Pp
.Cd "le* at vme? a32 0x00900000 a16 0x4000 ipl 3"
.Cd "le* at vme? a32 0x55540000 a16 0x8600 ipl 3"
.Cd "le* at vme? a32 0x55900000 a16 0x4000 ipl 3"
.Cd "le* at vme? a32 0x55980000 a16 0x5000 ipl 3"
.Sh DESCRIPTION
The
.Nm
driver provides access to the on-board AMD 7990/LANCE or AMD 79900/ILACC
interface, as well as the VME Interphase 3207 Hawk Ethernet boards.
This in turn provides an interface to the
.Tn Ethernet
network.
.\" XXX this section needs a rework -- miod
.\" .Sh HARDWARE CONFIGURATION
.\" The card's base address
.\" .Po
.\" matching the
.\" .Em addr
.\" locator on the configuration line
.\" .Pc
.\" is defined through three sets of DIP switches,
.\" .Dq SW1
.\" and
.\" .Dq SW2 ,
.\" located in the middle of the board, near the space between the two
.\" VME connectors, and
.\" .Dq SW3 ,
.\" closer to the AM7990DC chip at the bottom edge.
.\" .Pp
.\" The only supported configurations are:
.\" .Bl -column "xxxxxxxx" "xxxxxxxx" "xxxxxxxx" "0xffffffff"
.\" .It Li SW1 Ta SW2 Ta SW3 Ta Address
.\" .It " "
.\" .It Li "UUU_UU_U" Ta "U__U____" Ta "______U_" Ta "0xffff1200"
.\" .It Li "UUU_U_UU" Ta "U__U_U__" Ta "______U_" Ta "0xffff1400"
.\" .It Li "UUU_U__U" Ta "U__UU___" Ta "______U_" Ta "0xffff1600"
.\" .It Li "U_U_U_UU" Ta "U__UUU__" Ta "______U_" Ta "0xffff5400"
.\" .It Li "U_U_U__U" Ta "U_U_____" Ta "______U_" Ta "0xffff5600"
.\" .It Li "_U_UU_UU" Ta "U_U__U__" Ta "______U_" Ta "0xffffa400"
.\" .El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr inet 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr vme 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
