openbsd/src/share/man/man4/man4.aviion/syscon.4
.\"	$OpenBSD: syscon.4,v 1.1 2013/10/15 18:13:53 miod Exp $
.\"
.\" Copyright (c) 2008 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies. And
.\" I won't mind if you keep the disclaimer below.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 15 2013 $
.Dt SYSCON 4 aviion
.Os
.Sh NAME
.Nm syscon
.Nd VME system controller
.Sh SYNOPSIS
.Cd "syscon0 at mainbus0 addr 0xfff00000"
.Cd "nvram0  at syscon0 offset 0x80000"
.Cd "dart0   at syscon0 offset 0x82000"
.Cd "dart1   at syscon0 offset 0x82c00"
.Cd "vme0    at syscon0 offset 0x85000"
.Cd "oaic0   at syscon0 offset 0x8a000"
.Cd "le0     at syscon0 offset 0x8c000"
.Cd "oosiop0 at syscon0 offset 0xb0000"
.Cd "oosiop1 at syscon0 offset 0xb0080"
.Cd "le0     at syscon0 offset 0xb0100"
.Cd "le1     at syscon0 offset 0xb0140"
.Sh DESCRIPTION
The
.Nm
driver provides an interface to the different local bus-attached I/O
devices found on AViiON systems.
.Pp
The devices which may be connected to
.Nm
are:
.Pp
.Bl -tag -compact -width 9n -offset indent
.It Xr dart 4
MC68681 or MC68692 dual UART
.It Xr le 4
AMD LANCE or ILACC Ethernet device
.It Xr nvram 4
Mostek MK48T0x battery-backed realtime clock
.It Xr oaic 4
Adaptec AIC-6250 SCSI interface
.It Xr oosiop 4
Symbios/NCR 53C700 SCSI driver
.It Xr syscon 4
VME system controller
.Ir Xr vme 4
VMEbus interface
.El
.Sh SEE ALSO
.Xr intro 4
