openbsd/src/share/man/man4/man4.aviion/vme.4
.\"	$OpenBSD: vme.4,v 1.2 2013/10/15 20:34:47 jmc Exp $
.\"
.\" Copyright (c) 2003 Paul Weissmann
.\" All rights reserved.
.\"
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: October 15 2013 $
.Dt VME 4 aviion
.Os
.Sh NAME
.Nm vme
.Nd VMEbus interface
.Sh SYNOPSIS
.Cd "vme0   at syscon0    offset 0x85000"
.Sh DESCRIPTION
The
.Nm
driver provides access to the VMEbus, operating the VMEbus part of the
.Xr syscon 4
device.
.Pp
The currently supported VMEbus drivers are:
.Pp
.Bl -tag -compact -width 10n -offset indent
.It Xr le 4
AMD LANCE or ILACC Ethernet device
.\" .It Xr vs 4
.\" MVME328, MVME328S and MVME328XT high performance SCSI controller
.\" .It Xr vsbic 4
.\" MVME327A SCSI and floppy controller
.\" .It Xr vx 4
.\" MVME332XT high performance serial I/O controller
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr syscon 4
