openbsd/src/sbin/slattach/slattach.8
.\"	$OpenBSD: slattach.8,v 1.15 2007/05/31 19:19:47 jmc Exp $
.\"	$NetBSD: slattach.8,v 1.12 1995/03/18 15:01:12 cgd Exp $
.\"
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)slattach.8	8.2 (Berkeley) 4/1/94
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt SLATTACH 8
.Os
.Sh NAME
.Nm slattach
.Nd attach serial lines as network interfaces
.Sh SYNOPSIS
.Nm slattach
.Op Fl hm
.Op Fl s Ar baudrate
.Ar ttyname
.Sh DESCRIPTION
.Nm
is used to assign a tty line to a network interface,
and will attach the named tty line to the first
available slipdevice that is configured and up.
The following operands are supported by
.Nm slattach :
.Bl -tag -width Ar
.It Fl h
Turn on RTS/CTS flow control.
By default, no flow control is done.
.It Fl m
Maintain modem control signals after closing the line.
Specifically, this disables HUPCL.
.It Fl s Ar baudrate
Specifies the speed of the connection.
If not specified, the default of 9600 is used.
.It Ar ttyname
Specifies the name of the tty device.
.Ar ttyname
should be a string of the form
.Dq ttyXX ,
or
.Dq /dev/ttyXX .
.El
.Pp
In addition, the following flags to
.Xr ifconfig 8
control various properties of the link:
.Bl -tag -width Ar
.It Ar link0
Turn on Van Jacobsen header compression.
.It Ar -link0
Turn off header compression.
.It Ar link1
Don't pass through ICMP packets.
.It Ar -link1
Do pass through ICMP packets.
.It Ar link2
If a packet with a compressed header is received, automatically enable
compression of outgoing packets.
.It Ar -link2
Don't auto-enable compression.
.El
.Pp
Only the superuser may attach a network interface.
.Pp
To detach the interface, use
.Dq Li ifconfig interface-name down
after killing off the
.Nm
process.
.Ar interface-name
is the name that is shown by
.Xr netstat 1 .
.Sh EXAMPLES
.Bd -literal -offset indent
# ifconfig sl0 10.0.0.1 10.0.0.2 link0 link2 up
# slattach ttyh8
# ifconfig sl1 192.168.0.1 192.168.0.2 link0 up
# slattach \-s 4800 /dev/tty01
.Ed
.Sh DIAGNOSTICS
Messages indicating the specified interface does not exist, the
requested address is unknown, the user is not privileged and
tried to alter an interface's configuration.
.Sh SEE ALSO
.Xr netstat 1 ,
.Xr netintro 4 ,
.Xr ifconfig 8 ,
.Xr rc 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
