openbsd/src/share/man/man8/man8.hp300/boot_hp300.8
.\"	$OpenBSD: boot_hp300.8,v 1.4 2003/02/01 16:38:39 jmc Exp $
.\"
.\" Copyright (c) 2002, Miodrag Vallat.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistribution of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 2nd, 2002
.Dt BOOT_HP300 8 hp300
.Os
.Sh NAME
.Nm boot_hp300
.Nd hp300 system bootstrapping procedures
.Sh DESCRIPTION
.Ss Cold starts
When powered on, the hp300
firmware will proceed to its initialization, and
will boot an operating system from the first bootable device found.
By pressing the
.Dq enter
key during the initialization sequence, the user can force another
device to be used.
.Ss Warm starts
After a panic, or if the system is rebooted via
.Xr reboot 8
or
.Xr shutdown 8 ,
the firmware will restart from the previous boot device.
.Ss Bootable devices
The following devices can be booted from the firmware:
.Bl -bullet -compact
.It
Any disk successfully probed, and containing a boot program in a
.Tn LIF
format directory at its beginning.
.It
Any network interface, for which a
.Xr rbootd 8
server is listening on the network.
.El
.Ss Boot process options
The
.Ox
bootloader will let the user enter a boot device, kernel
filename and boot options.
.Pp
If the special line
.Ic reset
is entered, the bootloader will attempt to restart the machine.
.Pp
The file specification used for an interactive boot is of the form:
.Dl device unit partition : filename   options
where:
.Bl -tag -width device -compact
.It Ar device
is the type of the device to be searched.
Currently,
.Li ct Pq HP-IB tape ,
.Li hd Pq HP-IB disk ,
.Li le Pq network ,
and
.Li sd Pq SCSI disk or tape
are the only valid
.Ar device
specifiers.
.It Ar unit
is the device id for
.Tn SCSI devices,
and the
.Li "(8 * the HP-IB controller number + the device unit number)"
formula for
.Tn HP-IB
devices.
Controller and unit numbering start at zero.
.It Ar minor
is the disk partition letter or tape file number.
.El
Normal line editing characters can be used when typing the file specification.
.Pp
For example,
to boot the
.Pa /bsd
kernel from the
.Dq a
file system of unit 0 on second HP-IB controller, type
.Dq rd8a:/bsd
at the boot prompt.
.Pp
The following options are recognized:
.Bl -tag -width "-XXX" -offset indent -compact
.Pp
.It Fl a
Prompt for the root filesystem device after the devices have been configured.
.It Fl b
On the next system reboot, always halt the system, even if a reboot is
required.
.It Fl c
Enter the
.Dq User Kernel Configuration
mode upon startup
.Pq see Xr boot_config 8 .
.It Fl d
Enter the debugger,
.Xr ddb 4 ,
as soon as the kernel console has been initialized.
.It Fl s
Boot the system single-user.
The system will be booted multi-user unless this option is specified.
.El
.Pp
If the user does not enter anything after a few seconds, the bootloader
will attempt to boot a kernel from the device it was loaded from, with no
options.
The following kernel filenames will be tried, in this order:
.Bl -item -compact
.Pp
.It
bsd
.It
bsd.gz
.It
obsd
.It
obsd.gz
.It
bsd.old
.It
bsd.old.gz
.El
.Ss Abnormal system termination
In case of system crashes, the kernel will usually enter the kernel
debugger,
.Xr ddb 4 ,
unless it is not present in the kernel, or it is disabled via the
.Em ddb.panic
sysctl.
Upon leaving ddb, or if ddb was not entered, the kernel will halt the system
if it was still in device configuration phase, or attempt a dump to the
configured dump device, if possible.
The crash dump will then be recovered by
.Xr savecore 8
during the next multi-user boot cycle.
It is also possible to force other behaviours from ddb.
.Sh FILES
.Bl -tag -width /usr/mdec/bootxx.lif -compact
.It Pa /bsd
default system kernel
.It Pa /usr/mdec/uboot.lif
.Tn LIF
format boot block, suitable for all bootable devices
.It Pa /usr/mdec/cdboot.lif
.Tn LIF
format boot block, suitable for bootable cd-rom.
.El
.Sh SEE ALSO
.Xr ddb 4 ,
.Xr boot_config 8 ,
.Xr halt 8 ,
.Xr init 8 ,
.Xr installboot 8 ,
.Xr rbootd 8 ,
.Xr reboot 8 ,
.Xr savecore 8 ,
.Xr shutdown 8
