openbsd/src/share/man/man8/man8.hp300/MAKEDEV.8
.\"	$OpenBSD: MAKEDEV.8,v 1.12 2003/01/25 00:04:19 jmc Exp $
.\"
.\" Copyright (c) 1997, Jason Downs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jason Downs for the
.\"      OpenBSD system.
.\" 4. Neither the name(s) of the author(s) nor the name OpenBSD
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" Copyright (c) 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)MAKEDEV.8	5.2 (Berkeley) 3/22/91
.\"
.Dd July 27, 1997
.Dt MAKEDEV 8 hp300
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Op Ar ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the
.Pa /dev
directory, is used to create the common special files.
See
.Xr intro 4
for a more complete discussion of special files.
.Pp
.Nm MAKEDEV
takes any number of device names as arguments, where the names are
the common abbreviation for the device.
There are three special device names,
.Ar all ,
.Ar std
and
.Ar local .
If
given,
.Ar all
creates device files for all devices on the hp300.
If units are expected for a device,
.Nm MAKEDEV
will supply the standard numbers.
The
.Ar std
argument creates only the standard devices for the hp300.
Finally
.Ar local
is for devices specific to the local site, and executes the shell file
.Pa MAKEDEV.local .
.Pp
The hp300 supports the following devices.
Where a device name is followed by a hash sign ("#"), the hash sign
must be replaced by a unit number.
.Pp
.Sy Pseudo\-names
.Bl -tag -width indent -compact
.It Ar all
All known devices for the hp300.
.It Ar std
The standard devices (console, drum, fd/*, klog, kmem, mem, null, stderr,
stdin, stdout, tty, zero).
.It Ar local
Configuration specific devices.
.El
.Pp
.Sy Device\-names
.Bl -tag -width indent -compact
.It Ar ct#
HP300 HP-IB cartridge tape.
.It Ar ccd#
.Dq Concatenated
pseudo-disks.
.It Ar hd#
HP300 HP-IB disks.
.It Ar mt#
(Magnetic) 9-track reel tape.
.It Ar sd#
HP300 SCSI disks.
.It Ar st#
HP300 SCSI tape.
.It Ar vnd#
.Dq File
pseudo-disks.
.It Ar rd#
.Dq Ramdisk
pseudo-disks.
.It Ar dca#
HP200/300 single port serial interface.
.It Ar dcm#
HP200/300 4 port serial mux interface.
.It Ar apci#
HP400 3 port/keyboard Apollo mux interface.
.It Ar pty#
Set of 16 master and slave pseudo terminals.
.It Ar grf#
Raw interface to HP300 graphics devices.
.It Ar ite#
Terminal emulator interface to HP300 graphics devices.
.It Ar hil
HP300 HIL input devices.
.It Ar ppi#
HP-IB plotters.
.It Ar bpf#
Berkeley packet filters.
.It Ar tun#
Network tunnel driver.
.It Ar lkm
Loadable kernel modules interface.
.It Ar random
In-kernel random number generator.
.El
.Pp
.Sh FILES
.Bl -tag -width XXXX -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
