openbsd/src/sbin/mount_kernfs/mount_kernfs.8
.\"	$OpenBSD: mount_kernfs.8,v 1.6 1998/11/28 19:56:25 aaron Exp $
.\"	$NetBSD: mount_kernfs.8,v 1.6 1995/03/18 14:57:24 cgd Exp $
.\"
.\" Copyright (c) 1992, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Jan-Simon Pendry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)mount_kernfs.8	8.2 (Berkeley) 3/27/94
.\"
.Dd March 27, 1994
.Dt MOUNT_KERNFS 8
.Os BSD 4.4
.Sh NAME
.Nm mount_kernfs
.Nd mount the /kern file system
.Sh SYNOPSIS
.Nm
.Op Fl o Ar options
.Ar /kern
.Ar mount_point
.Sh DESCRIPTION
The
.Nm
command attaches an instance of the kernel parameter
namespace to the global filesystem namespace.
The conventional mount point is
.Pa /kern .
This command is normally executed by
.Xr mount 8
at boot time.
.Pp
The filesystem includes several regular files which can be read,
some of which can also be written.
The contents of the files is in a machine-independent format,
either a string, or an integer in decimal ASCII.
Where numbers are returned, a trailing newline character is also added.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
.El
.Sh FILES
.Bl -tag -width copyright -compact
.It Pa boottime
Time at which the system was last booted (decimal ASCII).
.It Pa byteorder
_BYTE_ORDER for this kernel.
.It Pa copyright
Kernel copyright message.
.It Pa hostname
The hostname, with a trailing newline.
The hostname can be changed by writing to this file.
A trailing newline will be stripped from the hostname being written.
.It Pa domainname
The domainname, with a trailing newline. Behaves like a hostname.
.It Pa hz
Frequency of the system clock (decimal ASCII).
.It Pa loadavg
The 1, 5 and 15 minute load average in kernel fixed-point format.
The final integer is the fix-point scaling factor.
All numbers are in decimal ASCII.
.It Pa machine
Architecture this kernel compiled for.
.It Pa model
Model of the processor this machine running on.
.It Pa msgbuf
Kernel message buffer, also read by
.Xr syslogd 8 ,
through the
.Pa log
device, and by
.Xr dmesg 8 .
.It Pa ncpu
Number of CPUs in this machine.
.It Pa ostype
OS type for this kernel ("OpenBSD").
.It Pa osrelease
OS release number.
.It Pa osrev
OS revision number (BSD from <sys/param.h>).
.It Pa pagesize
Machine pagesize (decimal ASCII).
.It Pa posix
_POSIX_VERSION for this kernel.
.It Pa physmem
Number of pages of physical memory in the machine (decimal ASCII).
.\" .It Pa root
.\" the system root directory.
.\" In a chroot'ed environment,
.\" .Nm
.\" can be used to create a new
.\" .Pa /kern
.\" mount point.
.\" .Pa /kern/root
.\" will then refer to the system global root, not the current process root.
.It Pa rootdev
Root device.
.It Pa rrootdev
Raw root device.
.It Pa time
Second and microsecond value of the system clock.
Both numbers are in decimal ASCII.
.It Pa usermem
Number of pages of physical memory available for user processes.
.It Pa version
Kernel version string.
The head line for
.Pa /etc/motd
can be generated by running:
.Dq Ic "sed 1q /kern/version" .
.El
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr dmesg 8 ,
.Xr mount 8 ,
.Xr syslogd 8
.Sh CAVEATS
This filesystem may not be NFS-exported.
.Sh HISTORY
The
.Nm
utility first appeared in
.Bx 4.4 .
