openbsd/src/usr.sbin/netgroup_mkdb/netgroup_mkdb.8
.\"	$OpenBSD: netgroup_mkdb.8,v 1.8 2015/11/30 17:03:05 jmc Exp $
.\"
.\" Copyright (c) 1994 Christos Zoulas
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christos Zoulas.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: November 30 2015 $
.Dt NETGROUP_MKDB 8
.Os
.Sh NAME
.Nm netgroup_mkdb
.Nd generate the netgroup databases
.Sh SYNOPSIS
.Nm netgroup_mkdb
.Op Fl o Ar database
.Op Ar file
.Sh DESCRIPTION
.Nm netgroup_mkdb
creates Berkeley databases for the specified
.Ar file .
If no file is specified,
.Pa /etc/netgroup
is used.
These databases are then installed into
.Pa /etc/netgroup.db .
The file must be in the correct format (see
.Xr netgroup 5 ) .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl o Ar database
Put the output databases in the named file.
.El
.Pp
The databases are used by the C library netgroup routines (see
.Xr getnetgrent 3 ) .
.Pp
.Nm netgroup_mkdb
exits zero on success, non-zero on failure.
.Sh FILES
.Bl -tag -width 24n -compact
.It Pa /etc/netgroup.db
current netgroup database
.It Pa /etc/netgroup.db.tmp
a temporary file
.It Pa /etc/netgroup
current netgroup file
.El
.Sh SEE ALSO
.Xr dbopen 3 ,
.Xr getnetgrent 3 ,
.Xr netgroup 5
.Sh BUGS
Because
.Nm netgroup_mkdb
guarantees not to install a partial destination file it must
build a temporary file in the same file system and if successful use
.Xr rename 2
to install over the destination file.
.Pp
If
.Nm netgroup_mkdb
fails it will leave the previous version of the destination file intact.
