Repository: openbsd/src
Catalog: gnu/usr.bin/lynx/po/*.po
Languages: cs, tr

source: TABLE center disable.
tr: TABLO ortala(mayý) devre dýþý býrak.

source: Current URL is empty.
tr: Mevcut URL boþ.

source: Copy to clipboard failed.
tr: Panoya kopyalama baþarýsýz.

source: Document URL put to clipboard.
tr: Belge URL'sini panoya koy.

source: Link URL put to clipboard.
tr: Link URL'sini panoya koy.

source: No URL in the clipboard.
tr: Panoda URL yok.

source: -index-
cs: -rejstøík-
tr: -indeks-

source: lynx: Can't access startfile
cs: lynx: startovní soubor nelze otevøít
tr: lynx: baþlat dosyasýna (startfile) eriþilemiyor

source: lynx: Start file could not be found or is not text/html or text/plain
cs: lynx: startovní soubor nelze nalézt, nebo není ani typu text/html ani text/plain.
tr: lynx: Baþlat dosyasý bulunamýyor ya da html-metin ya da salt-metin deðil

source: Exiting...
cs: Konèím...
tr: Kapanýyor...

source: -more-
cs: -pokraèování-
tr: -devam-

source: You will be posting to:
cs: Posíláte po¹tu na:
tr: Postalayacaðýnýz yer/kiþi:

source: Please provide your mail address for the From: header
cs: Zadejte adresu pro hlavièku From:
tr: Lütfen Gönderen: hanesi için e-posta adresinizi giriniz

source: Please provide or edit the Subject: header
cs: Zadejte pøedmìt zprávy
tr: Lütfen Konu: hanesini giriniz ya da düzenleyiniz

source: Please provide or edit the Organization: header
cs: Zadejte hodnotu pro hlavièku Organization:
tr: Lütfen Kurum: hanesini giriniz ya da düzenleyiniz

source: Please enter your message below.
cs: Zadejte text zprávy.
tr: Lütfen mesajýnýzý aþaðýya giriniz.

source: Message has no original text!
cs: Zpráva neobsahuje ¾ádný pùvodní text!
tr: Mesajda orijinal metin yok!

source: review/edit B)ookmarks files
cs: zobrazit/editovat soubory se zálo¾kami B>
tr: Yer imi(B) dosyalarýný gözden geçir/düzenle

source: B)ookmark file:
cs: Soubor se zálo¾kami B>:
tr: Yer imi(B) dosyasý:

source: ON
tr: AÇIK

source: OFF
tr: KAPALI

source: NEVER
tr: ASLA

source: ALWAYS
tr: HER ZAMAN

source: ignore
tr: yoksay

source: ask user
tr: kullanýcýya sor

source: accept all
tr: tümünü kabul et

source: ALWAYS OFF
tr: HER ZAMAN KAPALI

source: FOR LOCAL FILES ONLY
tr: YALNIZCA YEREL DOSYALAR ÝÇÝN

source: ALWAYS ON
tr: HER ZAMAN AÇIK

source: Numbers act as arrows
tr: Rakamlar oklar gibi davranýrlar

source: Links are numbered
tr: Linkler numaralandý

source: Links and form fields are numbered
tr: Linkler ve form alanlarý numaralandý

source: Form fields are numbered
tr: Form alanlarý numaralandý

source: Case insensitive
tr: Büyük/küçük harf duyarsýz

source: Case sensitive
tr: Büyük/küçük harf duyarlý

source: prompt normally
tr: normal bilgi istemi

source: force yes-response
tr: evet-yanýtýna zorla

source: force no-response
tr: hayýr-yanýtýna zorla

source: Novice
tr: Acemi

source: Intermediate
tr: Orta düzey

source: Advanced
tr: Ýleri düzey

source: By First Visit
tr: Ýlk Ziyaretle

source: By First Visit Reversed
tr: Ýlk Ziyaretle-Tersten

source: As Visit Tree
tr: Ziyaret Aðacý Gibi

source: By Last Visit
tr: Son Ziyaretle

source: By Last Visit Reversed
tr: Son Ziyaretle-Tersten

source: relaxed (TagSoup mode)
tr: gevþek (TagSoup kipi)

source: strict (SortaSGML mode)
tr: katý (SortaSGML kipi)

source: as labels
tr: etiket gibi

source: as links
tr: link gibi

source: show filename
tr: dosya adýný göster

source: STANDARD
tr: STANDART

source: ADVANCED
tr: ÝLERÝ DÜZEY

source: Directories first
tr: Önce dizinler

source: Files first
tr: Önce dosyalar

source: Mixed style
tr: Karýþýk stil

source: By Name
tr: Ýsimle

source: By Type
tr: Türle

source: By Size
tr: Boyutla

source: By Date
tr: Tarihle

source: By Mode
tr: Kiple

source: By User
tr: Kullanýcýyla

source: By Group
tr: Grupla

source: Do not show rate
tr: Hýzý gösterme

source: Show %s/sec rate
tr: %s/sn hýzýný göster

source: Show %s/sec, ETA
tr: %s/sn'yi göster, ETA

source: Show progressbar
tr: Geliþim çubuðunu göster

source: Accept lynx's internal types
tr: Lynx'in dahili türlerini kabul et

source: Also accept lynx.cfg's types
tr: Lynx cfg'nin türlerini de kabul et

source: Also accept user's types
tr: Kullanýcýnýn türlerini de kabul et

source: Also accept system's types
tr: Sistemin türlerini de kabul et

source: Accept all types
tr: Tüm türleri kabul et

source: deflate
tr: söndür

source: compress
tr: sýkýþtýr

source: All
tr: Tümü

source: Use %s to invoke the Options menu!
cs: Pomocí %s mù¾ete aktivovat konfiguraèní menu!
tr: Seçenekler menüsünü çaðýrmak için %s kullanýnýz!

source: (options marked with (!) will not be saved)
tr: ((!) ile iþaretlenmiþ seçenekler kaydedilmeyecek)

source: General Preferences
cs: V¹eobecná nastavení
tr: Genel Tercihler

source: User mode
cs: U¾ivatelský re¾im
tr: Kullanýcý kipi

source: Editor
tr: Düzenleyici

source: Type of Search
cs: Druh hledání
tr: Arama Tipi

source: Security and Privacy
tr: Güvenlik ve Mahremiyet

source: Cookies
tr: Çerezler

source: Invalid-Cookie Prompting
tr: Geçersiz Çerez Bilgi Ýstemi

source: SSL Prompting
tr: SSL Bilgi Ýstemi

source: Keyboard Input
cs: Nastavení klávesnice
tr: Klavye Girdisi

source: Keypad mode
cs: Re¾im numerické klávesnice
tr: Mini klavye(keypad) kipi

source: Emacs keys
cs: Emacs klávesy
tr: Emacs tuþlarý

source: VI keys
cs: VI klávesy
tr: VI tuþlarý

source: Line edit style
tr: Satýr düzenleme stili

source: Keyboard layout
tr: Klavye yerleþimi

source: Display and Character Set
cs: Display a znaková sada
tr: Görüntüleme ve Karakter Kümesi

source: Use locale-based character set
tr: Yerel tabanlý karakter kümesini kullan

source: Display character set
cs: Místní znaková sada
tr: Karakter kümesini görüntüle

source: Assumed document character set
cs: Pøedpokládaná znaková sada
tr: Varsayýlan belge karakter kümesi

source: CJK mode
cs: CJK re¾im
tr: CJK kipi

source: Raw 8-bit
cs: Pøímý 8bitový re¾im
tr: Ham 8-bit

source: X Display
tr: X Görüntüleme

source: Document Appearance
cs: Vzhled dokumentu
tr: Belge Görünümü

source: Show color
cs: Zobrazovat barvy
tr: Renkleri göster

source: Show cursor
cs: Zobrazovat kurzor
tr: Ýmleci göster

source: Underline links
tr: Linklerin altý çizili

source: Show scrollbar
tr: Kaydýrma çubuðunu göster

source: Popups for select fields
cs: Vyskakovací menu pro zvolená pole
tr: Seçme alanlar için açýlýrlar(popups)

source: HTML error recovery
cs: Zotavení po chybách HTML
tr: HTML hata kurtarma

source: Show images
cs: Zobrazení obrázkù
tr: Resimleri göster

source: Verbose images
cs: Doslovné obrázky
tr: Resimleri dillendir

source: Headers Transferred to Remote Servers
cs: Hlavièky pøená¹ené na vzdálené servery
tr: Baþlýklar Karþý Sunuculara Aktarýldý

source: Personal mail address
cs: Osobní adresa elektronické po¹ty
tr: Kiþisel mektup adresi

source: Password for anonymous ftp
tr: Anonim ftp için parola

source: Preferred media type
tr: Tercih edilen ortam türü

source: Preferred encoding
tr: Tercih edilen kodlama

source: Preferred document character set
cs: Upøednostòovaná znaková sada
tr: Tercih edilen belge karakter kümesi

source: Preferred document language
cs: Upøednostòovaný jazyk dokumentu
tr: Tercih edilen belge dili

source: User-Agent header
cs: Hlavièka 'User-Agent'
tr: Kullanýcý-Ajaný baþlýðý

source: Listing and Accessing Files
cs: Zobrazování adresáøù a pøístup k souborùm
tr: Dosya Listeleme ve Eriþim

source: Use Passive FTP
tr: Edilgen FTP Kullan

source: FTP sort criteria
cs: Øazení FTP adresáøù
tr: FTP sýralama ölçütleri

source: Local directory sort criteria
cs: Øazení lokálních adresáøù
tr: Yerel dizin sýralama ölçütleri

source: Local directory sort order
tr: Yerel dizin sýralama ölçütleri

source: Show dot files
cs: Zobrazovat teèkové soubory
tr: Nokta dosyalarý göster

source: Execution links
cs: Spustitelné odkazy
tr: Ýcra linkleri

source: Show transfer rate
tr: Aktarým hýzýný göster

source: Special Files and Screens
cs: Zvlá¹tní soubory a stránky
tr: Özel Dosyalar ve Ekranlar

source: Multi-bookmarks
cs: Dìlené zálo¾ky
tr: Çoklu-yer imleri

source: Review/edit Bookmarks files
cs: Editace podsouborù se zálo¾kami
tr: Yer Ými dosyalarýný gözden geçir/düzenle

source: Goto multi-bookmark menu
cs: Menu dìlených zálo¾ek
tr: Çoklu-yer imi menüsüne git

source: Bookmarks file
cs: Soubor se zálo¾kami
tr: Yer Ýmleri dosyasý

source: Auto Session
tr: Otomatik Oturum

source: Session file
tr: Oturum dosyasý

source: Visited Pages
cs: Nav¹tívené odkazy
tr: Uðranan Sayfalar

source: View the file
tr: Dosyayý görüntüle

source: Print job complete.
cs: Tisk dokonèen.
tr: Yazdýrma iþi tamamlandý.

source: Document:
cs: Dokument:
tr: Belge:

source: Number of lines:
cs: Poèet øádkù:
tr: Satýr sayýsý:

source: Number of pages:
cs: Poèet stran:
tr: Sayfa sayýsý:

source: pages
cs: stran(y)
tr: sayfa

source: page
cs: strana
tr: sayfa

source: (approximately)
cs: (pøibli¾nì)
tr: (yaklaþýk)

source: Some print functions have been disabled!
cs: Nìkteré funkce tisku byly vypnuty!
tr: Bazý yazdýrma iþlevleri devre dýþý!..

source: Standard print options:
cs: Standardní menu voleb tisku:
tr: Standart yazdýrma seçenekleri:

source: Print options:
cs: Menu voleb tisku:
tr: Yazdýrma seçenekleri:

source: Save to a local file
cs: Ulo¾it do místního souboru
tr: Yerel bir dosyaya kaydet

source: Save to disk disabled
cs: Ukládání na disk je vypnuto
tr: Diske kaydetme devre dýþý

source: Mail the file
cs: Poslat soubor po¹tou
tr: Dosyayý postala

source: Print to the screen
cs: Vytisknout na obrazovku
tr: Ekrana yazdýr

source: Print out on a printer attached to your vt100 terminal
cs: Vytisknout na tiskárnu pøipojenou k va¹emu vt100 terminálu
tr: vt100 uçbiriminize baðlý bir yazýcýya yazdýrýn

source: Syntax Error parsing COLOR in configuration file: The line must be of the form: COLOR:INTEGER:FOREGROUND:BACKGROUND Here FOREGROUND and BACKGROUND must be one of: The special strings 'nocolor' or 'default', or
cs: Byla nalezena syntaktická chyba pøi zpracování direktivy COLOR v konfiguraèním souboru: Øádek musí být ve formátu: COLOR:CELÉ ÈÍSLO:POPØEDÍ:POZADÍ
tr: Ayarlama dosyasýnda RENK ayrýþtýrma Betik Hatasý: Satýr þu þekilde olmalýdýr: RENK:TAMSAYI:ÖNPLAN:ARKAPLAN Burada ÖNPLAN ve ARKAPLAN özel dizgeler olan 'nocolor' ya da 'default' (ya da) 'dan biri olmalýdýr

source: Offending line:
cs: kritický øádek:
tr: Ýncitici satýr:

source: key remapping of %s to %s for %s failed
cs: chyba pøi pøemapovávání klávesy %1$s pro %3$s na %2$s
tr: %s'in %s'e tuþ yeniden eþlemlemesi %s kez baþarýsýz

source: key remapping of %s to %s failed
cs: chyba pøi pøemapovávání klávesy %s na %s
tr: %s'in %s'e tuþ yeniden eþlemlemesi baþarýsýz

source: invalid line-editor selection %s for key %s, selecting all
cs: Volba %s øádkového editoru pro klávesu %s je chybná. Volím v¹e.
tr: %2$s tuþu için geçersiz satýr-düzenleyici seçimi %1$s, tümü seçiliyor

source: setting of line-editor binding for key %s (0x%x) to 0x%x for %s failed
cs: klávesu %1$s (0x%2$x) se s funkcí %4$s (0x%3$x) øádkového editoru nepodaøilo svázat
tr: %s (0x%x) tuþu için 0x%x'e satýr-düzenleyici baðlantýsý kurulmasý %s kez baþarýsýz

source: setting of line-editor binding for key %s (0x%x) for %s failed
cs: klávesu %s (0x%x) se s funkcí %s øádkového editoru nepodaøilo svázat
tr: %s (0x%x) tuþu için satýr-düzenleyici baðlantýsý kurulmasý %s kez baþarýsýz

source: Lynx: cannot start, CERN rules file %s is not available
cs: Lynx: nelze spustit, soubor %s s pravidly CERN není dostupný
tr: Lynx: baþlayamýyor, CERN kurallarý dosyasý %s temin edilemiyor

source: (no name)
cs: (¾ádné jméno)
tr: (isimsiz)

source: More than %d nested lynx.cfg includes -- perhaps there is a loop?!?
cs: Více ne¾ %d vnoøených vlo¾ení z lynx.cfg -- nejedná se o nekoneènou smyèku?!?
tr: lynx.cfg içermeleri, %d'den çok içiçe geçmiþ -- belki bir döngü olmasýn?

source: Last attempted include was '%s',
cs: Poslední vlo¾ený soubor je '%s'.
tr: Son kalkýþýlan içerme '%s' idi,

source: included from '%s'.
cs: vlo¾ený z '%s'.
tr: '%s'den içerilmiþti.

source: The following is read from your lynx.cfg file.
cs: Následující údaje jsou èteny z va¹eho lynx.cfg.
tr: Aþaðýdaki, lynx.cfg dosyanýzdan okunmuþtur.

source: Please read the distribution
cs: Pøeètìte si implicitní dodávaný s distribucí
tr: Lütfen daha fazla yorum için

source: for more comments.
cs: pro více informací.
tr: daðýtýmý okuyunuz.

source: RELOAD THE CHANGES
cs: NAÈÍST ZMÌNY
tr: DEÐÝÞÝKLÝKLERÝ YENÝDEN YÜKLE

source: Your primary configuration
cs: Va¹e primární konfigurace
tr: Birincil ayarlarýnýz

source: Directory that you are currently viewing
cs: Adresáø, který právì prohlí¾íte
tr: Halen görüntülediðiniz dizin

source: Name:
cs: Jméno:
tr: Ýsim:

source: Directory that you have currently selected
cs: Adresáø, který jste právì zvolil
tr: Halen seçilmiþ dizin

source: File that you have currently selected
cs: Soubor, který jste právì zvolil
tr: Halen seçilmiþ dosya

source: Symbolic link that you have currently selected
cs: Symbolický odkaz, který jste právì zvolil
tr: Halen seçilmiþ simgesel link

source: Item that you have currently selected
cs: Polo¾ka, kterou jste právì zvolil
tr: Halen seçilmiþ öðe

source: Full name:
cs: Celé jméno:
tr: Tam isim:

source: Unable to follow link
cs: Odkaz nelze následovat
tr: Link takip edilemiyor

source: Points to file:
cs: Odkazuje do souboru:
tr: Ýmlediði dosya:

source: Name of owner:
cs: Jméno vlastníka:
tr: Sahibinin adý:

source: Group name:
cs: Jméno skupiny:
tr: Grup adý:

source: File size:
cs: Velikost souboru:
tr: Dosya boyutu:

source: (bytes)
tr: (bayt)

source: Creation date:
cs: Datum vytvoøení:
tr: Oluþturulma tarihi:

source: Last modified:
cs: Poslední zmìna:
tr: Son deðiþiklik:

source: Last accessed:
cs: Poslední pøístup:
tr: Son eriþim:

source: Access Permissions
cs: Pøístupová práva
tr: Eriþim Ýzinleri

source: Group:
tr: Grup:

source: World:
tr: Dünya:

source: File that you are currently viewing
cs: Soubor, který si právì prohlí¾íte
tr: Halen görüntülediðiniz dosya

source: Linkname:
cs: Jméno odkazu:
tr: Link adý:

source: Charset:
cs: Znaková sada:
tr: Karakter Kümesi:

source: (assumed)
tr: (varsayýldý)

source: Server:
tr: Sunucu:

source: Date:
cs: Datum:
tr: Tarih:

source: Last Mod:
cs: Poslední modifikace:
tr: Son Kip:

source: Expires:
tr: Zamanaþýmý tarihi:

source: Cache-Control:
tr: Önbellek-Konrolü:

source: Content-Length:
tr: Ýçerik Uzunluðu:

source: Length:
tr: Uzunluk:

source: Language:
cs: Jazyk:
tr: Dil:

source: Post Data:
tr: Post Verisi:

source: Post Content Type:
tr: Post Ýçerik Tipi:

source: Owner(s):
cs: Vlastníci:
tr: Sahip(ler):

source: size:
cs: velikost:
tr: boyut:

source: lines
cs: øádky
tr: satýr

source: forms mode
cs: formuláøový re¾im
tr: form kipi

source: source
cs: zdroj
tr: kaynak

source: , safe
cs: , bezpeèný
tr: , güvenli

source: , via internal link
cs: , pøes vnitøní odkaz
tr: , dahili link aracýlýðýyla

source: , no-cache
tr: , ön belleksiz

source: , ISMAP script
cs: , ISMAP skript
tr: , ISMAP betiði

source: , bookmark file
cs: , soubor zálo¾ek
tr: , yer imi dosyasý

source: mode:
cs: re¾im:
tr: kip:

source: Link that you currently have selected
cs: Odkaz, který jste právì zvolil
tr: Halen seçmiþ olduðunuz link

source: Method:
cs: Metoda:
tr: Yöntem:

source: Enctype:
cs: Typ kódování
tr: Enctipi:

source: Action:
tr: Eylem:

source: (Form field)
cs: (Pole formuláøe)
tr: (Form alaný)

source: No Links on the current page
cs: Aktuální stránka neobsahuje ¾ádné odkazy
tr: Mevcut sayfada link yok

source: Server Headers:
tr: Sunucu Baþlýklarý:

source: Syntax Error parsing style in lss file: [%s] The line must be of the form: OBJECT:MONO:COLOR (ie em:bold:brightblue:white) where OBJECT is one of EM,STRONG,B,I,U,BLINK etc.
cs: Syntaktická chyba pøi zpracování stylu v lss souboru: [%s] Øádek musí mít formát: OBJEKT:MONO:BARVA (t.j. em:bold:brightblue:white) kde OBJEKT je jedno z EM,STRONG,B,I,U,BLINK etc.
tr: lss dosyasý tarz ayrýþtýrma Betik Hatasý: [%s] Satýr þu þekilde olmalýdýr: NESNE:MONO:RENK (yani em:kalýn:açýkmavi:beyaz) burada NESNE EM,STRONG,B,I,U,BLINK vs'den biri olmalýdýr.

source: here is a list of the history stack so that you may rebuild
cs: Zde je výpis historie
tr: yeniden yapýlandýrabilmeniz için iþte bir tarihçe yýðýný listesi

source: ERROR! - upload command is misconfigured
cs: CHYBA! - pøíkaz pro poslání je ¹patnì nakonfigurovaný
tr: HATA! - yükle komutu yanlýþ ayarlanmýþ...

source: Illegal redirection "../" found! Request ignored.
cs: Pøesmìrování obsahuje ".."! Po¾adavek ignorován.
tr: Kuraldýþý yeniden yönlendirme " /" bulundu! Ýstem yoksayýldý.

source: Illegal character "/" found! Request ignored.
cs: Nalezen chybný znak "/"! Po¾adavek ignorován.
tr: Kuraldýþý karakter "/" bulundu! Ýstem yoksayýldý.

source: Illegal redirection using "~" found! Request ignored.
cs: Pøesmìrování obsahuje "~"! Po¾adavek ignorován.
tr: "~" kullanan kuraldýþý yeniden yönlendirme bulundu! Ýstem yoksayýldý.

source: Unable to upload file.
cs: Soubor nelze poslat.
tr: Dosya yüklenemiyor.

source: Upload To:
cs: Poslat na:
tr: Yüklenecek yer:

source: Upload options:
cs: Menu voleb posílání:
tr: Yükleme seçenekleri:

source: Download document URL put to clipboard.
tr: Belge indirme URL'sini panoya koy.

source: Unexpected access protocol for this URL scheme.
cs: Neoèekávaný protokol pro tento typ URL.
tr: Bu URL þemasý için umulmadýk eriþim protokolü.

source: Too many tempfiles
tr: Çok sayýda geçici dosya

source: unknown restriction
tr: bilinmeyen kýsýtlama

source: No restrictions set.
cs: ®ádná omezení.
tr: Hiçbir kýsýtlama kurulmamýþ.

source: Restrictions set:
cs: Zapnutá omezení:
tr: Kurulmuþ kýsýtlamalar:

source: Cannot find HOME directory
tr: EV dizini bulunamýyor

source: Normally disabled. See ENABLE_LYNXRC in lynx.cfg
tr: Normalde devre dýþýdýr. Bkz. lynx.cfg'de ENABLE_LYNXRC

source: accept_all_cookies allows the user to tell Lynx to automatically accept all cookies if desired. The default is "FALSE" which will prompt for each cookie. Set accept_all_cookies to "TRUE" to accept all cookies.
cs: Volba accept_all_cookies øíká Lynxu, aby automaticky pøijímal v¹echna cookie. Implicitní nastavení je "FALSE", pøi kterém budete muset potvrdit pøijetí ka¾dého cookie. Pøijetí ka¾dého cookie zapnete nastavením accept_all_cookies na "TRUE".
tr: accept_all_cookies, arzu edildiðinde kullanýcýnýn Lynx'e tüm çerezleri otomatikman kabul etmesini söylemesini saðlar. Öntanýmlý "FALSE" (yanlýþ) olup, her çerez için sorulmasýný saðlar. Tüm çerezleri kabul etmek için accept_all_cookies'i "TRUE" (doðru)ya ayarlayýn.

source: anonftp_password allows the user to tell Lynx to use the personal email address as the password for anonymous ftp. If no value is given, Lynx will use the personal email address. Set anonftp_password to a different value if you choose.
tr: anonftp_password ile kullanýcý Lynx'e kiþisel e-posta adresini anonim ftp için parola olarak kullanmasýný bildirir. Eðer bir deðer verilmezse, Lynx kiþisel e-posta adresini kullanacaktýr. anonftp_password'ü baþka bir deðere kurmayý seçebilirsiniz.

source: bookmark_file specifies the name and location of the default bookmark file into which the user can paste links for easy access at a later date.
cs: Volba bookmark_file udává jméno implicitního souboru se zálo¾kami, do kterého si u¾ivatel mù¾e ukládat odkazy pro pozdìj¹í pou¾ití.
tr: bookmark_file, kullanýcýnýn daha sonraki bir tarihte kolay eriþim için linkleri içine yapýþtýrdýðý öntanýmlý yer imi dosyasýnýn adý ve konumunu belirtir.

source: If case_sensitive_searching is "on" then when the user invokes a search using the 's' or '/' keys, the search performed will be case sensitive instead of case INsensitive. The default is usually "off".
cs: Pokud je volba case_sensitive_searching zapnuta ("on") tak, kdy¾ u¾ivatel spustí klávesou 's' èi '/' vyhledávání, bude toto brát ohled na velikost písmen. Tato volba je implicitnì vypnuta ("off").
tr: case_sensitive_searching "on" (açýk)a ayarlanmýþsa, kullanýcý 's' ya da '/' tuþlarýyla bir arama baþlattýðýnda, arama büyük/küçük harfe duyarSIZ olmak yerine duyarlý olarak yapýlacaktýr. Öntanýmlýsý genellikle "off" (kapalý)dýr.

source: The character_set definition controls the representation of 8 bit characters for your terminal. If 8 bit characters do not show up correctly on your screen you may try changing to a different 8 bit set or using the 7 bit character approximations. Current valid characters sets are:
cs: Volba character_set definuje zpùsob zobrazení 8bitových znakù na va¹em terminálu. Pokud se na va¹í obrazovce 8bitové znaky nezobrazují správnì, mù¾ete zkusit jiné 8bitové kódování, èi pou¾ít 7bitové aproximace. Mo¾né znakové sady:
tr: character_set tanýmý 8 bit karakterlerin uçbiriminizde gösterilmesini denetler. Eðer ekranýnýzda 8 bit karakterler doðru þekilde gösterilmiyorsa baþka bir 8 bit kümesi ya da 7 bit karakter yaklaþýklýklarýný deneyebilirsiniz. Mevcut geçerli karakter kümeleri þunlardýr:

source: cookie_accept_domains and cookie_reject_domains are comma-delimited lists of domains from which Lynx should automatically accept or reject all cookies. If a domain is specified in both options, rejection will take precedence. The accept_all_cookies parameter will override any settings made here.
cs: cookie_accept_domains a cookie_reject_domains jsou dvojteèkou oddìlený seznam domén, z kterých Lynx automaticky pøijme, èi odmítne jakékoliv cookie. Pokud je doména uvedena v obou seznamech, má cookie_reject_domains pøednost. Volba accept_all_cookies má vy¹¹í prioritu, ne¾ obì tyto volby.
tr: cookie_accept_domains ve cookie_reject_domains, Lynx'in sýrasýyla, otomatikman tüm çerezleri kabul ya da reddedeceði yörelerin virgülle ayrýlmýþ listeleridir. Eðer bir yöre, her iki listede de belirtildiyse, reddetme öncelik taþýr. accept_all_cookies parametresi, burada yapýlan tüm ayarlarý geçersiz kýlar.

source: cookie_file specifies the file from which to read persistent cookies. The default is ~/
tr: cookie_file kalýcý çerezlerin okunacaðý dosyayý belirler. Öntanýmlýsý ~/'dir

source: cookie_loose_invalid_domains, cookie_strict_invalid_domains, and cookie_query_invalid_domains are comma-delimited lists of which domains should be subjected to varying degrees of validity checking. If a domain is set to strict checking, strict conformance to RFC2109 will be applied. A domain with loose checking will be allowed to set cookies with an invalid path or domain attribute. All domains will default to querying the user for an invalid path or domain.
cs: cookie_loose_invalid_domains, cookie_strict_invalid_domains a cookie_query_invalid_domains jsou dvojteèkou oddìlený seznam domén, které které by mìly být podrobeny nejrùznìj¹ím stupòùm ovìøování. Pokud je doména nastavena na 'strict' ovìøování, bude postupováno pøesnì dle RFC2109. Doména s 'loose' ovìøováním bude moci nastavovat cookies s chybnou cestou èi doménovým atributem (implicitním nastavením je zeptat se u¾ivatele).
tr: cookie_loose_invalid_domains, cookie_strict_invalid_domains ve cookie_query_invalid_domains, hangi yörenin hangi derecede geçerlilik kontrolüne uðrayacaðýný belirleyen virgülle ayrýlmýþ yöre listeleridir. Eðer bir yöre katý(strict) kontrole tabi tutuluyorsa, RFC2109'a katý uyumluluk uygulanacaktýr. Gevþek(loose) kontrollü bir yöreye, geçersiz yol ya da yöre öznitelikli çerez kurma izni verilir. Tüm yöreler, öntanýmlý olarak, geçersiz bir yol ya da yöre (özniteliðini) kullanýcýya sorgulatýr.

source: dir_list_order specifies the directory list order under DIRED_SUPPORT (if implemented). The default is "ORDER_BY_NAME"
tr: dir_list_order (eðer mevcutsa) DIRED_SUPPORT altýndaki dizin listesi sýrasýný belirler. Öntanýmlýsý "ORDER_BY_NAME"'dir
