Repository: openbsd/src
Catalog: gnu/usr.bin/lynx/po/*.po
Languages: cs, tr

source: Spawning your selected editor to edit news message
cs: Spou¹tím editor pro editaci diskuzního pøíspìvku.
tr: Haber iletisini düzenlemek için seçilmiþ düzenleyici baþlatýlýyor

source: Post this message?
cs: Odeslat tuto zprávu?
tr: Ýleti gönderilsin mi?

source: Append '%s'?
cs: Pøipojit '%s'?
tr: '%s' sona eklensin mi?

source: Posting to newsgroup(s)...
cs: Zasílám do diskuzních skupin...
tr: Haber grubu (ya da gruplarýna) gönderiliyor...

source: *** You have unread mail. ***
cs: *** Máte nepøeètenou po¹tu. ***
tr: *** Okunmamýþ mektubunuz var. ***

source: *** You have mail. ***
cs: *** Máte po¹tu. ***
tr: *** Mektubunuz var. ***

source: *** You have new mail. ***
cs: *** Máte novou po¹tu. ***
tr: *** Yeni mektubunuz var. ***

source: File insert cancelled!!!
cs: Po¾adavek na vlo¾ení souboru byl zru¹en!!!
tr: Dosya ekleme iptal edildi!!!

source: Not enough memory for file!
cs: Pro soubor není dostatek pamìti!
tr: Dosya için yeterli bellek yok!

source: Can't open file for reading.
cs: Soubor nelze pro ètení otevøít!
tr: Okumak için dosya açýlamýyor.

source: File does not exist.
cs: Soubor neexistuje.
tr: Dosya mevcut deðil.

source: File does not exist - reenter or cancel:
cs: Soubor neexistuje. Zadejte jiný, èi zru¹te:
tr: Dosya mevcut deðil - yeniden girin ya da vazgeçin:

source: File is not readable.
cs: Soubor je neèitelný.
tr: Dosya okunabilir durumda deðil.

source: File is not readable - reenter or cancel:
cs: Soubor je neèitelný. Zadejte jiný, èi zru¹te:
tr: Dosya okunabilir durumda deðil - yeniden girin ya da vazgeçin:

source: Nothing to insert - file is 0-length.
cs: Není co vlo¾it - soubor má nulovou délku.
tr: Eklenecek hiçbir þey yok - dosya 0 uzunlukta...

source: Save request cancelled!!!
cs: Po¾adavek na ulo¾ení byl zru¹en!!!
tr: Kaydetme istemi iptal edildi!

source: Mail request cancelled!!!
cs: Po¾adavek na odeslání po¹ty byl zru¹en!!!
tr: Mektup istemi iptal edildi!!!

source: Viewing preparsed source. Are you sure you want to mail it?
cs: Zobrazuji pøedzpracovaný zdrojový kód. Opravdu jej chcete poslat po¹tou?
tr: Ayrýþtýrma öncesi kaynak görüntüleniyor. Mektupla göndermek istediðinizden emin misiniz?

source: Please wait...
cs: Okam¾ik, prosím...
tr: Lütfen bekleyiniz...

source: Mailing file. Please wait...
cs: Posílám soubor po¹tou. Okam¾ik, prosím...
tr: Dosya mektupla gönderiliyor. Lütfen bekleyiniz...

source: ERROR - Unable to mail file
cs: CHYBA - Soubor nelze po¹tou odeslat.
tr: HATA - Dosya mektupla gönderilemedi

source: File is %d screens long. Are you sure you want to print?
cs: Délka souboru v obrazovkách je %d. Opravdu jej chcete vytisknout?
tr: Dosya %d ekran uzunluðunda. Yazdýrmak istediðinizden emin misiniz?

source: Print request cancelled!!!
cs: Po¾adavek na tisk byl zru¹en!!!
tr: Yazdýrma istemi iptal edildi!!!

source: Press <return> to begin:
cs: Zahajte stisknutím <return>:
tr: Baþlamak için <return>'e basýnýz:

source: Press <return> to finish:
cs: Ukonèete stisknutím <return>:
tr: Bitirmek için <return>'e basýnýz:

source: File is %d pages long. Are you sure you want to print?
cs: Délka souboru ve stranách je %d. Opravdu jej chcete vytisknout?
tr: Dosya %d sayfa uzunluðunda. Yazdýrmak istediðinizden emin misiniz?

source: Be sure your printer is on-line. Press <return> to start printing:
cs: Ujistìte se, ¾e tiskárna je zapnuta. Tisk zahajte stisknutím <return>:
tr: Yazýcýnýzýn çevrimiçi olduðundan emin olun. Yazdýrmaya baþlamak için lütfen <return>'e basýnýz::

source: ERROR - Unable to allocate file space!!!
cs: CHYBA - není dostatek místa pro soubor!!!
tr: HATA - dosya boþluðu tahsis edilemedi!!!

source: Unable to open tempfile
cs: Doèasný soubor nelze otevøít.
tr: Geçici dosya açýlamadý

source: Unable to open print options file
cs: Soubor s menu voleb tisku nelze otevøít.
tr: Yazdýrma seçenekleri dosyasý açýlamadý

source: Printing file. Please wait...
cs: Tisknu soubor. Okam¾ik, prosím...
tr: Dosya yazdýrýlýyor. Lütfen bekleyiniz...

source: Please enter a valid internet mail address:
cs: Zadejte platnou adresu elektronické po¹ty:
tr: Lütfen geçerli bir internet mektup adresi giriniz:

source: ERROR! - printer is misconfigured!
cs: CHYBA! - tiskárna je ¹patnì nastavena!
tr: HATA! - Yazýcý yanlýþ ayarlanmýþ!

source: Image map from POST response not available!
cs: Klikací mapa z odpovìdi na POST není dostupná!
tr: POST yanýtýndan resim eþlemi temin edilemiyor!

source: Misdirected client-side image MAP request!
cs: Chybnì cílený po¾adavek z klikací mapy!
tr: Yanlýþ yönlendirilmiþ alýcý-tarafý resim EÞLEM istemi!

source: Client-side image MAP is not accessible!
cs: Klientská klikací mapa není pøístupná!
tr: Alýcý-tarafý resim EÞLEMine eriþilemez!

source: No client-side image MAPs are available!
cs: Není dostupná ¾ádná klientská klikací mapa!
tr: Hiçbir alýcý-tarafý resim EÞLEMi yok!..

source: Client-side image MAP is not available!
cs: Klientská klikací mapa není dostupná!
tr: Alýcý-tarafý resim EÞLEMi yok!

source: Screen height must be at least 24 lines for the Options menu!
cs: Konfiguraèní menu potøebuje obrazovku o alespoò 24 øádcích!
tr: Seçenekler menüsü için ekran boyu en az 24 satýr olmalýdýr!

source: Screen height must be at least 23 lines for the Options menu!
cs: Konfiguraèní menu potøebuje obrazovku o alespoò 23 øádcích!
tr: Seçenekler menüsü için ekran boyu en az 23 satýr olmalýdýr!

source: Screen height must be at least 22 lines for the Options menu!
cs: Konfiguraèní menu potøebuje obrazovku o alespoò 23 øádcích!
tr: Seçenekler menüsü için ekran boyu en az 22 satýr olmalýdýr!

source: That key requires Advanced User mode.
cs: Tato klávesa funguje pouze v re¾imu pro pokroèilé u¾ivatele.
tr: O tuþ, Ýleri Düzey Kullanýcý kipi gerektirir.

source: Content-type: %s
tr: Ýçerik türü: %s

source: Command:
cs: Pøíkaz:
tr: Komut:

source: Unknown or ambiguous command
tr: Bilinmeyen ya da belirsiz komut

source: Version
cs: verze
tr: Sürüm

source: first
cs: jako první
tr: ilk

source: , guessing...
cs: , hádám...
tr: , tahmin ediliyor...

source: Permissions for
cs: Pøístupová práva pro
tr: Ýzinlerin sahibi

source: Select
cs: Zvolte
tr: Seçiniz

source: capital letter
cs: velké písmeno
tr: büyük harf

source: of option line,
cs: z volby,
tr: seçenek satýrýnýn,

source: to save,
cs: pro ulo¾ení,
tr: kaydetmek için,

source: to
cs: do
tr: hedef

source: or
cs: èi
tr: ya da

source: index
cs: rejstøík
tr: indeks

source: to return to Lynx.
cs: pro návrat do programu Lynx.
tr: Lynx'e dönmek için.

source: Accept Changes
cs: Pøijmout zmìny
tr: Deðiþiklikleri kabul et

source: Reset Changes
cs: Zru¹it zmìny
tr: Deðiþiklikleri Sýfýrla

source: Left Arrow cancels changes
cs: ©ipka vlevo zru¹í zmìny
tr: Sol Ok deðiþiklikleri iptal eder

source: Save options to disk
cs: Ulo¾it konfiguraci na disk
tr: Seçenekleri diske Kaydet

source: Hit RETURN to accept entered data.
cs: Stisknìte RETURN pro pøijetí údajù.
tr: Girilen veriyi kabul etmek için RETURN'e basýnýz.

source: Hit RETURN to accept entered data. Delete data to invoke the default.
cs: Stisknìte RETURN pro pøijetí údajù. Smazáním vyvoláte implicitní nastavení.
tr: Girilen veriyi kabul etmek için RETURN'e basýnýz. Öntanýmlýyý çaðýrmak için veriyi siliniz.

source: Value accepted!
cs: Hodnota pøijmuta!
tr: Deðer kabul edildi!

source: Value accepted! -- WARNING: Lynx is configured for XWINDOWS!
cs: Hodnota pøijmuta! -- VAROVÁNÍ: Lynx je nastaven pro XWINDOWS!
tr: Deðer kabul edildi! -- UYARI: Lynx, XWINDOWS için ayarlanmýþtýr!

source: Value accepted! -- WARNING: Lynx is NOT configured for XWINDOWS!
cs: Hodnota pøijmuta! -- VAROVÁNÍ: Lynx není nastaven pro XWINDOWS!
tr: Deðer kabul edildi! -- UYARI: Lynx, XWINDOWS için ayarlanmamýþtýr!

source: You are not allowed to change which editor to use!
cs: Nemáte oprávnìní mìnit editor!
tr: Kullanýlacak düzenleyiciyi deðiþtirmenize izin verilmiyor!

source: Failed to set DISPLAY variable!
cs: Promìnnou DISPLAY se nepodaøilo nastavit!
tr: DISPLAY deðiþkeninin atanmasý baþarýlamadý!

source: Failed to clear DISPLAY variable!
cs: Promìnnou DISPLAY se nepodaøilo nastavit!
tr: DISPLAY deðiþkeninin silinmesi baþarýlamadý!

source: You are not allowed to change the bookmark file!
cs: Nemáte oprávnìní mìnit soubor zálo¾ek!
tr: Yer imi dosyasýný deðiþtirmenize izin verilmiyor!

source: Terminal does not support color
cs: Terminál nepodporuje barvy.
tr: Uçbirim renk(li çýktýyý) desteklemiyor

source: Your '%s' terminal does not support color.
cs: Terminál '%s' nepodporuje barvy.
tr: '%s' uçbiriminiz, renk(li çýktýyý) desteklemiyor.

source: Access to dot files is disabled!
cs: Pøístup k teèkovým souborùm je zakázán!
tr: nokta dosyalara eriþim devre dýþý!..

source: User-Agent string does not contain "Lynx" or "L_y_n_x"
cs: Hlavièka User-Agent neobsahuje "Lynx" èi "L_y_n_x"
tr: Kullanýcý Ajaný dizgesi "Lynx" ya da "L_y_n_x" içermiyor

source: Use "L_y_n_x" or "Lynx" in User-Agent, or it looks like intentional deception!
cs: V User-Agent pou¾ijte "L_y_n_x" èi "Lynx", nebo to bude zámìrný podvod!
tr: Kullanýcý Ajaný'nda "L_y_n_x" ya da "Lynx" kullanýn, deðilse kasýtlý aldatmacaya benziyor!

source: Changing of the User-Agent string is disabled!
cs: Mìnit hodnotu hlavièky User-Agent je zakázáno!
tr: Kullanýcý Ajan dizgesinin deðiþtirilmesi devre dýþý!..

source: You are not allowed to change this setting.
cs: Nemáte oprávnìní mìnit tuto volbu.
tr: Bu ayarý deðiþtirmenize izin verilmiyor.

source: Saving Options...
cs: Ukládám konfiguraci...
tr: Seçenekler Kaydediliyor...

source: Options saved!
cs: Konfigurace ulo¾ena!
tr: Seçenekler kaydedildi!

source: Unable to save Options!
cs: Konfiguraci nelze ulo¾it!
tr: Seçenekler kaydedilemedi!

source: 'r' to return to Lynx
cs: 'r' pro návrat do programu Lynx
tr: Lynx'e dönmek için 'r'

source: '>' to save, or 'r' to return to Lynx
cs: '>' pro ulo¾ení èi 'r' pro návrat do programu Lynx
tr: kaydetmek için '>', ya da Lynx'e dönmek için 'r'

source: Hit any key to change value; RETURN to accept.
cs: Stisknìte jakoukoli klávesu pro zmìnu hodnoty; RETURN pro její pøijetí.
tr: Deðeri deðiþtirmek için herhangi bir tuþa, kabul etmek için RETURNe basýnýz.

source: Error uncompressing temporary file!
cs: Chyba pøi dekompresi doèasného souboru!
tr: Geçici dosyanýn geniþletilmesinde hata!

source: Unsupported URL scheme!
cs: Nepodporovaný typ URL!
tr: Desteklenmeyen URL þemasý!

source: Unsupported data: URL! Use SHOWINFO, for now.
cs: Nepodporované 'data:' URL! Pou¾ijte SHOWINFO.
tr: Desteklenmeyen veri: URL! Þimdilik SHOWINFO (bilgi-göster) kullanýnýz.

source: Redirection limit of 10 URL's reached.
cs: Maximální poèet pøesmìrování (10 URL) byl dosa¾en.
tr: Yeniden yönlendirme limiti olan 10 URL'ye eriþildi.

source: Illegal redirection URL received from server!
cs: Server zaslal chybné URL pro pøesmìrování!
tr: Sunucudan kuraldýþý yeniden yönlendirme URL'si alýndý!

source: Server asked for %d redirection of POST content to
cs: Server po¾aduje %d pøesmìrování POST obsahu na
tr: Sunucu, POST içeriðinin þuraya %d yeniden yönlendirilmesini istedi

source: P)roceed, use G)ET or C)ancel
cs: P)okraèovat, pou¾ít G)ET èi C>Zru¹it
tr: Devam et(P), Al(G) ya da Vazgeç(C)

source: P)roceed, or C)ancel
cs: P)okraèovat èi C>Zru¹it
tr: Devam et(P) ya da Vazgeç(C)

source: Redirection of POST content. P)roceed, see U)RL, use G)ET or C)ancel
cs: Pøesmìrování POST obsahu. P)okraèovat, zobrazit U)RL, pou¾ít G)ET èi C>Zru¹it
tr: POST içeriðinin yeniden yönlendirilmesi. Devam et(P), (U)RL'ye bak, Al(G) ya da Vazgeç(C)

source: Redirection of POST content. P)roceed, see U)RL, or C)ancel
cs: Pøesmìrování POST obsahu. P)okraèovat, zobrazit U>RL èi C>Zru¹it
tr: POST içeriðinin yeniden yönlendirilmesi. Devam et(P), (U)RL'ye bak, ya da Vazgeç(C)

source: Document from Form with POST content. Resubmit?
cs: Dokument z formuláøe s POST obsahem? Odeslat znovu?
tr: POST içerikli formdan belge. Yeniden gönderilsin mi?

source: Resubmit POST content to %s ?
cs: Odeslat znovu POST obsah na %s?
tr: POST içeriði %s'e yeniden gönderilsin mi?

source: List from document with POST data. Reload %s ?
cs: Seznam z dokumentu s POST obsahem? Naèíst %s znovu?
tr: POST verili belgeden liste. %s yeniden yüklensin mi?

source: Document from POST action, HEAD may not be understood. Proceed?
cs: Dokument vznikl z POST akce. Hlavièka nemusí být správnì zpracována. Pokraèovat?
tr: POST eyleminden belge, BAÞLIK anlaþýlmamýþ olabilir. Devam edilsin mi?

source: Form submit action is POST, HEAD may not be understood. Proceed?
cs: Akce formuláøe pou¾ívá POST. Hlavièka nemusí být správnì zpracována. Pokraèovat?
tr: Form gönderme eylemi POST, KAFA anlaþýlmamýþ olabilir. Devam edilsin mi?

source: Proceed without a username and password?
cs: Pokraèovat bez ovìøení u¾ivatelským jménem a heslem?
tr: Kullanýcý adý ve parola olmaksýzýn devam edecek misiniz?

source: Proceed (%s)?
cs: Pokraèovat (%s)?
tr: Devam edilsin mi (%s)?

source: Cannot POST to this host.
cs: Na tento poèítaè nelze data metodou POST odeslat.
tr: Bu makinaya POST yapýlamýyor.

source: POST not supported for this URL - ignoring POST data!
cs: Pro toto URL není metoda POST podporována - ignoruji POST data!
tr: Bu URL için POST desteklenmiyor - POST verisi yok sayýlýyor!

source: Discarding POST data...
cs: Zahazuji POST data...
tr: POST verisi siliniyor...

source: Document will not be reloaded!
cs: Dokument nebude znovu naèten!
tr: Belge geri yüklenmeyecek!

source: Location:
cs: Umístìní:
tr: Konum:

source: '%s' not found!
cs: '%s' nebylo nalezeno!
tr: '%s' bulunamadý!

source: Default Bookmark File
cs: Implicitní soubor zálo¾ek
tr: Öntanýmlý Yer Ými Dosyasý

source: Screen too small! (8x35 min)
cs: Obrazovka je pøíli¹ malá! (alespoò 8x35)
tr: Ekran çok küçük! (en az 8x35)

source: Select destination or ^G to Cancel:
cs: Zvolte cíl èi zru¹te pomocí ^G:
tr: Varýþ noktasýný seçiniz ya da iptal etmek için ^G:

source: Select subbookmark, '=' for menu, or ^G to cancel:
cs: Zvolte zálo¾ku, '=' pro menu èi ^G pro zru¹ení:
tr: Alt yer imini seçiniz, menü için '=' ya da iptal etmek için ^G:

source: Reproduce L)ink in this bookmark file or C)ancel? (l,c):
cs: L>Duplikovat zálo¾ku v tomto souboru èi C>Zru¹it? (l,c):
tr: Bu yer imi dosyasýndaki bað(L)antý çoðaltýlsýn mý, iptal(C) mi edilsin? (l,c):

source: Multiple bookmark support is not available.
cs: Dìlené zálo¾ky nejsou podporovány.
tr: Çok sayýda yer imi desteði mevcut deðil...

source: Select Bookmark (screen %d of %d)
cs: Zvolte zálo¾ku (obrazovka %d/%d)
tr: Yer imini seçiniz (%2$d ekranýn %1$d.'si)

source: Select Bookmark
cs: Zvolte zálo¾ku
tr: Yer Ýmini Seçiniz

source: Editing Bookmark DESCRIPTION and FILEPATH (%d of 2)
cs: Nastavení podsouborù zálo¾ek a jejich popisu (%d/2)
tr: Yer Ými AÇIKLAMASI ve DOSYAYOLU düzenleniyor (2'nin %d'i)

source: Editing Bookmark DESCRIPTION and FILEPATH
cs: Nastavení podsouborù zálo¾ek a jejich popisu
tr: Yer Ými AÇIKLAMASI ve DOSYAYOLU düzenleniyor

source: Letter:
cs: Písmeno:
tr: Mektup:

source: Use a filepath off your login directory in SHELL syntax!
cs: Pou¾ijte jméno cesty z pøihla¹ovacího adresáøe a v syntaxi SHELLU!
tr: KABUK sözdiziminde giriþ dizininiz dýþýnda bir dosyayolu kullanýn!

source: Use a filepath off your home directory!
cs: Pou¾ijte jméno cesty z domácího adresáøe!
tr: Ana dizininiz dýþýnda bir dosyayolu kullanýn!

source: Maximum links per page exceeded! Use half-page or two-line scrolling.
cs: Maximální poèet odkazù na stránku dosa¾en! Pou¾ijte posun o 1/2 strany èi 2 øádky.
tr: Sayfa baþýna maksimum link aþýldý! Yarým sayfa ya da iki satýrlýk kaydýrma kullanýn.

source: No previously visited links available!
cs: ®ádné nav¹tívené odkazy nejsou k dispozici!
tr: Önceden uðranmýþ link mevcut deðil!..

source: Memory exhausted! Program aborted!
cs: Do¹la pamì»! Program pøeru¹en!
tr: Bellek tükendi! Program yarýda kesildi!

source: Memory exhausted! Aborting...
cs: Do¹la pamì»! Pøeru¹uji...
tr: Bellek tükendi! Yarýda kesiliyor...

source: Not enough memory!
cs: Do¹la pamì»!
tr: Bellek yetersiz!

source: Directory/File Manager not available
cs: Správce souborù není k dispozici.
tr: Dizin/Dosya Yöneticisi mevcut deðil

source: HREF in BASE tag is not an absolute URL.
cs: Cílové URL v BASE znaèce není absolutní.
tr: BASE etiketindeki HREF mutlak bir URL deðil.

source: Location URL is not absolute.
cs: URL není absolutní.
tr: Konum URL'si mutlak deðil...

source: Refresh URL is not absolute.
cs: Obnovovací URL není absolutní.
tr: Yenile URL'si mutlak deðil...

source: You are sending a message with body to:
cs: Posíláte zprávu na:
tr: Þuraya gövdeli bir mesaj gönderiyorsunuz:

source: You are sending a comment to:
cs: Posíláte komentáø na:
tr: Þuraya bir yorum gönderiyorsunuz:

source: With copy to:
cs: S kopií na:
tr: Þuraya kopya ile:

source: With copies to:
cs: S kopiemi na:
tr: Þuraya kopyalar ile:

source: Use Ctrl-G to cancel if you do not want to send a message
cs: Odeslání zprávy mù¾ete zru¹it pomocí Ctrl-G.
tr: Eðer bir mesaj göndermek istemiyorsanýz iptal etmek için Ctrl-G kullanýn

source: Please enter your name, or leave it blank to remain anonymous
cs: Zadejte va¹e jméno, nebo ponechte prázdné, aby jste zùstal v anonymitì.
tr: Lütfen ya adýnýzý girin, ya da anonim kalmak için boþ býrakýn

source: Please enter a mail address or some other
cs: Pokud chcete dostat odpovìï, udejte adresu
tr: Lütfen bir e-posta adresi ya da benzerini girin

source: means to contact you, if you desire a response.
cs: elektronické po¹ty èi jiný kontakt na vás.
tr: eðer bir yanýt arzularsanýz, size ulaþma yollarý.

source: Please enter a subject line.
cs: Zadejte pøedmìt.
tr: Lütfen bir konu satýrý giriniz.

source: Enter a mail address for a CC of your message.
cs: Zadejte adresu pro odeslání kopie této zprávy.
tr: Mesajýnýzýn KK'sý için lütfen bir e-posta adresi giriniz.

source: (Leave blank if you don't want a copy.)
cs: (Ponechte prázdné, pokud kopie nechcete poslat.)
tr: (Bir kopya istemiyorsanýz boþ býrakýnýz.)

source: Please review the message body:
cs: Zkontrolujte tìlo zprávy:
tr: Lütfen mesaj gövdesini gözden geçiriniz:

source: Press RETURN to continue:
cs: Stisknìte RETURN pro pokraèování:
tr: Devam etmek için RETURN'e basýnýz:

source: Press RETURN to clean up:
cs: Stisknìte RETURN pro úklid:
tr: Temizlemek için RETURN'e basýnýz:

source: Use Control-U to erase the default.
cs: Pou¾ijte Control-U pro smazání implicitních hodnot.
tr: Öntanýmlýyý silmek için Control-U kullanýnýz.

source: Please enter your message below.
cs: Zadejte text va¹í zprávy.
tr: Lütfen mesajýnýzý aþaðýya giriniz.

source: When you are done, press enter and put a single period (.)
cs: A¾ budete hotov, stisknìte enter a napi¹te jednu teèku (.)
tr: Bitirdiðinizde enter'a basýp, yeni satýra tek bir nokta (.)

source: on a line and press enter again.
cs: na zaèátek øádku a stisknìte opìt enter.
tr: koyup tekrar enter'a basýnýz.

source: %s cookie: %.*s=%.*s Allow? (Y/N/Always/neVer)
cs: %s cookie: %.*s=%.*s Pøijmout? (Y/N/Always/neVer)
tr: %s çerez: %.*s=%.*s Ýzin verir misiniz? Evet(Y)/Hayýr(N)/Her zaman(A)/Asla(V)

source: Accept invalid cookie domain=%s for '%s'?
cs: Pøijmout chybnou cookie doménu (%s) pro '%s'?
tr: '%2$s' için geçersiz çerez yöresi=%1$s kabul edilsin mi?

source: Accept invalid cookie path=%s as a prefix of '%s'?
cs: Pøijmout chybnou cookie cestu (%s) jako prefix '%s'?
tr: '%2$s'in öneki olarak geçersiz çerez yolu=%1$s kabul edilsin mi?

source: Allowing this cookie.
cs: Cookie pøijmuto.
tr: Bu çereze izin veriliyor.

source: Rejecting this cookie.
cs: Cookie zamítnuto.
tr: Bu çerez reddediliyor.

source: The Cookie Jar is empty.
cs: Sklad cookies je prázdný.
tr: Çerez kavanozu boþ...

source: The Cache Jar is empty.
tr: Önbellek Kavanozu boþ.

source: Activate links to gobble up cookies or entire domains,
tr: Çerezleri ya da tüm yöreleri silip süpürmek, bir yörenin 'izin' ayarlarýný

source: or to change a domain's 'allow' setting.
tr: deðiþtirmek için linkleri etkinleþtiriniz.

source: (Cookies never allowed.)
cs: (Cookies zakázány)
tr: (Çerezlere asla izin verilmiyor.)

source: (Cookies always allowed.)
cs: (Cookies v¾dy povoleny)
tr: (Çerezlere her zaman izin veriliyor.)

source: (Cookies allowed via prompt.)
cs: (Pøijetí cookies musí potvrdit u¾ivatel.)
tr: (Çerezlere bilgi istemi aracýlýðýyla izin veriliyor.)

source: (Persistent Cookies.)
cs: (Trvalé cookies)
tr: (Kalýcý çerezler.)

source: (No title.)
cs: (®ádný titulek)
tr: (Baþlýk yok.)

source: (No name.)
cs: (®ádné jméno)
tr: (Ýsim yok.)

source: (No value.)
cs: (®ádná hodnota)
tr: (Deðer yok.)

source: None
cs: Nic
tr: Hiçbiri

source: (End of session.)
cs: (Konec sezení)
tr: (Oturum sonu.)

source: Delete this cookie?
cs: Smazat toto cookie?
tr: Bu çerez silinsin mi?

source: The cookie has been eaten!
cs: Cookie bylo smazáno!
tr: Çerez yendi!

source: Delete this empty domain?
cs: Smazat tuto prázdnou doménu?
tr: Bu boþ yöre silinsin mi?

source: The domain has been eaten!
cs: Doména byla smazána!
tr: Yöre yendi!

source: D)elete domain's cookies, set allow A)lways/P)rompt/neV)er, or C)ancel?
cs: D>Smazat cookies z domény, pøijmout A>V¾dy/P)o potvrzení/V>Nikdy èi C>Zru¹it?
tr: Yörenin çerezlerini silin(D), izin verin her zaman(A)/sor(P)/asla(V), ya da vazgeç(C)?

source: D)elete domain, set allow A)lways/P)rompt/neV)er, or C)ancel?
cs: D>Smazat doménu, pøijmout A>V¾dy/P)o potvrzení/V>Nikdy èi C>Zru¹it?
tr: Yöreyi silin(D), izin verin her zaman(A)/sor(P)/asla(V), ya da vazgeç(C)?

source: All cookies in the domain have been eaten!
cs: V¹echna cookie v této doménì byly smazána!
tr: Yöredeki tüm çerezler yendi!

source: 'A'lways allowing from domain '%s'.
cs: 'A'V¾dy pøijímám z domény '%s'.
tr: '%s' yöresine her zaman(A) izin veriliyor.

source: ne'V'er allowing from domain '%s'.
cs: 'V'Nikdy nepøijímám z domény '%s'.
tr: '%s' yöresine asla(V) izin verilmiyor.

source: 'P'rompting to allow from domain '%s'.
cs: Pøijetí z domény '%s' musí 'p'otvrdit u¾ivatel.
tr: '%s' yöresine izin vermek için soruluyor(P).

source: Delete all cookies in this domain?
cs: Smazat v¹echny cookies v této doménì?
tr: Bu yöredeki tüm çerezler silinsin mi?

source: All of the cookies in the jar have been eaten!
cs: Ùlo¾na cookies byla vyprázdnìna!
tr: Kavanozdaki tüm çerezler yendi!

source: Port 19 not permitted in URLs.
cs: URL nesmí obsahovat port 19.
tr: Port 19'a URL'lerde izin verilmiyor.

source: Port 25 not permitted in URLs.
cs: URL nesmí obsahovat port 25.
tr: Port 25'e URL'lerde izin verilmiyor.

source: Port %lu not permitted in URLs.
cs: URL nesmí obsahovat port %lu.
tr: Port %lu'e URL'lerde izin verilmiyor.

source: URL has a bad port field.
cs: URL obsahuje chybný port.
tr: URL'de bozuk port alaný var.

source: Maximum nesting of HTML elements exceeded.
cs: Maximální povolený poèet vnoøení HTML prvkù pøekroèen.
tr: HTML bileþenlerinin maksimum içiçe geçme sýnýrý aþýldý.

source: Bad partial reference! Stripping lead dots.
cs: Chybný relativní odkaz! Odtrhuji úvodní teèky.
tr: Bozuk kýsmi referans! Yol gösterici noktalar soyuluyor.

source: Trace Log open failed. Trace off!
cs: Nepodaøilo se otevøít soubor pro záznam èinnosti. Sledování vypnuto!
tr: Ýzleme Kütüðünün açýlmasý baþarýsýz. Ýzleme kapatýldý!

source: Lynx Trace Log
cs: Záznam èinnosti programu Lynx
tr: Lynx Ýzleme Kütüðü

source: No trace log has been started for this session.
cs: Pro toto sezení nebylo sledování spu¹tìno.
tr: Bu oturum için hiç izleme kütüðü baþlatýlmadý.

source: The maximum temporary file count has been reached!
cs: Maximální povolený poèet doèasných souborù pøekroèen.
tr: Maksimum geçici dosya sayýsýna ulaþýldý!

source: Form field value exceeds buffer length! Trim the tail.
cs: Hodnota pole formuláøe pøesahuje délku bufferu! Zkra»te ji.
tr: Form alaný deðeri tampon uzunluðunu aþmakta! Kuyruðunu kýrpýn.
