Repository: openbsd/src
Catalog: gnu/usr.bin/lynx/po/*.po
Languages: cs, tr

source: Jump to (use '?' for list):
cs: Skoèit na ('?' pro seznam):
tr: Sýçranacak yer (liste için '?' kullanýnýz):

source: Jumping to a shortcut URL is disallowed!
cs: Není povoleno pøeskakovat na zkrácená URL!
tr: Bir kýsayol URL'ye sýçramaya izin verilmiyor!

source: Random URL is disallowed! Use a shortcut.
cs: Náhodná URL jsou zakázána! Pou¾ijte zkratku.
tr: Rastgele URL'ye izin verilmiyor! Bir kýsayol kullanýnýz.

source: No random URLs have been used thus far.
cs: Doposud nebyla pou¾ita ¾ádná náhodná URL.
tr: Þimdiye dek hiç rastgele URL kullanýlmadý.

source: Bookmark features are currently disabled.
cs: Pou¾ívání zálo¾ek je nyní zakázáno.
tr: Yer imi özellikleri halen devre dýþý...

source: Execution via bookmarks is disabled.
cs: Spou¹tìní programù pøes soubory zálo¾ek je zakázáno.
tr: Yer imleriyle icra devre dýþý...

source: Bookmark file is not defined. Use %s to see options.
cs: Soubor se zálo¾kami není zadán. Pou¾ijte %s pro zobrazení mo¾ností.
tr: Yer imi dosyasý tanýmlanmamýþ. Seçenekleri görmek için %s kullanýnýz.

source: Unable to open tempfile for X Mosaic hotlist conversion.
cs: Doèasný soubor pro konverzi X Mosaic 'hotlistu' nelze otevøít.
tr: X Mosaic sýcakliste dönüþümü için geçici dosya açýlamadý.

source: ERROR - unable to open bookmark file.
cs: CHYBA - soubor zálo¾ek nelze otevøít.
tr: HATA - yer imi dosyasý açýlamadý.

source: Unable to open bookmark file for deletion of link.
cs: Zálo¾ku nelze smazat: soubor zálo¾ek nelze otevøít
tr: Linkin silinebilmesi için yer imi dosyasý açýlamadý.

source: Unable to open scratch file for deletion of link.
cs: Zálo¾ku nelze smazat: doèasný soubor nelze otevøít
tr: Linkin silinebilmesi için müsvedde dosyasý açýlamadý.

source: Error renaming scratch file.
cs: Chyba pøi pøejmenovávání doèasného souboru.
tr: Müsvedde dosyasýnýn yeniden adlandýrýlmasýnda hata...

source: Error renaming temporary file.
cs: Chyba pøi pøejmenovávání doèasného souboru.
tr: Geçici dosyanýn yeniden adlandýrýlmasýnda hata...

source: Unable to copy temporary file for deletion of link.
cs: Zálo¾ku nelze smazat: doèasný soubor nelze kopírovat
tr: Linkin silinebilmesi için geçici dosya kopyalanamýyor.

source: Unable to reopen temporary file for deletion of link.
cs: Zálo¾ku nelze smazat: doèasný soubor nelze znovu otevøít
tr: Linkin silinebilmesi için geçici dosya yeniden açýlamýyor.

source: Link is not by itself all on one line in bookmark file.
cs: Zálo¾ka je del¹í ne¾ jeden øádek.
tr: Yer imi dosyasýndaki link kendi baþýna tek satýrda deðil.

source: Bookmark deletion failed.
cs: Odstranìní zálo¾ky se nezdaøilo.
tr: Yer iminin silinmesi baþarýsýz.

source: Bookmark files cannot be traversed (only http URLs).
cs: Soubory se zálo¾kami nelze prolézat (pouze http URL).
tr: Yer imi dosyalarý nakledilemez (yalnýzca http URL'ler edilebilir).

source: Unable to open bookmark file, use 'a' to save a link first
cs: Soubor se zálo¾kami nelze otevøít. Klávesou 'a' nejprve ulo¾te odkaz
tr: Yer imi dosyasý açýlamadý, önce linki kaydetmek için 'a'yý kullanýn

source: There are no links in this bookmark file!
cs: Tento soubor zálo¾ek je prázdný!
tr: Bu yer imi dosyasýnda hiç link yok!

source: D)elete cached document or C)ancel? (d,c):
tr: Önbellekteki belge silinsinD) mi, iptalC) mi edilsin? (d,c):

source: Save D)ocument or L)ink to bookmark file or C)ancel? (d,l,c):
cs: Ulo¾it do souboru se zálo¾kami D)okument, L>Odkaz èi C>Zru¹it? (d,l,c):
tr: Yer imi dosyasýna belge(D), link(L) kaydedilsin mi, iptal(C) mi edilsin? (d,l,c):

source: Save D)ocument to bookmark file or C)ancel? (d,c):
cs: Ulo¾it do souboru se zálo¾kami D)okument èi C>Zru¹it? (d,c):
tr: Yer imi dosyasýna belge(D) kaydedilsin mi, iptal(C) mi edilsin? (d,c):

source: Save L)ink to bookmark file or C)ancel? (l,c):
cs: Ulo¾it do souboru se zálo¾kami L>Odkaz èi C>Zru¹it? (l,c):
tr: Yer imi dosyasýna link(L) kaydedilsin mi, iptal(C) mi edilsin? (l,c):

source: Documents from forms with POST content cannot be saved as bookmarks.
cs: Zálo¾ky pro dokumenty s POST obsahem ukládat nelze.
tr: POST içerikli formdan olan belgeler, yer imi olarak kaydedilemez.

source: Cannot save form fields/links
cs: Formuláøová pole/odkazy nelze ukládat.
tr: Form alanlarý/linkleri kaydedilemiyor

source: History, showinfo, menu and list files cannot be saved as bookmarks.
cs: Zálo¾ky pro historii, showinfo, menu a seznamy nelze ukládat.
tr: Tarihçe, bilgi-göster, menü ve liste dosyalarý yer imi olarak kaydedilemez.

source: Do you really want to delete this link from your bookmark file?
cs: Opravdu chcete vymazat tento odkaz z va¹eho souboru se zálo¾kami?
tr: Yer imi dosyanýzdan bu linki silmek istediðinize emin misiniz?

source: Malformed address.
cs: Chybná adresa.
tr: Bozuk adres

source: Historical comment parsing ON (Minimal is overridden)!
cs: Historické komentáøe zapnuto (minimální komentáøe potlaèeny)!
tr: Tarihsel yorum ayrýþtýrma AÇIK (Minimal geçersiz kýlýnmýþ)!

source: Historical comment parsing OFF (Minimal is in effect)!
cs: Historické komentáøe vypnuty (minimální komentáøe aktivní)!
tr: Tarihsel yorum ayrýþtýrma KAPALI (Minimal yürürlükte)!

source: Historical comment parsing ON (Valid is overridden)!
cs: Historické komentáøe zapnuty (platné komentáøe potlaèeny)!
tr: Tarihsel yorum ayrýþtýrma AÇIK (Valid geçersiz kýlýnmýþ)!

source: Historical comment parsing OFF (Valid is in effect)!
cs: Historické komentáøe vypnuty (platné komentáøù aktivní)!
tr: Tarihsel yorum ayrýþtýrma KAPALI (Valid yürürlükte)!

source: Minimal comment parsing ON (and in effect)!
cs: Pou¾ívání minimálních komentáøù zapnuto a aktivní!
tr: Minimal yorum ayrýþtýrma AÇIK (ve yürürlükte)!

source: Minimal comment parsing OFF (Valid is in effect)!
cs: Pou¾ívání minimálních komentáøù vypnuto (platné komentáøe aktivní)!
tr: Minimal yorum ayrýþtýrma KAPALI (Valid yürürlükte)!

source: Minimal comment parsing ON (but Historical is in effect)!
cs: Pou¾ívání minimálních komentáøù zapnuto (ale aktivní jsou historické komentáøe)!
tr: Minimal yorum ayrýþtýrma AÇIK (ancak Tarihsel yürürlükte)!

source: Minimal comment parsing OFF (Historical is in effect)!
cs: Pou¾ívání minimálních komentáøù vypnuto (historické komentáøù aktivní)!
tr: Minimal yorum ayrýþtýrma KAPALI (Tarihsel yürürlükte)!

source: Soft double-quote parsing ON!
cs: Pou¾ívání '>' jako zakonèení znaèek a citací zapnuto!
tr: Salt çift-týrnak ayrýþtýrma AÇIK!

source: Soft double-quote parsing OFF!
cs: Pou¾ívání '>' jako zakonèení znaèek a citací vypnuto!
tr: Salt çift-týrnak ayrýþtýrma KAPALI!

source: Now using TagSoup parsing of HTML.
cs: Pou¾ívám 'TagSoup' metodu zpracování HTML.
tr: Þu an HTML'nin TagSoup ayrýþtýrmasý kullanýlýyor.

source: Now using SortaSGML parsing of HTML!
cs: Pou¾ívám 'SortaSGML' metodu zpracování HTML!
tr: Þu an HTML'nin SortaSGML ayrýþtýrmasý kullanýlýyor!

source: You are already at the end of this document.
cs: Ji¾ jste na konci dokumentu.
tr: Zaten bu belgenin sonundasýnýz.

source: You are already at the beginning of this document.
cs: Ji¾ jste na zaèátku dokumentu.
tr: Zaten bu belgenin baþýndasýnýz.

source: You are already at page %d of this document.
cs: Ji¾ jste na stranì %d.
tr: Zaten bu belgenin %d. sayfasýndasýnýz.

source: Link number %d already is current.
cs: Odkaz èíslo %d je právì zvolen.
tr: %d no'lu link zaten güncel...

source: You are already at the first document
cs: Jste na prvním dokumentu.
tr: Zaten birinci belgedesiniz

source: There are no links above this line of the document.
cs: Nad tímto øádkem ji¾ nejsou ¾ádné odkazy.
tr: Belgenin bu satýrýndan önce hiç link yok...

source: There are no links below this line of the document.
cs: Pod tímto øádkem ji¾ nejsou ¾ádné odkazy.
tr: Belgenin bu satýrýndan sonra hiç link yok...

source: Maximum length reached! Delete text or move off field.
cs: Maximální délka dosa¾ena! Sma¾te text, nebo se pøesuòte mimo pole.
tr: Maksimum uzunluða ulaþýldý! Metin silin ya da alanýn dýþýna çýkýn.

source: You are not on a form submission button or normal link.
cs: Toto není bì¾ný odkaz ani tlaèítko na odeslání formuláøe.
tr: Form gönderme düðmesi ya da normal baðlantý üzerinde deðilsiniz.

source: One radio button must be checked at all times!
cs: V¾dy musí být vybráno alespoò jedno z pøepínacích tlaèítek!
tr: Radyo düðmelerinden biri mutlaka seçilmiþ olmalýdýr!

source: No submit button for this form, submit single text field?
cs: Tento formuláø nemá tlaèítko pro odeslání dat. Odeslat jediné textové pole?
tr: Formda gönder düðmesi yok, tek metin alaný gönderilsin mi?

source: Do you want to go back to the previous document?
cs: Chcete se vrátit k pøedchozímu dokumentu?
tr: Önceki belgeye dönmek ister misiniz?

source: Use arrows or tab to move off of field.
cs: Pou¾ijte ¹ipky èi tabelátor pro pøesun mimo pole.
tr: Alanýn dýþýna çýkmak için oklarý ya da sekmeyi kullanýnýz.

source: Enter text. Use arrows or tab to move off of field.
cs: Vlo¾te text. Pou¾ijte ¹ipky èi tabelátor pro pøesun mimo pole.
tr: Metin giriniz. Alanýn dýþýna çýkmak için oklarý ya da sekmeyi kullanýnýz.

source: ** Bad HTML!! No form action defined. **
cs: ** Chybné HTML!! Formuláø nemá definovánu ¾ádnou akci. **
tr: **Bozuk HTML!! Hiçbir form eylemi tanýmlanmamýþ. **

source: Bad HTML!! Unable to create popup window!
cs: Chybné HTML!! Nelze vytvoøit vyskakovací okno!
tr: Bozuk HTML!! Beliriveren pencere oluþturulamadý!

source: Unable to create popup window!
cs: Nelze vytvoøit vyskakovací okno!
tr: Beliriveren pencere oluþturulamadý!

source: Goto a random URL is disallowed!
cs: Náhodná URL je zakázáno pou¾ít jako cíl!
tr: Rastgele URL'ye gitmeye izin verilmiyor!

source: Goto a non-http URL is disallowed!
cs: Ne-http URL je zakázáno pou¾ít jako cíl!
tr: Http olmayan URL'ye gitmeye izin verilmiyor!

source: You are not allowed to goto "%s" URLs
tr: "%s" URL'lere gitme izniniz yok

source: URL to open:
cs: Cílové URL:
tr: Açýlacak URL:

source: Edit the current Goto URL:
cs: Editace aktuálního cílového URL:
tr: Mevcut Gidilecek URL'yi düzenleyiniz:

source: Edit the previous Goto URL:
cs: Editace pøedchozího cílového URL:
tr: Önceki Gidilecek URL'yi düzenleyiniz:

source: Edit a previous Goto URL:
cs: Editace pøedchozího cílového URL:
tr: Önceki Gidilecek URL'lerden birini düzenleyiniz:

source: Current document has POST data.
cs: Aktuální dokument obsahuje POST data.
tr: Mevcut belgede POST verisi var.

source: Edit this document's URL:
cs: Editace URL tohoto dokumentu:
tr: Bu belgenin URL'sini düzenleyiniz:

source: Edit the current link's URL:
cs: Editace URL aktuálního odkazu:
tr: Mevcut linkin URL'sini düzenleyiniz:

source: You cannot edit File Management URLs
cs: Nemù¾ete editovat URL Správce souborù
tr: Dosya Yönetim URL'lerini düzenleyemezsiniz

source: Enter a database query:
cs: Zadejte dotaz na databázi:
tr: Bir veritabaný sorgusu giriniz:

source: Enter a whereis query:
cs: Zadejte hledaný øetìzec:
tr: Bir whereis sorgusu giriniz:

source: Edit the current query:
cs: Editace aktuálního dotazu:
tr: Mevcut sorguyu düzenleyiniz:

source: Edit the previous query:
cs: Editace pøedchozího dotazu:
tr: Önceki sorguyu düzenleyiniz:

source: Edit a previous query:
cs: Editace pøedchozího dotazu:
tr: Önceki sorgulardan birini düzenleyiniz:

source: Use Control-R to resubmit the current query.
cs: Pou¾ijte Control-R pro opìtovné odeslání dotazu.
tr: Mevcut sorguyu yeniden göndermek için Control-R'yi kullanýnýz.

source: Edit the current shortcut:
cs: Editovat aktuální zkratku:
tr: Mevcut kýsayolu düzenleyiniz:

source: Edit the previous shortcut:
cs: Editovat pøedchozí zkratku:
tr: Önceki kýsayolu düzenleyiniz:

source: Edit a previous shortcut:
cs: Editovat pøedchozí zkratku:
tr: Önceki kýsayollardan birini düzenleyiniz:

source: Key '%c' is not mapped to a jump file!
cs: Klávesa '%c' není svázána se souborem zkratek!
tr: '%c' tuþu, herhangi bir sýçrama dosyasýna eþlemlenmemiþ!

source: Cannot locate jump file!
cs: Soubor zkratek nelze nalézt!
tr: Sýçrama dosyasý konumlandýrýlamýyor!

source: Cannot open jump file!
cs: Soubor zkratek nelze otevøít!
tr: Sýçrama dosyasý açýlamýyor!

source: Error reading jump file!
cs: Chyba pøi ètení souboru zkratek!
tr: Sýçrama dosyasýnýn okunmasýnda hata!

source: Out of memory reading jump file!
cs: Pøi ètení souboru zkratek do¹la pamì»!
tr: Sýçrama dosyasýnýn okunmasýnda bellek yetersiz!

source: Out of memory reading jump table!
cs: Pøi ètení tabulky zkratek do¹la pamì»!
tr: Sýçrama tablosunun okunmasýnda bellek yetersiz!

source: No index is currently available.
cs: Není dostupný ¾ádný rejstøík.
tr: Halen hiç indeks yok.

source: Do you really want to go to the Main screen?
cs: Opravdu chcete pøejít na hlavní obrazovku?
tr: Ana ekrana gitmeyi gerçekten istiyor musunuz?

source: You are already at main screen!
cs: Ji¾ jste na hlavní obrazovce!
tr: Zaten ana ekrandasýnýz!

source: Not a searchable indexed document -- press '/' to search for a text string
cs: Toto není prohledávatelný rejstøík -- pou¾ijte '/' pro vyhledání øetìzce
tr: Aranabilir indekslenmiþ bir belge deðil -- metin dizgesi aramak için '/'ye basýnýz

source: No owner is defined for this file so you cannot send a comment
cs: Není udán vlastník tohoto dokumentu, tudí¾ nemù¾ete zaslat komentáø.
tr: Bu dosya için bir sahip tanýmlanmadýðýndan yorum gönderemezsiniz

source: No owner is defined. Use %s?
cs: Není udán vlastník. Pou¾ít %s?
tr: Sahip tanýmlanmamýþ. %s kullanmak ister misiniz?

source: Do you wish to send a comment?
cs: Chcete zaslat komentáø?
tr: Yorum göndermek ister misiniz?

source: Mail is disallowed so you cannot send a comment
cs: Po¹ta je zakázána, tudí¾ nemù¾ete zaslat komentáø.
tr: Mektuba izin verilmediðinden yorum gönderemezsiniz

source: The 'e'dit command is currently disabled.
cs: Pou¾ití pøíkazu 'e' je nyní zakázáno.
tr: Düzenl'e' komutu halen devre dýþý...

source: External editing is currently disabled.
cs: pou¾ívání externího editoru je nyní zakázáno.
tr: Harici düzenleme halen devre dýþý...

source: System error - failure to get status.
cs: Systémová chyba - status nelze zjistit.
tr: Sistem hatasý - durum alýmý baþarýsýz.

source: No editor is defined!
cs: Není zadán ¾ádný editor!
tr: Hiçbir düzenleyici tanýmlanmamýþ!

source: The 'p'rint command is currently disabled.
cs: Pou¾ití pøíkazu 'p' je nyní zakázáno.
tr: Yazdýr(p) komutu halen devre dýþý...

source: Document has no Toolbar links or Banner.
cs: Dokument nemá ¾ádnou nástrojovou li¹tu ani reklamní nudli.
tr: Belgede araç çubuðu linki ya da afiþ yok...

source: Unable to open traversal file.
cs: Nelze otevøít 'traverse' soubor.
tr: Nakil dosyasý açýlamýyor.

source: Unable to open traversal found file.
cs: Nelze otevøít 'traverse_found' soubor.
tr: Nakil bulunmuþ dosya açýlamýyor.

source: Unable to open reject file.
cs: Nelze otevøít 'traverse_reject' soubor.
tr: Red dosyasý açýlamýyor.

source: Unable to open traversal errors output file
cs: Nelze otevøít 'traverse_errors' soubor.
tr: Nakil hatalarý çýktý dosyasý açýlamýyor

source: TRAVERSAL WAS INTERRUPTED
cs: PROLÉZÁNÍ BYLO PØERU©ENO
tr: NAKÝL YARIDA KESÝLDÝ

source: Follow link (or goto link or page) number:
cs: Následovat odkaz (èi jít na odkaz nebo stránku) èíslo:
tr: Ýzlenecek link (ya da Gidilecek link/sayfa) no:

source: Select option (or page) number:
cs: Zvolte èíslo volby (èi strany):
tr: Seçenek (ya da sayfa) no seçiniz:

source: Option number %d already is current.
cs: Volba èíslo %d je právì aktivní.
tr: %d no'lu seçenek zaten güncel.

source: You are already at the end of this option list.
cs: Jste na konci seznamu voleb.
tr: Zaten bu seçenek listesinin sonundasýnýz.

source: You are already at the beginning of this option list.
cs: Jste na zaèátku seznamu voleb.
tr: Zaten bu seçenek listesinin baþýndasýnýz.

source: You are already at page %d of this option list.
cs: Ji¾ jste na stranì %d nabídky.
tr: zaten bu seçenek listesinin %d. sayfasýndasýnýz.

source: You have entered an invalid option number.
cs: Zadal jste chybné èíslo volby.
tr: Geçersiz bir seçenek no'su girdiniz.

source: ** Bad HTML!! Use -trace to diagnose. **
cs: ** Chybné HTML!! Pou¾ijte -trace pro diagnostiku. **
tr: ** Bozuk HTML!! Taný için -trace kullanýnýz. **

source: Give name of file to save in
cs: Zadejte jméno souboru, do kterého mám ulo¾it
tr: Ýçine kaydedilecek dosya adý veriniz

source: Can't save data to file -- please run WWW locally
cs: Data nelze do souboru ulo¾it -- spus»te WWW místnì
tr: Veri, dosyaya kaydedilemiyor -- lütfen WWW'yu yerel çalýþtýrýn

source: Can't open temporary file!
cs: Doèasný soubor nelze otevøít!
tr: Geçici dosya açýlamýyor!

source: Can't open output file! Cancelling!
cs: Výstupní soubor nelze otevøít! Ru¹ím!
tr: Çýktý dosyasý açýlamýyor! Ýptal ediliyor!

source: Execution is disabled.
cs: Spou¹tìní programù je zakázáno.
tr: Ýcra etme devre dýþý...

source: Execution is not enabled for this file. See the Options menu (use %s).
cs: Tento soubor nelze spustit. Viz Konfiguraèní menu (pou¾ijte %s).
tr: Ýcra etme, bu dosya için etkinleþtirilmemiþ. Seçenekler menüsüne bakýnýz (%s kullanýn).

source: Execution capabilities are not compiled into this version.
cs: Podpora pro spou¹tìní programù byla vypnuta pøi pøekladu programu.
tr: Ýcra etme yetileri bu sürüm içine derlenmemiþ.

source: This file cannot be displayed on this terminal.
cs: Tento soubor nelze na tomto terminálu zobrazit.
tr: Bu dosya, bu uçbirimde görüntülenemez.

source: This file cannot be displayed on this terminal: D)ownload, or C)ancel
cs: Tento soubor nelze na tomto terminálu zobrazit: D>Stáhnout èi C>Zru¹it
tr: Bu dosya, bu uçbirimde görüntülenemez: Ýndir(D) ya da Ýptal et(C)

source: %s D)ownload, or C)ancel
cs: %s D>Stáhnout èi C>Zru¹it
tr: %s Ýndir(D) ya da Ýptal et(C)

source: Cancelling file.
cs: Zru¹eno
tr: Dosya iptal ediliyor.

source: Retrieving file. - PLEASE WAIT -
cs: Stahuji soubor. - POÈKEJTE, PROSÍM -
tr: Dosya alýnýyor. - LÜTFEN BEKLEYÝNÝZ -

source: Enter a filename:
cs: Zadejte jméno souboru:
tr: Bir dosya adý giriniz:

source: Edit the previous filename:
cs: Editace pøedchozího jména souboru:
tr: Önceki dosya adýný düzenleyiniz:

source: Edit a previous filename:
cs: Editace pøedchozího jména souboru:
tr: Önceki dosya adlarýndan birini düzenleyiniz:

source: Enter a new filename:
cs: Zadejte nové jméno souboru:
tr: Yeni bir dosya adý giriniz:

source: File name may not begin with a dot.
cs: Jméno souboru nesmí zaèínat teèkou.
tr: Dosya adý noktayla baþlayamaz.

source: File exists. Create higher version?
cs: Soubor ji¾ existuje. Vytvoøit jeho novou verzi?
tr: Dosya zaten var. Daha yüksek sürüm oluþturulsun mu?

source: File exists. Overwrite?
cs: Soubor ji¾ existuje. Pøepsat?
tr: Dosya zaten var. Üzerine yazýlsýn mý?

source: Cannot write to file.
cs: Do souboru nelze zapisovat.
tr: Dosyaya yazýlamýyor.

source: ERROR! - download command is misconfigured.
cs: CHYBA! - pøíkaz pro stahování je chybný
tr: HATA! - indir komutu yanlýþ ayarlanmýþ.

source: Unable to download file.
cs: Soubor nelze stáhnout.
tr: Dosya indirilemiyor.

source: Reading directory...
cs: Ètu adresáø...
tr: Dizin okunuyor...

source: Building directory listing...
cs: Sestavuji výpis adresáøe...
tr: Dizin listesi yapýlanýyor...

source: Saving...
cs: Ukládám...
tr: Kaydediliyor...

source: Could not edit file '%s'.
cs: Soubor '%s' nelze editovat.
tr: '%s' dosyasý düzenlenemedi.

source: Unable to access document!
cs: Pøístup k dokumentu nelze získat!
tr: Belgeye eriþilemedi!

source: Could not access file.
cs: Soubor není dostupný.
tr: Dosyaya eriþilemedi.

source: Could not access directory.
cs: Adresáø není dostupný.
tr: Dizine eriþilemedi.

source: Could not load data.
cs: Nelze naèíst data.
tr: Veri yüklenemedi.

source: Lynx cannot currently (e)dit remote WWW files.
cs: V souèasné dobì nelze vzdálené WWW dokumenty z Lynxu (e)ditovat.
tr: Lynx, halen uzak WWW dosyalarýný düz(e)nleyemiyor.

source: This field cannot be (e)dited with an external editor.
cs: Toto pole nemù¾e být (e)ditováno pomocí externího editoru.
tr: Bu alan, harici bir düzenleyiciyle düz(e)nlenemez.

source: Bad rule
cs: Chybné pravidlo
tr: Hatalý kural

source: Insufficient operands:
cs: Chybí operandy:
tr: Ýþlenenler yetersiz:

source: You are not authorized to edit this file.
cs: Nejste oprávnìn editovat tento soubor.
tr: Bu dosyayý düzenleme yetkiniz yok.

source: Title:
cs: Titulek:
tr: Baþlýk:

source: Subject:
cs: Pøedmìt:
tr: Konu:

source: Username:
cs: U¾ivatelské jméno:
tr: Kullanýcý adý:

source: Password:
cs: Heslo:
tr: Parola:

source: lynx: Username and Password required!!!
cs: lynx: Je tøena u¾ivatelské jméno a heslo!!!
tr: lynx: Kullanýcý adý ve Parola zorunludur!!!

source: lynx: Password required!!!
cs: Lynx: Je tøeba heslo!!!
tr: lynx: Parola zorunludur!!!

source: Clear all authorization info for this session?
cs: Smazat v¹echny autorizaèní informace pro toto sezení?
tr: Bu oturum için tüm yetkilendirme bilgisi silinsin mi?

source: Authorization info cleared.
cs: Autorizaèní informace smazány.
tr: Yetkilendirme bilgisi silindi.

source: Authorization failed. Retry?
cs: Autorizace se nezdaøila. Nový pokus?
tr: Yetkilendirme baþarýsýz. Yinele?

source: cgi support has been disabled.
cs: podpora cgi byla vypnuta.
tr: cgi desteði devre dýþý...

source: Lynxcgi capabilities are not compiled into this version.
cs: Podpora pro spou¹tìní cgi byla vypnuta pøi pøekladu programu.
tr: Lynxcgi yetileri bu sürüm içine derlenmemiþ.

source: Sorry, no known way of converting %s to %s.
cs: Není znám zpùsob jak pøevést %s na %s.
tr: Üzgünüm, %s'i %s'e dönüþtürmenin bilinen yöntemi yok.

source: Unable to set up connection.
cs: Spojení nelze navázat.
tr: Baðlantý saðlanamýyor.

source: Unable to make connection
cs: Spojení nelze navázat.
tr: Baðlantý kurulamýyor

source: Executable link rejected due to malformed request.
cs: Chybný po¾adavek na spu¹tìní programu.
tr: Bozuk istem nedeniyle icra edilebilir baðlantý geri çevrildi.

source: Executable link rejected due to `%c' character.
cs: Odkaz na program obsahuje chybný znak `%c'.
tr: `%c' karakteri nedeniyle icra edilebilir baðlantý geri çevrildi.

source: Executable link rejected due to relative path string ('../').
cs: Odkaz na program nesmí být relativní ('../')'.
tr: Göreli yol dizgesi ('../') nedeniyle icra edilebilir baðlantý reddedildi.

source: Executable link rejected due to location or path.
cs: Odkaz na program odmítnut kvùli umístìní èi názvu cesty.
tr: Konum ya da yol nedeniyle icra edilebilir baðlantý reddedildi.

source: Mail access is disabled!
cs: Po¹ta je zakázána!
tr: E-posta eriþimi devre dýþý!..

source: Only files and servers on the local host can be accessed.
cs: Pøístup je povolen pouze k místním souborùm a slu¾bám.
tr: Yalnýzca yerel makinadaki dosya ve sunuculara eriþilebilir.

source: Telnet access is disabled!
cs: Pou¾ití telnetu je zakázáno!
tr: Telnet eriþimi devre dýþý!..

source: Telnet port specifications are disabled.
cs: Je zakázáno uvádìt port u telnetu.
tr: Telnet port belirleyicileri devre dýþý...

source: USENET news access is disabled!
cs: Pøístup do diskuzních skupin je zakázán!
tr: USENET haber eriþimi devre dýþý!..

source: Rlogin access is disabled!
cs: Pou¾ití rlogin je zakázáno!
tr: Rlogin eriþimi devre dýþý!..

source: Ftp access is disabled!
cs: Pou¾ití FTP je zakázáno!
tr: Ftp eriþimi devre dýþý!..

source: There are no references from this document.
cs: Tento dokument neobsahuje ¾ádné odkazy.
tr: Bu belgeden hiç referans yok...

source: There are only hidden links from this document.
cs: Tento dokument obsahuje pouze skryté odkazy.
tr: Bu belgeden yalnýzca gizli linkler var...

source: Unable to open command file.
cs: Soubor s pøíkazy nelze otevøít.
tr: Komut dosyasý açýlamýyor.

source: News Post Cancelled!!!
cs: Odeslání pøíspìvku do diskuzních skupin ZRU©ENO!!!
tr: Haber Gönderimi Ýptal Edildi!!!
