Repository: openbsd/src
Catalog: gnu/usr.bin/lynx/po/*.po
Languages: cs, tr

source: If vi_keys is set to "on", then the normal VI movement keys: j = down k = up h = left l = right will be enabled. These keys are only lower case. Capital 'H', 'J' and 'K will still activate help, jump shortcuts, and the keymap display, respectively.
cs: Pokud je volba vi_keys nastavena na "on", pak jsou bì¾né VI klávesy pro pohyb: j = dolù k = nahoru h = vlevo l = vpravo zapnuty. Fungují pouze malá písmena. Velké 'H', 'J' a 'K zapínají nápovìdu, zkrácená URL a výpis klávesové mapy.
tr: Eðer vi_keys "on" (açýk)a ayarlandýysa, o zaman normal VI gezinme tuþlarý olan j = aþaðý k = yukarý h = sol l = sað etkinleþtirilecektir. Bu tuþlar yalnýzca küçük harf þeklinde kullanýlýr. Büyük 'H', 'J' ve 'K', hâlâ sýrasýyla yardým, kýsayollara sýçrama ve tuþeþlem görüntülemeyi etkinleþtireceklerdir.

source: The visited_links setting controls how Lynx organizes the information in the Visited Links Page.
cs: Volba visited_links urèuje uspoøádání informací na stránce Nav¹tívených odkazù
tr: visited_links ayarý, Lynx'in Uðranmýþ Linkler Sayfasý'ndaki bilgiyi nasýl düzenleyeceðini denetler.

source: If keypad_mode is set to "NUMBERS_AS_ARROWS", then the numbers on your keypad when the numlock is on will act as arrow keys: 8 = Up Arrow 4 = Left Arrow 6 = Right Arrow 2 = Down Arrow and the corresponding keyboard numbers will act as arrow keys, regardless of whether numlock is on.
cs: Pokud je volba keypad_mode nastavena na "NUMBERS_AS_ARROWS", pak se èísla na numerické klávesnici pøi zapnutém numlock budou chovat jako kurzorové klávesy: 8 = Nahoru 4 = Vlevo 6 = Vpravo 2 = Dolù Èísla na hlavní klávesnici se budou chovat jako kurzorové klávesy bez ohledu na stav numlock.
tr: Eðer keypad_mode "NUMBERS_AS_ARROWS"a ayarlanýrsa, mini klavyenizdeki rakamlar, numlock açýk olduðunda ok tuþlarý gibi davranacaktýr: 8 = Yukarý Ok 4 = Sol Ok 6 = Sað Ok 2 = Aþaðý Ok ve karþýlýk gelen klavye rakamlarý, numlock'ýn açýk olup olmadýðýndan baðýmsýz olarak ok tuþlarý gibi davranacaktýr.

source: If keypad_mode is set to "LINKS_ARE_NUMBERED", then numbers will appear next to each link and numbers are used to select links.
cs: Pokud je volba keypad_mode nastavena na "LINKS_ARE_NUMBERED", pak v¹echny odkazy budou viditelnì oèíslovány a èísla budou pou¾ita ke zvolení pøíslu¹ného odkazu.
tr: Eðer keypad_mode "LINKS_ARE_NUMBERED"e ayarlanýrsa, her linkin yanýnda numaralar belirecek ve bu numaralar linkleri seçmekte kullanýlacaktýr.

source: If keypad_mode is set to "LINKS_AND_FORM_FIELDS_ARE_NUMBERED", then numbers will appear next to each link and visible form input field. Numbers are used to select links, or to move the "current link" to a form input field or button. In addition, options in popup menus are indexed so that the user may type an option number to select an option in a popup menu, even if the option isn't visible on the screen. Reference lists and output from the list command also enumerate form inputs.
cs: Pokud je volba keypad_mode nastavena na "LINKS_AND_FORM_FIELDS_ARE_NUMBERED", pak v¹echny odkazy a viditelná pole formuláøù budou viditelnì oèíslovány. Èísla budou pou¾ita ke zvolení pøíslu¹ného odkazu èi pøesunu na vstupní pole formuláøe èi tlaèítko. Volby vyskakovacích menu jsou indexovány, tak¾e u¾ivatel mù¾e zvolit polo¾ku napsáním jejího èísla i kdy¾ tato není viditelná na obrazovce. Seznamy odkazù a výstup pøíkazu 'list' jsou také èíslovány.
tr: Eðer keypad_mode "LINKS_AND_FORM_FIELDS_ARE_NUMBERED"e ayarlanýrsa, her link ve görünür form girdi alanýnýn yanýnda numaralar belirecektir. Bu numaralar, linkleri seçmede ya da "current link"(mevcut link)i bir form girdi alaný ya da düðmesine taþýmakta kullanýlýr. Ek olarak, açýlýr menülerdeki seçenekler indekslenmiþ olup, kullanýcý, seçenek ekranda görünmese bile bir seçenek no'su tuþlayarak seçeneði seçebilir. Referans listeleri ve list komutu çýktýsý da form girdilerini numaralandýrýr.

source: NOTE: Some fixed format documents may look disfigured when "LINKS_ARE_NUMBERED" or "LINKS_AND_FORM_FIELDS_ARE_NUMBERED" are enabled.
cs: POZOR: Formát nìkterých dokumentù s pevnou strukturou mù¾e pøi zapnutých volbách "LINKS_ARE_NUMBERED" a "LINKS_AND_FORM_FIELDS_ARE_NUMBERED" vypadat jako po¹kozený.
tr: NOT: "LINKS_ARE_NUMBERED" ya da "LINKS_AND_FORM_FIELDS_ARE NUMBERED" etkinleþtirildiðinde, bazý sabit biçemli belgeler bozuk þekilde görünebilir.

source: Lynx User Defaults File
tr: Lynx Kullanýcý Öntanýmlýlarý Dosyasý

source: This file contains options saved from the Lynx Options Screen (normally with the 'o' key). To save options with that screen, you must select the checkbox:
tr: Bu dosya Lynx Seçenekleri Ekraný'ndan kaydedilen seçenekleri içerir (normalde 'o' tuþuyla birlikte). O ekranla seçenekleri kaydetmek için onay kutusunu seçmelisiniz:

source: You must then save the settings using the link on the line above the checkbox:
tr: Daha sonra da onay kutusunun üstünde bulunan satýrdaki linki kullanarak ayarlarý kaydetmelisiniz:

source: You may also use the command-line option "-forms_options", which displays the simpler Options Menu instead. Save options with that using the '>' key.
tr: "-forms_options" komut satýrý seçeneðini de kullanabilirsiniz, bu, daha basit Seçenekler Menüsünü gösterecektir. Seçenekleri buradan '>' tuþunu kullanarak kaydedebilirsiniz.

source: This file contains options saved from the Lynx Options Screen (normally with the '>' key).
tr: Bu dosya Lynx Seçenekler Ekraný'ndan kaydedilmiþ seçenekleri içerir (normalde '>' tuþuyla).

source: There is normally no need to edit this file manually, since the defaults here can be controlled from the Options Screen, and the next time options are saved from the Options Screen this file will be completely rewritten. You have been warned... If you are looking for the general configuration file - it is normally called "lynx.cfg". It has different content and a different format. It is not this file.
tr: Buradaki öntanýmlýlar Seçenekler Ekraný'ndan kontrol edilebildiði ve seçenekler, Seçenekler Ekraný'ndan bir sonraki sefer kaydedildiðinde bu dosya tümüyle yeniden yazýlacaðýndan, normalde bu dosyayý elle düzenlemek gerekmez. Uyarýlmýþ oldunuz... Eðer genel ayarlama dosyasýný arýyorsanýz - normalde "lynx.cfg" olarak anýlýr. Onun farklý bir içeriði ve biçemi vardýr. O, bu dosya deðildir.

source: normal
cs: bì¾ný
