Repository: openbsd/src
Catalog: gnu/usr.bin/lynx/po/*.po
Languages: cs, tr

source: Alert!: %s
cs: Pozor!: %s
tr: Alarm!: %s

source: Welcome
cs: Vítejte
tr: Hoþgeldiniz

source: Are you sure you want to quit?
cs: Opravdu chcete ukonèit program?
tr: Çýkmak istediðinizden emin misiniz?

source: Really exit from Lynx?
cs: Opravdu chcete ukonèit Lynx?
tr: Lynx'ten cidden çýkýlsýn mý?

source: Connection interrupted.
cs: Spojení bylo pøeru¹eno.
tr: Baðlantý kesildi.

source: Data transfer interrupted.
cs: Pøenos dat byl pøeru¹en.
tr: Veri aktarýmý kesildi.

source: Cancelled!!!
cs: Zru¹eno!!!
tr: Ýptal edildi!!!

source: Cancelling!
cs: Ru¹ím!
tr: Ýptal ediliyor!

source: Excellent!!!
cs: Výbornì!!!
tr: Mükemmel!!!

source: OK
tr: Tamam

source: Done!
cs: Hotovo!
tr: Bitti!

source: Bad request!
cs: Chybný po¾adavek!
tr: Kötü istem!

source: previous
cs: pøedchozí
tr: önceki

source: next screen
cs: následující obrazovka
tr: sonraki ekran

source: HELP!
cs: NÁPOVÌDA!
tr: YARDIM!

source: , help on
cs: , nápovìda pro
tr: , yardým konusu

source: Commands: Use arrow keys to move, '?' for help, 'q' to quit, '<-' to go back.
cs: Pøíkazy: ¹ipky: pohyb, '?': nápovìda, 'q': ukonèení, '<-': návrat zpìt
tr: Komutlar: Gezinmek için ok tuþlarýný, yardým için '?'ni, çýkýþ için 'q'yu, geri dönmek için '<-'u kullanýnýz.

source: -- press space for more, use arrow keys to move, '?' for help, 'q' to quit.
cs: -- mezerník: dal¹í strana, ¹ipky: pohyb, '?': nápovìda. 'q': ukonèení
tr: -- devamý için boþluða, gezinmek için ok tuþlarýna, yardým için '?'ne, çýkmak için 'q'ya basýnýz.

source: -- press space for next page --
cs: -- mezerníkem zobrazíte dal¹í stranu --
tr: -- sonraki sayfa için boþluða basýnýz --

source: URL too long
cs: URL je pøíli¹ dlouhé
tr: çok uzun URL

source: (Text entry field) Inactive. Press <return> to activate.
cs: (Pole pro textový vstup) Vypnuto. Zapnutí pomocí <return>.
tr: (Metin giriþ alaný) Etkin deðil. Etkinleþtirmek için <return>'e basýnýz.

source: (Textarea) Inactive. Press <return> to activate.
cs: (Textové pole) Vypnuto, Zapnutí pomocí <return>.
tr: (Metin alaný) Etkin deðil. Etkinleþtirmek için <return>'e basýnýz.

source: (Textarea) Inactive. Press <return> to activate (%s for editor).
cs: (Textové pole) Zadejte text. Zapnutí pomocí <return> (%s pro editor).
tr: (Metin alaný) Etkin deðil. Etkinleþtirmek için <return>'e basýnýz (düzenleyici için %s).

source: (Form field) Inactive. Use <return> to edit.
cs: (Pole formuláøe) Vypnuto. <return> pro editaci.
tr: (Form alaný) Etkin deðil. Düzenlemek için <return>'ü kullanýnýz.

source: (Form field) Inactive. Use <return> to edit (%s to submit with no cache).
cs: (Pole formuláøe) Vypnuto. <return> pro editaci (%s pro NO CACHE).
tr: (Form alaný) Etkin deðil. Düzenlemek için <return>'ü kullanýnýz (önbelleksiz göndermek için %s).

source: (Form field) Inactive. Press <return> to edit, press <return> twice to submit.
cs: (Pole formuláøe) Zadejte text. <return> pro editaci, 2x <return> pro odeslání.
tr: (Form alaný) Etkin deðil. Düzenlemek için <return>'e bir kez, göndermek için iki kez basýnýz.

source: (mailto form field) Inactive. Press <return> to change.
cs: (mailto pole formuláøe) Vypnuto. <return> pro zmìnu.
tr: (e-posta form alaný) Etkin deðil. Deðiþtirmek için <return>'e basýnýz.

source: (Password entry field) Inactive. Press <return> to activate.
cs: (Pole pro zadání hesla) Vypnuto. Zapnutí pomocí <return>.
tr: (Parola giriþ alaný) Etkin deðil. Etkinleþtirmek için <return>'e basýnýz.

source: UNMODIFIABLE file entry field. Use UP or DOWN arrows or tab to move off.
cs: NEMODIFIKOVATELNÉ pole pro výbìr souboru. NAHORU/DOLÙ èi tab pro odchod.
tr: DEÐÝÞTÝRÝLEMEZ dosya giriþ alaný. Dýþýna çýkmak için YUKARI / AÞAÐI ok tuþlarýný ya da sekmeyi kullanýnýz.

source: (File entry field) Enter filename. Use UP or DOWN arrows or tab to move off.
cs: (Pole pro výbìr souboru) Vyberte soubor. NAHORU/DOLÙ èi tab pro odchod.
tr: (Dosya giriþ alaný) Dosya adý giriniz. Dýþýna çýkmak için YUKARI / AÞAÐI ok tuþlarýný ya da sekmeyi kullanýnýz.

source: (Text entry field) Enter text. Use UP or DOWN arrows or tab to move off.
cs: (Pole pro textový vstup) Zadejte text. NAHORU/DOLÙ èi TAB pro odchod.
tr: (Metin giriþ alaný) Metin giriniz. Dýþýna çýkmak için YUKARI / AÞAÐI ok tuþlarýný ya da sekmeyi kullanýnýz.

source: (Textarea) Enter text. Use UP/DOWN arrows or TAB to move off.
cs: (Textové pole) Zadejte text. NAHORU/DOLÙ èi TAB pro odchod.
tr: (Metin alaný) Metin giriniz. Dýþýna çýkmak için YUKARI/AÞAÐI ok tuþlarýný ya da sekmeyi kullanýnýz.

source: (Textarea) Enter text. Use UP/DOWN arrows or TAB to move off (%s for editor).
cs: (Textové pole) Zadejte text. NAHORU/DOLÙ èi TAB pro odchod (%s pro editor).
tr: (Metin alaný) Metin giriniz. Dýþýna çýkmak için YUKARI/AÞAÐI ok tuþlarýný ya da sekmeyi kullanýnýz (düzenleyici için %s).

source: UNMODIFIABLE form text field. Use UP or DOWN arrows or tab to move off.
cs: NEMODIFIKOVATELNÉ textové pole formuláøe. NAHORU/DOLÙ èi tab pro odchod.
tr: DEÐÝÞTÝRÝLEMEZ form metin alaný. Dýþýna çýkmak için YUKARI/AÞAÐI ok tuþlarýný ya da sekmeyi kullanýnýz.

source: (Form field) Enter text. Use <return> to submit.
cs: (Pole formuláøe) Zadejte text. <return> pro odeslání.
tr: (Form alaný) Metin giriniz. Göndermek için <return>'ü kullanýnýz.

source: (Form field) Enter text. Use <return> to submit (%s for no cache).
cs: (Pole formuláøe) Zadejte text. <return> ode¹le (%s pro 'NO CACHE').
tr: (Form alaný) Metin giriniz. Göndermek için <return>'ü kullanýnýz (önbelleksiz gönderim %s).

source: (Form field) Enter text. Use <return> to submit, arrows or tab to move off.
cs: (Pole formuláøe) Zadejte text. <return> ode¹le, ¹ipky èi TAB pro odchod.
tr: (Form alaný) Metin giriniz. Göndermek için <return>, dýþýna çýkmak için oklar ya da sekmeyi kullanýnýz.

source: UNMODIFIABLE form field. Use UP or DOWN arrows or tab to move off.
cs: NEMODIFIKOVATELNÉ pole formuláøe. NAHORU/DOLÙ èi TAB pro odchod.
tr: DEÐÝÞTÝRÝLEBÝLÝR form alaný. Dýþýna çýkmak için YUKARI/AÞAÐI ok tuþlarýný ya da sekmeyi kullanýnýz.

source: (mailto form field) Enter text. Use <return> to submit, arrows to move off.
cs: (mailto pole formuláøe) Zadejte text. <return> ode¹le, ¹ipky pro odchod.
tr: (e-posta form alaný) Metin giriniz. Göndermek için <return>, dýþýna çýkmak için oklarý kullanýnýz.

source: (mailto form field) Mail is disallowed so you cannot submit.
cs: ('mailto' pole formuláøe) Po¹ta je vypnuta, tudí¾ nemù¾ete nic poslat.
tr: (e-posta form alaný) Mektuba izin verilmiyor, dolayýsýyla gönderemezsiniz.

source: (Password entry field) Enter text. Use UP or DOWN arrows or tab to move off.
cs: (Pole pro zadání hesla) Zadejte text. NAHORU/DOLÙ èi tab pro odchod.
tr: (Parola giriþ alaný) Metin giriniz. Dýþýna çýkmak için YUKARI/AÞAÐI ok tuþlarýný ya da sekmeyi kullanýnýz.

source: UNMODIFIABLE form password. Use UP or DOWN arrows or tab to move off.
cs: NEMODIFIKOVATELNÉ heslo formuláøe. NAHORU/DOLÙ èi tab pro odchod.
tr: DEÐÝÞTÝRÝLEMEZ form parolasý. Dýþýna çýkmak için YUKARI/AÞAÐI ok tuþlarýný ya da sekmeyi kullanýnýz.

source: (Checkbox Field) Use right-arrow or <return> to toggle.
cs: (Za¹krtávací pole). ©ipka vpravo èi <return> pro pøepnutí.
tr: (Onay kutusu Alaný) Seçmek için sað ok ya da <return>'ü kullanýnýz.

source: UNMODIFIABLE form checkbox. Use UP or DOWN arrows or tab to move off.
cs: NEMODIFIKOVATELNÉ za¹krtávací pole. NAHORU/DOLÙ èi tab pro odchod.
tr: DEÐÝÞTÝRÝLEMEZ form onay kutusu. Dýþýna çýkmak için YUKARI/AÞAÐI ok tuþlarýný ya da sekmeyi kullanýnýz.

source: (Radio Button) Use right-arrow or <return> to toggle.
cs: (Pøepínací tlaèítko) ©ipka vpravo èi <return> pro pøepnutí.
tr: (Radyo Düðmesi) Seçmek için sað ok ya da <return>'ü kullanýnýz.

source: UNMODIFIABLE form radio button. Use UP or DOWN arrows or tab to move off.
cs: NEMODIFIKOVATELNÉ pøepínací tlaèítko. NAHORU/DOLÙ èi tab pro odchod.
tr: DEÐÝÞTÝRÝLEMEZ form radyo düðmesi. Dýþýna çýkmak için YUKARI/AÞAÐI ok tuþlarýný ya da sekmeyi kullanýnýz.

source: Submit ('x' for no cache) to
cs: Odeslat ('x' pro 'NO CACHE') na
tr: Alýcý (önbelleksiz gönderim 'x')

source: Submit to
cs: Odeslat na
tr: Alýcý

source: (Form submit button) Use right-arrow or <return> to submit ('x' for no cache).
cs: (Tlaèítko pro odeslání) ©ipka vpravo èi <return> pro odeslání (x pro NO CACHE)
tr: (Form gönderme düðmesi) Göndermek için sað ok ya da <return>'ü kullanýnýz (önbelleksiz gönderim 'x').

source: (Form submit button) Use right-arrow or <return> to submit.
cs: (Tlaèítko pro odeslání) ©ipka vpravo èi <return> pro odeslání
tr: (Form gönderme düðmesi) Göndermek için sað ok ya da <return>'ü kullanýnýz.

source: DISABLED form submit button. Use UP or DOWN arrows or tab to move off.
cs: (VYPNUTÉ tlaèítko pro odeslání) NAHORU/DOLÙ èi tab pro odchod.
tr: DEVRE DIÞI form gönderme tuþu. Dýþýna çýkmak için YUKARI/AÞAÐI ok tuþlarýný ya da sekmeyi kullanýnýz.

source: Submit mailto form to
cs: Odeslat 'mailto' formuláø na
tr: E-posta formu alýcýsý

source: (mailto form submit button) Use right-arrow or <return> to submit.
cs: (Tlaèítko pro odeslání) ©ipka vpravo èi <return> pro odeslání
tr: (e-posta formu gönderme düðmesi) Göndermek için sað ok ya da <return>'ü kullanýnýz.

source: (mailto form submit button) Mail is disallowed so you cannot submit.
cs: (Tlaèítko pro odeslání) Po¹ta je zakázána, tudí¾ nemù¾ete nic odeslat.
tr: (e-posta formu gönderme düðmesi) Mektuba izin verilmiyor, dolayýsýyla gönderemezsiniz.

source: (Form reset button) Use right-arrow or <return> to reset form to defaults.
cs: (Tlaèítko pro smazání) ©ipka vpravo èi <return> pro smazání vlo¾ených údajù.
tr: (Form temizleme düðmesi) Formu öntanýmlýya dönüþtürmek için sað ok ya da <return>'ü kullanýnýz.

source: DISABLED form reset button. Use UP or DOWN arrows or tab to move off.
cs: (VYPNUTÉ tlaèítko pro smazání) NAHORU/DOLÙ èi tab pro odchod.
tr: DEVRE DIÞI form temizleme düðmesi. Dýþýna çýkmak için YUKARI/AÞAÐI ok tuþlarýný ya da sekmeyi kullanýnýz.

source: (Option list) Hit return and use arrow keys and return to select option.
cs: (Seznam voleb) <return> a ¹ipky pro vybrání.
tr: (Seçenek listesi) Return'e basýp, seçmek için ok tuþlarý ve return'ü kullanýnýz.

source: (Choice list) Hit return and use arrow keys and return to select option.
cs: (Nabídka mo¾ností) <return> a ¹ipky pro zvolení.
tr: (Tercih listesi) Return'e basýp, seçmek için ok tuþlarý ve return'ü kullanýnýz.

source: UNMODIFIABLE option list. Use return or arrow keys to review or leave.
cs: NEMODIFIKOVATELNÝ seznam voleb. <return> èi ¹ipky pro prohlí¾ení èi odchod
tr: DEÐÝÞTÝRÝLEMEZ seçenek listesi. Göz gezdirmek ya da terketmek için ok tuþlarý ya da retun'ü kullanýnýz.

source: UNMODIFIABLE choice list. Use return or arrow keys to review or leave.
cs: NEMODIFIKOVATELNÁ nabídka mo¾ností. <return> èi ¹ipky pro prohlí¾ení èi odchod
tr: DEÐÝÞTÝRÝLEMEZ tercih listesi. Göz gezdirmek ya da terketmek için ok tuþlarý ya da retun'ü kullanýnýz.

source: Submitting form...
cs: Odesílám formuláø...
tr: Form gönderiliyor...

source: Resetting form...
cs: Ma¾u obsah formuláøe...
tr: Form temizleniyor...

source: Reloading document. Any form entries will be lost!
cs: Znovu nahrávám dokument. V¹echny údaje zapsané do formuláøù budou ztraceny!
tr: Belge yeniden yükleniyor. Forma girdikleriniz yitirilecek!

source: Warning: Cannot transcode form data to charset %s!
cs: Varování: Data formuláøe nelze pøevést do znakové sady %s!
tr: Uyarý: Form verisi %s karakter kümesine çevrilemiyor!

source: (NORMAL LINK) Use right-arrow or <return> to activate.
cs: (BÌ®NÝ ODKAZ) Pou¾ijte ¹ipku vpravo èi <return> pro aktivaci.
tr: (NORMAL LÝNK) Etkinleþtirmek için sað ok ya da<return>'ü kullanýnýz.

source: The resource requested is not available at this time.
cs: Po¾adovaný zdroj není v tuto chvíli pøístupný.
tr: Ýstenen kaynak, þu anda temin edilemiyor.

source: Enter Lynx keystroke command:
cs: Stisknìte nìjakou pøíkazovou klávesu:
tr: Lynx tuþbasým komutunu giriniz:

source: Looking up
cs: Vyhledávám
tr: Aranýyor

source: Getting %s
cs: Získávám %s
tr: %s alýnýyor

source: Skipping %s
cs: Pøeskakuji %s
tr: %s atlanýyor

source: Using %s
cs: Pou¾ívám %s
tr: %s kullanýlýyor

source: Illegal URL: %s
cs: Chybné URL %s
tr: Kuraldýþý URL: %s

source: Badly formed address %s
cs: Adresa %s je chybnì utvoøená.
tr: Yanlýþ yazýlmýþ adres: %s

source: Unable to access WWW file!!!
cs: Pøístup k WWW souboru nelze získat!!!
tr: WWW dosyasýna eriþilemiyor!!!

source: This is a searchable index. Use %s to search.
cs: Toto je prohledávatelný rejstøík. Pou¾ijte %s pro hledání.
tr: Bu, aranabilir bir indeks... Aramak için %s kullanýnýz.

source: --More-- This is a searchable index. Use %s to search.
cs: --Více-- Toto je prohledávatelný rejstøík. Pou¾ijte %s pro hledání.
tr: --Devam-- Bu, aranabilir bir indeks...Aramak için %s kullanýnýz.

source: You have entered an invalid link number.
cs: Èíslo odkazu, které jste zadal je chybné.
tr: Geçersiz bir link numarasý girdiniz.

source: Currently viewing document source. Press '\' to return to rendered version.
cs: Zobrazuji zdrojový kód. Stisknìte '\' pro návrat k interpretované verzi.
tr: Halen belge kaynaðý görüntüleniyor. Yorumlanmýþ (rendered) sürüme dönmek için '\'a basýnýz.

source: Arrow keys: Up and Down to move. Right to follow a link; Left to go back.
cs: ©ipky: Nahoru/Dolù pro pohyb. Vpravo následuje odkaz; vlevo se vrátí zpìt.
tr: Ok tuþlarý: Gezinmek için Yukarý ve Aþaðý. Linke gitmek için Sað; geriye gitmek için Sol.

source: H)elp O)ptions P)rint G)o M)ain screen Q)uit /=search [delete]=history list
cs: H>Nápovìda Vo)lby P>Tisk G>Jdi M>Hlavní obrazovka /=hledej [delete]=historie
tr: H)Yardým O)Seçenekler P)Yazdýr G)Git M)Ana ekran Q)Çýkýþ /=ara [delete]=tarihçe listesi

source: O)ther cmds H)elp K)eymap G)oto P)rint M)ain screen o)ptions Q)uit
cs: O)statní pøík. H>Nápovìda K)lávesová mapa G>Jdi_na P>Tisk M>Hlavní obrazovka o>volby Q>Konec
tr: ..O)Diðer komutlar H)Yardým K)Tuþeþlem G)Git P)Yazdýr M)Ana ekran o)Seçenekler Q)Çýkýþ

source: O)ther cmds B)ack E)dit D)ownload ^R)eload ^W)ipe screen search doc: /
cs: O)statní pøík. B>Zpìt E)ditovat D>Stáhnout ^R>Znovu nahrát ^W>Smazat obraz hledat: /
tr: ..O)Diðer komutlar B)Geri E)Düzenle D)Ýndir ^R)Geri yükle ^W)Ekraný sil belgeyi ara: /

source: O)ther cmds C)omment History: <backspace> Bookmarks: V)iew, A)dd, R)emove
cs: O)statní pøík. C>Komentáø Historie: <backspace> Zálo¾ky: V>Zobrazit A>Nová R>Smazat
tr: O)Diðer komutlar C)Yorum Tarihçe: <backspace> Yer imleri: V)Görüntüle, A)Ekle, R)Çýkart

source: Enter text into the field by typing on the keyboard
cs: Pomocí klávesnice vlo¾te text do pole
tr: Klavyeyi kullanarak alana metin giriniz

source: Ctrl-U to delete all text in field, [Backspace] to delete a character
cs: Ctrl-U vyma¾e ve¹kerý text v poli; [Backspace] sma¾e jeden znak
tr: Alandaki tüm metni silmek için Ctrl-U, tek karakter silmek için [Backspace]

source: Ctrl-U to delete text in field, [Backspace] to delete a character
cs: Ctrl-U vyma¾e ve¹kerý text v poli; [Backspace] sma¾e jeden znak
tr: Alandaki metni silmek için Ctrl-U,tek karakter silmek için [Backspace]

source: %s to delete all text in field, [Backspace] to delete a character
cs: %s vyma¾e ve¹kerý text v poli; [Backspace] sma¾e jeden znak
tr: Alandaki tüm metni silmek için %s, tek karakter silmek için [Backspace]

source: %s to delete text in field, [Backspace] to delete a character
cs: %s vyma¾e text v poli; [Backspace] sma¾e jeden znak
tr: Alandaki metni silmek için %s, tek karakter silmek için [Backspace]

source: Malformed mailto form submission! Cancelled!
cs: Pokus o odeslání chybného 'mailto' formuláøe! Zru¹eno!
tr: Bozuk e-posta formu gönderimi! Ýptal edildi!

source: Warning! Control codes in mail address replaced by ?
cs: Varování! Øídící znaky v po¹tovní adrese byly nahrazeny ?
tr: Uyarý! E-posta adresindeki kontrol kodlarý yerine ? konuldu.

source: Mail disallowed! Cannot submit.
cs: Po¹ta je zakázána! Nelze nic poslat.
tr: E-postaya izin verilmiyor! Gönderilemedi.

source: Mailto form submission failed!
cs: Odeslání 'mailto' formuláøe se nezdaøilo!
tr: E-posta formunun gönderimi baþarýsýz!

source: Mailto form submission Cancelled!!!
cs: Odeslání 'mailto' formuláøe zru¹eno!!!
tr: E-posta formunun gönderimi iptal edildi!!!

source: Sending form content...
cs: Posílám obsah formuláøe...
tr: Form içeriði gönderiliyor...

source: No email address is present in mailto URL!
cs: 'Mailto' URL neobsahuje po¹tovní adresu!
tr: E-posta URL'sinde mektup adresi yok!

source: Unable to open temporary file for mailto URL!
cs: Doèasný soubor pro 'mailto' URL nelze otevøít!
tr: E-posta URL'si için geçici dosya açýlamadý!

source: Do you wish to include the original message?
cs: Chcete zaøadit text pùvodní zprávy?
tr: Orijinal iletinin içerilmesini ister misiniz?

source: Do you wish to include the preparsed source?
cs: Chcete zaøadit pøedzpracovaný zdrojový text?
tr: Ayrýþtýrýlmamýþ kaynaðýn içerilmesini ister misiniz?

source: Spawning your selected editor to edit mail message
cs: Spou¹tím vámi zvolený textový editor pro editaci zprávy
tr: Ýletinin düzenlenmesi için seçilmiþ düzenleyiciniz baþlatýlýyor

source: Error spawning editor, check your editor definition in the options menu
cs: Chyba pøi startu editoru. Zkontrolujte nastavení editoru v konfiguraèním menu.
tr: Düzenleyici baþlatmada hata, seçenekler menüsündeki düzenleyici tanýmýnýzý kontrol ediniz

source: Send this comment?
cs: Odeslat tento komentáø?
tr: Bu yorum gönderilsin mi?

source: Send this message?
cs: Odeslat tuto zprávu?
tr: Bu ileti gönderilsin mi?

source: Sending your message...
cs: Odesílám va¹i zprávu...
tr: Ýletiniz gönderiliyor...

source: Sending your comment:
cs: Odesílám vá¹ komentáø:
tr: Yorumunuz gönderiliyor:

source: Not in a TEXTAREA; cannot use external editor.
cs: Toto není textová oblast; externí editor nelze pou¾ít.
tr: Bir METÝN ALANI'nda deðil(siniz); harici düzenleyici kullanýlamýyor.

source: Not in a TEXTAREA; cannot use command.
cs: Toto není textová oblast; pøíkaz nelze pou¾ít.
tr: Bir METÝN ALANI'nda deðil(siniz); komut kullanýlamýyor.

source: file: ACTIONs are disallowed!
cs: file: AKCE jsou zakázány!
tr: dosya: EYLEMlere izin verilmiyor!

source: file: URLs via served links are disallowed!
cs: Pou¾ívání odkazù ze vzdálených dokumentù pro lokální soubory je zakázáno!
tr: dosya: sunulan linkler aracýlýðýyla URL'lere izin verilmiyor!

source: Access to local files denied.
cs: Pøístup k místním souborùm je zakázán!
tr: Yerel dosyalara eriþim reddedildi.

source: file: URLs via bookmarks are disallowed!
cs: Pou¾ívání zálo¾ek pro lokální soubory je zakázáno!
tr: dosya: Yer imleri aracýlýðýyla URL'lere izin verilmiyor!

source: This special URL is not allowed in external documents!
cs: Toto zvlá¹tní URL není v externích dokumentech povoleno!
tr: Harici belgelerde bu özel URL'ye izin verilmiyor!

source: Press <return> to return to Lynx.
cs: Stisknìte <return> pro návrat do programu Lynx.
tr: Lynx'e dönmek için <return>'e basýnýz.

source: Spawning DCL subprocess. Use 'logout' to return to Lynx.
cs: Spou¹tím DCL proces. Pou¾ijte 'logout' pro návrat do programu Lynx.
tr: DCL altsüreci baþlatýlýyor. Lynx'e dönmek için 'logout'u kullanýnýz.

source: Type EXIT to return to Lynx.
cs: Napi¹te EXIT pro návrat do programu Lynx.
tr: Lynx'e dönmek için EXIT tuþlayýnýz.

source: Spawning your default shell. Use 'exit' to return to Lynx.
cs: Spou¹tím implicitní shell. Pou¾ijte 'exit' pro návrat do programu Lynx.
tr: Öntanýmlý kabuðunuz baþlatýlýyor. Lynx'e dönmek için 'exit'i kullanýnýz.

source: Spawning is currently disabled.
cs: Spou¹tìní je nyní vypnuto.
tr: Baþlatma (spawning) þu an devre dýþý.

source: The 'd'ownload command is currently disabled.
cs: Pøíkaz 'd' je nyní vypnut.
tr: Ýndir komutu(d) þu an devre dýþý.

source: You cannot download an input field.
cs: Nemù¾ete stahovat vstupní pole.
tr: Bir giriþ alanýný indiremezsiniz.

source: Form has a mailto action! Cannot download.
cs: Formuláø obsahuje 'mailto' akci! Nelze stáhnout.
tr: Formda bir e-posta eylemi mevcut! Ýndirilemiyor.

source: You cannot download a mailto: link.
cs: Nemù¾ete stáhnout 'mailto:' odkaz.
tr: Bir e-posta: linkini indiremezsiniz.

source: You cannot download cookies.
cs: Nemù¾ete stahovat cookies.
tr: Çerez indiremezsiniz.

source: You cannot download a printing option.
cs: Polo¾ku z menu voleb tisku nelze stahovat.
tr: Bir yazdýrma seçeneðini indiremezsiniz.

source: You cannot download an upload option.
cs: Polo¾ku z menu voleb posílání nelze stahovat.
tr: Bir yükleme seçeneðini indiremezsiniz.

source: You cannot download an permit option.
cs: Polo¾ku z menu nastavení práv souborù nelze stahovat.
tr: Bir izin seçeneðini indiremezsiniz.

source: This special URL cannot be downloaded!
cs: Toto zvlá¹tní URL nemù¾e být sta¾eno!
tr: Bu özel URL indirilemez!

source: Nothing to download.
cs: Není co stáhnout.
tr: Ýndirilecek hiçbir þey yok.

source: Trace ON!
cs: Sledování ZAPNUTO!
tr: Ýz(leme) AÇIK!

source: Trace OFF!
cs: Sledování VYPNUTO!
tr: Ýz(leme) KAPALI!

source: Links will be included for all images! Reloading...
cs: Budou zaøazeny odkazy na v¹echny obrázky! Znovu naèítám...
tr: Tüm resimler için link içerilecek! Yeniden yükleniyor...

source: Standard image handling restored! Reloading...
cs: Implicitní zpracování obrázkù obnoveno! Znovu naèítám...
tr: Standart resim becerimi geri kuruldu! Yeniden yükleniyor...

source: Pseudo_ALTs will be inserted for inlines without ALT strings! Reloading...
cs: Zobrazuji pseudo-popisy pro vlo¾ené obrázky bez popisu! Znovu naèítám...
tr: ALT dizgesi olmayan içeriðe(inline) yalancý_ALT'lar atanacak! Yeniden yükleniyor...

source: Inlines without an ALT string specified will be ignored! Reloading...
cs: Vlo¾ené obrázky bez popisu budou ignorovány! Znovu naèítám...
tr: Belirtilmiþ ALT dizgesi olmayan içerik(inlines) yoksayýlacak! Yeniden yükleniyor...

source: Raw 8-bit or CJK mode toggled OFF! Reloading...
cs: Pøímý 8bitový èi CJK re¾im VYPNUT! Znovu naèítám...
tr: Ham 8-bit ya da CJK modu KAPATILDI! Yeniden yükleniyor...

source: Raw 8-bit or CJK mode toggled ON! Reloading...
cs: Pøímý 8bitový èi CJK re¾im ZAPNUT! Znovu naèítám...
tr: Ham 8-bit ya da CJK modu AÇILDI! Yeniden yükleniyor...

source: Send HEAD request for D)ocument or L)ink, or C)ancel? (d,l,c):
cs: Poslat HEAD po¾adavek pro D)okument, L>Odkaz èi C>Zru¹it? (d,l,c):
tr: Belge(D), link(L) için BAÞLIK istemi gönderilsin mi, iptal(C) mi edilsin? (d,l,c):

source: Send HEAD request for D)ocument, or C)ancel? (d,c):
cs: Poslat HEAD po¾adavek pro D)okument èi C>Zru¹it? (d,c):
tr: Belge(D) için BAÞLIK istemi gönderilsin mi, iptal(C) mi edilsin? (d,c):

source: Sorry, the document is not an http URL.
cs: Lituji, dokument není http URL.
tr: Üzgünüm, belge bir http URL deðil...

source: Sorry, the link is not an http URL.
cs: Lituji, odkaz není http URL.
tr: Üzgünüm, link bir http URL deðil...

source: Sorry, the ACTION for this form is disabled.
cs: Akce tohoto formuláøe je vypnuta.
tr: Üzgünüm, bu form için EYLEM devre dýþý...

source: Sorry, the ACTION for this form is not an http URL.
cs: Akce tohoto formuláøe není http URL.
tr: Üzgünüm, bu form için EYLEM bir http URL deðil...

source: Not an http URL or form ACTION!
cs: Toto není http URL ani akce formuláøe!
tr: http URL ya da form EYLEMi deðil!..

source: This special URL cannot be a form ACTION!
cs: Toto zvlá¹tní URL nemù¾e být akcí formuláøe!
tr: Bu özel URL, bir form EYLEMi olamaz!

source: URL is not in starting realm!
cs: URL není ve startovní oblasti!
tr: URL, baþlangýç bölgesinde deðil!..

source: News posting is disabled!
cs: Odesílání pøíspìvkù do diskuzních skupin je zakázáno!
tr: Haber gönderme devre dýþý!..

source: File management support is disabled!
cs: Správce souborù je zakázán!
tr: Dosya yönetim desteði devre dýþý!..

source: No jump file is currently available.
cs: ®ádný soubor zkratek není dostupný.
tr: Mevcut hiçbir sýçrama dosyasý yok.
