Repository: openbsd/src
Catalog: gnu/usr.bin/lynx/po/*.po
Languages: cs, tr

source: Modified tail combined with head of form field value.
cs: Zmìnìný konec hodnoty pole formuláøe byl spojen s jejím zaèátkem.
tr: Form alaný deðeri baþlýðýyla birleþik deðiþtirilmiþ kuyruk.

source: Directory
cs: Adresáø
tr: Dizin

source: Directory browsing is not allowed.
cs: Procházení adresáøù je zakázáno.
tr: Dizine göz atmaya izin verilmiyor.

source: Selective access is not enabled for this directory
cs: Selektivní pøístup k tomuto adresáøi není zapnut.
tr: Bu dizin için seçici eriþim etkinleþtirilmemiþ

source: Multiformat: directory scan failed.
cs: Multiformat: volání scandir pro adresáø se nezdaøilo
tr: Çokbiçim: dizin taramasý baþarýsýz.

source: This directory is not readable.
cs: Tento adresáø nelze èíst.
tr: Bu dizin okunabilir (durumda) deðil.

source: Can't access requested file.
cs: Pøístup k po¾adovanému souboru nelze získat.
tr: Ýstenen dosyaya eriþilemiyor.

source: Could not find suitable representation for transmission.
cs: Nelze nalézt vhodný formát dat pro pøenos.
tr: Ýletim için uygun temsil (tarzý) bulunamadý.

source: Could not open file for decompression!
cs: Soubor pro dekompresi nelze otevøít!
tr: Geniþletmek üzere dosya açýlamadý!

source: Files:
cs: Soubory:
tr: Dosyalar:

source: Subdirectories:
cs: Podadresáøe:
tr: Altdizinler:

source: directory
cs: adresáø
tr: dizin

source: Up to
cs: O úroveò vý¹e do
tr: Üst sýnýr

source: Current directory is
cs: Aktuální adresáø je
tr: Mevcut dizin

source: Symbolic Link
cs: Symbol. odkaz
tr: Simgesel Link

source: No response from server!
cs: Od serveru nepøi¹la odpovìï!
tr: Sunucudan yanýt yok!

source: CSO index
cs: CSO rejstøík
tr: CSO indeksi

source: This is a searchable index of a CSO database.
cs: Toto je prohledávatelný rejstøík CSO databáze.
tr: Bu, CSO veritabanýnýn aranabilir bir indeksidir.

source: CSO Search Results
cs: Výsledky prohledávání CSO
tr: CSO Arama Sonuçlarý

source: Seek fail on %s
cs: Posun ukazovátka pro %s selhal
tr: Arama %s'de baþarýsýz

source: Press the 's' key and enter search keywords.
cs: Stisknìte klávesu 's' a zadejte hledaná klíèová slova.
tr: 's' tuþuna basýp, anahtar sözcükleri giriniz.

source: This is a searchable Gopher index.
cs: Toto je prohledávatelný Gopher rejstøík.
tr: Bu, arama yapýlabilen bir Gopher indeksidir.

source: Gopher index
cs: Gopher rejstøík
tr: Gopher indeksi

source: Gopher Menu
tr: Gopher Menüsü

source: Search Results
cs: Výsledky hledání
tr: Arama Sonuçlarý

source: Sending CSO/PH request.
cs: Posílám CSO/PH po¾adavek.
tr: CSO/PH istemi gönderiliyor.

source: Sending Gopher request.
cs: Posílám Gopher po¾adavek.
tr: Gopher istemi gönderiliyor.

source: CSO/PH request sent; waiting for response.
cs: CSO/PH po¾adavek poslán; èekám na odpovìï.
tr: CSO/PH istemi gönderildi; yanýt bekleniyor.

source: Gopher request sent; waiting for response.
cs: Gopher po¾adavek poslán; èekám na odpovìï.
tr: Gopher istemi gönderildi; yanýt bekleniyor.

source: Please enter search keywords.
cs: Zadejte hledaná klíèová slova.
tr: Lütfen arama için anahtar sözcükleri giriniz.

source: The keywords that you enter will allow you to search on a
cs: Klíèová slova, která zadáte, vám umo¾ní hledat
tr: Girdiðiniz anahtar sözcükler, veri tabanýnda bir kiþi adýnýn

source: person's name in the database.
cs: jméno osoby v databázi.
tr: aranmasýný saðlayacak.

source: Connection closed ???
cs: Spojení uzavøeno ???
tr: Baðlantý kapatýldý mý ???

source: Cannot open temporary file for news POST.
cs: Nelze otevøít doèasný soubor pro odeslání diskuzního pøíspìvku.
tr: Haber POSTu için geçici dosya açýlamýyor.

source: This client does not contain support for posting to news with SSL.
cs: Tento klient nepodporuje zasílání zpráv do diskuzních skupin pøes SSL.
tr: Bu istemci SSL'li habere postalamak için destek içermiyor.

source: Style %d `%s' SGML:%s. Font %s %.1f point.
cs: Styl %d `%s' SGML:%s. Písmo %s %.1f bodù.
tr: Stil %d `%s' SGML:%s. Yazýtipi %s %.1f boyut.

source: Align=%d, %d tabs. (%.0f before, %.0f after)
cs: Zarovnání=%d, %d tabulátorù. (%.0f pøed, %.0f za)
tr: Yaslama=%d, %d sekme. (%.0f önce, %.0f sonra)

source: Tab kind=%d at %.0f
cs: Druh tabulátorù=%d na %.0f
tr: Sekme türü=%d konum %.0f

source: Can't proceed without a username and password.
cs: Bez u¾ivatelského jména a hesla nelze pokraèovat.
tr: Kullanýcý adý ve parola olmadan devam edilemez.

source: Can't retry with authorization! Contact the server's WebMaster.
cs: Dal¹í pokus s autorizací není mo¾ný! Kontaktujte pøíslu¹ného webmastera.
tr: Yetkilendirme yeniden denenemez! Sunucunun site yöneticisiyle temas kurun.

source: Can't retry with proxy authorization! Contact the server's WebMaster.
cs: S proxy autorizací není dal¹í pokus mo¾ný! Kontaktujte pøíslu¹ného webmastera.
tr: Vekil(proxy) yetkilendirmesi yeniden denenemez! Sunucunun site yöneticisiyle temas kurun.

source: Retrying with proxy authorization information.
cs: Zkou¹im to znovu s proxy autorizací.
tr: Vekil(proxy) yetkilendirme bilgisiyle yeniden deneniyor.

source: SSL error:%s-Continue?
tr: SSL hatasý:%s-Devam edilsin mi?

source: HTWAIS: Return message too large.
cs: HTWAIS: Odpovìï je pøíli¹ veliká.
tr: HTWAIS: Dönüþ mesajý çok büyük.

source: Enter WAIS query:
cs: Zadejte WAIS dotaz:
tr: WAIS sorgusu giriniz:

source: Retrying as HTTP0 request.
cs: Posílám znovu jako HTTP0 po¾adavek.
tr: HTTP0 istemi olarak yeniden deneniyor.

source: Transferred %d bytes
cs: Pøeneseno bajtù: %d
tr: %d bayt aktarýldý

source: Data transfer complete
cs: Pøenos dat dokonèen
tr: Veri aktarýmý tamamlandý

source: Error processing line %d of %s
cs: Chyba pøi zpracování %d. øádku souboru%s
tr: %2$s satýrdan %1$d.'sinin iþlenmesinde hata

source: Address List Page
cs: Seznam adres
tr: Adres Listesi Sayfasý

source: Bookmark file
cs: Soubor se zálo¾kami
tr: Yer imi dosyasý

source: Configuration Definitions
cs: Konfigurace
tr: Ayar Tanýmlarý

source: Cookie Jar
cs: Sklad cookies
tr: Çerez kavanozu

source: Current Key Map
cs: Aktuální klávesová mapa
tr: Mevcut Tuþ Eþlemi

source: File Management Options
cs: Nabídka správce souborù
tr: Dosya Yönetim Seçenekleri

source: Download Options
cs: Mo¾nosti stahování
tr: Ýndirme Seçenekleri

source: History Page
cs: Historie
tr: Tarihçe Sayfasý

source: Cache Jar
tr: Önbellek Kavanozu

source: List Page
cs: Seznam odkazù
tr: Liste Sayfasý

source: Lynx.cfg Information
cs: Lynx.cfg Informace
tr: Lynx.cfg Bilgileri

source: Converted Mosaic Hotlist
cs: Pøevedený 'Hotlist' Mosaicu
tr: Dönüþtürülmüþ Mosaic Sýcaklistesi

source: Options Menu
cs: Konfiguraèní menu
tr: Seçenekler Menüsü

source: File Permission Options
cs: Menu nastavení práv souboru
tr: Dosya Ýzin Seçenekleri

source: Printing Options
cs: Menu voleb tisku
tr: Yazdýrma Seçenekleri

source: Information about the current document
cs: Informace o aktuálním dokumentu
tr: Mevcut dosya bilgileri

source: Your recent statusline messages
cs: Zprávy stavové øádky
tr: Son durumsatýrý mesajlarýnýz

source: Upload Options
cs: Menu voleb posílání
tr: Yükleme Seçenekleri

source: Visited Links Page
cs: Nav¹tívené odkazy
tr: Uðranmýþ Linkler Sayfasý

source: See also
cs: Viz té¾
tr: Ayrýca bakýnýz

source: your
cs: vá¹
tr: sizin

source: for runtime options
cs: pro aktuální konfiguraci
tr: yürütüm süresi seçenekleri için

source: compile time options
cs: volby zadané pøi pøekladu
tr: derleme süresi seçenekleri

source: color-style configuration
tr: renk stili ayarlama

source: latest release
cs: poslední verze
tr: son daðýtým

source: pre-release version
cs: vývojová verze
tr: daðýtým öncesi sürüm

source: development version
cs: vývojová verze
tr: geliþtirme sürümü

source: The following data were derived during the automatic configuration/build process of this copy of Lynx. When reporting a bug, please include a copy of this page.
cs: Následující údaje byly získány pøi automatické konfiguraci a pøekladu této kopie programu Lynx. Pøi oznamování chyby pøilo¾te kopii této stránky.
tr: Aþaðýdaki veri, Lynx'in bu kopyasýnýn otomatik ayarlanma/yapýlandýrma süreci sýrasýnda türetilmiþtir. Yazýlým hatasý bildirirken, lütfen bu sayfanýn bir kopyasýný da dahil ediniz.

source: The following data were used as automatically-configured compile-time definitions when this copy of Lynx was built.
cs: Následující údaje byly získány pøi automatické konfiguraci a pou¾ity pøi pøekladu této kopie programu Lynx.
tr: Aþaðýdaki veri, Lynx'in bu kopyasý yapýlandýrýlýrken otomatik-ayarlanmýþ derleme süresi tanýmlarý olarak kullanýlmýþtýr.

source: C)reate D)ownload E)dit F)ull menu M)odify R)emove T)ag U)pload
cs: C>Vytvoøit D>Stáhnout E)ditovat F>Úplné menu R>Smazat T>Oznaèit U>Poslat
tr: ..Oluþtur(C) Ýndir(D) Düzenle(E) Tam menü(F) Deðiþtir(M) Çýkart(R) Ýþaretle(T) Yükle(U)

source: Failed to obtain status of current link!
cs: Nepodaøilo se zjistit status aktuálního odkazu!
tr: Mevcut linkin durumu elde edilemedi!

source: Special URL only valid from current File Permission menu!
cs: Zvlá¹tní URL je platné pouze z aktuálního menu nastavení práv souboru!
tr: Özel URL yalnýzca güncel Dosya Ýzin menüsünden geçerlidir!

source: External support is currently disabled.
cs: Spou¹tìní externích programù je nyní zakázáno.
tr: Harici destek halen devre dýþý...

source: Changing working-directory is currently disabled.
tr: Çalýþma dizinini deðiþtirme þu an devre dýþý.

source: Linewrap OFF!
tr: Satýrsarma KAPALI!

source: Linewrap ON!
tr: Satýrsarma AÇIK!

source: Parsing nested-tables toggled OFF! Reloading...
tr: Ýçice geçmiþ-tablo ayrýþtýrma KAPATILDI! Yeniden yükleniyor...

source: Parsing nested-tables toggled ON! Reloading...
tr: Ýçice geçmiþ-tablo ayrýþtýrma AÇILDI! Yeniden yükleniyor...

source: Shifting is disabled while line-wrap is in effect
tr: Satýr-sarma etkinken kaydýrma (shifting) devre dýþýdýr

source: Trace not supported
tr: Ýz(leme) desteklenmiyor

source: Indents: first=%.0f others=%.0f, Height=%.1f Desc=%.1f
cs: Odsazení: první=%.0f dal¹í=%.0f, Vý¹ka=%.1f Popis=%.1f
tr: Girinti: ilk satýr=%.0f diðerleri=%.0f, Yükseklik=%.1f Alt çýkýntý=%.1f

source: Username for '%s' at %s '%s%s':
cs: U¾ivatelské jméno pro '%s' na %s '%s%s':
tr: %2$s '%3$s%4$s'deki '%1$s' için kullanýcý adý:

source: This client doesn't know how to compose proxy authorization information for scheme
cs: Tento klient neumí vytvoøit proxy autorizaèní informace pro schéma
tr: Bu istemci þema için vekil(proxy) yetkilendirme bilgisi oluþturmayý bilmiyor

source: This client doesn't know how to compose authorization information for scheme
cs: Tento klient neumí vytvoøit autorizaèní informace pro schéma
tr: Bu istemci þema için yetkilendirme bilgisi oluþturmayý bilmiyor

source: Invalid header '%s%s%s%s%s'
cs: Chybná hlavièka '%s%s%s%s%s'
tr: Geçersiz baþlýk '%s%s%s%s%s'

source: Proxy authorization required -- retrying
cs: Proxy vy¾aduje autorizaci -- zkou¹ím znovu
tr: Vekil(proxy) yetkilendirmesi gerekli -- yeniden deneniyor

source: Access without authorization denied -- retrying
cs: Pøístup není bez autorizace povolen -- zkou¹ím znovu
tr: Yetkilendirilmeden eriþim reddedildi -- yeniden deneniyor

source: Access forbidden by rule
cs: Pøístup odmítnut implicitním pravidlem
tr: Eriþim kuralla yasaklanmýþ

source: Document with POST content not found in cache. Resubmit?
cs: Dokument s POST obsahem nenalezen v cache. Odeslat znovu?
tr: Önbellekte POST içerikli belge bulunmadý. Yeniden gönderilsin mi?

source: Loading failed, use a previous copy.
tr: Yükleme baþarýsýz, önceki bir kopyayý kullanýn.

source: Loading incomplete.
cs: Nahrávání dokonèeno.
tr: Yükleme tamamlanmadý.

source: **** HTAccess: socket or file number returned by obsolete load routine!
cs: **** HTAccess: soket èi èíslo souboru vráceno zastaralou load funkcí!
tr: **** HTAcess: Yürürlükten kalkmýþ yük rutini tarafýndan soket ya da dosya numarasý döndü!

source: **** HTAccess: Internal software error. Please mail lynx-dev@nongnu.org!
tr: **** HTAcess: Dahili yazýlým hatasý. Lütfen lynx-dev@nongnu.org adresine bildiriniz!

source: **** HTAccess: Status returned was: %d
cs: **** HTAccess: Návratový status: %d
tr: **** HTAccess: Dönen durum: %d

source: Can't Access
cs: Nelze získat pøístup
tr: Eriþilemiyor

source: Unable to access document.
cs: Nelze získat pøístup k dokumentu.
tr: Belgeye eriþilemiyor.

source: Enter password for user %s@%s:
cs: Zadejte heslo pro u¾ivatele %s@%s:
tr: %s@%s kullanýcýsý için parola giriniz:

source: Unable to connect to FTP host.
cs: Nelze navázat spojení s FTP serverem.
tr: FTP makinasýna baðlanýlamadý.

source: close master socket
cs: zavøít hlavní soket
tr: ana soketi kapatýnýz

source: socket for master socket
cs: hlavní soket
tr: ana soket için soket

source: Receiving FTP directory.
cs: Stahuji výpis FTP adresáøe.
tr: FTP dizini alýnýyor.

source: Transferred %d bytes (%5d)
cs: Pøeneseno bajtù: %d (%5d)
tr: %d bayt aktarýldý (%5d)

source: connect for data
cs: datové spojení
tr: veri için baðlan

source: Receiving FTP file.
cs: Stahuji FTP soubor.
tr: FTP dosyasý alýnýyor

source: Could not set up finger connection.
cs: Spojení s finger serverem nelze navázat.
tr: Finger baðlantýsý saðlanamýyor.

source: Could not load data (no sitename in finger URL)
cs: Finger URL neobsahuje jméno serveru.
tr: Veri yüklenemiyor (finger URL'sinde site adý yok)

source: Invalid port number - will only use port 79!
cs: Chybné èíslo portu - pou¾ívám pouze port 79!
tr: Geçersiz port no - yalnýzca port 79 kullanýlacak!

source: Could not access finger host.
cs: Spojení s finger serverem nelze navázat.
tr: Finger makinasýna eriþilemedi.

source: No response from finger server.
cs: Od finger serveru nepøi¹la ¾ádná odpovìï.
tr: Finger sunucusundan yanýt yok.

source: Username for news host '%s':
cs: U¾ivatelské jméno na news serveru '%s':
tr: '%s' adlý haber makinasý için kullanýcý adý:

source: Change username?
cs: Zmìnit u¾ivatelské jméno?
tr: Kullanýcý adý deðiþtirilsin mi?

source: Username:
cs: U¾ivatelské jméno:
tr: Kullanýcý adý:

source: Password for news host '%s':
cs: Heslo na news serveru '%s':
tr: '%s' adlý haber makinasý için parola:

source: Change password?
cs: Zmìnit heslo?
tr: Parola deðiþtirilsin mi?

source: No matches for: %s
cs: %s nic nevyhovuje
tr: %s için eþleþme yok...

source: No articles in this group.
cs: Tato skupina neobsahuje ¾ádné pøíspìvky.
tr: Bu grupta hiç mesaj yok.

source: No articles in this range.
cs: V zadaném intervalu se nenacházejí ¾ádné pøíspìvky.
tr: Bu erimde hiç mesaj yok.

source: %s, Articles %d-%d
cs: %s, Èlánky %d-%d
tr: %s, %d-%d mesaj

source: Earlier articles
cs: Pøedchozí pøíspìvky
tr: Önceki mesajlar

source: There are about %d articles currently available in %s, IDs as follows:
cs: Poèet èlánkù v %2$s: %1$d. ID jsou následující:
tr: Halen %2$s'de yaklaþýk %1$d mesaj mevcut, kimlikler þu þekilde:

source: All available articles in
cs: V¹echny dostupné pøíspìvky v
tr: Tüm mevcut mesajlar

source: Later articles
cs: Pozdìj¹í pøíspìvky
tr: Sonraki mesajlar

source: Post to
cs: Poslat do
tr: Kime Gönderilecek

source: This client does not contain support for SNEWS URLs.
cs: Tento klient nepodporuje SNEWS URL.
tr: Bu istemci SNEWS URL'ler için destek içermiyor.

source: No target for raw text!
cs: ®ádný cíl pro prostý text!
tr: Ham metin için hiç hedef yok!

source: Connecting to NewsHost ...
cs: Navazuji spojení s news serverem...
tr: Haber makinasýna baðlanýlýyor ...

source: Could not access %s.
cs: S %s nelze navázat spojení.
tr: %s'e eriþilemiyor.

source: Can't read news info. News host %.20s responded: %.200s
cs: Informace o diskuzních skupinách nelze získat. News server %.20s odpovìdìl %.200s
tr: Haber bilgisi okunamýyor. %.20s adlý haber makinasýnýn yanýtý: %.200s

source: Can't read news info, empty response from host %s
cs: Informace o diskuzních skupinách nelze získat. Prázdná odpovìï od serveru %s
tr: Haber bilgisi okunamýyor, %s makinasýndan boþ yanýt

source: Reading list of available newsgroups.
cs: Ètu seznam dostupných diskuzních skupin.
tr: Mevcut haber gruplarýnýn listesi okunuyor.

source: Reading list of articles in newsgroup.
cs: Ètu seznam èlánkù v diskuzní skupinì.
tr: Haber grubundaki mesaj listesi okunuyor.

source: Reading news article.
cs: Ètu pøíspìvek z diskuzní skupiny.
tr: Haber mesajý okunuyor.

source: Sorry, could not load requested news.
cs: Lituji, po¾adované diskuzní pøíspìvky nelze stáhnout.
tr: Üzgünüm, istenen haber yüklenemedi.

source: Address has invalid port
cs: Adresa má chybný port.
tr: Adres portu geçersiz

source: Address length looks invalid
cs: Délka adresy se zdá být chybnou.
tr: Adres uzunluðu geçersiz görünüyor

source: Unable to locate remote host %s.
cs: Adresu poèítaèe %s nelze zjistit.
tr: %s adlý karþý makina konumlandýrýlamýyor.

source: Invalid hostname %s
cs: Jméno poèítaèe %s je chybné
tr: Geçersiz makina adý %s

source: Making %s connection to %s
cs: Navazuji %s spojení s %s.
tr: %2$s'e %1$s baðlantýsý kuruluyor

source: socket failed.
cs: chyba soketu.
tr: soket baþarýsýz.

source: socket failed: family %d addr %s port %s.
tr: soket baþarýsýz: aile %d adres %s port %s.

source: Could not make connection non-blocking.
cs: Soket nelze nastavit jako neblokující.
tr: Baðlantý engelsizleþtirilemedi (non-blocking).

source: Connection failed (too many retries).
cs: Spojení se nepodaøilo navázat (pøíli¹ mnoho pokusù).
tr: Baðlantý baþarýsýz (çok sayýda yeniden deneme).

source: Could not restore socket to blocking.
cs: Soket nelze nastavit jako blokující.
tr: Soket engellemeye (blocking) geri yüklenemedi.

source: Socket read failed (too many tries).
tr: Soket okuma baþarýsýz (çok sayýda deneme).

source: SSL callback:%s, preverify_ok=%d, ssl_okay=%d
tr: SSL geriçaðýrýmý:%s, öndoðrulama_tamam=%d, ssl_tamam=%d

source: Address contains a username: %s
tr: Adres bir kullanýcý adý içeriyor: %s

source: Certificate issued by: %s
tr: Sertifikayý veren:%s

source: This client does not contain support for HTTPS URLs.
cs: Tento klient nepodporuje HTTPS URL.
tr: Bu istemci HTTPS URL'ler için destek içermiyor.

source: Unable to connect to remote host.
cs: Spojení se vzdáleným poèítaèem nelze navázat.
tr: Karþý makinaya baðlanýlamadý.

source: Retrying connection without TLS.
tr: Baðlantý, TLS'siz tekrar deneniyor.

source: no issuer was found
tr: yayýnlayýcý bulunamadý

source: issuer is not a CA
tr: yayýnlayýcý bir CA deðil

source: the certificate has no known issuer
tr: sertifikanýn bilinen bir yayýnlayýcýsý yok

source: the certificate has been revoked
tr: sertifika hükümsüz kýlýnmýþ

source: the certificate is not trusted
tr: sertifikaya güvenilmiyor

source: Verified connection to %s (cert=%s)
tr: %1$s'e doðrulanmýþ baðlantý (cert=%2$s)

source: Verified connection to %s (subj=%s)
tr: %s'e baðlantý doðrulandý (konu=%s)

source: Can't find common name in certificate
tr: Sertifikada ortak ad bulunamadý

source: SSL error:host(%s)!=cert(%s)-Continue?
tr: SSL hatasý:makina(%s)!=sert(%s)-Devam edilsin mi?

source: UNVERIFIED connection to %s (cert=%s)
tr: %s'e DOÐRULANMAMIÞ baðlantý (cert=%s)

source: Secure %d-bit %s (%s) HTTP connection
tr: Güvenli %d-bit %s (%s) HTTP baðlantýsý

source: Sending HTTP request.
cs: Odesílám HTTP po¾adavek.
tr: HTTP istemi gönderiliyor.

source: Unexpected network write error; connection aborted.
cs: Neoèekávaná chyba pøi zápisu na soket; spojení uzavøeno.
tr: Umulmadýk aða yazma hatasý; baðlantý yarýda kesildi.

source: HTTP request sent; waiting for response.
cs: HTTP po¾adavek odeslán; èekám na odpovìï
tr: HTTP istemi gönderildi; yanýt bekleniyor.

source: Unexpected network read error; connection aborted.
cs: Neoèekávaná chyba pøi ètení ze soketu; spojení uzavøeno.
tr: Umulmadýk aða yazma hatasý; baðlantý yarýda kesildi.

source: Got unexpected Informational Status.
cs: Neoèekávané Informaèní hlá¹ení.
tr: Umulmadýk Bilgisel Durum alýndý.

source: Request fulfilled. Reset Content.
cs: Po¾adavek vyøízen. Obsah formuláøe smazán.
tr: Ýstem karþýlandý. Ýçeriði temizle.

source: Got unexpected 304 Not Modified status.
cs: Neoèekávané hlá¹ení: 304 Not Modified
tr: Umulmadýk 304 Deðiþtirilmedi durumu alýndý.

source: Redirection of POST content requires user approval.
cs: Pøesmìrování POST obsahu vy¾aduje souhlas u¾ivatele.
tr: POST içeriðinin yeniden yönlendirilmesi kullanýcý onayý gerektirir.

source: Have POST content. Treating Permanent Redirection as Temporary.
cs: Obsahuje POST data. Trvalé pøesmìrování pou¾ívám pouze jako doèasné.
tr: POST içeriði mevcut. Kalýcý Yeniden Yönlendirmeye Geçici muamelesi yapýlýyor.

source: Retrying with access authorization information.
cs: Zkou¹ím to znovu s proxy autorizací.
tr: Eriþim yetkilendirme bilgisiyle yeniden deneniyor.

source: Show the 401 message body?
cs: Zobrazit tìlo 401 hlá¹ení?
tr: 401 mesaj gövdesi gösterilsin mi?

source: Show the 407 message body?
cs: Zobrazit tìlo 407 hlá¹ení?
tr: 407 mesaj gövdesi gösterilsin mi?

source: Unknown status reply from server!
cs: Neznámé hlá¹ení od serveru!
tr: Sunucudan bilinmeyen durum yanýtý!

source: remote %s session:
cs: vzdálené %s sezení:
tr: uzak %s oturumu:

source: Could not connect to WAIS server.
cs: Spojení s WAIS serverem nelze navázat.
tr: WAIS sunucusuna baðlanýlamadý.

source: Could not open WAIS connection for reading.
cs: WAIS nelze pro ètení otevøít.
tr: Okuma için WAIS baðlantýsý açýlamadý.

source: Diagnostic code is
cs: Diagnostický kód je
tr: Tanýsal kod:

source: Index
cs: Rejstøík
tr: Ýndeks

source: contains the following %d item%s relevant to "
cs: obsahuje %d následujících polo¾ek%s vztahujících se k "
tr: aþaðýdaki ilgili %d öðe%s(y)i içerir "

source: The first figure after each entry is its relative score,
cs: Za ka¾dou polo¾kou následuje nejprve její bodové ohodnocení
tr: Herbir girdiden sonraki ilk sayý, onun göreceli skoru,

source: the second is the number of lines in the item.
cs: a poté poèet øádkù.
tr: ikincisiyse, öðedeki satýr sayýsýdýr.

source: (bad file name)
cs: (chybné jméno souboru)
tr: (bozuk dosya adý)

source: (bad doc id)
cs: (chybné id dokumentu)
tr: (bozuk belge no)

source: (Short Header record, can't display)
cs: ('Short Header' záznam, nelze zobrazit)
tr: (Kýsa Baþlýk kaydý, görüntülenemiyor)

source: Long Header record, can't display
cs: 'Long Header' záznamu, nelze zobrazit
tr: Uzun Baþlýk kaydý, görüntülenemiyor

source: Text record
cs: Textový záznam
tr: Metin kaydý

source: Headline record, can't display
cs: 'Headline' záznam, nelze zobrazit
tr: Baþlýk kaydý, görüntülenemiyor

source: Code record, can't display
cs: 'Code' záznam, nelze zobrazit
tr: Kod kaydý, görüntülenemiyor

source: Syntax error in WAIS URL
cs: Syntaktická chyba ve WAIS URL.
tr: WAIS URL'de sözdizimi hatasý

source: (WAIS Index)
cs: (WAIS rejstøík)
tr: (WAIS Ýndeksi)

source: WAIS Index:
cs: WAIS rejstøík:
tr: WAIS Ýndeksi:

source: This is a link for searching the
cs: Tento odkaz ukazuje na prohledávaè
tr: Bu, WAIS indeksini aramak için

source: WAIS Index.
cs: WAIS rejstøíku.
tr: bir linktir.

source: Enter the 's'earch command and then specify search words.
cs: Stisknìte 's' a pak zadejte hledaná slova.
tr: Ara(s) komutunu girip arama sözcüklerini belirleyiniz.

source: (in
cs: (v
tr: (þurada

source: WAIS Search of "
cs: WAIS hledání "
tr: WAIS Aramasý "

source: " in:
cs: " v:
tr: " þurada:

source: HTWAIS: Request too large.
cs: HTWAIS: po¾adavek pøíli¹ dlouhý.
tr: HTWAIS: Ýstem çok büyük.

source: Searching WAIS database...
cs: Prohledávám WAIS databázi...
tr: WAIS veritabaný aranýyor...

source: Search interrupted.
cs: Hledání pøeru¹eno.
tr: Arama kesildi.

source: Can't convert format of WAIS document
cs: Formát WAIS dokumentu nelze pøevést
tr: WAIS belgesinin biçemi dönüþtürülemiyor

source: HTWAIS: Request too long.
cs: HTWAIS: po¾adavek pøíli¹ dlouhý
tr: HTWAIS: Ýstem çok uzun.

source: Fetching WAIS document...
cs: Stahuji WAIS dokument...
tr: WAIS belgesi getiriliyor...

source: No text was returned!
cs: ®ádná odpovìï!
tr: Hiç metin dönmedi!
