Repository: openbsd/src
Catalog: gnu/usr.bin/lynx/po/*.po
Languages: cs, tr

source: NOT GIVEN in source file;
cs: NENACHÁZÍ se ve zdrojovém souboru;
tr: kaynak dosyada VERÝLMEDÝ;

source: WAIS source file
cs: zdrojový soubor WAIS
tr: WAIS kaynak dosyasý

source: description
cs: popis
tr: açýklama

source: Access links
cs: Odkazy
tr: Eriþim linkleri

source: Direct access
cs: Pøímý pøístup
tr: Dolaysýz eriþim

source: (or via proxy server, if defined)
cs: (èi, pokud je definován, pøes proxy server)
tr: (ya da tanýmlýysa, vekil(proxy) sunucu aracýlýðýyla)

source: Maintainer
cs: Správce
tr: Yönetici

source: Host
cs: Poèítaè
tr: Bilgisayar

source: Memory exhausted, display interrupted!
cs: Do¹la pamì», zobrazení pøeru¹eno!
tr: Bellek tükendi, görüntü kesildi!

source: Memory exhausted, will interrupt transfer!
cs: Do¹la pamì», pøenos pøeru¹en!
tr: Bellek tükendi, aktarým kesilecek!

source: *** MEMORY EXHAUSTED ***
cs: *** DO©LA PAMÌ« ***
tr: *** BELLEK TÜKENDÝ ***

source: unknown field or link
cs: neznámé pole èi odkaz
tr: bilinmeyen alan ya da link

source: text entry field
cs: textové vstupní pole
tr: metin giriþ alaný

source: password entry field
cs: vstupní pole pro heslo
tr: parola giriþ alaný

source: checkbox
cs: za¹krtávací políèko
tr: onay kutusu

source: radio button
cs: pøepínací tlaèítko
tr: radyo düðmesi

source: submit button
cs: tlaèítko pro odeslání dat serveru
tr: gönderme düðmesi

source: reset button
cs: tlaèítko pro obnovení implicitních hodnot
tr: temizleme düðmesi

source: popup menu
cs: vyskakovací menu
tr: açýlýr menü

source: hidden form field
cs: skryté pole formuláøe
tr: gizli form alaný

source: text entry area
cs: textová vstupní oblast
tr: metin giriþ alaný

source: range entry field
cs: vstupní pole pro interval
tr: erim giriþ alaný

source: file entry field
cs: pole pro výbìr souboru
tr: dosya giriþ alaný

source: text-submit field
cs: tlaèítko pro odeslání textu
tr: metin-gönderme alaný

source: image-submit button
cs: tlaèítko pro odeslání obrázku
tr: resim-gönderme alaný

source: keygen field
cs: pole pro vytvoøení klíèe
tr: keygen alaný

source: unknown form field
cs: neznámé pole formuláøe
tr: bilinmeyen form alaný

source: Can't open file for uploading
tr: Yüklemek için dosya açýlamýyor.

source: Submitting %s
cs: Odesílám %s
tr: %s gönderiliyor

source: Hang Detect: TextAnchor struct corrupted - suggest aborting!
tr: Takýlma Saptandý: TextAnchor struct bozuk - sonlandýrmanýz önerilir!

source: Wrap lines to fit displayed area?
cs: Zalamovat dlouhé øádky, aby se ve¹ly na obrazovku?
tr: Görüntülenen alana sýðmak üzere satýrlar sarmalansýn mý?

source: Very long lines have been wrapped!
cs: Pøíli¹ dlouhé øádky byly zalomeny!
tr: Çok uzun satýrlar sarmalandý!

source: Very long lines have been truncated!
cs: Pøíli¹ dlouhé øádky byly oøezány!
tr: Çok uzun satýrlarýn sonundan kýrpýldý!

source: bytes
cs: bajtù
tr: bayt

source: Read %s of data
cs: Mno¾ství pøenesených dat: %s
tr: Verinin %s'i okundu

source: Read %s of %s of data
cs: Mno¾ství pøenesených dat: %s/%s
tr: %2$s verinin %1$s'i okundu

source: , %s/sec
cs: , %s/s
tr: , %s/sn

source: (stalled for %s)
tr: (%s süresince durakladý)

source: (Press 'z' to abort)
cs: (Stisknìte 'z' pro ukonèení)
tr: (Yarýda kesmek için 'z'ye basýnýz)

source: yes
cs: ano
tr: evet

source: no
cs: ne
tr: hayýr

source: Y/N/A/V
tr: (E/H/Daima/Asla)

source: Description:
cs: Popis:
tr: Açýklama:

source: (none)
cs: (¾ádný)
tr: (hiçbiri)

source: Filepath:
cs: Cesta:
tr: Dosya yolu:

source: (unknown)
cs: (neznámá)
tr: (bilinmiyor)

source: Document has only hidden links. Use the 'l'ist command.
cs: Dokument obsahuje pouze skryté odkazy. Pou¾ijte 'l' pro jejich vypsání.
tr: Belgede yalnýzca gizli linkler var. Listele(l) komutunu kullanýnýz.

source: Source cache error - disk full?
cs: Chyba pøi práci s vyrovnávací pamìtí pro dokumenty - nedo¹lo místo na disku?
tr: Kaynak önbellek hatasý - disk tamamen dolu mu?

source: Source cache error - not enough memory!
cs: Chyba pøi práci s vyrovnávací pamìtí pro dokumenty - do¹la pamì»!
tr: Kaynak önbellek hatasý - bellek yetersiz!

source: This file is an HTML representation of the X Mosaic hotlist file. Outdated or invalid links may be removed by using the remove bookmark command, it is usually the 'R' key but may have been remapped by you or your system administrator.
cs: Tento soubor je HTML obdobou 'hotlistu' programu 'X Mosaic'. Zastaralé èi chybné odkazy mohou být smazány pomocí klávesy 'R'. Správce systému ale mohl tuto funkci svázat s jinou klávesou.
tr: Bu dosya, X Mosaic sýcak listesinin bir HTML temsilidir. Kullanýmdan kalkmýþ ya da geçersiz linkler, yer imi çýkartma komutu kullanýlarak çýkartýlabilir, bu genellikle 'R' tuþudur, ancak siz ya da sistem yöneticiniz tarafýndan yeniden eþlemlenmiþ olabilir.

source: You can delete links by the 'R' key<br> <ol>
cs: Klávesou 'R' mù¾ete mazat odkazy<br> <ol>
tr: Linkleri 'R' tuþuyla silebilirsiniz<br> <ol>

source: You can delete links using the remove bookmark command. It is usually the 'R' key but may have been remapped by you or your system administrator.
cs: Odkazy mohou být smazány pomocí klávesy 'R'. Správce systému ale mohl tuto funkci svázat s jinou klávesou.
tr: Linkleri yer imi çýkartma komutunu kullanarak silebilirsiniz. Bu genellikle 'R' tuþudur, ancak siz ya da sistem yöneticiniz tarafýndan yeniden .eþlemlenmiþ olabilir.

source: This file also may be edited with a standard text editor to delete outdated or invalid links, or to change their order.
cs: Mazání odkazù èi zmìna jejich poøadí Mù¾e být provedena i pomocí úprav tohoto souboru bì¾ným textovým editorem.
tr: Bu dosya, kullanýmdan kalkmýþ, geçersiz linkleri silmek ya da sýralarýný deðiþtirmek üzere standart bir metin düzenleyiciyle de düzenlenebilir.

source: Note: if you edit this file manually you should not change the format within the lines or add other HTML markup. Make sure any bookmark link is saved as a single line.
cs: Poznámka: pokud budete upravovat tento soubor ruènì, nemìl byste mìnit jeho formát, èi pøidávat dal¹í HTML znaèky. ®ádná zálo¾ka nesmí zabírat více ne¾ jeden øádek.
tr: Not: Eðer bu dosyayý elle düzenlerseniz satýr içlerindeki biçimi deðiþtirmemeli, ya da baþka HTML belirteci eklememelisiniz. Herbir linkin tek satýr olarak kaydedildiðine emin olun.

source: File may be recoverable from %s during this session
cs: Bìhem tohoto sezení lze soubor obnovit z %s.
tr: Dosya, bu oturum boyunca %s'den kurtarýlabilir

source: Do you want to execute "%s"?
tr: "%s"'i çalýþtýrmak ister misiniz?

source: Unable to access cgi script
cs: Nelze získat pøístup k cgi skriptu
tr: cgi betiðine eriþilemiyor

source: Good Advice
cs: Dobrá rada
tr: Ýyi Öneri

source: An excellent http server for VMS is available via
cs: Vynikající http server pro VMS je dostupný pøes
tr: VMS için kusursuz bir http sunucusu, þu link aracýlýðýyla

source: this link
cs: tento odkaz.
tr: temin edilebilir

source: It provides state of the art CGI script support.
cs: Poskytuje výbornou podporu pro cgi skripty.
tr: Güncel CGI betik desteðini saðlar.

source: Exiting via interrupt:
cs: Konèím kvùli pøeru¹ení:
tr: Ýþkesmesi aracýlýðýyla kapanýyor:

source: (from a previous session)
cs: (z pøedchozího sezení)
tr: (önceki bir oturumdan)

source: Maximum Gobble Date:
tr: Maksimum Silip Süpürme Tarihi:

source: Internal
cs: Vnitøní
tr: Dahili

source: cookie_domain_flag_set error, aborting program
cs: chyba cookie_domain_flag_set, ukonèuji program
tr: cookie_domain_flag_set hatasý, program yarýda kesiliyor

source: Terminal initialisation failed - unknown terminal type?
cs: Inicializace terminálu se nezdaøila - neznámý typ terminálu?
tr: Uçbirim ön deðer atamasý baþarýsýz - bilinmeyen uçbirim türü?

source: Terminal =
cs: Terminál =
tr: Uçbirim =

source: You must use a vt100, 200, etc. terminal with this program.
cs: Tento program vy¾aduje terminál typu vt100, 200 etc.
tr: Bu programla bir vt100, 200 vb. uçbirim kullanmalýsýnýz.

source: Your Terminal type is unknown!
cs: Typ va¹eho terminálu je neznámý!
tr: Uçbirim türünüz bilinmiyor!

source: Enter a terminal type:
cs: Zadejte typ terminálu:
tr: Bir uçbirim türü giriniz:

source: TERMINAL TYPE IS SET TO
cs: TYP TERMINÁLU JE NASTAVEN NA
tr: UÇBÝRÝM TÜRÜ AYARI

source: A Fatal error has occurred in %s Ver. %s
cs: V programu %s verze %s nastala fatální chyba.
tr: %2$s Sür. %1$s'de ölümcül bir hata oluþtu

source: Please notify your system administrator to confirm a bug, and if confirmed, to notify the lynx-dev list. Bug reports should have concise descriptions of the command and/or URL which causes the problem, the operating system name with version number, the TCPIP implementation, the TRACEBACK if it can be captured, and any other relevant information.
cs: Zeptejte se va¹eho správce systému, zda se vskutku jedná o chybu a pokud ano, uvìdomte o ní úèastníky konference lynx-dev. Chybová hlá¹ení by mìla obsahovat struèný popis pøíkazu a/nebo URL, který ji zpùsobil, jméno a verzi operaèního systému, TCPIP implementaci, TRACEBACK a v¹echny dal¹í relevantní informace.
tr: Lütfen sistem yöneticinize bir yazýlým hatasýný doðrulatmak için, ve eðer doðrulanýrsa lynx-dev listesine bildirmesi için haber veriniz. Hata raporlarý, soruna yol açan komutun ve/veya URL'nin kýsa açýklamasýný, iþletim sistemi adýyla sürüm numarasýný, TCPIP uygulamasýný, kapýlabildiyse GERÝÝZSÜRÜMÜnü ve ilgili diðer bilgileri içermelidir.

source: Error starting editor, %s
tr: Düzenleyiciyi baþlatmada hata, %s

source: Editor killed by signal
cs: Editor ukonèen signálem.
tr: Düzenleyici sinyalle öldürüldü

source: Editor returned with error status %s
tr: Düzenleyici %s hata durumuyla döndü.

source: Downloaded link:
cs: Sta¾ený odkaz:
tr: Ýndirilmiþ link:

source: Suggested file name:
cs: Doporuèené jméno souboru:
tr: Önerilen dosya adý:

source: Standard download options:
cs: Standardní menu nabídek pro stahování:
tr: Standart indirme seçenekleri:

source: Download options:
cs: Menu nabídek pro stahování:
tr: Ýndirme seçenekleri:

source: Save to disk
cs: Ulo¾it na disk
tr: Diske kaydet

source: View temporary file
tr: Geçici dosyayý görüntüle

source: Save to disk disabled.
cs: Ukládání na disk je zakázáno.
tr: Diske kaydetme devre dýþý...

source: Local additions:
cs: Místní roz¹íøení:
tr: Yerel eklentiler:

source: No Name Given
cs: Nebylo zadáno ¾ádné jméno.
tr: Ýsim Verilmemiþ

source: You selected:
cs: Nav¹tívené odkazy:
tr: Seçiminiz:

source: (no address)
cs: (¾ádná adresa)
tr: (adres yok)

source: (internal)
cs: (vnitøní)
tr: (dahili)

source: (was internal)
cs: (pùvodnì vnitøní)
tr: (dahiliydi)

source: (From History)
cs: (z historie)
tr: (Tarihçe'den)

source: You visited (POSTs, bookmark, menu and list files excluded):
cs: Nav¹tívené odkazy (POST, zálo¾ky, menu a seznamy odkazù vynechány):
tr: Uðradýklarýnýz (POSTlar, yer imi, menü ve liste dosyalarý hariç):

source: (No messages yet)
cs: (Zatím ¾ádné zprávy)
tr: (Henüz hiç mesaj yok)

source: Invalid pointer detected.
cs: Nalezen chybný ukazatel.
tr: Geçersiz imleyici saptandý.

source: Sequence:
tr: Sýra:

source: Pointer:
cs: Ukazatel:
tr: Ýmleyici:

source: FileName:
cs: Jméno souboru:
tr: DosyaAdý:

source: LineCount:
cs: Øádek:
tr: SatýrSayýsý:

source: Memory leak detected.
cs: Zji¹tìn problém s pamìtí.
tr: Bellek sýzýntýsý saptandý.

source: Contains:
cs: Obsahuje:
tr: Ýçindekiler:

source: ByteSize:
cs: Velikost v bajtech:
tr: BaytÖlçüsü:

source: realloced:
cs: realokováno:
tr: Yeniden özgülenen:

source: Total memory leakage this run:
cs: Celkový poèet problémù s pamìtí:
tr: Bu yürütmedeki toplam bellek sýzýntýsý:

source: Peak allocation
tr: Tepe ayýrma

source: Bytes allocated
tr: Ayrýlan bayt

source: Total mallocs
tr: Ayrýlan toplam bellek

source: Total frees
tr: Toplam boþ

source: References in
cs: Odkazy v
tr: Bu belgedeki

source: this document:
cs: v tomto dokumentu:
tr: referanslar:

source: Visible links:
cs: Viditelné odkazy:
tr: Görünür linkler:

source: Hidden links:
cs: Skryté odkazy:
tr: Gizli Linkler:

source: References
cs: Reference
tr: Referanslar

source: Visible links
cs: Viditelné odkazy
tr: Görünür linkler

source: Unable to get status of '%s'.
cs: Status '%s' nelze zjistit.
tr: '%s'in durumu alýnamýyor.

source: The selected item is not a file or a directory! Request ignored.
cs: Vybraný pøedmìt není souborem ani adresáøem! Po¾adavek ignorován.
tr: Seçilen öðe bir dosya ya da dizin deðil! Ýstem yoksayýldý.

source: Unable to %s due to system error!
cs: %s selhalo kvùli systémové chybì!
tr: Sistem hatasý nedeniyle %s yapýlamýyor!

source: Probable failure to %s due to system error!
cs: %s pravdìpodobnì selhalo kvùli systémové chybì!
tr: Sistem hatasý nedeniyle olasý %s baþarýsýzlýðý!

source: remove %s
cs: smazat %s
tr: %s'i çýkart

source: touch %s
tr: %s'e dokun

source: move %s to %s
cs: pøesunout %s do %s
tr: %s'i %s'e taþý

source: There is already a directory with that name! Request ignored.
cs: Byl nalezen adresáø stejného jména! Po¾adavek ignorován.
tr: O isimde bir dizin zaten var! Ýstem yoksayýldý.

source: There is already a file with that name! Request ignored.
cs: Byl nalezen soubor stejného jména! Po¾adavek ignorován.
tr: O isimde bir dosya zaten var! Ýstem yoksayýldý.

source: The specified name is already in use! Request ignored.
cs: Zadané jméno je ji¾ pou¾íváno! Po¾adavek ignorován.
tr: Belirtilmiþ isim zaten kullanýmda! Ýstem yoksayýldý.

source: Destination has different owner! Request denied.
cs: Cíl má jiného vlastníka! Po¾adavek zamítnut.
tr: Varýþ yerinin sahibi farklý! Ýstem reddedildi.

source: Destination is not a valid directory! Request denied.
cs: Cíl není platným adresáøem! Po¾adavek zamítnut.
tr: Varýþ yeri geçerli bir dizin deðil! Ýstem reddedildi.

source: Remove all tagged files and directories?
cs: Smazat v¹echny oznaèené soubory a adresáøe?
tr: Bütün iþaretlenmiþ dosya ve dizinler çýkartýlsýn mý?

source: Enter new location for tagged items:
cs: Zadejte nové místo urèení pro oznaèené pøedmìty:
tr: Ýþaretlenmiþ öðeler için yeni konum giriniz:

source: Path too long
cs: Cesta je pøíli¹ dlouhá.
tr: Yol çok uzun

source: Source and destination are the same location - request ignored!
cs: Zdroj a cíl oznaèují jedno a to samé místo - po¾adavek zamítnut!
tr: Çýkýþ ve varýþ konumlarý ayný - istem yoksayýldý!

source: Enter new name for directory:
cs: Zadejte nové jméno adresáøe:
tr: Dizin için yeni isim giriniz:

source: Enter new name for file:
cs: Zadejte nové jméno souboru:
tr: Dosya için yeni isim giriniz:

source: Illegal character (path-separator) found! Request ignored.
cs: Nalezen chybný znak (oddìlovaè cesty)! Po¾adavek ignorován.
tr: Kuraldýþý karakter (yol-ayracý) bulundu! Ýstem yoksayýldý.

source: Enter new location for directory:
cs: Zadejte nové místo urèení pro adresáø:
tr: Dizin için yeni konum giriniz:

source: Enter new location for file:
cs: Zadejte nové místo urèení pro soubor:
tr: Dosya için yeni konum giriniz:

source: Unexpected failure - unable to find trailing path separator
cs: Neoèekávaná chyba - koncový oddìlovaè cesty nelze nalézt
tr: Umulmadýk aksaklýk - izleme yolu ayracý bulunamadý

source: Source and destination are the same location! Request ignored!
cs: Zdroj a cíl oznaèují jedno a to samé místo - po¾adavek zamítnut!
tr: Çýkýþ ve varýþ konumlarý ayný! Ýstem yoksayýldý!

source: Modify name, location, or permission (n, l, or p):
cs: Zmìnit jméno, umístìní èi pøístupová práva? (n,l èi p):
tr: Ýsim(n), konum(l) ya da izin(p) deðiþtirme:

source: Modify name or location (n or l):
cs: Zmìnit jméno èi umístìní (n èi l):
tr: Ýsim(n) ya da konum(l) deðiþtirme:

source: This feature not yet implemented!
cs: Tato funkce zatím nebyla implementována!
tr: Bu nitelik daha tamamlanmadý!

source: Enter name of file to create:
cs: Zadejte jméno souboru, který mám vytvoøit:
tr: Oluþturulacak dosyanýn adýný giriniz:

source: Illegal redirection "//" found! Request ignored.
cs: Nalezeno chybné pøesmìrování "//"! Po¾adavek ignorován.
tr: Kuraldýþý yeniden yönlendirme "//" bulundu! Ýstem yoksayýldý.

source: Enter name for new directory:
cs: Zadejte nové jméno adresáøe:
tr: Yeni dizin için isim giriniz:

source: Create file or directory (f or d):
cs: Vytvoøit soubor èi adresáø? (f èi d):
tr: Dosya(f) ya da dizin(d) oluþtur:

source: Remove directory '%s'?
tr: '%s' dizini çýkartýlsýn mý?

source: Remove directory?
tr: Dizin çýkarýlsýn mý?

source: Remove file '%s'?
cs: Smazat soubor '%s'?
tr: '%s' dosyasý çýkartýlsýn mý?

source: Remove file?
cs: Smazat soubor?
tr: Dosya çýkartýlsýn mý?

source: Remove symbolic link '%s'?
cs: Smazat symbolický odkaz '%s'?
tr: '%s' simgesel linki çýkartýlsýn mý?

source: Remove symbolic link?
cs: Smazat symbolický odkaz?
tr: Simgesel link çýkartýlsýn mý?

source: Sorry, don't know how to permit non-UNIX files yet.
cs: Nevím jak nastavit pøístupová práva na ne-UNIXOVÉM systému souborù
tr: Üzgünüm, daha UNIX-dýþý dosyalara nasýl izin verileceði bilinmiyor.

source: Unable to open permit options file
cs: Soubor s menu nastavení práv souborù nelze otevøít.
tr: Ýzin seçenekleri dosyasý açýlamýyor

source: Specify permissions below:
cs: Zadejte pøístupová práva:
tr: Ýzinleri aþaðýda belirtin:

source: Owner:
cs: Vlastník:
tr: Sahip:

source: Group
cs: Skupina
tr: Grup

source: Others:
cs: Ostatní:
tr: Diðerleri:

source: form to permit
cs: formuláø
tr: izin verilecek form

source: Invalid mode format.
cs: Chybný formát.
tr: Kip biçemi geçersiz.

source: Invalid syntax format.
cs: Chybná syntaxe.
tr: Betik biçemi geçersiz.

source: Warning! UUDecoded file will exist in the directory you started Lynx.
cs: Varování! UUdekódovaný soubor bude vytvoøen v adresáøi, ze kterého byl Lynx spu¹tìn.
tr: Uyarý! UUçözülmüþ dosya, Lynx'i baþlattýðýnýz dizinde yer alacak.

source: NULL URL pointer
cs: NULOVÝ URL ukazatel
tr: BOÞ URL imleyici

source: Executing %s
cs: Spou¹tím %s
tr: %s icra ediliyor

source: Executing system command. This might take a while.
cs: Spou¹tí se systémový pøíkaz. Okam¾ik, prosím.
tr: Sistem komutu icra ediliyor. Bu, bir süre alabilir.

source: Current directory:
cs: Aktuální adresáø:
tr: Mevcut dizin:

source: Current selection:
cs: Zvolené polo¾ky:
tr: Mevcut seçim:

source: Nothing currently selected.
cs: ®ádné polo¾ky nejsou zvoleny.
tr: Halen hiçbir þey.seçili deðil.

source: tagged item:
cs: oznaèena polo¾ka:
tr: iþaretlenmiþ öðe:

source: tagged items:
cs: oznaèené polo¾ky:
tr: iþaretlenmiþ öðeler:

source: Illegal filename; request ignored.
cs: Chybné jméno souboru; po¾adavek ignorován.
tr: Kuraldýþý dosya adý; istem yoksayýldý.

source: Install in the selected directory not permitted.
cs: Instalace do zvoleného adresáøe není povolena.
tr: Seçili dizine kurmaya izin verilmiyor.

source: The selected item is not a directory! Request ignored.
cs: Zvolená polo¾ka není adresáøem! Po¾adavek ignorován.
tr: Seçili öðe bir dizin deðil! Ýstem yoksayýldý.

source: Just a moment, ...
cs: Okam¾ik, prosím ...
tr: Bir dakikacýk, ...

source: Error building install args
tr: Kurma arg'larýný yapýlandýrmada hata

source: Source and target are the same: %s
cs: Zdroj je toto¾ný s cílem: %s
tr: Kaynak ve hedef ayný: %s

source: Already in target directory: %s
cs: Cílový adresáø %s je toto¾ný s aktuálním.
tr: Zaten hedef dizinde: %s

source: Installation complete
cs: Instalace dokonèena
tr: Kurma tamamlandý

source: Temporary URL or list would be too long.
cs: Doèasné URL nebo seznam by bylo pøíli¹ dlouhé.
tr: Geçici URL ya da liste çok uzun olacaktý.

source: Sending
cs: Posílám
tr: Gönderiliyor

source: The link %s :?: %s
cs: Odkaz %s :?: %s
tr: %s :?: %s baðý

source: called "%s"
cs: volaný "%s"
tr: "%s" çaðrýldý

source: in the file "%s" called "%s"
cs: v souboru "%s" se jménem "%s"
tr: "%2$s" adlý dosyanýn içinde "%1$s" olup

source: was requested but was not available.
cs: byl po¾adován, ale nebyl dostupný.
tr: istendi, fakat temin edilemedi.

source: Thought you might want to know.
cs: Pouze jsem vás chtìl informovat.
tr: Bilmek isteyeceðinizi sandým.

source: This message was automatically generated by
cs: Tato zpráva byla vytvoøena automaticky programem
tr: Bu mesajý otomatik olarak oluþturan

source: No system mailer configured
tr: Ayarlanmýþ sistem postacýsý yok

source: No Winsock found, sorry.
cs: Winsock nenalezen. lituji.
tr: Winsock bulunamadý, üzgünüm.

source: You MUST define a valid TMP or TEMP area!
tr: Geçerli bir TMP ya da TEMP alaný tanýmlamalýsýnýz!

source: No such directory
tr: Böyle bir dizin yok

source: Configuration file "%s" is not available.
tr: Ayarlama dosyasý "%s" temin edilemiyor.

source: Lynx character sets not declared.
cs: Znakové sady Lynxu nejsou deklarovány.
tr: Lynx karakter kümeleri bildirilmemiþ.

source: Lynx edit map not declared.
cs: Editovací mapy Lynxu nejsou deklarovány.
tr: Lynx düzenleme eþlemi bildirilmemiþ.

source: Lynx file "%s" is not available.
tr: Lynx dosyasý "%s" temin edilemiyor.

source: Ignored %d characters from standard input.
tr: Standart girdiden %d karakter yok sayýldý.

source: Use "-stdin" or "-" to tell how to handle piped input.
tr: Veriyolu girdisinin nasýl halledileceðini belirtmek için "-stdin" ya da "-" kullanýn.

source: Warning:
cs: Varování:
tr: Uyarý:

source: persistent cookies state will be changed in next session only.
cs: Stav trvalých cookies bude zmìnìn a¾ pøi pøí¹tím sezení.
tr: kalýcý çerezler durumu, yalnýzca gelecek oturumda deðiþecek.

source: Lynx: ignoring unrecognized charset=%s
cs: Lynx: Ignoruji neznámou znakovou sadu %s
tr: Lynx: tanýnmayan karakterkümesi=%s yoksayýlýyor

source: %s Version %s (%s)
tr: %s Sürüm %s (%s)

source: Built on %s %s %s
cs: Pøelo¾en na %s %s %s
tr: %s %s %s üzerine yapýlandýrýldý

source: Copyrights held by the Lynx Developers Group,
tr: Telif haklarý Lynx Geliþtirme Grubu,

source: the University of Kansas, CERN, and other contributors.
tr: Kansas Üniversitesi, CERN ve diðer katýlýmcýlar tarafýndan (saklý) tutulmaktadýr.

source: Distributed under the GNU General Public License (Version 2).
tr: GNU Genel Kamu Lisansý (Sürüm 2) altýnda daðýtýlmaktadýr.

source: See http://lynx.isc.org/ and the online help for more information.
tr: Daha fazla bilgi için http://lynx.isc.org/ ve çevrim içi yardýma bakýnýz.

source: USAGE: %s [options] [file]
cs: Pou¾ití: %s [pøepínaèe] [soubor]
tr: KULLANIM: %s [seçenekler] [dosya]

source: Options are:
cs: Pøepínaèe:
tr: Seçenekler:

source: %s: Invalid Option: %s
cs: %s: Chybný pøepínaè %s
tr: %s: Geçersiz Seçenek: %s

source: Internal error: Invalid mouse link %d!
cs: Vnitøní chyba: chybný my¹í odkaz %d!
tr: Dahili hata: Geçersiz fare linki %d!

source: A URL specified by the user
cs: URL zadané u¾ivatelem
tr: Kullanýcý tarafýndan belirtilmiþ bir URL

source: Enctype multipart/form-data not yet supported! Cannot submit.
cs: Kódování multipart/form-data není zatím podporováno. Nelze odeslat.
tr: Enctip çok parçalý/form verisi henüz desteklenmiyor! Gönderilemez.

source: Help Screen
cs: Nápovìda
tr: Yardým Ekraný

source: System Index
cs: Systémový index
tr: Sistem Ýndeksi

source: Entry into main screen
cs: Vstup na hlavní obrazovku
tr: Ana ekrana giriþ

source: No next document present
tr: Sonrasýnda baþka belge yok

source: charset for this document specified explicitly, sorry...
cs: znaková sada tohoto dokumentu je explicitnì zadána, lituji...
tr: bu belge için karakterkümesi özgün þekilde belirtilmiþtir, üzgünüm...

source: cd to:
tr: hangi dizine cd:

source: A component of path is not a directory
tr: Yolun bileþenlerinden biri dizin deðildir

source: failed to change directory
tr: dizin deðiþtirme baþarýsýz

source: Reparsing document under current settings...
cs: Znovu zpracovávám dokument za pou¾ití nových nastavení...
tr: Mevcut ayarlarla belge yeniden ayrýþtýrýlýyor...

source: Fatal error - could not open output file %s
cs: Fatální chyba - výstupní soubor %s nelze otevøít
tr: Ölümcül hata - çýktý dosyasý %s açýlamýyor

source: TABLE center enable.
tr: TABLO ortala(mayý) etkinleþtir.
