Repository: openbsd/src
Catalog: gnu/usr.bin/lynx/po/*.po
Languages: cs, tr

source: dir_list_styles specifies the directory list style under DIRED_SUPPORT (if implemented). The default is "MIXED_STYLE", which sorts both files and directories together. "FILES_FIRST" lists files first and "DIRECTORIES_FIRST" lists directories first.
cs: Volba dir_list_styles udává pou¾itý styl pro výpis adresáøù pod DIRED_SUPPORT (pokud je podporováno). Implicitní nastavení je "MIXED_STYLE", které zpùsobí vzájemné promíchání souborù s adresáøi. "FILES_FIRST" vypí¹e jako první soubory a "DIRED_SUPPORT" adresáøe.
tr: dir_list_styles, (eðer yerine getirilmiþse) DIRED_SUPPORT altýnda dizin liste tarzýný belirler. Öntanýmlý, "MIXED_STYLE" olup, dosya ve dizinleri birlikte sýralar. "FILES_FIRST" önce dosyalarý, "DIRECTORIES_FIRST" önce dizinleri sýralar.

source: If emacs_keys is to "on" then the normal EMACS movement keys: ^N = down ^P = up ^B = left ^F = right will be enabled.
cs: Pokud je volba emacs_keys nastavena na "on", pak jsou bì¾né EMACSOVÉ klávesy pro pohyb: ^N = dolù ^P = nahoru ^B = vlevo ^F = vpravo zapnuty.
tr: Eðer emacs_keys "on" (açýk)sa, o zaman normal EMACS gezinme tuþlarý olan ^N = aþaðý ^P = yukarý ^B = sol ^F = sað etkinleþtirilecektir.

source: file_editor specifies the editor to be invoked when editing local files or sending mail. If no editor is specified, then file editing is disabled unless it is activated from the command line, and the built-in line editor will be used for sending mail.
cs: Volba file_editor udává, který editor bude pou¾it k úpravám místních souborù a psaní dopisù. Jestli¾e není specifikován ¾ádný editor, tak, pokud nejsou povoleny z pøíkazové øádky, jsou úpravy souborù zakázány. Pro psaní dopisù bude pou¾it vestavìný editor.
tr: file_editor yerel dosyalar düzenlenirken ya da posta gönderilirken çaðrýlacak düzenleyiciyi belirtir. Eðer bir düzenleyici belirtilmemiþse, komut satýrýndan etkinleþtirilmedikçe dosya düzenleme devre dýþý kalýr ve posta göndermek için yerleþik satýr düzenleyici kullanýlýr.

source: The file_sorting_method specifies which value to sort on when viewing file lists such as FTP directories. The options are: BY_FILENAME -- sorts on the name of the file BY_TYPE -- sorts on the type of the file BY_SIZE -- sorts on the size of the file BY_DATE -- sorts on the date of the file
cs: Metoda øazení souborù udává klíè, dle kterého budou øazeny seznamy souborù, jako jsou napøíklad FTP adresáøe. Mo¾né volby jsou: BY_FILENAME -- øadí dle jména souboru BY_TYPE -- øadí dle typu souboru BY_SIZE -- øadí dle velikosti souboru BY_DATE -- øadí dle data souboru
tr: file_sorting_method, FTP dizinleri gibi dosya listeleri görüntülenirken hangi deðere göre sýralama yapýlacaðýný belirler. Seçenekler: BY_FILENAME -- dosya adýna göre sýralar BY_TYPE -- dosya türüne göre sýralar BY_SIZE -- dosya boyutuna göre sýralar BY_DATE -- dosyanýn tarihine göre sýralar

source: lineedit_mode specifies the key binding used for inputting strings in prompts and forms. If lineedit_mode is set to "Default Binding" then the following control characters are used for moving and deleting: Prev Next Enter = Accept input Move char: <- -> ^G = Cancel input Move word: ^P ^N ^U = Erase line Delete char: ^H ^R ^A = Beginning of line Delete word: ^B ^F ^E = End of line Current lineedit modes are:
cs: Volba lineedit_mode specifikuje funkce kláves pro øádkový editor. Pokud je tato volba nastavena na "Default Binding", pak jsou pro posun kurzoru a mazání textu pou¾ity následující klávesy: Prev Next Enter = Pøijme zadaný text Posun o znak: <- -> ^G = Zru¹í zadávání Posun o slovo: ^P ^N ^U = Sma¾e øádek Sma¾e znak: ^H ^R ^A = Zaèátek øádku Sma¾e slovo: ^B ^F ^E = Konec øádku Mo¾né re¾imy øádkového editoru:
tr: lineedit_mode, bilgi istemi ve formlara dizge giriþi için kullanýlan tuþ karþýlýklarýný belirler. Eðer lineedit_mode "Default Binding"e ayarlanýrsa, gezinme ve silme için aþaðýdaki kontrol karakterleri kullanýlýr: Önceki Sonraki Enter = Girdiyi kabul et Kark'i taþý: <- -> ^G = Girdiyi iptal et Sözc'ü taþý: ^P ^N ^U = Satýr sil Kark'i sil: ^H ^R ^A = Satýr baþý Sözc'ü sil: ^B ^F ^E = Satýr sonu Mevcut satýr düzenleme kipleri þunlardýr:

source: The following allow you to define sub-bookmark files and descriptions. The format is multi_bookmark<capital_letter>=<filename>,<description> Up to 26 bookmark files (for the English capital letters) are allowed. We start with "multi_bookmarkB" since 'A' is the default (see above).
cs: Zde mù¾ete nastavit jména podsouborù zálo¾ek a jejich popisy. Formát je: multi_bookmark<velké_písmeno>=<jméno souboru>,<popis>. Mù¾e být zadáno a¾ 26 podsouborù zálo¾ek (ka¾dý odpovídá jednomu velkému písmeno anglické abecedy). Zaèíná se s "multi_bookmarkB", proto¾e 'A' je implicitní (viz vý¹e).
tr: Aþaðýdaki, sizin alt-yer imi dosya ve açýklamalarýný tanýmlamanýzý saðlayacaktýr. Biçem, multi_bookmark<büyük_harf>=<dosya_adý>,<açýklama> þeklindedir. 26 yer imi dosyasýna (Ýngilizce'deki büyük harfler) kadar izin verilir. "multi_bookmarkB" ile baþlanýr, zira 'A' öntanýmlý olandýr (yukarýya bkz).

source: personal_mail_address specifies your personal mail address. The address will be sent during HTTP file transfers for authorization and logging purposes, and for mailed comments. If you do not want this information given out, set the NO_FROM_HEADER to TRUE in lynx.cfg, or use the -nofrom command line switch. You also could leave this field blank, but then you won't have it included in your mailed comments.
cs: Volba personal_mail_address udává va¹i osobní adresu elektronické po¹ty. Bude pou¾ita pøi HTTP pøenosech souborù pro autorizaci a záznam èinnosti a pøi zasílání komentáøù. Pokud chcete, aby tato informace zùstala dùvìrnou, nastavte v konfiguraèním souboru lynx.cfg volbu NO_FROM_HEADER na TRUE, èi pou¾ijte pøepínaè -nofrom. Té¾ je mo¾né nechat toto pole prázdné, ale pak by nebylo zaèlenìno do vámi odeslaných komentáøù.
tr: personal_mail_address, sizin kiþisel e-posta adresinizi belirler. Bu adres, HTTP dosya aktarýmlarý sýrasýnda yetkilendirme ve oturum açma amaçlý olarak, ve yorum postalama sýrasýnda gönderilecektir. Eðer bu bilginin verilmesini istemiyorsanýz, lynx.cfg'de NO_FROM_HEADER'ý TRUE olarak ayarlayýn, ya da -nofrom komut satýr seçeneðini kullanýn. Bu alaný boþ da býrakabilirsiniz, ama o zaman gönderilmiþ yorumlarýnýzda da bu alan içerilmeyecektir.

source: preferred_charset specifies the character set in MIME notation (e.g., ISO-8859-2, ISO-8859-5) which Lynx will indicate you prefer in requests to http servers using an Accept-Charset header. The value should NOT include ISO-8859-1 or US-ASCII, since those values are always assumed by default. May be a comma-separated list. If a file in that character set is available, the server will send it. If no Accept-Charset header is present, the default is that any character set is acceptable. If an Accept-Charset header is present, and if the server cannot send a response which is acceptable according to the Accept-Charset header, then the server SHOULD send an error response, though the sending of an unacceptable response is also allowed.
cs: Volba preferred_charset udává, ve kterých znakových sadách bude Lynx pøednostnì po¾adovat dokumenty od http serverù. Znaková sada musí být zadána v MIME notaci (ISO-8859-2, ISO-8859-5). ISO-8859-1 a US-ASCII by NEMÌLY být pou¾ity, nebo» tyto znakové sady jsou v¾dy implicitnì pøedpokládány. Znakových sad mù¾e být uvedeno více a musí být oddìleny èárkou. Pokud je dokument v této znakové sadì k dispozici, server jej za¹le. V pøípadì, ¾e hlavièka Accept-Charset není pøítomna, se implicitnì pøedpokládá, ¾e bude akceptována jakákoli znaková sada. Jestli¾e je hlavièka Accept-Charset pøítomna a server nemù¾e zaslat dokument v poøadované znakové sadì, MÌL BY zaslat chybovou hlá¹ku. Mù¾e v¹ak také poslat dokument v jiné, ne¾ po¾adované znakové sadì.
tr: preferred_charset, MIME gösterimindeki karakter kümesini belirler (örn, ISO-8859-2, ISO-8859-5), Lynx bunu, http sunucularýndan yaptýðýnýz istemlerde sizin tercihiniz olarak bir Accept-Charset baþlýðýyla belirtir. Deðer, ISO-8859-1 ya da US-ASCII'yi, bunlar her zaman öntanýmlý olarak varsayýldýðýndan, içermemelidir. Virgülle ayrýlmýþ bir liste olabilir. Eðer o karakter kümesinde bir dosya mevcutsa, sunucu onu gönderecektir. Eðer Accept-Charset baþlýðý yoksa öntanýmlý olan, tüm karakter kümelerinin kabul edilebilirliðidir. Eðer bir Accept-Charset baþlýðý var ve sunucu bu baþlýk uyarýnca kabul edilebilir bir yanýt gönderemiyorsa, sunucunun bir hata yanýtý göndermesi gerekmekle birlikte, bir kabul edilemez yanýtýnýn gönderimine de izin verilir.

source: preferred_language specifies the language in MIME notation (e.g., en, fr, may be a comma-separated list in decreasing preference) which Lynx will indicate you prefer in requests to http servers. If a file in that language is available, the server will send it. Otherwise, the server will send the file in its default language.
tr: preferred_language, MIME gösterimindeki dili belirler (örn, en,fr, tercih sýrasýna göre virgülle ayrýlmýþ bir liste olabilir); Lynx bunu http sunucularýndan istemde bulunurken sizin tercihiniz olarak belirtir. O dilde bir dosya mevcutsa, sunucu onu gönderecektir. Aksi halde, sunucu öntanýmlý dilindeki dosyayý gönderir.

source: If run_all_execution_links is set "on" then all local execution links will be executed when they are selected. WARNING - This is potentially VERY dangerous. Since you may view information that is written by unknown and untrusted sources there exists the possibility that Trojan horse links could be written. Trojan horse links could be written to erase files or compromise security. This should only be set to "on" if you are viewing trusted source information.
cs: Pokud je volba run_all_execution_links zapnuta ("on"), pak v¹echny programy budou pøi zvolení odkazu na tento program spu¹tìny. VAROVÁNÍ - Tato volba je VELICE nebezpeèná. Jeliko¾ si mù¾ete prohlí¾et informace, které pocházejí z neznámých a nedùvìryhodných zdrojù, existuje mo¾nost, ¾e nìkteré odkazy vedou k programùm typu 'trojský kùò'. Úèelem odkazù na 'trojské konì' mù¾e být smazání souborù èi naru¹ení bezpeènosti systému. Tato volba by mìla být zapnuta pouze tehdy, jestli¾e soubory, které prohlí¾íte, pocházejí z dùvìryhodných zdrojù.
tr: Eðer run_all_execution_links "on" (açýk)a ayarlanýrsa, tüm yerel icraat linkleri seçildiklerinde icra edilecektir. UYARI - Bu, potansiyel olarak çok tehlikelidir. Bilinmeyen ve güvenilmez kaynaklar tarafýndan yazýlmýþ bilgileri görüntüleyebileceðinizden dolayý Truva atý linklerinin yazýlma olasýlýðý mevcuttur. Truva atý linkleri dosyalarý silmek ya da güvenliði zayýflatmak için yazýlabilir. Bu ayar yalnýzca güvenilir kaynak bilgisi görüntülediðiniz koþulda "on" (açýk)a ayarlanmalýdýr.

source: If run_execution_links_on_local_files is set "on" then all local execution links that are found in LOCAL files will be executed when they are selected. This is different from run_all_execution_links in that only files that reside on the local system will have execution link permissions. WARNING - This is potentially dangerous. Since you may view information that is written by unknown and untrusted sources there exists the possibility that Trojan horse links could be written. Trojan horse links could be written to erase files or compromise security. This should only be set to "on" if you are viewing trusted source information.
cs: Pokud je volba run_execution_links_on_local_files zapnuta ("on"), pak v¹echny místní programy, na které je odkaz v MÍSTNÍCH souborech, budou pøi zvolení tohoto odkazu spu¹tìny. Tato volba se od volby run_all_execution_links odli¹uje v tom, ¾e povoluje spou¹tìní pouze tìch programù, na nì¾ vedou odkazy z MÍSTNÍCH souborù. VAROVÁNÍ - Tato volba je potenciálnì nebezpeèná. Jeliko¾ si mù¾ete prohlí¾et informace, které pocházejí z neznámých a nedùvìryhodných zdrojù, existuje mo¾nost, ¾e nìkteré odkazy vedou k programùm typu 'trojský kùò'. Úèelem odkazù na 'trojské konì' mù¾e být smazání souborù èi naru¹ení bezpeènosti systému. Tato volba by mìla být zapnuta pouze tehdy, jestli¾e soubory, které prohlí¾íte, pocházejí z dùvìryhodných zdrojù.
tr: Eðer run_execution_links_on_local_files "on" (açýk)a ayarlanýrsa YEREL dosyalarda bulunan tüm yerel icraat linkleri seçildiklerinde icra edilecektir. Bu, run_all_execution_links'ten farklý olup, yalnýzca yerel sistemde yerleþik bulunan dosyalarýn icraat link izinleri vardýr. UYARI - Bu, potansiyel olarak çok tehlikelidir. Bilinmeyen ve güvenilmez kaynaklar tarafýndan yazýlmýþ bilgileri görüntüleyebileceðinizden dolayý Truva atý linklerinin yazýlma olasýlýðý mevcuttur. Truva atý linkleri dosyalarý silmek ya da güvenliði zayýflatmak için yazýlabilir. Bu ayar yalnýzca güvenilir kaynak bilgisi görüntülediðiniz koþulda "on" (açýk)a ayarlanmalýdýr.

source: select_popups specifies whether the OPTIONs in a SELECT block which lacks a MULTIPLE attribute are presented as a vertical list of radio buttons or via a popup menu. Note that if the MULTIPLE attribute is present in the SELECT start tag, Lynx always will create a vertical list of checkboxes for the OPTIONs. A value of "on" will set popup menus as the default while a value of "off" will set use of radio boxes. The default can be overridden via the -popup command line toggle.
cs: Volba select_popups udává, zda volby (OPTION) uvnitø prvku SELECT, který nemá specifikován atribut MULTIPLE, budou zobrazeny jako vertikální seznam pøepínacích tlaèítek èi jako vyskakovací menu. Pokud je atribut MULTIPLE specifikován, pak Lynx v¾dy vytvoøí vertikální seznam za¹krtávacích polí. Nastavení této volby na "on" zapne pou¾ívání vyskakovacích menu. Nastavení na "off" zapne pou¾ívání pøepínacích tlaèítek. Implicitní nastavení mù¾e být potlaèeno pøepínaèem -popup.
tr: select_popups, MULTIPLE özniteliðinden yoksun olan SELECT bloðundaki OPTIONlarýn dikey bir radyo düðmesi listesi olarak mý, yoksa açýlýr menü olarak mý gösterileceðini belirler. MULTIPLE özniteliðinin SELECT baþlangýç etiketinde yer almasýnýn, Lynx'in OPTIONlar için her zaman dikey onay kutusu listesi oluþturmasýna yol açacaðýný kaydediniz. Bir "on" (açýk) deðeri, öntanýmlý olarak açýlýr menüler kurarken, "off" (kapalý), radyo kutularý kullanýmýný kuracaktýr. Öntanýmlý, -popup komut satýr anahtarýyla geçersiz kýlýnabilir.

source: show_color specifies how to set the color mode at startup. A value of "never" will force color mode off (treat the terminal as monochrome) at startup even if the terminal appears to be color capable. A value of "always" will force color mode on even if the terminal appears to be monochrome, if this is supported by the library used to build lynx. A value of "default" will yield the behavior of assuming a monochrome terminal unless color capability is inferred at startup based on the terminal type, or the -color command line switch is used, or the COLORTERM environment variable is set. The default behavior always is used in anonymous accounts or if the "option_save" restriction is set. The effect of the saved value can be overridden via the -color and -nocolor command line switches. The mode set at startup can be changed via the "show color" option in the 'o'ptions menu. If the option settings are saved, the "on" and "off" "show color" settings will be treated as "default".
cs: Volba show_color udává, jak bude nastaven barevný re¾im po spu¹tìní programu. Hodnota "never" znamená, ¾e terminál bude chápán jako monochromatický ( i kdyby podporoval barvy). Hodnota "always" zapne barevný re¾im i kdy¾ se terminál zdá být monochromatickým. Barvy musí být podporovány knihovnou, se kterou byl Lynx pøelo¾en. Hodnota "default" znamená, ¾e pokud bude splnìna jedna z následujících podmínek, bude terminál pova¾ován za barevný, jinak za monochromatický: terminál podporuje barvy, byl pou¾it pøepínaè -color èi je nastavena promìnná COLORTERM. Implicitní chování je v¾dy pou¾ito pro anonymní úèty, nebo pokud je nastaveno omezení "option_save". Nastavení této volby mù¾e být potlaèeno pøepínaèi -color èi -nocolor. Re¾im nastavený pøi startu mù¾e být zmìnìn pomocí volby "show color" v konfiguraèním menu (do nìj vstoupíte klávesou 'o'). Pokud je hodnota volby "show color" ulo¾ena, je pova¾ována za implicitní nastavení.
tr: show_color, baþlangýçta renk kipinin nasýl ayarlanacaðýný belirler. Bir "never" (asla) deðeri, uçbirim renk yetisine sahip olsa da, renk kipini kapanmaya zorlayacaktýr (uçbirime siyah/beyaz muamelesi yapacaktýr). Bir "always" (her zaman) deðeri, uçbirim siyah/beyaz görünse de, lynx yapýlandýrýlýrken kullanýlan kitaplýk desteklediði takdirde renkli kipe zorlayacaktýr. Bir "default" (öntanýmlý) deðeri, renk yetisi baþlangýçta uçbirim türüne dayandýrýlarak çýkarsanmýþ, -color komut satýrý seçeneði, ya da COLORTERM çevre deðiþkeniyle atanmýþ olmadýkça, siyah/beyaz bir uçbirim varsayma davranýþý sergileyecektir. Öntanýmlý davranýþ, anonim hesaplarda ya da "option_save" kýsýtlamasý kurulduðunda her zaman kullanýlýr. Kaydedilmiþ deðerin etkisi, -color ve -nocolor komut satýr seçenekleriyle geçersiz kýlýnabilir. Baþlangýçtaki kip ayarý, seçenekler(o) menüsündeki "renkleri göster" seçeneði aracýlýðýyla deðiþtirilebilir. Eðer seçenek ayarlarý kaydedilmiþse, "on" (açýk) "off" (kapalý) ve "show color" (renk göster) ayarlarý "default" (öntanýmlý) olarak muamele görecektir.

source: show_cursor specifies whether to 'hide' the cursor to the right (and bottom, if possible) of the screen, or to place it to the left of the current link in documents, or current option in select popup windows. Positioning the cursor to the left of the current link or option is helpful for speech or braille interfaces, and when the terminal is one which does not distinguish the current link based on highlighting or color. A value of "on" will set positioning to the left as the default while a value of "off" will set 'hiding' of the cursor. The default can be overridden via the -show_cursor command line toggle.
cs: Volba show_cursor udává, zda 'schovat' kurzor k pravému (a pokud mo¾no i dolnímu) kraji obrazovky, èi zda jej umístit vlevo k aktuálnímu odkazu (v dokumentech) nebo volbì (ve vyskakovacích menu). Zobrazení kurzoru vlevo od aktuálního odkazu je u¾iteèné pro braille terminály a pro terminály, které neumí zvýraznit aktuální odkaz zvýraznìním èi barvou. Nastavení této volby na "on" zpùsobí zobrazování kurzoru vlevo od aktuálního odkazu. Nastavení na "off" zapne 'schovávání' kurzoru. Implicitní nastavení mù¾e být potlaèeno pøepínaèem -show_cursor.
tr: show_cursor, imlecin ekranýn (mümkünse) saðýna mý, yoksa belgelerdeki linkin ya da seçkin beliriveren pencerelerdeki mevcut seçeneðin soluna mý yerleþtirileceðini belirler. Ýmleci mevcut link ya da seçeneðin soluna yerleþtirmek, konuþma ya da körler alfabesi arayüzleri için, ayrýca uçbirimin parlaklaþtýrarak ya da renkle mevcut linki ayýrdetmediði durumlarda yararlýdýr. Bir "on" (açýk) deðeri, konumlandýrmayý öntanýmlý olarak sola yönlendirirken, "off" (kapalý) deðeri, imlecin gizlenmesini saðlar. Öntanýmlý, -show_cursor komut satýr anahtarýyla geçersiz kýlýnabilir.

source: show_dotfiles specifies that the directory listing should include "hidden" (dot) files/directories. If set "on", this will be honored only if enabled via userdefs.h and/or lynx.cfg, and not restricted via a command line switch. If display of hidden files is disabled, creation of such files via Lynx also is disabled.
cs: Volba show_dotfiles øíká, ¾e výpisy obsahu adresáøù by mìly zahrnovat 'skryté' (teèkou zaèínající) soubory/adresáøe. Na zapnutí této volby (nastavení na "on"), bude brán zøetel pouze tehdy, jestli¾e je zapnuta také v lynx.cfg a/nebo v userdefs.h a zároveò není vypnuta z pøíkazové øádky. Pokud je zobrazování skrytých souborù vypnuto, nebude je mo¾né z Lynxu ani vytváøet.
tr: show_dotfiles dizin listelemenin "hidden" (nokta) dosyalar/dizinleri içerip içermeyeceðini belirler. Eðer "on" (açýk)a ayarlanýrsa, yalnýzca userdefs.h ve/veya lynx.cfg aracýlýðýyla etkinleþtirildiðinde bu onurlandýrma saðlanacak ve komut satýr seçeneðiyle kýsýtlanmayacaktýr. Eðer gizli dosyalarýn gösterimi devre dýþý býrakýlýrsa, Lynx aracýlýðýyla bu tür dosyalarýn oluþturulmasý da devre dýþý kalacaktýr.

source: If sub_bookmarks is not turned "off", and multiple bookmarks have been defined (see below), then all bookmark operations will first prompt the user to select an active sub-bookmark file. If the default Lynx bookmark_file is defined (see above), it will be used as the default selection. When this option is set to "advanced", and the user mode is advanced, the 'v'iew bookmark command will invoke a statusline prompt instead of the menu seen in novice and intermediate user modes. When this option is set to "standard", the menu will be presented regardless of user mode.
cs: Pokud není volba sub_bookmarks vypnuta ("off") a bylo specifikováno více souborù se zálo¾kami (viz ní¾e), pak pøi v¹ech operacích se zálo¾kami bude u¾ivatel nejprve vyzván, aby vybral nìkterý ze souborù. Jestli¾e je nastavena volba bookmark_file, pak bude implicitnì pou¾ita její hodnota. Jestli¾e je sub_bookmarks nastaveno na "advanced" a u¾ivatelský re¾im je také "advanced", tak pøíkaz pro zobrazení zálo¾ek ('v') vyvolá místo menu prompt. Nastavení této volby na "standard" zpùsobí zobrazení menu bez ohledu na u¾ivatelský re¾im.
tr: Eðer sub_bookmarks "off" (kapalý) deðilse ve çok sayýda yer imi tanýmlanmýþsa (aþaðýya bkz), tüm yer imi iþlemleri ilk olarak kullanýcýdan etkin bir alt-yer imi dosyasý seçmesini ister. Eðer öntanýmlý Lynx yer imi dosyasý tanýmlanmýþsa (yukarýya bkz) bu, öntanýmlý seçim olarak kullanýlacaktýr. Bu seçenek "advanced" (ileri düzey)e ayarlanmýþ ve kullanýcý kipi de ileri düzeyse, yer imini göster(v) komutu, acemi ve orta düzey kullanýcý kiplerinde görülen menü yerine bir durumsatýrý bilgi istemi çaðýracaktýr. Bu seçenek "standard"a ayarlandýðýnda menü, kullanýcý kipinden baðýmsýz olarak görüntülenecektir.

source: user_mode specifies the users level of knowledge with Lynx. The default is "NOVICE" which displays two extra lines of help at the bottom of the screen to aid the user in learning the basic Lynx commands. Set user_mode to "INTERMEDIATE" to turn off the extra info. Use "ADVANCED" to see the URL of the currently selected link at the bottom of the screen.
cs: Volba user_mode udává úroveò znalostí u¾ivatele o programu Lynx. Implicitní nastavení je "NOVICE", které zpùsobí zobrazení 2 øádek s nápovìdou v dolní èásti obrazovky. Nastavení "INTERMEDIATE" vypne tuto nápovìdu a nastavení "ADVANCED" zpùsobí vypsání URL aktuálního odkazu v dolní èásti obrazovky.
tr: user_mode, kullanýcýnýn Lynx bilgi düzeyini belirler. Öntanýmlý "NOVICE" (acemi) olup, kullanýcýnýn temel Lynx komutlarýný öðrenmesine yardýmcý olmak için ekranýn en altýnda iki satýrlýk yardým (mesajlarý) görüntüler. Bu fazladan bilgiyi kapatmak için user_mode'u "INTERMEDIATE" (orta düzey)e ayarlayýnýz. Ekranýn en altýnda mevcut seçilmiþ linkin URL'sini görmek için "ADVANCED" (ileri düzey)i kullanýn.

source: If verbose_images is "on", lynx will print the name of the image source file in place of [INLINE], [LINK] or [IMAGE] See also VERBOSE_IMAGES in lynx.cfg
cs: Pokud je volba verbose_images zapnuta ("on"), lynx bude zobrazovat jména souborù s obrázky místo [INLINE], [LINK] èi [IMAGE]. Viz té¾ volbu VERBOSE_IMAGES v kynx.cfg.
tr: Eðer verbose_images "on" (açýk) ise lynx, [INLINE], [LINK] ya da [IMAGE] yerine resim kaynak dosyasýnýn ismini yazacaktýr. Ayrýca lynx.cfg'deki VERBOSE_IMAGES'a bkz
