openbsd/src/sbin/modunload/modunload.8
.\"	$OpenBSD: modunload.8,v 1.15 2010/09/03 10:08:22 jmc Exp $
.\"	$NetBSD: modunload.8,v 1.3 1995/03/18 14:56:49 cgd Exp $
.\"
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: September 3 2010 $
.Dt MODUNLOAD 8
.Os
.Sh NAME
.Nm modunload
.Nd unload a kernel module
.Sh SYNOPSIS
.Nm modunload
.Op Fl i Ar id
.Op Fl n Ar name
.Op Fl p Ar postunload
.Sh DESCRIPTION
The
.Nm
utility unloads a loadable kernel module from a running system.
The
.Ar id
or
.Ar name
is the ID or name of the module as shown by
.Xr modstat 8 .
.Pp
One of the following options must be specified:
.Bl -tag -width indent
.It Fl i Ar id
Unload the module with the ID
.Ar id .
.It Fl n Ar name
Unload the module with the name
.Ar name .
.It Fl p Ar postunload
Specify the name of a shell script or program that will be executed if the
module is successfully unloaded.
This program is passed no arguments.
.El
.Sh EXIT STATUS
The
.Nm
utility exits 0 on success or with a non-zero status if an error occurred.
.Sh SEE ALSO
.Xr lkm 4 ,
.Xr securelevel 7 ,
.Xr modload 8 ,
.Xr modstat 8
.Sh HISTORY
The
.Nm
command was designed to be similar in functionality
to the corresponding command in
.Tn "SunOS 4.1.3" .
.Sh AUTHORS
.An Terrence R. Lambert terry@cs.weber.edu
