openbsd/src/usr.bin/mixerctl/mixerctl.1
.\" $OpenBSD: mixerctl.1,v 1.36 2020/04/04 08:43:08 ratchov Exp $
.\" $NetBSD: mixerctl.1,v 1.8 1998/05/09 12:41:16 augustss Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Author: Lennart Augustsson
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: April 4 2020 $
.Dt MIXERCTL 1
.Os
.Sh NAME
.Nm mixerctl
.Nd control audio mixing
.Sh SYNOPSIS
.Nm mixerctl
.Op Fl anv
.Op Fl f Ar file
.Nm mixerctl
.Op Fl nv
.Op Fl f Ar file
.Ar name ...
.Nm mixerctl
.Op Fl qt
.Op Fl f Ar file
.Ar name ...
.Nm mixerctl
.Op Fl q
.Op Fl f Ar file
.Ar name Ns = Ns Ar value ...
.Sh DESCRIPTION
The
.Nm
command displays or sets various audio system mixing variables.
If a list of variables is present on the command line,
.Nm
prints the current value of those variables for the specified device.
Variables can also be set at system startup using the configuration file
.Xr mixerctl.conf 5 .
.Pp
The options are as follows:
.Bl -tag -width "-f file"
.It Fl a
Print all device variables and their current values.
This is the default, if no parameters are given to
.Nm .
.It Fl f Ar file
Specify an alternative audio mixing device.
The default is
.Pa /dev/audioctl0 .
.It Fl n
Suppress printing of the variable name.
.It Fl q
Suppress all printing when setting a variable.
.It Fl t
Toggle.
Attempt to select the next possible value
of an enum
(see below).
.It Fl v
Show all possible values of variables.
Enum values are shown in
.Sq []
and values belonging to a set are shown in
.Sq {}
(see below).
.It Ar name Ns = Ns Ar value
Attempt to set the specified variable
.Ar name
to
.Ar value .
.El
.Pp
The exact set of controls that can be manipulated depends on
the mixer.
The general format (in both getting and setting a value) is:
.Pp
.D1 class.name=value
.Pp
The
.Ar class
can have values like
.Dq inputs
or
.Dq outputs ,
indicating that the control affects the input or output, respectively,
to the mixer.
The
.Ar name
indicates what part of the mixer the control affects.
Continuous mixer values, e.g. volume,
have numeric values in the range 0\-255.
If
.Ar value
can be set for each channel independently,
the values are printed separated by commas.
Discrete mixer values, e.g. the recording source,
have symbolic names.
.Pp
Variables may take one of three types,
again dependent on the mixer:
.Bl -enum
.It
Enums.
These may take only one out of a possible list of symbolic values
or the literal string
.Dq toggle ,
which toggles the value,
e.g. inputs.mic.source=mic0.
.It
Sets.
These can take one or more of a possible list of symbolic values;
multiple values are specified as a comma-separated list,
e.g. record.source=mic,cd.
Additionally,
.Ar value
may be omitted to specify the empty set,
e.g. record.source=.
.It
Numbers.
Numerical values may be specified in either absolute or relative forms.
The relative form is indicated by a prefix of
.Ql +
or
.Ql -
to denote an increase or decrease, respectively.
.El
.Sh ENVIRONMENT
.Bl -tag -width "MIXERDEVICEXXX"
.It Ev MIXERDEVICE
The audio mixer device to use.
.El
.Sh FILES
.Bl -tag -width "/etc/mixerctl.confXXX" -compact
.It Pa /dev/audioctl0
Default mixer audio device.
.It Pa /etc/mixerctl.conf
.Nm
configuration file.
.El
.Sh EXAMPLES
Show possible values for all mixer variables,
and their current settings:
.Bd -literal -offset indent
$ mixerctl -av
inputs.mic=0,0 volume
inputs.mic.mute=off  [ off on ]
inputs.cd=220,220 volume
inputs.cd.mute=off  [ off on ]
inputs.dac=220,220 volume
inputs.dac.mute=off  [ off on ]
record.record=220,220 volume
record.record.source=mic  [ mic cd dac ]
monitor.monitor=0 volume
.Ed
.Pp
Toggle inputs.dac.mute:
.Bd -literal -offset indent
$ mixerctl -t inputs.dac.mute
inputs.dac.mute: off -\*(Gt on
$ mixerctl inputs.dac.mute=toggle
inputs.dac.mute: on -\*(Gt off
.Ed
.Sh SEE ALSO
.Xr aucat 1 ,
.Xr audioctl 1 ,
.Xr cdio 1 ,
.Xr audio 4 ,
.Xr mixerctl.conf 5 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
command first appeared in
.Ox 2.4 .
