openbsd/src/usr.bin/mixerctl/mixerctl.1
.\" $OpenBSD: mixerctl.1,v 1.22 2004/11/22 09:26:24 jsg Exp $
.\" $NetBSD: mixerctl.1,v 1.8 1998/05/09 12:41:16 augustss Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Author: Lennart Augustsson
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 4, 1997
.Dt MIXERCTL 1
.Os
.Sh NAME
.Nm mixerctl
.Nd control audio mixing
.Sh SYNOPSIS
.Nm mixerctl
.Op Fl nv
.Op Fl f Ar file
.Fl a
.Nm mixerctl
.Op Fl nv
.Op Fl f Ar file
.Ar name Op Ar ...
.Nm mixerctl
.Op Fl q
.Pf \ \& Op Fl f Ar file
.Xo
.Ar name Ns = Ns Ar value
.Op Ar ...
.Xc
.Sh DESCRIPTION
The
.Nm
command displays or sets various audio system mixing variables.
If a list of variables is present on the command line,
.Nm
prints the current value of those variables for the specified device.
By default,
.Nm
operates on the
.Pa /dev/mixer
device.
.Pp
The options are as follows:
.Bl -tag -width "-f file"
.It Fl a
Print all device variables and their current values.
.It Fl f Ar file
Specify an alternative audio mixing device.
.It Fl n
Suppress printing of the variable name.
.It Fl q
Suppress all printing when setting a variable.
.It Fl v
Show the possible values of enumeration and set valued variables.
Enumerated values are shown in
.Dq []
and set values are shown in
.Dq {} .
.It Ar name Ns = Ns Ar value
Attempt to set the specified variable
.Ar name
to
.Ar value .
.El
.Pp
Values may be specified in either absolute or relative forms.
The relative form is indicated by a prefix of
.Ql +
or
.Ql -
to denote an increase or decrease, respectively.
.Pp
The exact set of controls that can be manipulated depends on
the mixer.
The general format (in both getting and setting a value) is
.Pp
.D1 class.name=value
.Pp
The
.Ar class
can have values like
.Li inputs
or
.Li outputs
indicating that the control affects the input or output, respectively,
to the mixer.
The
.Ar name
indicates what part of the mixer the control affects.
Continuous mixer values, e.g., volume, have numeric values
in the range 0-255.
If
.Ar value
can be set for each channel independently,
the values are printed separated by commas.
Discrete mixer values, e.g.,
the recording source, have symbolic names.
Depending on the mixer it
may either be an enumeration or a set.
.Sh ENVIRONMENT
.Bl -tag -width MIXERDEVICE
.It Ev MIXERDEVICE
The audio mixer device to use.
.El
.Sh FILES
.Bl -tag -width /dev/mixer
.It Pa /dev/mixer
default mixer audio device
.El
.Sh EXAMPLES
The command
.Pp
.Dl "$ mixerctl -a -v"
.Pp
can produce
.Bd -literal -offset indent
inputs.mic=0,0 volume
inputs.mic.mute=off  [ off on ]
inputs.cd=220,220 volume
inputs.cd.mute=off  [ off on ]
inputs.dac=220,220 volume
inputs.dac.mute=off  [ off on ]
record.record=220,220 volume
record.record.source=mic  [ mic cd dac ]
monitor.monitor=0 volume
.Ed
.Sh SEE ALSO
.Xr aucat 1 ,
.Xr audioctl 1 ,
.Xr cdio 1 ,
.Xr audio 4 ,
.Xr mixerctl.conf 5 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 1.3 .
