openbsd/src/share/man/man4/man4.amd64/amdpcib.4
.\"     $OpenBSD: amdpcib.4,v 1.2 2007/10/08 12:48:21 jmc Exp $
.\"
.\" Marc Balmer, 2007. Public Domain.
.\"
.Dd $Mdocdate: October 8 2007 $
.Dt AMDPCIB 4 amd64
.Os
.Sh NAME
.Nm amdpcib
.Nd AMD-8111 series LPC bridge and timecounter
.Sh SYNOPSIS
.Cd "amdpcib* at pci?"
.Cd "isa* at amdpcib?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the AMD-8111 LPC bridge and implements a
32/64-bit 14.3 MHz (or variable) timecounter using the HPET timer.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr isa 4 ,
.Xr pci 4 ,
.Xr watchdog 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.3 .
.Sh AUTHORS
The
.Nm
driver was written by Michael Shalayeff.
