openbsd/src/share/man/man4/man4.amd64/cpu.4
.\"	$OpenBSD: cpu.4,v 1.2 2007/05/31 19:19:53 jmc Exp $
.\"
.\" Copyright (c) 2004 Ted Unangst
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt CPU 4 amd64
.Os
.Sh NAME
.Nm cpu
.Nd Central Processing Unit
.Sh SYNOPSIS
.Cd "cpu0 at mainbus?"
.Cd "cpu* at mainbus?"
.Sh DESCRIPTION
Several processor models have additional features that extend their base
functionality, such as power and frequency control.
.Sh FREQUENCY CONTROL
The
.Xr sysctl 3
hw.cpuspeed will return the current operating frequency of the processor
(on some processors this value may be an approximation).
If possible, speed may be adjusted by altering hw.setperf from 0 to 100,
representing percentage of maximum speed.
There is only one possible implementation for setperf, transparent
to the user:
.Bl -tag -width tenletters
.It PowerNow
Found on various AMD processors.
Currently only supports a limited set of models in the K8 families.
.El
.Sh SEE ALSO
.Xr sysctl 8
