openbsd/src/usr.sbin/eigrpd/eigrpd.8
.\"	$OpenBSD: eigrpd.8,v 1.3 2015/10/27 07:26:43 jmc Exp $
.\"
.\" Copyright (c) 2015 Renato Westphal <renato@openbsd.org>
.\" Copyright (c) 2004, 2005, 2007 Esben Norby <norby@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 27 2015 $
.Dt EIGRPD 8
.Os
.Sh NAME
.Nm eigrpd
.Nd Enhanced Interior Gateway Routing Protocol daemon
.Sh SYNOPSIS
.Nm
.Op Fl dnv
.Op Fl D Ar macro Ns = Ns Ar value
.Op Fl f Ar file
.Op Fl s Ar socket
.Sh DESCRIPTION
.Nm
is an Enhanced Interior Gateway Routing Protocol
.Pq EIGRP
daemon which manages routing tables.
EIGRP is a routing protocol based on Distance Vector technology.
.Pp
.Nm
is usually started at boot time, and can be enabled by
setting the following in
.Pa /etc/rc.conf.local :
.Pp
.Dl eigrpd_flags=\&"\&"
.Pp
See
.Xr rc 8
and
.Xr rc.conf 8
for more information on the boot process
and enabling daemons.
.Pp
A running
.Nm
can be controlled with the
.Xr eigrpctl 8
utility.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl D Ar macro Ns = Ns Ar value
Define
.Ar macro
to be set to
.Ar value
on the command line.
Overrides the definition of
.Ar macro
in the configuration file.
.It Fl d
Do not daemonize.
If this option is specified,
.Nm
will run in the foreground and log to
.Em stderr .
.It Fl f Ar file
Specify an alternative configuration file.
.It Fl n
Configtest mode.
Only check the configuration file for validity.
.It Fl s Ar socket
Use an alternate location for the default control socket.
.It Fl v
Produce more verbose output.
.El
.Sh FILES
.Bl -tag -width "/var/run/eigrpd.sockXX" -compact
.It Pa /etc/eigrpd.conf
Default
.Nm
configuration file.
.It Pa /var/run/eigrpd.sock
.Ux Ns -domain
socket used for communication with
.Xr eigrpctl 8 .
.El
.Sh SEE ALSO
.Xr eigrpd.conf 5 ,
.Xr eigrpctl 8
.Sh STANDARDS
.Rs
.%A Savage, et al.
.%D April 2014
.%R draft-savage-eigrp-04
.%T Enhanced Interior Gateway Routing Protocol
.Re
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 5.9 .
.Sh AUTHORS
The
.Nm
program was written by
.An Renato Westphal Aq Mt renato@openbsd.org .
