openbsd/src/usr.sbin/ypserv/yppush/yppush.8
.\"	$OpenBSD: yppush.8,v 1.12 2007/05/31 19:20:31 jmc Exp $
.\"
.\" Copyright (c) 1995 Mats O Jansson <moj@stacken.kth.se>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt YPPUSH 8
.Os
.Sh NAME
.Nm yppush
.Nd force distribution of YP map
.Sh SYNOPSIS
.Nm yppush
.Op Fl d Ar domainname
.Op Fl h Ar hostname
.\" .Op Fl p Ar paralleljobs
.\" .Op Fl t Ar timeout
.Op Fl v
.Ar mapname
.Sh DESCRIPTION
.Nm yppush
is used to distribute an YP map from a master server to any
slave server in the domain.
All servers of the domain are fetched from the YP map ypservers.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d Ar domainname
Don't use default domain, use the specified domain.
.It Fl h Ar hostname
Distribute map only to one host and not to the hosts in the ypserver map.
.\" .It Fl p Ar paralleljobs
.\"Set the number of parallel transfers.
.\".It Fl t Ar timeout
.\"Set the amount of time to elapse before a timeout is registered.
.It Fl v
Verbose.
Announce what the program is doing.
.El
.Sh SEE ALSO
.Xr yp 8 ,
.Xr ypserv 8
.Sh AUTHORS
.An Mats O Jansson Aq moj@stacken.kth.se
