openbsd/src/usr.sbin/ldpd/ldpd.conf.5
.\"	$OpenBSD: ldpd.conf.5,v 1.7 2012/04/24 14:56:09 jmc Exp $
.\"
.\" Copyright (c) 2009 Michele Marchetto <michele@openbsd.org>
.\" Copyright (c) 2005, 2006 Esben Norby <norby@openbsd.org>
.\" Copyright (c) 2004 Claudio Jeker <claudio@openbsd.org>
.\" Copyright (c) 2003, 2004 Henning Brauer <henning@openbsd.org>
.\" Copyright (c) 2002 Daniel Hartmeier <dhartmei@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 24 2012 $
.Dt LDPD.CONF 5
.Os
.Sh NAME
.Nm ldpd.conf
.Nd Label Distribution Protocol daemon configuration file
.Sh DESCRIPTION
The
.Xr ldpd 8
daemon implements the Label Distribution Protocol as described in RFC 3036.
.Sh SECTIONS
The
.Nm
config file is divided into three main sections.
.Bl -tag -width xxxx
.It Sy Macros
User-defined variables may be defined and used later, simplifying the
configuration file.
.It Sy Global Configuration
Global settings for
.Xr ldpd 8 .
.It Sy Interfaces Configuration
Interface-specific parameters.
.El
.Sh MACROS
Much like
.Xr cpp 1
or
.Xr m4 1 ,
macros can be defined that will later be expanded in context.
Macro names must start with a letter, digit, or underscore,
and may contain any of those characters.
Macro names may not be reserved words (for example,
.Ic cost ) .
Macros are not expanded inside quotes.
.Pp
For example:
.Bd -literal -offset indent
hi="2"
interface em0 {
	cost $hi
}
.Ed
.Sh GLOBAL CONFIGURATION
Global settings concerns the main behaviour of the daemon.
.Pp
.Bl -tag -width Ds -compact
.It Xo
.Ic fib-update
.Pq Ic yes Ns | Ns Ic no
.Xc
If set to
.Ic no ,
do not update the Label Forwarding Information Base, a.k.a. the kernel routing
table.
The default is
.Ic yes .
.Pp
.It Ic router-id Ar address
Set the router ID; in combination with labelspace it forms the LSR-ID.
.Pp
.It Ic labelspace Ar number
Set the label space advertised by
.Xr ldpd 8 .
.Pp
.It Ic holdtime Ar seconds
Set the hello holdtime in seconds.
The maximum time
.Xr ldpd 8
will wait between two consecutive hello messages from a peer before it is
marked as being down.
The default value is 15.
.Pp
.It Ic hello-interval Ar seconds
Set the hello interval in seconds.
The default value is 5; valid range is 1\-65535.
.Pp
.It Ic keepalive Ar seconds
Set the keepalive interval in seconds.
The default value is 180; valid range is 1\-65535.
.Pp
.It Xo
.Ic distribution
.Pq Ic independent Ns | Ns Ic ordered
.Xc
Select the distribution mode.
.Ic independent
distributes labels at any time;
.Ic ordered
forces
.Xr ldpd 8
to wait a mapping from nexthop before distributing it to peers.
.Pp
.It Xo
.Ic retention
.Pq Ic liberal Ns | Ns Ic conservative
.Xc
Select the retention mode.
.Ic conservative
retains just the labels advertised from nexthop;
.Ic liberal
mode retains every label received, even those not advertised
from nexthops.
.Pp
.It Xo
.Ic advertisement
.Pq Ic unsolicited Ns | Ns Ic ondemand
.Xc
Select the advertisement mode.
.Ic unsolicited
advertises labels according to the distribution mode;
.Ic ondemand
advertises labels solely upon explicit request from peers.
.El
.Sh INTERFACES
Each interface can have several parameters configured individually, otherwise
they are inherited.
.Bd -literal -offset indent
interface em0 {
}
.Ed
.Pp
Interface-specific parameters are listed below.
.Bl -tag -width Ds
.It Ic passive
Prevent transmission and reception of LDP packets on this interface.
.El
.Sh FILES
.Bl -tag -width "/etc/ldpd.conf" -compact
.It Pa /etc/ldpd.conf
.Xr ldpd 8
configuration file
.El
.Sh SEE ALSO
.Xr ldpctl 8 ,
.Xr ldpd 8 ,
.Xr rc.conf.local 8
.Sh HISTORY
The
.Nm
file format first appeared in
.Ox 4.6 .
