openbsd/src/share/man/man4/man4.arm64/apldcp.4
.\"	$OpenBSD: apldcp.4,v 1.1 2024/01/22 18:56:18 kettenis Exp $
.\"
.\" Copyright (c) 2024 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 22 2024 $
.Dt APLDCP 4 arm64
.Os
.Sh NAME
.Nm apldcp
.Nd Apple display coprocessor
.Sh SYNOPSIS
.Cd "apldcp* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver controls the display coprocessor integrated on Apple SoCs.
.Sh SEE ALSO
.Xr apldrm 4 ,
.Xr drm 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 7.5 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Alyssa Rosenzweig
and
.An Janne Grunau
for Linux and ported to
.Ox
by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
