openbsd/src/share/man/man4/man4.arm64/apldma.4
.\"	$OpenBSD: apldma.4,v 1.1 2022/08/06 09:40:55 kettenis Exp $
.\"
.\" Copyright (c) 2022 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 6 2022 $
.Dt APLDMA 4
.Os
.Sh NAME
.Nm apldma
.Nd Apple DMA controller
.Sh SYNOPSIS
.Cd "apldma* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the DMA controller integrated on various
Apple SoCs.
.Pp
The controller is used to support DMA for the audio interfaces
integrated on the SoC.
.Sh SEE ALSO
.Xr aplmca 4 ,
.Xr intro 4
.Sh HISTORY
.Ox
support for
.Nm
first appeared in
.Ox 7.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
