openbsd/src/share/man/man4/man4.arm64/aplpmu.4
.\"	$OpenBSD: aplpmu.4,v 1.1 2021/05/29 08:37:53 kettenis Exp $
.\"
.\" Copyright (c) 2021 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 29 2021 $
.Dt APLPMU 4 arm64
.Os
.Sh NAME
.Nm aplpmu
.Nd Apple power management unit
.Sh SYNOPSIS
.Cd "aplpmu* at aplspmi?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the real-time clock embedded in the PMU
found on various Apple SoCs.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr aplspmi 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
