openbsd/src/share/man/man4/man4.arm64/pluart.4
.\"	$OpenBSD: pluart.4,v 1.1 2018/04/04 14:21:26 jsg Exp $
.\"
.\" Copyright (c) 2015 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 4 2018 $
.Dt PLUART 4 arm64
.Os
.Sh NAME
.Nm pluart
.Nd ARM PrimeCell PL011 UART
.Sh SYNOPSIS
.Cd "pluart* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver supports the ARM PrimeCell PL011 UART.
.Sh SEE ALSO
.Xr tty 4
.Rs
.%T ARM PrimeCell UART (PL011) Technical Reference Manual
.%V ARM DDI 0183
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.8 .
