openbsd/src/share/man/man4/man4.arm64/qciic.4
.\"	$OpenBSD: qciic.4,v 1.1 2022/09/12 15:49:36 kettenis Exp $
.\"
.\" Copyright (c) 2016 Jonathan Gray <jsg@openbsd.org>
.\" Copyright (c) 2022 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 12 2022 $
.Dt QCIIC 4
.Os
.Sh NAME
.Nm qciic
.Nd Qualcomm Snapdragon GENI I2C controller
.Sh SYNOPSIS
.Cd "qciic* at acpi?"
.Cd "iic* at qciic?"
.Sh DESCRIPTION
The
.Nm
driver supports the GENI I2C controller found on Qualcomm Snapdragon
SoCs for use with the
.Xr iic 4
framework.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr iic 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 7.2 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
