openbsd/src/share/man/man4/man4.sparc64/asio.4
.\"	$OpenBSD: asio.4,v 1.1 2002/03/14 01:45:56 jason Exp $
.\"
.\" Copyright (c) 2002 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Jason L. Wright
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 13, 2002
.Dt ASIO 4 sparc64
.Os
.Sh NAME
.Nm asio
.Nd SBus Aurora sio2 driver
.Sh SYNOPSIS
.Cd "asio* at sbus? slot ? offset ?"
.Cd "com* at asio?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Aurora Technologies
.Tn sio2
serial interface, which is basically a pair of
.Xr com 4
ports with
.Xr sbus 4
glue logic.
.Sh SEE ALSO
.Xr com 4 ,
.Xr sbus 4
.Sh AUTHORS
The driver was written by
.An Jason Wright Aq jason@thought.net .
.Sh HISTORY
.Ox
support for
.Nm
was added in
.Ox 3.1 .
.Sh BUGS
Only revision
.Tn 210sj
is known to work.
Minor work may be necessary for other revisions of this card.
Also, the parallel port is not currently supported.
