openbsd/src/share/man/man4/man4.sparc64/audiocs.4
.\"     $OpenBSD: audiocs.4,v 1.8 2006/09/05 14:09:33 jmc Exp $
.\"
.\" Copyright (c) 2001 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 1, 2001
.Dt AUDIOCS 4 sparc64
.Os
.Sh NAME
.Nm audiocs
.Nd SPARC64 CS4231 audio device
.Sh SYNOPSIS
.Cd "audiocs* at sbus?"
.Cd "audio*  at audiocs?"
.Sh DESCRIPTION
The
.Nm
device uses the
.Tn Crystal Semiconductor
CS4231A
Parallel Interface, Multimedia Audio Codec
chip to implement the audio device interface described in
.Xr audio 4 .
This device is found onboard on some SBus based sparc64 models.
The
.Nm
has a maximum precision of 16 bits and has both stereo and monoaural outputs.
The output ports are: the internal speaker, line, and headphones.
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr audio 4 ,
.Xr audioce 4 ,
.Xr intro 4 ,
.Xr sbus 4
.Sh HISTORY
.Ox
support for
.Nm
first appeared in
.Ox 3.0 .
