openbsd/src/share/man/man4/man4.sparc64/cbus.4
.\"     $OpenBSD: cbus.4,v 1.1 2009/01/04 15:36:12 kettenis Exp $
.\"
.\" Copyright (c) 2009 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 4 2009 $
.Dt CBUS 4 sparc64
.Os
.Sh NAME
.Nm cbus
.Nd channel device bus
.Sh SYNOPSIS
.Cd "cbus* at vbus?"
.Sh DESCRIPTION
The
.Nm
driver provides a virtual bus for channel devices provided by the
UltraSPARC Hypervisor as found on sun4v logical domains.
.Pp
.Ox
provides support for the following devices:
.Pp
.Bl -tag -width "vdisk(4)XX" -offset 3n -compact
.\" .It Xr vdisk 4
.\" virtual disk
.It Xr vnet 4
virtual network interface
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr vbus 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.5 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
