openbsd/src/share/man/man4/man4.sparc64/clkbrd.4
.\"     $OpenBSD: clkbrd.4,v 1.1 2004/09/28 02:50:37 jason Exp $
.\"
.\" Copyright (c) 2004 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 27, 2004
.Dt CLKBRD 4 sparc64
.Os
.Sh NAME
.Nm clkbrd
.Nd SPARC64 Clock Board
.Sh SYNOPSIS
.Cd "clkbrd* at fhc?"
.Sh DESCRIPTION
The
.Nm
device provides support for the
clock board on Sunfire, Starfire, and Wildire
UltraSPARC systems.
This device also controls the main front panel LED.
This LED can be made to blink based on the load average on most systems   
by setting the
.Xr sysctl 3
variable
.Ar machdep.led_blink
to a non-zero value.
.Sh SEE ALSO
.Xr sysctl 3 ,
.Xr fhc 4 ,
.Xr intro 4
.Sh HISTORY
.Ox
support for the
.Nm
first appeared in
.Ox 3.7 .
