openbsd/src/share/man/man4/man4.sparc64/creator.4
.\"	$OpenBSD: creator.4,v 1.8 2002/06/15 19:12:56 jason Exp $
.\"
.\" Copyright (c) 2002 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Jason L. Wright
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 21, 2002
.Dt CREATOR 4 sparc64
.Os
.Sh NAME
.Nm creator
.Nd accelerated color frame buffer
.Sh SYNOPSIS
.Cd "creator* at mainbus0"
.Cd "creator* at upa0"
.Cd "wsdisplay* at creator?"
.Sh DESCRIPTION
The
.Nm
is a memory based color frame buffer driver for the
.Xr wscons 4
console framework and for the Creator, Creator 3D and Elite 3D UPA
framebuffers.
It does not provide direct device driver entry points but makes its functions
available via the internal
.Xr wsdisplay 4
interface.
.Sh SEE ALSO
.Xr upa 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh BUGS
There is no support for the acceleration this hardware provides, so
some operations are quite slow.
