openbsd/src/share/man/man4/man4.sparc64/creator.4
.\"	$OpenBSD: creator.4,v 1.23 2008/03/31 08:12:22 jmc Exp $
.\"
.\" Copyright (c) 2002 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 31 2008 $
.Dt CREATOR 4 sparc64
.Os
.Sh NAME
.Nm creator
.Nd accelerated color frame buffer
.Sh SYNOPSIS
.Cd "creator* at mainbus0 flags 0x0"
.Cd "creator* at upa0 flags 0x0"
.Cd "wsdisplay* at creator?"
.Sh DESCRIPTION
The Creator, Creator 3D and Elite 3D UPA
are color frame buffers, with graphics acceleration, available for most
of the UltraSPARC workstations with UPA or PCI slots.
.Pp
The
.Nm
driver interfaces those frame buffers with the
.Xr wscons 4
console framework.
It does not provide direct device driver entry points but makes its functions
available via the internal
.Xr wsdisplay 4
interface.
.Pp
By default hardware acceleration is used to erase the screen and
scroll text.
By setting
.Ar flags
to
.Ar 1
(via
.Xr config 8
or
.Xr boot_config 8 )
this acceleration can be disabled.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr upa 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4 ,
.Xr boot_config 8 ,
.Xr config 8
