openbsd/src/share/man/man4/man4.sparc64/intro.4
.\"     $OpenBSD: intro.4,v 1.9 2002/01/31 03:10:44 jason Exp $
.\"
.\" Copyright (c) 2001 The OpenBSD Project
.\" All Rights Reserved.
.\"
.Dd October 4, 2001
.Dt INTRO 4 sparc64
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files, 
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the
sparc64
platform.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system will have to be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.
Pseudo-devices are not listed.
Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width zs/zstty/zskbd -compact -offset indent
.It audioce
EBus CS4231 based audio.
.It audiocs
SBus CS4231 based audio.
.It autri
PCI Trident 4DWAVE DX/NX, SiS 7018, ALi M5451 audio.
.It be
10BaseT/100BaseTX SBus Ethernet controller.
.It cgsix
8 bit SBus color graphics frame buffer.
.It cgthree
8 bit SBus color graphics frame buffer.
.It com
EBUS clones of the NS16550 serial UART.
.It comkbd
Sun serial keyboards on
.Xr com 4
ports.
.It dc
Clones of the DEC Tulip ethernet controller.
.It esp
ESP SCSI controller.
.It hifn
Hifn 7751/7811/7951 cryptography acclerators.
.It hme
SBus HME Ethernet controllers (SunSwift).
.It isp
Qlogic ISP SBus SCSI controller.
.It le/lebuffer
AMD 7990 LANCE ethernet controller.
.It magma
MAGMA serial/parallel communication boards.
.It openprom
Sun Open boot PROM (what became IEEE 1275) configuration driver.
.It pcons
PROM console input/output device.
.It qe
Quad 10BaseT SBus Ethernet controller.
.It qec
Supported as carrier for
.Nm be
or
.Nm qe
Ethernet controllers.
.It sab
Infineon (formerly Siemens) SAB82532 serial controller.
.It spif
Sun SUNW,spif serial/parallel communication boards.
.It ubsec
Bluesteelnet 5501/5601, Broadcom 5805/5820/5821 crytography accelerators.
.It uperf
Performance counters on SBUS/PCI machines.
.It zs/zstty/zskbd
Zilog 8530 serial controller (and serial keyboards).
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HISTORY
The
sparc64
.Nm intro
first appeared in
.Ox 3.0 .
