openbsd/src/share/man/man4/man4.sparc64/intro.4
.\"     $OpenBSD: intro.4,v 1.16 2002/05/22 03:29:42 jason Exp $
.\"
.\" Copyright (c) 2001-2002 The OpenBSD Project
.\" All Rights Reserved.
.\"
.Dd October 4, 2001
.Dt INTRO 4 sparc64
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files, 
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the
sparc64
platform.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system will have to be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.
Pseudo-devices are not listed.
Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width zs/zstty/zskbd(4) -compact -offset indent
.It Xr apio 4
Aurora SBus pio1 parallel ports.
.It Xr asio 4
Aurora SBus sio2 serial ports.
.It Xr audioce 4
EBus CS4231 based audio.
.It Xr audiocs 4
SBus CS4231 based audio.
.It Xr autri 4
PCI Trident 4DWAVE DX/NX, SiS 7018, ALi M5451 audio.
.It Xr creator 4
UPA Creator/Creator 3D color graphics frame buffer.
.It Xr eap 4
Ensoniq AudioPCI based audio.
.It Xr be 4
10BaseT/100BaseTX SBus Ethernet controller.
.It Xr beeper 4
simple speaker beeper
.It Xr cgsix 4
8 bit SBus color graphics frame buffer.
.It Xr cgthree 4
8 bit SBus color graphics frame buffer.
.It Xr com 4
EBUS clones of the NS16550 serial UART.
.It Xr comkbd 4
Sun serial keyboards on
.Xr com 4
ports.
.It Xr dc 4
Clones of the DEC Tulip ethernet controller.
.It Xr esp 4
ESP SCSI controller.
.It Xr hifn 4
Hifn 7751/7811/7951 cryptography acclerators.
.It Xr hme 4
SBus HME Ethernet controllers (SunSwift).
.It Xr isp 4
Qlogic ISP SBus SCSI controller.
.It Xr le/lebuffer 4
AMD 7990 LANCE ethernet controller.
.It Xr magma 4
MAGMA serial/parallel communication boards.
.It Xr openprom 4
Sun Open boot PROM (what became IEEE 1275) configuration driver.
.It Xr pcons 4
PROM console input/output device.
.It Xr qe 4
Quad 10BaseT SBus Ethernet controller.
.It Xr qec 4
Supported as carrier for
.Nm be
or
.Nm qe
Ethernet controllers.
.It Xr sab 4
Infineon (formerly Siemens) SAB82532 serial controller.
.It Xr spif 4
Sun SUNW,spif serial/parallel communication boards.
.It Xr ubsec 4
Bluesteelnet 5501/5601, Broadcom 5805/5820/5821 crytography accelerators.
.It Xr uperf 4
Performance counters on SBUS/PCI machines.
.It Xr vgafb 4
PCI graphics frame buffer.
.It Xr zs/zstty/zskbd 4
Zilog 8530 serial controller (and serial keyboards).
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HISTORY
The
sparc64
.Nm intro
first appeared in
.Ox 3.0 .
