openbsd/src/share/man/man4/man4.sparc64/led.4
.\"     $OpenBSD: led.4,v 1.2 2007/05/31 19:19:57 jmc Exp $
.\"
.\" Copyright (c) 2007 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt LED 4 sparc64
.Os
.Sh NAME
.Nm led
.Nd SPARC64 LED driver
.Sh SYNOPSIS
.Cd "led* at ebus?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the front panel alert LED.
This LED can be made to blink based on the load average on most systems
by setting the
.Xr sysctl 3
variable
.Ar machdep.led_blink
to a non-zero value.
.Sh SEE ALSO
.Xr sysctl 3 ,
.Xr ebus 4 ,
.Xr intro 4 ,
.Xr sysctl 8
.Sh HISTORY
.Ox
support for the
.Nm
first appeared in
.Ox 4.2 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
