openbsd/src/share/man/man4/man4.sparc64/pcons.4
.\"	$OpenBSD: pcons.4,v 1.4 2003/06/02 16:16:26 miod Exp $
.\"
.\" Copyright (c) 2001 Miodrag Vallat.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistribution of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd October 8, 2001
.Dt PCONS 4 sparc64
.Os
.Sh NAME
.Nm pcons
.Nd SPARC64 PROM console interface
.Sh SYNOPSIS
.Cd "pcons0 at mainbus0"
.Sh DESCRIPTION
The
.Nm
device provides a simple text console, using the PROM services for
input and output.
It will use the PROM console devices set via the
.Dq input-device
and
.Dq output-device
variables.
.Pp
This driver is deprecated and only provided as a fallback console mechanism
if the real console hardware can not be driven in
.Ox .
.Sh FILES
.Bl -tag -width /dev/console
.It Pa /dev/console
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr tty 4
.Sh HISTORY
.Ox
support for the PROM console
first appeared in
.Ox 3.0 .
.Sh CAVEATS
Since the PROM will handle break (or Stop-A) sequences before
.Nm pcons ,
the preferred way to enter
.Xr ddb 4
on a ddb-enabled pcons console is to enter the following sequence :
.Sq +++++
