openbsd/src/share/man/man4/man4.sparc64/power.4
.\"     $OpenBSD: power.4,v 1.4 2007/05/31 19:19:57 jmc Exp $
.\"
.\" Copyright (c) 2006 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt POWER 4 sparc64
.Os
.Sh NAME
.Nm power
.Nd power button
.Sh SYNOPSIS
.Cd "power* at ebus?"
.Sh DESCRIPTION
Some UltraSPARC host bridges provide an interrupt when the power button
is depressed.
The
.Nm
driver catches that interrupt.
If the
.Va machdep.kbdreset
.Xr sysctl 8
is set to 1,
.Nm power
will signal
.Xr init 8
to do a clean shutdown.
.Sh SEE ALSO
.Xr ebus 4 ,
.Xr intro 4 ,
.Xr init 8 ,
.Xr rc.shutdown 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver was first supported in
.Ox 4.0 .
.Sh AUTHORS
The driver was written by
.An Jason Wright Aq jason@thought.net .
