openbsd/src/share/man/man4/man4.sparc64/qec.4
.\"     $OpenBSD: qec.4,v 1.9 2006/10/28 10:26:26 jmc Exp $
.\"
.\" Copyright (c) 1998 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 5, 2001
.Dt QEC 4 sparc64
.Os
.Sh NAME
.Nm qec
.Nd SPARC64 Quad Ethernet Controller
.Sh SYNOPSIS
.Cd "qec* at sbus?"
.Cd "be* at qec?"
.Cd "qe* at qec?"
.Sh DESCRIPTION
The
.Nm
driver is an SBus controller that can contain either one
.Xr be 4
Ethernet controller (Sun part number SUNW,501-2655)
or four
.Xr qe 4
Ethernet controllers (Sun part number SUNW,501-2062).
This driver, like other buses, is not directly available to users.
In essence it is a buffering DMA controller.
.Sh SEE ALSO
.Xr be 4 ,
.Xr intro 4 ,
.Xr qe 4 ,
.Xr sbus 4
.Sh HISTORY
.Ox
support for the
.Nm
first appeared in
.Ox 3.0 .
