openbsd/src/share/man/man4/man4.sparc64/sbbc.4
.\"     $OpenBSD: sbbc.4,v 1.1 2008/07/06 07:28:32 kettenis Exp $
.\"
.\" Copyright (c) 2008 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 6 2008 $
.Dt SBBC 4 sparc64
.Os
.Sh NAME
.Nm sbbc
.Nd PCI BootBus Controller
.Sh SYNOPSIS
.Cd "sbbc* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PCI BootBus Controllers found on
Serengeti and Starcat systems.
It provides access to the system controller in these systems,
providing time of day and console services.
.Pp
.Sh SEE ALSO
.Xr intro 4 ,
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
.Sh BUGS
Console support isn't there yet.
