openbsd/src/share/man/man4/man4.sparc64/vdsk.4
.\"     $OpenBSD: vdsk.4,v 1.1 2009/01/12 20:43:44 kettenis Exp $
.\"
.\" Copyright (c) 2009 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 12 2009 $
.Dt VDSK 4 sparc64
.Os
.Sh NAME
.Nm vdsk
.Nd virtual disk
.Sh SYNOPSIS
.Cd "vdsk* at cbus?"
.Cd "scsibus* at vdsk?"
.Sh DESCRIPTION
The
.Nm
driver provides a virtual disk using the services provided by the
UltraSPARC Hypervisor as found on sun4v systems.
It connects to a virtual disk server (vds) device in another logical
domain using a logical domain channel provided by the hypervisor.
.Pp
The
.Nm
driver supports version 1.0 of the vDisk protocol.
.Sh SEE ALSO
.Xr cbus 4 ,
.Xr intro 4 ,
.Xr scsi 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.5 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
