openbsd/src/share/man/man4/man4.sparc64/zx.4
.\"	$OpenBSD: zx.4,v 1.12 2008/03/31 08:12:22 jmc Exp $
.\" Copyright (c) 2003 Miodrag Vallat.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 31 2008 $
.Dt ZX 4 sparc64
.Os
.Sh NAME
.Nm zx
.Nd accelerated 24-bit color frame buffer
.Sh SYNOPSIS
.Cd "zx* at sbus?"
.Cd "wsdisplay* at zx?"
.Sh DESCRIPTION
The ZX and TurboZX
are dual-slot SBus color frame buffers, with graphics acceleration
and overlay capabilities.
They are also known as the
.Tn Sun
.Dq Leo
graphics card.
.Pp
The
.Nm
driver interfaces the frame buffer with the
.Xr wscons 4
console framework.
It does not provide direct device driver entry points
but makes its functions available via the internal
.Xr wsdisplay 4
interface.
.Sh DISPLAY RESOLUTION
The following resolutions are supported by the ZX frame buffer:
.Bl -column "Resolution" "Refresh Rate"
.It Li Resolution Ta "Refresh Rate"
.It " "
.It Li 1280x1024 Ta 76 Hz Ta Non-interlaced
.It Li 1280x1024 Ta 67 Hz Ta Non-interlaced
.It Li 1152x900 Ta 76 Hz Ta Non-interlaced
.It Li 1152x900 Ta 66 Hz Ta Non-interlaced
.It Li 1024x768 Ta 76 Hz Ta Non-interlaced
.It Li 1024x768 Ta 60 Hz Ta Non-interlaced
.\" Is it worth documenting the Stereo and TV modes?
.It Li 960x680 Ta 112 Hz Ta "Stereo, non-interlaced"
.It Li "" Ta "" Ta "56 Hz field rate per eye"
.It Li 960x680 Ta 108 Hz Ta "Stereo, non-interlaced"
.It Li "" Ta "" Ta "54 Hz field rate per eye"
.It Li 770x575 Ta 50 Hz Ta "Interlaced - PAL"
.It Li 640x480 Ta 59.94 Hz Ta "Interlaced - NTSC"
.El
.Pp
If the ZX frame buffer is connected to a monitor at boot time, it will
select its display resolution depending of the monitor
.Sq select code
provided by the 13W3 connector.
If the frame buffer is not connected to a monitor, the default resolution
of 1152x900, with a 66 Hz refresh rate, will be selected.
The selected resolutions are:
.Bl -column "sense code" "Resolution" "Refresh" "Monitor"
.It Li Monitor Ta Resolution Ta Refresh Ta Monitor
.It Li "sense code" Ta "" Ta Rate Ta Type
.It " "
.It Li 0 Ta 1024x768  Ta "76 Hz" Ta X449A
.It Li 1 Ta 1152x900  Ta "66 Hz"
.It Li 2 Ta 1280x1024 Ta "76 Hz" Ta X248A, GDM-205S
.It Li 3 Ta 1152x900  Ta "66 Hz" Ta GDM-1955A15, GDM-1604A15, CPD-1790
.It Li 4 Ta 1280x1024 Ta "67 Hz" Ta GDM-20D10, GDM-1962
.It Li 5 Ta 1152x900  Ta "66 Hz"
.It Li 6 Ta 1152x900  Ta "76 Hz" Ta GDM-1662B, 17SMM4
.It Li 7 Ta 1152x900  Ta "66 Hz"
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sbus 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh CAVEATS
There is currently no software interface to change the frame buffer
resolution at runtime.
