openbsd/src/kerberosIV/src/appl/movemail/movemail.8
.\" $KTH: movemail.8,v 1.2 2001/01/11 16:16:27 assar Exp $
.\"
.Dd November 14, 1996
.Dt MOVEMAIL 1
.Os KTH-KRB
.Sh NAME
.Nm movemail
.Nd
Fetch mail from a spool file or using the
KPOP
protocol
.Sh SYNPOSYS
.Nm
.Ar inbox
.Ar destfile
.Sh DESCRIPTION
The
.Nm
program fetches mail from
.Ar inbox ,
which can be a file name or
po:username
meaning fetch the mails with
KPOP from the host
.Ev MAILHOST .
.Pp
This program is intended to be called from mail user agents that are
themselves not able to fetch the mail.  The primary example of this is
Emacs.
.Sh ENVIRONMENT
.Bl -tag -width MAILHOST
.It Ev MAILHOST
The host from which to fetch the mail.
.El
.Sh SEE ALSO
.Xr popper 8
.Sh HISTORY
movemail comes from Emacs 19.30
