openbsd/src/sys/stand/mkuboot/mkuboot.8
.\"     $OpenBSD: mkuboot.8,v 1.1 2010/02/12 17:30:41 mk Exp $
.\"
.\" Copyright (c) 2008 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 12 2010 $
.Dt MKUBOOT 8
.Os
.Sh NAME
.Nm mkuboot
.Nd create U-Boot files
.Sh SYNOPSIS
.Nm
.Op Fl a Ar arch
.Op Fl e Ar entry
.Op Fl l Ar loadaddr
.Op Fl o Ar os
.Ar infile outfile
.Sh DESCRIPTION
The
.Nm
utility creates images suitable for loading using the U-Boot bootloader.
.Pp
The options are as follows:
.Bl -tag -width xxxxxxxxxxx
.It Fl a Ar arch
Sets the image architecture to
.Ar arch .
For a list of valid arguments, see below.
.It Fl e Ar entry
Sets the entry point to
.Ar entry .
.It Fl l Ar loadaddr
Sets the load address to
.Ar loadaddr .
.It Fl a Ar os
Sets the image OS to
.Ar os .
.Ar os
can be either
.Dq Linux
or
.Dq OpenBSD .
.El
.Pp
The following arguments are valid as the
.Ar arch
parameter:
.Bd -unfilled -offset indent -compact
alpha
amd64
arm
i386
m68k
mips
mips64
powerpc
sparc
sparc64
superh
.Ed
.Sh HISTORY
An
.Nm
utility first appeared in
.Ox 4.4
as
.Nm mkboot .
