openbsd/src/share/man/man8/man8.sun3/MAKEDEV.8
.\"	$OpenBSD: MAKEDEV.8,v 1.10 2002/10/02 17:40:22 miod Exp $
.\"	$NetBSD: MAKEDEV.8,v 1.1 1995/09/06 21:31:34 jtc Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)MAKEDEV.8	8.1 (Berkeley) 6/5/93
.\"
.Dd June 5, 1993
.Dt MAKEDEV 8 sun3
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Op Ar ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the
.Pa /dev
directory, is used to create
the common special
files.
See
.Xr intro 4
for a more complete discussion of special files.
.Pp
.Nm MAKEDEV
takes any number of device names as arguments, where the names are
the common abbreviation for the device.
There are three special device names,
.Ar all ,
.Ar std
and
.Ar local .
If
given,
.Ar all
creates device files for all devices on the sun3.
If units are expected for a device,
.Nm MAKEDEV
will supply the standard numbers.
The
.Ar std
argument creates only the standard devices for the sun3.
Finally
.Ar local
is for devices specific to the local site, and executes the shell file
.Pa MAKEDEV.local .
.Pp
The sun3 supports the following devices.
Where a device name is followed by a hash sign ("#"), the hash sign
must be replaced by a unit number.
.Pp
.Sy Pseudo\-names
.Bl -tag -width cgfour# indent -compact
.It Ar all
All known devices for the sun3.
.It Ar std
The standard devices (console, drum, fd/*, klog, kmem, mem, null, stderr,
stdin, stdout, tty, zero)
.It Ar local
Configuration specific devices
.El
.Pp
.Sy Device\-names
.Bl -tag -width cgfour# indent -compact
.It Ar bpf#
Berkeley packet filters
.It Ar bwtwo#
Black and white frame buffers
.It Ar cd#
SCSI CD-ROM drives
.It Ar cgtwo#
Colour frame buffers
.It Ar cgfour#
Colour P4 frame buffers
.It Ar kbd
The keyboard
.It Ar lkm
Loadable kernel modules
.It Ar mouse#
Mouse ports
.It Ar pty#
Set of 16 master and slave pseudo terminals
.It Ar sd#
SCSI disk drives
.It Ar st#
SCSI tape drives
.It Ar tty#
Onboard Serial ports
.It Ar vnd#
.Dq file
pseudo-disks
.El
.Sh FILES
.Bl -tag -width /dev -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
