openbsd/src/sbin/routed/rtquery/rtquery.8
.\"	$OpenBSD: rtquery.8,v 1.19 2007/05/31 19:19:47 jmc Exp $
.\"
.\" Copyright (c) 1982, 1986, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt RTQUERY 8
.Os
.Sh NAME
.Nm rtquery
.Nd query routing daemons for their routing tables
.Sh SYNOPSIS
.Nm rtquery
.Op Fl 1np
.Op Fl r Ar addr
.Op Fl t Ar op
.Op Fl w Ar timeout
.Ar host ...
.Sh DESCRIPTION
.Nm
is used to query a RIPv1/2 network routing daemon
for its routing table by sending a
.Em request
command.
The routing information in any routing
.Em response
packets returned is displayed numerically and symbolically.
.Nm
is also used to turn tracing on or off.
.Pp
See
.Xr routed 8
for more information about a RIPv1/2 capable routing daemon.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl 1
Query using RIP version 1 instead of RIP version 2.
.It Fl n
Normally network and host numbers are displayed both symbolically
and numerically.
The
.Fl n
option displays only the numeric network and host numbers.
.It Fl p
Uses the
.Em poll
command to request full routing information,
instead of the default
.Em request
command.
.It Fl r Ar addr
Ask about the route to destination
.Ar addr .
.It Fl t Ar op
Change tracing, where
.Ar op
is one of the following.
Requests from processes not running with UID 0 or on distant networks
are generally ignored by the daemon except for a message in the system log.
.Bl -tag -width Ds -offset indent
.It Ic dump
Dumps the daemon's routing table to the current tracefile.
.It Ic more
Increases the debugging level.
.It Ic off
Turns off tracing.
.It Ic on Ns = Ns Ar tracefile
Turn tracing on into the specified file.
That file must usually
have been specified when the daemon was started or be the same
as a fixed name, often
.Pa /etc/routed.trace .
.El
.It Fl w Ar timeout
Changes the delay for an answer from each host.
By default, each host is given 15 seconds to respond.
.El
.Sh SEE ALSO
.Xr routed 8
.Rs
.%R RFC 1058
.%T Routing Information Protocol, RIPv1
.%D June 1988
.Re
.Rs
.%R RFC 1723
.%T Routing Information Protocol, RIPv2
.%D November 1994
.Re
