openbsd/src/sbin/routed/rtquery/rtquery.8
.\"	$OpenBSD: rtquery.8,v 1.12 2000/03/23 21:10:21 aaron Exp $
.\"
.Dd June 1, 1996
.Dt RTQUERY 8
.Os
.Sh NAME
.Nm rtquery
.Nd query routing daemons for their routing tables
.Sh SYNOPSIS
.Nm rtquery
.Op Fl np1
.Op Fl w Ar timeout
.Op Fl r Ar addr
.Ar host ...
.Sh DESCRIPTION
.Nm
is used to query a network routing daemon,
.Xr routed 8
or
.Xr gated 8 ,
for its routing table by sending a
.Cm request
or
.Cm poll
command.
The routing information in any routing
.Dq response
packets returned is displayed numerically and symbolically.
.Pp
.Nm
by default uses the
.Cm request
command.
When the
.Fl p
option is specified,
.Nm
uses the
.Cm poll
command, an
undocumented extension to the RIP protocol supported by
.Xr gated 8 .
When querying gated, the
.Cm poll
command is preferred over the
.Cm request
command because the response is not subject to Split Horizon and/or
Poisoned Reverse, and because some versions of gated do not answer
the Request command.
Routed does not answer the Poll command, but
recognizes Requests coming from
.Nm
and so answers completely.
.Pp
.Nm
is also used to turn tracing on or off in
.Xr routed 8 .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl n
Normally network and host numbers are displayed both symbolically
and numerically.
The
.Fl n
option displays only the numeric network and host numbers.
.It Fl p
Uses the
.Cm poll
command to request full routing information from
.Xr gated 8 .
This is an undocumented extension RIP protocol supported only by
.Xr gated 8 .
.It Fl 1
Query using RIP version 1 instead of RIP version 2.
.It Fl w Ar timeout
Changes the delay for an answer from each host.
By default, each host is given 15 seconds to respond.
.It Fl r Ar addr
Ask about the route to destination
.Ar addr .
.It Fl t Ar op
Change tracing, where
.Ar op
is one of the following.
Requests from processes not running with UID 0 or on distant networks
are generally ignored by the daemon except for a message in the system log.
.El
.Bl -tag -width Ds -offset indent-two
.It Em on=tracefile
Turn tracing on into the specified file.
That file must usually
have been specified when the daemon was started or be the same
as a fixed name, often
.Pa /etc/routed.trace .
.It Em more
Increases the debugging level.
.It Em off
Turns off tracing.
.It Em dump
Dumps the daemon's routing table to the current tracefile.
.El
.Sh SEE ALSO
.Xr gated 8 ,
.Xr routed 8
.Pp
.Dl RFC\ 1058 - Routing Information Protocol, RIPv1
.Dl RFC\ 1723 - Routing Information Protocol, RIPv2
