openbsd/src/sbin/routed/rtquery/rtquery.8
.\"	$OpenBSD: rtquery.8,v 1.14 2003/02/18 07:43:35 jmc Exp $
.\"
.\" Copyright (c) 1982, 1986, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" 
.Dd June 1, 1996
.Dt RTQUERY 8
.Os
.Sh NAME
.Nm rtquery
.Nd query routing daemons for their routing tables
.Sh SYNOPSIS
.Nm rtquery
.Op Fl np1
.Op Fl w Ar timeout
.Op Fl r Ar addr
.Ar host ...
.Sh DESCRIPTION
.Nm
is used to query a network routing daemon,
.Xr routed 8
or
.Xr gated 8 ,
for its routing table by sending a
.Cm request
or
.Cm poll
command.
The routing information in any routing
.Dq response
packets returned is displayed numerically and symbolically.
.Pp
.Nm
by default uses the
.Cm request
command.
When the
.Fl p
option is specified,
.Nm
uses the
.Cm poll
command, an
undocumented extension to the RIP protocol supported by
.Xr gated 8 .
When querying gated, the
.Cm poll
command is preferred over the
.Cm request
command because the response is not subject to Split Horizon and/or
Poisoned Reverse, and because some versions of gated do not answer
the Request command.
Routed does not answer the Poll command, but
recognizes Requests coming from
.Nm
and so answers completely.
.Pp
.Nm
is also used to turn tracing on or off in
.Xr routed 8 .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl n
Normally network and host numbers are displayed both symbolically
and numerically.
The
.Fl n
option displays only the numeric network and host numbers.
.It Fl p
Uses the
.Cm poll
command to request full routing information from
.Xr gated 8 .
This is an undocumented extension RIP protocol supported only by
.Xr gated 8 .
.It Fl 1
Query using RIP version 1 instead of RIP version 2.
.It Fl w Ar timeout
Changes the delay for an answer from each host.
By default, each host is given 15 seconds to respond.
.It Fl r Ar addr
Ask about the route to destination
.Ar addr .
.It Fl t Ar op
Change tracing, where
.Ar op
is one of the following.
Requests from processes not running with UID 0 or on distant networks
are generally ignored by the daemon except for a message in the system log.
.El
.Bl -tag -width Ds -offset indent-two
.It Em on=tracefile
Turn tracing on into the specified file.
That file must usually
have been specified when the daemon was started or be the same
as a fixed name, often
.Pa /etc/routed.trace .
.It Em more
Increases the debugging level.
.It Em off
Turns off tracing.
.It Em dump
Dumps the daemon's routing table to the current tracefile.
.El
.Sh SEE ALSO
.Xr routed 8
.Pp
.Dl RFC\ 1058 - Routing Information Protocol, RIPv1
.Dl RFC\ 1723 - Routing Information Protocol, RIPv2
