openbsd/src/usr.bin/skey/skeyprune.8
.\" $OpenBSD: skeyprune.8,v 1.3 1998/09/27 16:57:53 aaron Exp $
.\"
.\"
.Dd 27 Sep 1996
.Dt SKEYPRUNE 8
.Os
.Sh NAME
.Nm skeyprune
.Nd prune commented out and old entries from keys file
.Sh SYNOPSIS
.Nm skeyprune
.Op Ar days
.Sh DESCRIPTION
.Nm skeyprune
searches through the file
.Dq Pa /etc/skeykeys
and prunes out users who have zeroed their entries via
.Xr skeyinit 1
as well as entries that have not been modified in
.Ar days
days.  If
.Ar days
is not specified only commented out entries are pruned.
.Sh FILES
.Bl -tag -width /etc/skeykeys -compact
.It Pa /etc/skeykeys
S/Key key information database
.El
.Sh SEE ALSO
.Xr skey 1 ,
.Xr skeyinit 1
.Sh BUGS
Since
.Nm skeyprune
rewrites
.Dq Pa /etc/skeykeys ,
there is a window where S/Key changes could get lost.
It is therefore suggested that
.Nm skeyprune
be run at a time when users are unlikely to be active.
