openbsd/src/share/man/man4/man4.mac68k/adb.4
.\"
.\" Copyright (c) 1997 Colin Wood
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Colin Wood
.\"      for the NetBSD Project.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$OpenBSD: adb.4,v 1.12 2007/05/31 19:19:55 jmc Exp $
.\"	$NetBSD: adb.4,v 1.1 1997/07/18 02:13:42 ender Exp $
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt ADB 4 mac68k
.Os
.Sh NAME
.Nm adb
.Nd Apple Desktop Bus driver
.Sh SYNOPSIS
.Cd "adb0 at obio?"
.Cd "akbd* at adb?"
.Cd "ams* at adb?"
.Sh DESCRIPTION
The Apple Desktop Bus
.Pq Tn ADB
is the single-master, multiple-slave, low-speed serial bus
interface used by Macintosh computers to connect input devices
such as keyboards, mice, trackballs, and graphics tablets
to the machine.
.Pp
.Ox
provides support for the following devices:
.Pp
.Bl -tag -width 12n -offset indent -compact
.It Xr akbd 4
Apple Keyboard Device
.It Xr ams 4
Apple Mouse Support
.El
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The
.Nm
interface first appeared in
.Nx 0.9 .
.Sh AUTHORS
Bradley A. Grantham wrote the original
.Nm
driver, including the
.Tn MRG
support.
The hardware direct interface was written by
John P. Wittkowski.
The PowerManager interface was written by Takashi Hamada.
.Sh BUGS
.Bl -bullet -compact
.It
Not every class of
.Tn ADB
hardware is supported yet.
.It
The talk command is currently unimplemented.
.It
The listen command is not implemented yet.
.El
