openbsd/src/share/man/man4/man4.mac68k/esp.4
.\"	$OpenBSD: esp.4,v 1.3 2007/05/31 19:19:55 jmc Exp $
.\"
.\" Copyright (c) 2004 Martin Reindl <martin@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt ESP 4 mac68k
.Os
.Sh NAME
.Nm esp
.Nd ESP NCR 53c96 on-board SCSI interface
.Sh SYNOPSIS
.Cd "esp0 at obio?"
.Cd "esp1 at obio?"
.Sh DESCRIPTION
The
.Nm
is an on-board SCSI controller based on the NCR 53c96 chip, found
on Apple Quadra/Centris machines.
.Pp
Tape devices should be allowed to disconnect for the SCSI bus to operate
acceptably.
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr obio 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr st 4 ,
.Xr uk 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.3 .
.Sh BUGS
The pseudo-DMA mode only works on non-AV Quadra/Centris machines at this time.
