openbsd/src/share/man/man4/man4.mac68k/macfb.4
.\"	$OpenBSD: macfb.4,v 1.1 2006/01/10 07:37:31 miod Exp $
.\"
.\" Copyright (c) 2006, Miodrag Vallat
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 10, 2006
.Dt MACFB 4 mac68k
.Os
.Sh NAME
.Nm macfb
.Nd Macintosh frame buffers
.Sh SYNOPSIS
.Cd "macfb* at obio?"
.Cd "macfb* at nubus?"
.Sh DESCRIPTION
The
.Nm
driver handles on-board and
.Tn Nubus
video frame buffers within the
.Xr wscons 4
console framework.
.Pp
All possible video modes are supported, but it is not possible to change
resolution or color depth on the fly under
.Ox .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr nubus 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
