openbsd/src/share/man/man4/man4.mac68k/obio.4
.\"
.\" Copyright (c) 1997 Colin Wood
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Colin Wood
.\"      for the NetBSD Project.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$OpenBSD: obio.4,v 1.15 2006/09/14 18:49:42 jmc Exp $
.\"	$NetBSD: obio.4,v 1.1 1997/07/18 02:13:40 ender Exp $
.\"
.Dd July 2, 1997
.Dt OBIO 4 mac68k
.Os
.Sh NAME
.Nm obio
.Nd Mac68k onboard I/O bus device
.Sh SYNOPSIS
.Cd "obio0 at mainbus?"
.Sh DESCRIPTION
The
.Nm
interface serves as an abstraction used by the autoconfiguration
system to help find and attach devices
.Pq e.g. the Ethernet or Tn SCSI controllers
connected to the
.Tn Macintosh
onboard I/O bus.
.Pp
.Ox
provides support for the following devices:
.Pp
.Bl -tag -width 12n -offset indent -compact
.It Xr asc 4
Apple Sound Chip on-board audio device
.It Xr esp 4
ESP NCR 53c96 on-board SCSI controller
.It Xr macfb 4
Macintosh frame buffers
.It Xr mc 4
Am79C940 (MACE) on-board Ethernet device
.It Xr ncrscsi 4
NCR 5380 on-board SCSI controller
.It Xr sbc 4
NCR 5380 on-board SCSI controller
.It Xr sn 4
SONIC-based Ethernet device
.It Xr zsc 4
Zilog 8530 (ZSCC) serial communications driver
.El
.Sh SEE ALSO
.Xr adb 4 ,
.Xr intro 4 ,
.Xr mainbus 4
.Sh HISTORY
The
.Nm
first appeared in
.Ox 2.0 .
