openbsd/src/usr.bin/vmstat/vmstat.8
.\"	$OpenBSD: vmstat.8,v 1.26 2003/02/17 07:24:32 jmc Exp $
.\"	$NetBSD: vmstat.8,v 1.12 1996/05/10 23:19:30 thorpej Exp $
.\"
.\" Copyright (c) 1986, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)vmstat.8	8.1 (Berkeley) 6/6/93
.\"
.Dd June 6, 1993
.Dt VMSTAT 8
.Os
.Sh NAME
.Nm vmstat
.Nd report statistics about kernel activities
.Sh SYNOPSIS
.Nm vmstat
.Op Fl fimstv
.Nm vmstat
.Op Fl c Ar count
.Op Fl M Ar core
.Op Fl N Ar system
.Op Fl w Ar wait
.Op Ar disks
.Sh DESCRIPTION
.Nm
reports certain kernel statistics kept about process, virtual memory,
disk, trap and CPU activity.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl c Ar count
Repeat the display
.Ar count
times.
The first display is for the time since a reboot and each subsequent report
is for the time period since the last display.
If no
.Ar wait
interval is specified, the default is 1 second.
.It Fl f
Report on the number of
.Xr fork 2 ,
.Xr rfork 2
and
.Xr vfork 2
system calls as well as kernel thread creations since system startup,
and the number of pages of virtual memory involved in each.
.It Fl i
Report on the number of interrupts taken by each device since system
startup.
.It Fl M Ar core
Extract values associated with the name list from the specified core
instead of the running kernel.
.It Fl N Ar system
Extract the name list from the specified system instead of the running kernel.
.It Fl m
Report on the usage of kernel dynamic memory listed first by size of
allocation and then by type of usage.
.It Fl s
Display the contents of the
.Ar sum
structure, giving the total number of several kinds of paging related
events which have occurred since system startup.
.It Fl t
Report on the number of page in and page reclaims since system startup,
and the amount of time required by each.
.It Fl w Ar wait
Pause
.Ar wait
seconds between each display.
If no repeat
.Ar count
is specified, the default is infinity.
.It Fl v
Print more verbose information.
.El
.Pp
By default,
.Nm
displays the following information just once:
.Bl -tag -width "whatever"
.It Ar procs
Information about the numbers of processes in various states.
.Pp
.Bl -inset -width xxxxxx -compact
.It Ar r
in run queue
.It Ar b
blocked for resources (i/o, paging, etc.)
.It Ar w
runnable or short sleeper (< 20 secs) but swapped
.El
.Pp
.It Ar memory
Information about the usage of virtual and real memory.
Virtual pages
(reported in units of 1024 bytes) are considered active if they belong
to processes which are running or have run in the last 20 seconds.
.Pp
.Bl -inset -width xxxxxx -compact
.It Ar avm
active virtual pages
.It Ar fre
size of the free list
.El
.Pp
.It Ar page
Information about page faults and paging activity.
These are averaged each five seconds, and given in units per second.
.Pp
.Bl -inset -width xxxxxx -compact
.It Ar re
page reclaims (simulating reference bits)
.It Ar at
pages attached (found in free list)
.It Ar pi
pages paged in
.It Ar po
pages paged out
.It Ar fr
pages freed per second
.It Ar sr
pages scanned by clock algorithm, per-second
.El
.Pp
.It Ar disks
Disk transfers per second.
Typically paging will be split across the available drives.
The header of the field is the first character of the disk name and
the unit number.
If more than four disk drives are configured in the system,
.Nm
displays only the first four drives.
To force
.Nm
to display specific drives, their names may be supplied on the command line.
.Pp
.It Ar faults
Trap/interrupt rate averages per second over last 5 seconds.
.Pp
.Bl -inset -width xxxxxx -compact
.It Ar in
device interrupts per interval (including clock interrupts)
.It Ar sy
system calls per interval
.It Ar cs
CPU context switch rate (switches/interval)
.El
.Pp
.It Ar cpu
Breakdown of percentage usage of CPU time.
.Pp
.Bl -inset -width xxxxxx -compact
.It Ar us
user time for normal and low priority processes
.It Ar sy
system time
.It Ar id
CPU idle
.El
.El
.Sh EXAMPLES
The command
.Ic vmstat -w 5
will print what the system is doing every five
seconds; this is a good choice of printing interval since this is how often
some of the statistics are sampled in the system.
Others vary every second and running the output for a while will make it
apparent which are recomputed every second.
.Sh SEE ALSO
.Xr fstat 1 ,
.Xr netstat 1 ,
.Xr nfsstat 1 ,
.Xr ps 1 ,
.Xr systat 1 ,
.Xr iostat 8 ,
.Xr pstat 8
.Pp
The sections starting with
.Dq Interpreting system activity
in
.%T "Installing and Operating 4.3BSD" .
.Sh BUGS
The
.Fl c
and
.Fl w
options are only available with the default output.
.Pp
This manual page lacks an incredible amount of detail.
