openbsd/src/usr.bin/readlink/readlink.1
.\"	$OpenBSD: readlink.1,v 1.14 2021/10/13 15:04:53 kn Exp $
.\"
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Institute of Electrical and Electronics Engineers, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: October 13 2021 $
.Dt READLINK 1
.Os
.Sh NAME
.Nm readlink
.Nd display target of symbolic link on standard output
.Sh SYNOPSIS
.Nm readlink
.Op Fl fn
.Ar file
.Sh DESCRIPTION
The
.Nm
utility when invoked with the pathname of a symbolic link as its
argument dereferences the symbolic link and prints the name of target
on standard output.
If the
.Fl f
option is not specified and
.Nm
is invoked with an argument other
than the pathname of a symbolic link, it exits with a nonzero exit
code without printing anything.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl f
Canonicalize by following every symlink in every component of the given
path recursively.
.Nm
will resolve both absolute and relative paths and
return the absolute pathname corresponding to
.Ar file .
The argument does not need to be a symbolic link.
.It Fl n
Do not print a trailing newline character.
.El
.Sh EXIT STATUS
.Ex -std readlink
.Sh SEE ALSO
.Xr realpath 1 ,
.Xr readlink 2 ,
.Xr realpath 3
.Sh HISTORY
The
.Nm
utility first appeared in
.Ox 2.1 .
