openbsd/src/libexec/smtpd/smtpd/smtpd.8
.\"	$OpenBSD: smtpd.8,v 1.19 2001/08/20 06:09:32 mpech Exp $
.Dd December 10, 1997
.Dt SMTPD 8
.Os
.Sh NAME
.Nm smtpd
.Nd Obtuse Systems SMTPD message storing daemon
.Sh SYNOPSIS
.Nm smtpd
.Op Fl HPDLq
.Op Fl c Ar chrootdir
.Op Fl d Ar spooldir
.Op Fl u Ar user
.Op Fl g Ar group
.Op Fl m Ar myname
.Op Fl s Ar maxsize
.Op Fl l Ar listenip
.Op Fl p Ar listenport
.Op Fl i Ar pidfile
.Sh DESCRIPTION
.Nm
talks the Simple Mail Transfer Protocol (SMTP) with
other SMTP daemons to receive mail from them and saves it into a spool
directory for later processing.
It is the store portion of an SMTP store and forward proxy.
The symbiotic companion program
.Xr smtpfwdd 8
is used to forward the spooled mail on to its eventual destination.
.Nm
is normally invoked from a super-server such as
.Xr inetd 8 .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl c Ar chrootdir
Specify a different
.Ar chrootdir
directory to chroot into on startup.
The default is
.Pa /var/spool/smtpd .
This directory should be readable and writable only to the user that
.Nm
runs as.
.It Fl d Ar spooldir
Specify a different spool directory within the chrooted subtree.
The default is
.Dq \&. ,
making
.Nm
spool files to the directory it chroots itself to.
.It Fl D
Tells
.Nm
to run as a daemon, listening on port 25.
The default is not to run as a daemon.
.It Fl g Ar group
Specify a
.Ar group
to run as.
.It Fl H
Disable host checking against the DNS.
By default,
.Nm
checks and will complain in the syslogs if the DNS information for
a host seems to indicate a possible spoof or misconfiguration.
.It Fl i Ar pidfile
Specify a filename that
.Nm
should lock and write its PID to when running as a daemon.
Doesn't do anything if running from inetd.
Default PID file in daemon mode is
.Pa /var/run/smtpd.pid
on BSD systems, or
.Pa /usr/spool/smtpd/smtpd.pid
on non-BSD systems.
.It Fl l Ar listenip
Specify an IP address in dotted quad format for
.Nm
to accept connections to.
In daemon mode this limits the address that
.Nm
listens on.
In inetd mode,
.Nm smtpd
will issue a 521 error code and exit if connected to an address other than
the specified one.
By default,
.Nm
accepts a connection no matter what address it is connected to.
.It Fl L
Suppress children in daemon mode (above) from doing an
openlog() call.
This means your syslogs won't have PID
information, but is useful if you don't want to have to set up
your chroot jail for
.Nm
in a manner that an openlog() call will work in it.
.It Fl m Ar myname
Specify
.Ar myname ,
the hostname the daemon should announce itself as.
The default is whatever
.Fn gethostname
returns.
.It Fl p Ar listenport
Specify a decimal port number for
.Nm
to listen when running as a daemon.
Doesn't do anything if running
from inetd.
.It Fl P
Enable paranoid mode of operation.
In this mode connections are dropped from any client feeding
.Nm
a suspicious hostname, FROM: or RCPT: lines containing characters
indicative of an attempt to do something evil, or any message headers
that aren't 8-bit clean.
The default is to log such occurrences and
substitute for the offending characters, but not drop the connection.
.It Fl q
Tell
.Nm
to be quieter.
By default,
.Nm
emits very verbose syslog messages.
With this option it will emit one line of log for each normal message exchange.
.It Fl s Ar maxsize
Specify
.Ar maxsize ,
the maximum size (in bytes) of mail message the daemon should accept.
The default is not to have a maximum size.
.It Fl u Ar user
Specify a
.Ar user
to run as.
This user must not be root but
should be a user that is able to run sendmail and use the
.Fl f
option to specify the sender of a mail message.
.El
.Sh FILES
The address checking file is normally
.Pa etc/smtpd_check_rules ,
within the chroot directory.
.Pp
The address check file, when enabled, is read for each RCPT line in the
SMTP dialogue.
Each rule is checked with the current source (SMTP client machine and
possibly user from ident) and the current
.Dq FROM:
and
.Dq RCPT:
addresses.
.Sh SEE ALSO
.Xr inetd 8 ,
.Xr sendmail 8 ,
.Xr smtpfwdd 8
.Pp
.Pa /usr/share/smtpd
\- example configuration files.
.Pp
.Pa http://www.obtuse.com/smtpd.html
\- more examples and rules file details.
.Sh BUGS
Mistakes in
.Pa /etc/smtpd_check_rules
can discard legitimate mail and annoy
your users and other postmasters a very great deal!  When
combined with custom return codes it is possible to write rules
that completely break the smtp protocol.
It is important to test your rules out and be absolutely sure they do
exactly what you want and no more.
.Pp
If
.Xr sendmail 8
is not run as a daemon when using
.Nm
and
.Xr smtpfwdd 8 ,
one must use cron to periodically invoke sendmail -q so that
queued messages are retried for eventual delivery.
Alternatively,
.Xr sendmail 8
may be run as a daemon, but configured not to listen to the network.
