openbsd/src/sbin/ipfstat/ipfstat.8
.\"     $OpenBSD: ipfstat.8,v 1.12 1999/07/04 15:34:52 aaron Exp $
.Dd 13 June, 1999
.Os
.Dt ipfstat 8
.Sh NAME
.Nm ipfstat
.Nd reports on packet filter statistics and filter lists
.Sh SYNOPSIS
.Nm ipfstat
.Op Fl aAfhIinosv
.Op Fl d Ar device
.Sh DESCRIPTION
By default
.Nm
displays current kernel statistics gathered
as a result of applying the filters in place (if any) to packets going through
the kernel.
.Pp
When supplied with either
.Fl i
or
.Fl o ,
it will retrieve and display
the appropriate list of filter rules currently installed and in use by the
kernel.
.Pp
.Nm
examines
.Pa /dev/kmem
using the symbols
.Sy _fr_flags ,
.Sy _frstats ,
.Sy _filterin ,
and
.Sy _filterout .
To run and work, it needs to be able to read both
.Pa /dev/kmem
and the kernel itself.
.Sh OPTIONS
.Bl -tag -width "-d device"
.It Fl a
Display the accounting filter list and show bytes counted against each rule. Used
with
.Fl i
or
.Fl o .
.It Fl A
Display packet authentication statistics.
.It Fl d Ar device
Use
.Ar device
instead of
.Pa /dev/ipl
for interfacing with the kernel.
.It Fl f
Show fragment state information (statistics) and held state information (in
the kernel) if any is present.
.It Fl h
Show per-rule the number of times each one scores a
.Sq hit .
For use in
combination with
.Fl i .
.It Fl i
Display the filter list used for the input side of the kernel IP processing.
.It Fl I
Swap between retrieving
.Sq inactive
/
.Sq active
filter list details. For use in combination with
.Fl i .
.It Fl n
Show the rule number for each rule as it is printed.
.It Fl o
Display the filter list used for the output side of the kernel IP processing.
.It Fl s
Show packet/flow state information (statistics) and held state information (in
the kernel) if any is present.
.It Fl v
Turn verbose mode on. Displays more debugging information.
.El
.Sh FILES
.Pa /dev/kmem
.br
.Pa /dev/ipl
.br
.Pa /dev/ipstate
.br
.Pa /bsd
.Sh SEE ALSO
.Xr ipftest 1 ,
.Xr ipf 4 ,
.Xr ipl 4 ,
.Xr ipnat 4 ,
.Xr ipf 5 ,
.Xr ipnat 5 ,
.Xr ipf 8 ,
.Xr ipmon 8 ,
.Xr ipnat 8 ,
.Pp
http://coombs.anu.edu.au/ipfilter/
.Sh BUGS
If you find any, please send email to me at darrenr@pobox.com.
