openbsd/src/share/man/man4/man4.octeon/amdcf.4
.\"	$OpenBSD: amdcf.4,v 1.1 2015/07/21 00:16:45 pirofti Exp $
.\"
.\" Copyright (c) 2015 Paul Irofti <pirofti@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.\"
.Dd $Mdocdate: July 21 2015 $
.Dt AMDCF 4 octeon
.Os
.Sh NAME
.Nm amdcf
.Nd octeon AMD flash memory driver
.Sh SYNOPSIS
.Cd "amdcf* at iobus?"
.Sh DESCRIPTION
The
.Nm
driver provides access to AMD/Fujitsu flash memory devices found on  
D-Link Octeon machines.
.Pp
The driver implementation follows the CFI specification and 
currently has write support disabled.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr octcf 4 ,
.Xr sd 4 ,
.Xr wd 4 ,
.Xr disklabel 5 ,
.Xr disklabel 8 ,
.Xr fdisk 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Paul Irofti Aq Mt pirofti@openbsd.org
with parts taken for the FreeBSD cfi driver.
