openbsd/src/share/man/man4/man4.octeon/octcit.4
.\"	$OpenBSD: octcit.4,v 1.1 2017/07/30 13:05:34 visa Exp $
.\"
.\" Copyright (c) 2017 Visa Hankala
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 30 2017 $
.Dt OCTCIT 4 octeon
.Os
.Sh NAME
.Nm octcit
.Nd OCTEON central interrupt unit version 3
.Sh SYNOPSIS
.Cd "octcit* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the OCTEON central interrupt unit version 3 (CIU3).
The CIU3 is present at least on the following system on chips:
.Pp
.Bl -item -offset indent -compact
.It
CN72xx
.It
CN73xx
.It
CN77xx
.It
CN78xx
.El
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.2 .
