openbsd/src/share/man/man4/man4.octeon/octmmc.4
.\"	$OpenBSD: octmmc.4,v 1.1 2016/12/21 14:04:54 visa Exp $
.\"
.\" Copyright (c) 2016 Visa Hankala
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: December 21 2016 $
.Dt OCTMMC 4 octeon
.Os
.Sh NAME
.Nm octmmc
.Nd OCTEON MMC host controller
.Sh SYNOPSIS
.Cd "octmmc* at fdt?"
.Cd "sdmmc* at octmmc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the OCTEON MMC host controller,
which provides an interface to
.Xr sdmmc 4
bus.
.Sh SEE ALSO
.Xr sdmmc 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.1 .
.Sh BUGS
The driver supports only on-board MMC devices.
