openbsd/src/share/man/man4/man4.octeon/octpip.4
.\"	$OpenBSD: octpip.4,v 1.2 2019/09/28 22:20:45 deraadt Exp $
.\"
.\" Copyright (c) 2019 Visa Hankala
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 28 2019 $
.Dt OCTPIP 4 octeon
.Os
.Sh NAME
.Nm octpip
.Nd OCTEON packet input processing unit
.Sh SYNOPSIS
.Cd "octpip* at fdt?"
.Cd "octgmx* at octpip?"
.Sh DESCRIPTION
The
.Nm
driver provides an attachment point for OCTEON packet interfaces.
.Sh SEE ALSO
.Xr octgmx 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.6 .
