openbsd/src/usr.sbin/httpd/httpd.conf.5
.\"	$OpenBSD: httpd.conf.5,v 1.24 2014/08/05 17:03:21 reyk Exp $
.\"
.\" Copyright (c) 2014 Reyk Floeter <reyk@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 5 2014 $
.Dt HTTPD.CONF 5
.Os
.Sh NAME
.Nm httpd.conf
.Nd HTTP daemon configuration file
.Sh DESCRIPTION
.Nm
is the configuration file for the HTTP daemon,
.Xr httpd 8 .
.Sh SECTIONS
.Nm
is divided into four main sections:
.Bl -tag -width xxxx
.It Sy Macros
User-defined variables may be defined and used later, simplifying the
configuration file.
.It Sy Global Configuration
Global settings for
.Xr httpd 8 .
.It Sy Servers
Listening HTTP web servers.
.It Sy Types
Media types and extensions.
.El
.Pp
Within the sections,
a host
.Ar address
can be specified by IPv4 address, IPv6 address, interface name,
interface group, or DNS hostname.
If the address is an interface name,
.Xr httpd 8
will look up the first IPv4 address and any other IPv4 and IPv6
addresses of the specified network interface.
A
.Ar port
can be specified by number or name.
The port name to number mappings are found in the file
.Pa /etc/services ;
see
.Xr services 5
for details.
.Pp
The current line can be extended over multiple lines using a backslash
.Pq Sq \e .
Comments can be put anywhere in the file using a hash mark
.Pq Sq # ,
and extend to the end of the current line.
Care should be taken when commenting out multi-line text:
the comment is effective until the end of the entire block.
.Pp
Argument names not beginning with a letter, digit, or underscore
must be quoted.
.Pp
Additional configuration files can be included with the
.Ic include
keyword, for example:
.Bd -literal -offset indent
include "/etc/httpd.conf.local"
.Ed
.Sh MACROS
Macros can be defined that will later be expanded in context.
Macro names must start with a letter, digit, or underscore,
and may contain any of those characters.
Macro names may not be reserved words (for example,
.Ic table ,
.Ic relay ,
or
.Ic timeout ) .
Macros are not expanded inside quotes.
.Pp
For example:
.Bd -literal -offset indent
ext_ip="10.0.0.1"
server "default" {
	listen on $ext_ip port 80
}
.Ed
.Sh GLOBAL CONFIGURATION
Here are the settings that can be set globally:
.Bl -tag -width Ds
.It Ic prefork Ar number
Run the specified number of server processes.
This increases the performance and prevents delays when connecting
to a server.
.Xr httpd 8
runs 3 server processes by default.
.It Ic chroot Ar directory
Set the
.Xr chroot 2
directory.
If not specified, it defaults to
.Pa /var/www ,
the home directory of the www user.
.El
.Sh SERVERS
The configured web servers.
.Pp
Each
.Ic server
must have a
.Ar name
and include one or more lines of the following syntax:
.Bl -tag -width Ds
.It Ic directory Oo Ic no Oc Ic auto index
If no index file is found, automatically generate a directory listing.
This is disabled by default.
.It Ic directory Ic index Ar string
Set the directory index file.
If not specified, it defaults to
.Pa index.html .
.It Ic directory no index
Disable the directory index.
.Nm httpd
will neither display nor generate a directory index.
.It Oo Ic no Oc Ic fastcgi Op Ic socket Ar socket
Enable FastCGI instead of serving files.
The
.Ar socket
is a local path name within the
.Xr chroot 2
root directory of
.Nm httpd
and defaults to
.Pa /run/slowcgi.sock .
.It Ic listen on Ar address Ic port Ar number Op Ic ssl
Set the listen address and port.
.It Ic location Ar path { ... }
Specify server configuration rules for a specific location.
The
.Ar path
argument will be matched against the URL path with shell globbing rules.
A location section may include all of the server configuration rules
except
.Ic listen on ,
.Ic location
and
.Ic tcp .
.It Ic log access Ar name
Set the
.Ar name
of the access log file relative to the log directory.
If not specified, it defaults to
.Pa access.log .
.It Ic log error Ar name
Set the
.Ar name
of the error log file relative to the log directory.
If not specified, it defaults to
.Pa error.log .
.It Ic log style Ar style
Set the logging style.
The
.Ar style
can be
.Ar common ,
.Ar combined
or
.Ar connection .
The styles
.Ar common
and
.Ar combined
write a log entry after each request similar to the standard Apache
and nginx access log formats.
The style
.Ar connection
writes a summarized log entry after each connection,
that can have multiple requests,
similar to the format that is used by
.Xr relayd 8 .
If not specified, the default is
.Ar common .
.It Ic log Oo Ic no Oc Ic syslog
Enable or disable logging to syslog instead of the log files.
.It Ic no log
Disable logging.
.It Ic root Ar directory
Set the document root of the server.
The
.Ar directory
is a pathname within the
.Xr chroot 2
root directory of
.Nm httpd .
If not specified, it defaults to
.Pa /htdocs .
.It Ic tcp Ar option
Enable or disable the specified TCP/IP options; see
.Xr tcp 4
and
.Xr ip 4
for more information about the options.
Valid options are:
.Bl -tag -width Ds
.It Ic backlog Ar number
Set the maximum length the queue of pending connections may grow to.
The backlog option is 10 by default and is limited by the
.Ic kern.somaxconn
.Xr sysctl 8
variable.
.It Ic ip minttl Ar number
This option for the underlying IP connection may be used to discard packets
with a TTL lower than the specified value.
This can be used to implement the
.Ar Generalized TTL Security Mechanism (GTSM)
according to RFC 5082.
.It Ic ip ttl Ar number
Change the default time-to-live value in the IP headers.
.It Xo
.Op Ic no
.Ic nodelay
.Xc
Enable the TCP NODELAY option for this connection.
This is recommended to avoid delays in the relayed data stream,
e.g. for SSH connections.
.It Xo
.Op Ic no
.Ic sack
.Xc
Use selective acknowledgements for this connection.
.It Ic socket buffer Ar number
Set the socket-level buffer size for input and output for this
connection.
This will affect the TCP window size.
.El
.El
.Sh TYPES
Configure the supported media types.
.Nm httpd
will set the
.Ar Content-Type
of the response header based on the file extension listed in the
.Ic types
section.
If not specified,
.Nm httpd
will use built-in media types for
.Ar text/css ,
.Ar text/html ,
.Ar text/plain ,
.Ar image/gif ,
.Ar image/png ,
.Ar image/jpeg ,
and
.Ar application/javascript .
.Pp
The
.Ic types
section must include one or more lines of the following syntax:
.Bl -tag -width Ds
.It Ar type/subtype Ar name Op Ar name ... ;
Set the media
.Ar type
and
.Ar subtype
to the specified extension
.Ar name .
One or more names can be specified per line.
.El
.Sh EXAMPLES
The following example will start one server that is pre-forked two
times and listening on the primary IP address of the network interface
that is a member of the
.Ar egress
group.
It additionally defines some media types overriding the defaults.
.Bd -literal -offset indent
prefork 2

server "default" {
	listen on egress port 80
}

types {
	text/css			css;
	text/html			htm html;
	text/txt			txt;
	image/gif			gif;
	image/jpeg			jpg jpeg;
	image/png			png;
	application/javascript		js;
	application/xml			xml;
}
.Ed
.Pp
Multiple servers can be configured to support hosting of different domains.
If the same address is repeated multiple times in the
.Ic listen on
statement,
the server will be matched based on the requested host name.
.Bd -literal -offset indent
server "www.a.example.com" {
	listen on 203.0.113.1 port 80
	root "/htdocs/www.a.example.com"
}

server "www.b.example.com" {
	listen on 203.0.113.1 port 80
	root "/htdocs/www.b.example.com"
}

server "intranet.example.com" {
	listen on 10.0.0.1 port 80
	root "/htdocs/intranet.example.com"
}
.Ed
.Pp
The syntax of the types section is compatible with the format used by
.Xr nginx 8 ,
so it is possible to include its
.Pa mime.types
file directly:
.Bd -literal -offset indent
include "/etc/nginx/mime.types"
.Ed
.Sh SEE ALSO
.Xr httpd 8
.Sh AUTHORS
.An -nosplit
The
.Xr httpd 8
program was written by
.An Reyk Floeter Aq Mt reyk@openbsd.org .
