openbsd/src/usr.sbin/httpd/httpd.8
.TH httpd 8 "February 1997"
.\" Copyright (c) 1995-1997 David Robinson. All rights reserved.
.\" Copyright (c) 1997 The Apache Group. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer. 
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\"
.\" 3. All advertising materials mentioning features or use of this
.\"    software must display the following acknowledgment:
.\"    "This product includes software developed by the Apache Group
.\"    for use in the Apache HTTP server project (http://www.apache.org/)."
.\"
.\" 4. The names "Apache Server" and "Apache Group" must not be used to
.\"    endorse or promote products derived from this software without
.\"    prior written permission.
.\"
.\" 5. Redistributions of any form whatsoever must retain the following
.\"    acknowledgment:
.\"    "This product includes software developed by the Apache Group
.\"    for use in the Apache HTTP server project (http://www.apache.org/)."
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE APACHE GROUP ``AS IS'' AND ANY
.\" EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE APACHE GROUP OR
.\" ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
.\" OF THE POSSIBILITY OF SUCH DAMAGE.
.\" ====================================================================
.\"
.\" This software consists of voluntary contributions made by many
.\" individuals on behalf of the Apache Group and was originally based
.\" on public domain software written at the National Center for
.\" Supercomputing Applications, University of Illinois, Urbana-Champaign.
.\" For more information on the Apache Group and the Apache HTTP server
.\" project, please see <http://www.apache.org/>.
.SH NAME
httpd \- Apache hypertext transfer protocol server
.SH SYNOPSIS
.B httpd 
[
.B \-hlvVSt?
] [
.BI \-d " serverroot"
] [
.BI \-f " config"
] [
.BI \-C " directive"
] [
.BI \-c " directive"
]
.SH DESCRIPTION
.B httpd
is the Apache HyperText Transfer Protocol (HTTP) server program. It is
designed to be run as a standalone daemon process. When used like this
is will create a pool of child processes to handle requests. To stop
it, send a TERM signal to the initial (parent) process. The PID of
this process is written to a file as given in the configuration file.
Alternatively 
.B httpd 
may be invoked by the Internet daemon inetd(8) each
time a connection to the HTTP service is made. Normally this service
can be enabled for startup on OpenBSD by editing \fB/etc/rc.conf\fP.
.PP
This manual page only lists the command line arguments. For details
of the directives necessary to configure httpd see the Apache manual,
which is part of the Apache distribution or can be found at
http://www.apache.org/, or in \fB/var/www/htdocs/manual\fP.
Paths in this manual page  reflect those
compiled into httpd by default with OpenBSD.
.SH OPTIONS
.TP 12
.BI \-c " directive" 
Process directive "directive" 
.BI after
reading config files.
.TP
.BI \-C " directive" 
Process directive "directive" 
.BI before
reading config files.
.TP
.BI \-d " serverroot"
Set the initial value for the ServerRoot directive to \fIserverroot\fP. This
can be overridden by the ServerRoot command in the configuration file. The
default is \fB/var/www\fP.
.TP
.BI \-f " config"
Execute the commands in the file \fIconfig\fP on startup. If \fIconfig\fP
does not begin with a /, then it is taken to be a path relative to
the ServerRoot. The default is \fBconf/httpd.conf\fP.
.TP
.B \-h
Output a list of directives together with expected arguments and
places where the directive is valid.
.TP
.B \-l
Output a list of modules compiled into the server.
.TP
.B \-S
Print the parsed settings (currently only vhost settings), and then exit.
.TP
.B \-t
Run a syntax test for the configuration files, and then exit.
.TP
.B \-v
Print the version of httpd, and then exit.
.TP
.B \-V
Print the compiled in settings for httpd, and then exit.
.TP
.B \-?
Print a list of the httpd options, and then exit.
.SH FILES
.PD 0
.B /var/www/conf/httpd.conf
.br
.B /var/www/conf/srm.conf
.br
.B /var/www/conf/access.conf
.br
.B /var/www/conf/mime.types
.br
.B /var/www/logs/error_log
.br
.B /var/www/logs/access_log
.br
.B /var/www/logs/httpd.pid
.br
.B /etc/rc.conf
.PD
.SH SEE ALSO
.BR inetd (8).
