openbsd/src/usr.sbin/snmpctl/snmpctl.8
.\" $OpenBSD: snmpctl.8,v 1.1 2007/12/05 09:22:44 reyk Exp $
.\"
.\" Copyright (c) 2006 Reyk Floeter <reyk@vantronix.net>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: December 5 2007 $
.Dt SNMPCTL 8
.Os
.Sh NAME
.Nm snmpctl
.Nd control the SNMP daemon
.Sh SYNOPSIS
.Nm
.Ar command
.Op Ar arguments ...
.Sh DESCRIPTION
The
.Nm
program controls the
.Xr snmpd 8
daemon.
.Pp
The following commands are available:
.Bl -tag -width Ds
.It Cm something
Do something
.El
.Sh FILES
.Bl -tag -width "/var/run/snmpd.sockXX" -compact
.It /var/run/snmpd.sock
Unix-domain socket used for communication with
.Xr snmpd 8 .
.El
.Sh SEE ALSO
.Xr snmpd 8
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 4.3 .
.Sh AUTHORS
The
.Nm
program was written by
.An Reyk Floeter Aq reyk@vantronix.net .
