openbsd/src/usr.sbin/afs/afsd/afsd.8
.\"	$OpenBSD: afsd.8,v 1.7 2000/03/05 00:28:57 aaron Exp $
.\"
.Dd September  5, 1998
.Dt AFSD 8
.Os
.Sh NAME
.Nm afsd
.Nd AFS cache manager for xfs
.Sh SYNOPSIS
.Nm afsd
.Op Fl t | Fl -test
.Oo Fl c Ar string \*(Ba Xo
.Fl -conffile= Ns Ar string Oc
.Xc
.Oo Fl l Ar string \*(Ba Xo
.Fl -log= Ns Ar string Oc
.Xc
.Op Fl -debug= Ns Ar string
.Oo Fl d Ar string \*(Ba Xo
.Fl -device= Ns Ar string Oc
.Xc
.Op Fl -connected-mode= Ns Ar string
.Op Fl n | Fl -no-fork
.Oo Fl r Ar string \*(Ba Xo
.Fl -rxkad-level= Ns Ar string Oc
.Xc
.Oo Fl s Ar string \*(Ba Xo
.Fl -sysname= Ns Ar string Oc
.Xc
.Op Fl -root-volume= Ns Ar string
.Op Fl -port= Ns Ar number
.Op Fl z | Fl -recover
.Op Fl -cache-dir= Ns Ar string
.Op Fl -version
.Op Fl -help
.Op Ar device
.Sh DESCRIPTION
.Nm
runs on AFS client machines. It is used to manage the file cache, fetch files
from AFS servers, handle callbacks and manage the authentication information
for users. In normal cases you will not need to run it by yourself. It is
automatically started when
.Xr mount_xfs 8
is run.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Xo
.Fl t Ns ,
.Fl -test
.Xc
Run in test mode.
.It Xo
.Fl c Ar string Ns ,
.Fl -conffile= Ns Ar string
.Xc
Path to configuration file
.Po default: Pa /etc/afs/afsd.conf
.Pc .
.It Xo
.Fl l Ar string Ns ,
.Fl -log= Ns Ar string
.Xc
Where to write log [stderr|syslog|path] (default: stderr).
.It Xo
.Fl -debug= Ns Ar string
.Xc
What to write in the log (default: none).
.It Xo
.Fl d Ar string Ns ,
.Fl -device= Ns Ar string
.Xc
The XFS device to use
.Po default: Pa /dev/xfs0
.Pc .
.It Xo
.Fl -connected-mode= Ns Ar string
.Xc
Initial connected mode [conncted|fetch-only|disconnected].
.It Xo
.Fl n Ns ,
.Fl -no-fork
.Xc
Don't fork and daemonize.
.It Xo
.Fl r Ar string Ns ,
.Fl -rxkad-level= Ns Ar string
.Xc
The rxkad level to use [clear|auth|crypt] (default: auth).
.It Xo
.Fl s Ar string Ns ,
.Fl -sysname= Ns Ar string
.Xc
Set the sysname of this system.
.It Xo
.Fl -root-volume= Ns Ar string
.Xc
Name of the root volume.
.It Xo
.Fl -port= Ns Ar number
.Xc
Port number to use.
.It Xo
.Fl z Ns ,
.Fl -recover
.Xc
Don't recover state.
.It Xo
.Fl -cache-dir= Ns Ar string
.Xc
Cache directory
.Po default: Pa /var/spool/afs
.Pc .
.It Xo
.Fl -version
.Xc
Print version information.
.It Xo
.Fl -help
.Xc
Print usage information.
.El
.Sh FILES
.Bl -tag -width /etc/afs/CellServDB -compact
.It Pa /etc/afs/afsd.conf
default configuration for afsd
.It Pa /etc/afs/CellServDB
database with all known AFS servers
.It Pa /etc/afs/ThisCell
our default cell (where we get the root directory)
.It Pa /var/spool/afs
default cache directory
.El
.Pp
It is highly recommended that the default cache directory be a separate
filesystem. When enough memory is available this could be a mfs to
drastically improve performance.
.Sh SEE ALSO
.Xr mount_xfs 8
.Sh BUGS
This code is still in the experimental stage and some bugs are present. If
.Nm
happens to crash, it's recommended to restart it with the
.Fl z
flag. Otherwise a corrupted cache can be reused.
