openbsd/src/share/man/man8/man8.sparc64/boot_sparc64.8
.\"	$OpenBSD: boot_sparc64.8,v 1.12 2007/05/31 19:20:00 jmc Exp $
.\"
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)boot_sparc.8	8.2 (Berkeley) 4/19/94
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt BOOT_SPARC64 8 sparc64
.Os
.Sh NAME
.Nm boot_sparc64
.Nd sparc64 system bootstrapping procedures
.Sh DESCRIPTION
.Ss System starts
When powered on, after a panic, or if the system is rebooted via
.Xr reboot 8
or
.Xr shutdown 8 ,
the PROM will proceed to its initialization, and will boot an operating
system if autoboot is enabled.
.Ss Boot process description
System boot blocks are installed near the start of the boot disk
using the procedure described in
.Xr installboot 8 .
The boot program attempts to load the kernel from the selected
boot device,
which must currently be an
.Tn SCSI
.Pq Dq sd
or IDE
.Pq Dq wd
disk drive, or a CD-ROM
.Pq Dq cd ,
or an
.Tn SCSI
tape drive
.Pq Dq st .
.Pp
The UltraSPARC
.Tn Open Firmware
will normally look for a bootloader on the device specified by the
.Em boot-device
variable.
The
.Ox
bootloader will then look for a kernel named
.Pa bsd
by default, unless the
.Em boot-file
variable is set, or a different filename has been specified
in the boot command.
To reset this variable to its default, empty, value, type the following:
.Pp
.Em \	ok
set-default
.Em boot-file
.Pp
Autoboot is enabled by setting the
.Em auto-boot?\&
variable to
.Dq true ,
and is the factory default.
.Ss Boot process options
The following options are recognized:
.Bl -tag -width "-XXX" -offset indent -compact
.Pp
.It Fl a
Prompt for the root filesystem and swap devices after the devices have
been configured.
.It Fl c
Enter the
.Dq User Kernel Configuration
mode upon startup
.Pq see Xr boot_config 8 .
.It Fl d
Enter the debugger,
.Xr ddb 4 ,
as soon as the kernel console has been initialized.
.It Fl s
Boot the system single-user.
The system will be booted multi-user unless this option is specified.
.El
.Ss Accessing the PROM during runtime
If the
.Xr sysctl 8
variable
.Em ddb.console
is enabled, at any time you can break back to the ROM by pressing the
.Dq L1
.Pq also known as the Dq stop key
and
.Dq a
keys at the same time (if the console is a serial port the same is
achieved by sending a
.Dq break ) ,
and entering
.Ic machine prom
at the prompt.
If you do this accidentally you can continue whatever was in progress
by typing
.Ic go
at the PROM prompt, and then
.Ic cont
to return to the system.
.Sh FILES
.Bl -tag -width /usr/mdec/ofwboot.net -compact
.It Pa /bsd
default system kernel
.It Pa /bsd.rd
standalone installation kernel, suitable for disaster recovery
.It Pa /usr/mdec/bootblk
primary bootstrap for
.Dq ffs
file system
.It Pa /usr/mdec/ofwboot
secondary bootstrap (usually also installed as
.Pa /ofwboot )
.It Pa /usr/mdec/ofwboot.net
network bootstrap
.El
.Sh SEE ALSO
.Xr ddb 4 ,
.Xr boot_config 8 ,
.Xr halt 8 ,
.Xr init 8 ,
.Xr installboot 8 ,
.Xr reboot 8 ,
.Xr savecore 8 ,
.Xr shutdown 8
