openbsd/src/share/man/man8/man8.sparc64/boot_sparc64.8
.\"	$OpenBSD: boot_sparc64.8,v 1.2 2001/10/14 21:02:25 miod Exp $
.\"
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)boot_sparc.8	8.2 (Berkeley) 4/19/94
.\"
.Dd April 19, 1994
.Dt BOOT_SPARC 8 sparc64
.Os
.Sh NAME
.Nm boot
.Nd
.Tn sparc64-specific
system bootstrapping procedures
.Sh DESCRIPTION
.Ss Power fail and crash recovery
Normally, the system will reboot itself at power-up or after crashes.
An automatic consistency check of the file systems will be performed
(as described in
.Xr fsck 8 ) ,
and unless this fails, the system will resume multi-user operations.
.Ss Cold starts
System boot blocks are installed near the start of the boot disk
using the procedure described in
.Xr installboot 8 .
The boot program attempts to load the kernel from partition
.Dq a
of the boot device,
which must currently be an
.Dq sd
or
.Dq wd
disk.
.Pp
The
.Fl s
flag to the bootloader will bring the system up in single-user mode.
The
.Fl a
flag instructs the system to prompt for the location of the root filesystem
and the primary swap partition.
The
.Fl c
flag instructs the system to enter the
.Dq User Kernel Config
mode upon startup (see
.Xr boot_config 8 ).
Other flags are currently ignored.
.Pp
The UltraSPARC OpenFirmware will normally load the kernel from the device and
filename as instructed by the
.Dq boot-device
and
.Dq boot-file
variables.
If the
.Dq boot-file
variable is empty, the
.Ox
bootloader will look for a kernel named
.Dq bsd ,
unless a different filename has been specified in the boot command.
To reset this variable to its default, empty, value, type the following:
.Pp
.Em \	ok
set-default boot-file
.Ss Accessing the PROM during runtime
If the
.Xr sysctl 8
variable
.Ev ddb.console
is enabled, at any time you can break back to the ROM by pressing the
.Dq L1
and
.Dq a
keys at the same time (if the console is a serial port the same is
achieved by sending a
.Dq break ) .
If you do this accidentally you can continue whatever was in progress
by typing
.Dq go .
.Sh FILES
.Bl -tag -width /ofwboot -compact
.It Pa /bsd
system code
.It Pa /ofwboot
system bootstrap
.El
.Sh SEE ALSO
.Xr boot_config 8 ,
.Xr crash 8 ,
.Xr disklabel 8 ,
.Xr fsck 8 ,
.Xr halt 8 ,
.Xr init 8 ,
.Xr installboot 8 ,
.Xr rc 8 ,
.Xr shutdown 8 ,
.Xr syslogd 8
