openbsd/src/share/man/man8/man8.sparc64/MAKEDEV.8
.\"	$OpenBSD: MAKEDEV.8,v 1.1 2001/10/04 23:39:38 miod Exp $
.\" Copyright (c) 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)MAKEDEV.8	5.2 (Berkeley) 3/22/91
.\"
.Dd October 5, 2001
.Dt MAKEDEV 8 sparc64
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Op Ar ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the
.Pa /dev
directory, is used to create
the common special
files.
See
.Xr special 8
for a more complete discussion of special files.
.Pp
.Nm MAKEDEV
takes any number of device names as arguments,
where the names are the common abbreviation for
the device.  There are three special device names,
.Ar all ,
.Ar std
and
.Ar local .
If
given,
.Ar all
creates device files for all devices on
sparc64.  If units are expected for a device
.Nm MAKEDEV
supplies the standard numbers.
The
.Ar std
argument creates the standard devices for sparc64.
Finally
.Ar local
is for devices specific to the local site, and
executes the shell file
.Pa MAKEDEV.local .
.Pp
sparc64 supports the following devices.
Where a device name is followed by a hash
sign ("#"), the hash sign must be replaced
by a unit number.
.Pp
.Sy Pseudo\-names
.Bl -tag -width indent -compact
.It Ar all
All known devices for sparc64.
.It Ar std
The standard devices (console, drum, fd/*, klog, kmem, mem, null,
stderr, stdin, stdout, tty, zero)
.It Ar local
Configuration specific devices
.El
.Pp
.Sy Device\-names
.Bl -tag -width indent -compact
.It Ar audio
Audio device
.It Ar bpf#
Berkeley packet filters
.It Ar bwtwo#
Black and white frame buffers
.It Ar ccd#
Concatenated disk drives
.It Ar cd#
SCSI CD-ROM drives
.It Ar cgfourteen#
Colour frame buffers
.It Ar cgthree#
Colour frame buffers
.It Ar cgsix#
Accelerated colour frame buffers
.It Ar ch#
SCSI media changer drives
.It Ar cua#
Serial ports
.It Ar fd#
.Dq floppy
disk drives
.It Ar kbd
The keyboard
.It Ar lkm
Loadable kernel modules.
.It Ar mouse#
Mouse ports
.It Ar openprom
OPENPROM and EEPROM interface
.It Ar pty#
Set of 16 master and slave pseudo terminals
.It Ar raid#
RAIDframe disk drives
.It Ar random
in-kernel random number generator
.It Ar rd#
"Ramdisk" pseudo-disks
.It Ar sd#
SCSI disk drives
.It Ar ses#
SCSI SES/SAF-TE devices
.It Ar st#
SCSI tape drives
.It Ar tcx#
Accelerated colour frame buffers
.It Ar tty#
Serial ports
.It Ar tun#
Network tunnel devices
.It Ar uk#
.Dq unknown SCSI
devices
.It Ar vnd#
"File" pseudo-disks
.It Ar xfs#
XFS filesystem devices
.El
.Sh FILES
.Bl -tag -width /dev -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8 ,
.Xr special 8
