openbsd/src/libexec/ld.so/prebind_strip/prebind_strip.8
.\"	$OpenBSD: prebind_strip.8,v 1.3 2006/05/05 13:52:42 jmc Exp $
.\"
.\" Copyright (c) 2006 Dale Rahn <drahn@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd May 1, 2006
.Dt PREBIND_STRIP 8
.Os
.Sh NAME
.Nm prebind_strip
.Nd remove prebind info from binaries and libraries
.Sh SYNOPSIS
.Nm prebind_strip
.Op Ar
.Sh DESCRIPTION
.Nm
removes any prebind information from a binary or shared library.
After this is run, the library length and md5 should match the original value.
.Sh SEE ALSO
.Xr ld.so 1 ,
.Xr prebind 8
.Sh STANDARDS
None
.Sh HISTORY
The
.Nm
utility first appeared in
.Ox 4.0 .
.Nm
is based loosely on Prelinking, however prelink removes the security
feature of libraries appearing in random order on each invocation, thus
it was incompatible with
.Ox Ns 's
goals.
.Nm
was written as an attempt to improve the speed of dynamic linking
without the penalty of loss of security features.
