openbsd/src/usr.bin/passwd/passwd.1
.\"	$OpenBSD: passwd.1,v 1.48 2022/03/31 17:27:26 naddy Exp $
.\"
.\" Copyright (c) 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)passwd.1	6.11 (Berkeley) 7/24/91
.\"
.Dd $Mdocdate: March 31 2022 $
.Dt PASSWD 1
.Os
.Sh NAME
.Nm passwd
.Nd modify a user's password
.Sh SYNOPSIS
.Nm passwd
.Op Ar user
.Sh DESCRIPTION
.Nm
changes the user's password.
If no
.Ar user
is specified, the user's login name is used (see
.Xr logname 1 ) .
First, the user is prompted for their current password.
If the current password is correctly typed, a new password is requested.
The new password must be entered twice to avoid typing errors.
.Pp
The new password should be at least six characters long and not
purely alphabetic.
A mixture of both lower and uppercase letters, numbers, and
meta-characters is encouraged.
.Pp
The quality of the password can be enforced by specifying an external
checking program via the
.Dq passwordcheck
variable in
.Xr login.conf 5 .
.Pp
The superuser is not required to provide a user's current password
if only the local password is modified.
.Pp
Password encryption parameters depend on the configuration of the
.Dq localcipher
capability in
.Xr login.conf 5 .
If none is specified then blowfish is used, with the number of
rounds selected based on system performance.
.Sh FILES
.Bl -tag -width /etc/master.passwd -compact
.It Pa /etc/login.conf
configuration options
.It Pa /etc/master.passwd
user database
.It Pa /etc/passwd
user database, with confidential information removed
.It Pa /etc/passwd.XXXXXX
temporary copy of the password file
.It Pa /etc/ptmp
lock file for the passwd database
.El
.Sh DIAGNOSTICS
.Bl -diag
.It "Attempting to lock password file, please wait or press ^C to abort"
.Pp
The password file is currently locked by another process;
.Nm
will keep trying to lock the password file until it succeeds or
you hit the interrupt character (control-C by default).
If
.Nm
is interrupted while trying to gain the lock, the password change will
be lost.
.Pp
If the process holding the lock was prematurely terminated, the lock
file may be stale and
.Nm
will wait forever trying to lock the password file.
To determine whether a live process is actually holding the lock, the
admin may run the following:
.Bd -literal -offset indent
$ fstat /etc/ptmp
.Ed
.Pp
If no process is listed, it is safe to remove the
.Pa /etc/ptmp
file to clear the error.
.El
.Sh SEE ALSO
.Xr chpass 1 ,
.Xr encrypt 1 ,
.Xr logname 1 ,
.Xr login.conf 5 ,
.Xr passwd 5 ,
.Xr pwd_mkdb 8 ,
.Xr vipw 8
.Rs
.%A Robert Morris
.%A Ken Thompson
.%T Password security: a case history
.%J Communications of the ACM
.%V Volume 22
.%N Issue 11
.%D Nov. 1979
.%P pp. 594\(en597
.Re
.Sh HISTORY
A
.Nm
command appeared in
.At v3 .
