openbsd/src/usr.bin/passwd/passwd.1
.\"	$OpenBSD: passwd.1,v 1.23 2003/01/06 08:50:11 deraadt Exp $
.\"
.\" Copyright (c) 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)passwd.1	6.11 (Berkeley) 7/24/91
.\"
.Dd July 24, 1991
.Dt PASSWD 1
.Os
.Sh NAME
.Nm passwd
.Nd modify a user's password
.Sh SYNOPSIS
.Nm passwd
.Op Fl l
.Op Fl y
.Op Fl k
.Op Fl K
.Op Fl n Ar name
.Op Fl i Ar instance
.Op Fl r Ar realm
.Op Fl u Ar username[.instance][@realm]
.Op Ar user
.\" This should really be: passwd [-l] [-y] [-k [-n name] [-i instance] [-r realm] [-u username[.instance][@realm]]] [user]
.Sh DESCRIPTION
.Nm
changes the user's local, KerberosIV, KerberosV, or YP password.
First, the user is prompted for their current password.
If the current password is correctly typed, a new password is requested.
The new password must be entered twice to avoid typing errors.
.Pp
The new password should be at least six characters long and not
purely alphabetic.
Its total length must be less than
.Dv _PASSWORD_LEN
(currently 128 characters).
A mixture of both lower and uppercase letters, numbers, and
meta-characters is encouraged.
.Pp
The quality of the password can be enforced by specifying an external
checking program via the
.Dq passwordcheck
variable in
.Xr login.conf 5 .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl l
Causes the password to be updated only in the local password file.
When changing only the local password,
.Xr pwd_mkdb 8
is used to update the password databases.
.It Fl y
Forces the YP password database entry to be changed, even if
the user has an entry in the local database.
The
.Xr rpc.yppasswdd 8
daemon should be running on the YP master server.
.It Fl k
Forces the change to affect the KerberosIV database, even
if the user has a password in the local database.
Once the password has been verified,
.Nm
communicates the new password information to the KerberosIV authenticating host.
.El
.Pp
The following flags are only used when the
.Fl k
flag is specified:
.Bl -tag -width flag
.It Fl n Ar name
Specifies a
.Ar name
that will be used as the principal name rather than the username
of the user running
.Nm passwd .
(This is determined from the ticket file if it exists; otherwise,
it is determined from the Unix user ID.)
.It Fl i Ar instance
Specifies an
.Ar instance
to use rather than a null instance.
.It Fl r Ar realm
Specifies a
.Ar realm
instead of the local realm.
.It Fl u Ar username[.instance][@realm]
Specifies a fully qualified KerberosIV principal.
.It Fl K Ar principal@REALM
Changes a users KerberosV password.
.El
.Pp
This is the behavior if no flags are specified:
if KerberosIV is active then
.Nm
will talk to the KerberosIV server (even if the user has an entry
in the local database).
If the password is not in the local password database, then
an attempt is made to use the YP database.
.Pp
To change another user's KerberosIV password, one must first run
.Xr kinit 1
followed by
.Xr passwd 1 .
The superuser is not required to provide a user's current password
if only the local password is modified.
.Pp
Which type of cipher is used to encrypt the password information
depends on the configuration in
.Xr login.conf 5 .
It can be different for local
.Po Do localcipher Dc Pc
and YP
.Po Do ypcipher Dc Pc
passwords.
.Sh DIAGNOSTICS
.Bl -diag
.It "Attempting lock password file, please wait or press ^C to abort"
.Pp
The password file is currently locked by another process;
.Nm
will keep trying to lock the password file until it succeeds or
you hit the interrupt character (control-C by default).
If
.Nm
is interrupted while trying to gain the lock the password changed will
be lost.
.Pp
If the process holding the lock was prematurely terminated the lock
file may be stale and
.Nm
will wait forever trying to lock the password file.
To determine whether a live process is actually holding the lock, the
admin may run the following:
.Bd -literal -offset indent
$ fstat /etc/ptmp
.Ed
.Pp
If no process is listed, it is safe to remove the
.Pa /etc/ptmp
file to clear the error.
.El
.Sh FILES
.Bl -tag -width /etc/master.passwd -compact
.It /etc/login.conf
configuration options
.It Pa /etc/master.passwd
user database
.It Pa /etc/passwd
a Version 7 format password file
.It Pa /etc/passwd.XXXXXX
temporary copy of the password file
.It /etc/ptmp
lock file for the passwd database
.El
.Sh SEE ALSO
.Xr chpass 1 ,
.Xr kerberos 1 ,
.Xr kinit 1 ,
.Xr login 1 ,
.Xr login.conf 5 ,
.Xr passwd 5 ,
.Xr pwd_mkdb 8 ,
.Xr vipw 8
.Rs
.%A Robert Morris
.%A Ken Thompson
.%T "UNIX password security"
.Re
.Sh HISTORY
A
.Nm
command appeared in
.At v3 .
