openbsd/src/usr.sbin/fw_update/fw_update.1
.\" $OpenBSD: fw_update.1,v 1.14 2013/08/20 22:42:08 halex Exp $
.\"
.\" Copyright (c) 2011 Alexander Hall <alexander@beard.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 20 2013 $
.Dt FW_UPDATE 1
.Os
.Sh NAME
.Nm fw_update
.Nd install and update non-free firmware packages
.Sh SYNOPSIS
.Nm
.Op Fl anv
.Op Ar driver ...
.Sh DESCRIPTION
The
.Nm
utility installs or updates firmware packages from the Internet.
Since firmware with acceptable licenses are already present in
.Ox ,
.Nm
exists purely to install and update firmware that may not be freely
distributed with
.Ox .
.Pp
If no
.Ar driver
is specified, the
.Nm
utility tries to determine which firmware are needed on the system.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl a
Install or update all available firmware.
It is an error to specify this option with any
.Ar driver
arguments. 
.It Fl n
Pass the
.Fl n
flag to
.Xr pkg_add 1 ,
causing it to not actually install or update any firmware packages,
just report the steps that would be taken if it did.
.It Fl v
Turn on verbose output and pass the
.Fl v
flag to
.Xr pkg_add 1 .
This flag can be specified multiple times for increased
.Xr pkg_add 1
verbosity.
.El
.Sh SEE ALSO
.Xr pkg_add 1 ,
.Xr dmesg 8
.Sh AUTHORS
.An -nosplit
The
.Nm
program was written by
.An Alexander Hall Aq Mt alexander@beard.se .
