openbsd/src/usr.sbin/fw_update/fw_update.1
.\" $OpenBSD: fw_update.1,v 1.5 2011/07/27 15:12:57 halex Exp $
.\"
.\" Copyright (c) 2011 Alexander Hall <alexander@beard.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 27 2011 $
.Dt FW_UPDATE 1
.Os
.Sh NAME
.Nm fw_update
.Nd install and update non-free firmware packages
.Sh SYNOPSIS
.Nm
.Op Fl nv
.Sh DESCRIPTION
The
.Nm
utility installs and updates device firmwares with non-free licenses
that may not be shipped with
.Ox .
It automatically detects such devices and downloads and installs the proper
firmware packages for the currently running kernel.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl n
Pass the
.Fl n
flag to pkg_add, causing it to not actually install any firmware packages,
just report the steps that would be taken if it was.
.It Fl v
Turn on verbose output and passes the
.Fl v
flag to
.Xr pkg_add 1 .
This flag can be specified multiple times for increased
.Xr pkg_add 1
verbosity.
.El
.Sh SEE ALSO
.Xr pkg_add 1 ,
.Xr dmesg 8
.Sh AUTHORS
.An -nosplit
The
.Nm
program was written by
.An Alexander Hall Aq alexander@beard.se .
