openbsd/src/usr.sbin/fw_update/fw_update.8
.\" $OpenBSD: fw_update.8,v 1.2 2022/01/06 19:27:01 afresh1 Exp $
.\"
.\" Copyright (c) 2011 Alexander Hall <alexander@beard.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 6 2022 $
.Dt FW_UPDATE 8
.Os
.Sh NAME
.Nm fw_update
.Nd install non-free firmware packages
.Sh SYNOPSIS
.Nm
.Op Fl adFnv
.Op Fl p Ar path
.Op Ar driver | file ...
.Sh DESCRIPTION
The
.Nm
utility installs, updates, or deletes firmware packages for
.Ar driver
from the Internet.
If no
.Ar driver
is specified, the
.Nm
utility tries to determine which firmware is needed on the system.
.Pp
Since firmware with an acceptable license is already present in
.Ox ,
.Nm
exists purely to deal with firmware that may not be freely
distributed with
.Ox .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl a
Install or update firmware for all drivers.
It is an error to specify this option with any
.Ar driver
arguments.
This is enabled by default unless drivers, files or
.Fl d
are specified.
.It Fl d
Delete firmware for
.Ar driver .
If used without parameters, delete all firmware that is not required by
a driver.
If used in conjunction with
.Fl a ,
delete firmware for all drivers.
.It Fl F
Download drivers only.
By default downloads to the current directory.
Secifying a URL with
.Fl p
downloads from that URL,
specifying a path downloads to that directory.
.It Fl n
Dry run.
Do not actually install or update any firmware packages;
just report the steps that would be taken.
.It Fl p Ar path
Use the firmware found at package repository
.Ar path ,
being either a local directory or a URL,
instead of the default location.
.It Fl v
Turn on verbose output.
This flag can be specified multiple times for increased verbosity.
.El
.Pp
Firmware is downloaded from release-specific directories at
.Lk http://firmware.openbsd.org/firmware/ .
The files are in the format required by
.Xr pkg_add 1 ,
but direct use of pkg_add is discouraged.
.Sh ENVIRONMENT
.Bl -tag -width DESTDIRXXX
.It Ev DESTDIR
The root of the system to install into.
.El
.Sh FILES
.Bl -tag -width Ds
.It Pa ${DESTDIR}/usr/share/misc/firmware_patterns
A list of patterns used to detect needed firmware from the
.Xr dmesg 8 .
.It Pa ${DESTDIR}/etc/signify/openbsd-XX-fw.pub
Used with
.Xr signify 1
to verify downloaded firmware files.
.El
.Sh SEE ALSO
.Xr pkg_add 1 ,
.Xr dmesg 8
.Sh AUTHORS
.An -nosplit
The
.Nm
program was designed by
.An Alexander Hall Aq Mt alexander@beard.se ;
it was then replaced with a perl version by
.An Marc Espie Aq Mt espie@openbsd.org .
It was rewritten to be able to be run from the installer by
.An Andrew Hewus Fresh Aq Mt afresh1@openbsd.org .
