openbsd/src/sbin/dhclient/dhclient.conf.5
.\"	$OpenBSD: dhclient.conf.5,v 1.38 2017/12/07 21:47:22 jmc Exp $
.\"
.\" Copyright (c) 1997 The Internet Software Consortium.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of The Internet Software Consortium nor the names
.\"    of its contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE INTERNET SOFTWARE CONSORTIUM AND
.\" CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE INTERNET SOFTWARE CONSORTIUM OR
.\" CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\" ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" This software has been written for the Internet Software Consortium
.\" by Ted Lemon <mellon@fugue.com> in cooperation with Vixie
.\" Enterprises.  To learn more about the Internet Software Consortium,
.\" see ``http://www.isc.org/isc''.  To learn more about Vixie
.\" Enterprises, see ``http://www.vix.com''.
.\"
.Dd $Mdocdate: December 7 2017 $
.Dt DHCLIENT.CONF 5
.Os
.Sh NAME
.Nm dhclient.conf
.Nd DHCP client configuration file
.Sh DESCRIPTION
.Nm
is the configuration file for
.Xr dhclient 8 .
It is a free-form ASCII text file made up of declarations, extra
tabs and newlines for formatting purposes and comments.
Keywords in the file are case-insensitive.
Comments begin with the
.Sq #
character and extend to the end of the current line.
.Sh PROTOCOL TIMING DECLARATIONS
.Bl -tag -width Ds
.It Ic backoff-cutoff Ar seconds ;
Sets the maximum number of seconds to
wait before retransmitting a packet.
The default is 10 seconds.
.It Ic initial-interval Ar seconds ;
Sets the number of seconds between the first packet transmission
and the first retransmission of the packet.
The default is 1 second.
.It Ic link-timeout Ar seconds ;
Sets the number of seconds
to wait for interface link before going into the background as a daemon.
The default is 10 seconds.
.It Ic reboot Ar seconds ;
Sets the number of seconds to wait
before giving up on reacquiring the previous lease, and how long
to attempt unicast renewal requests before falling back to broadcast
renewal requests.
The default is 1 second.
.It Ic retry Ar seconds ;
Sets the number of seconds to wait before starting a new attempt to
obtain a lease.
The default is 1 second.
.It Ic select-timeout Ar seconds ;
Sets the number of seconds to wait for additional leases after the
first lease arrives.
After
.Ic select-timeout
seconds the best lease received will be selected.
The default is 0 seconds, i.e. immediately use
the first acceptable lease received.
.It Ic timeout Ar seconds ;
Sets the number of seconds to wait for a lease.
If no lease is received the first valid lease in
.Xr dhclient.leases 5
will be used.
The default is 30 seonds.
.El
.Sh DHCP OPTION DECLARATIONS
.Bl -tag -width Ds
.It Ic append Ar option option-value ;
Append
.Ar option-value
to the value of
.Ar option
in the lease.
Each
.Ic append
for
.Ar option
overrides any previous
.Ic append ,
.Ic default ,
.Ic prepend
or
.Ic supersede
for
.Ar option .
.It Ic default Ar option option-value ;
If no value for
.Ar option
is present in the lease use
.Ar option-value .
Each
.Ic default
for
.Ar option
overrides any previous
.Ic append ,
.Ic default ,
.Ic prepend
or
.Ic supersede
for
.Ar option .
.It Ic ignore Op Ar option , ... ;
Discard values provided for the listed options.
Each
.Ic ignore
overrides any previous one.
.It Ic prepend Ar option option-value ;
Prepend
.Ar option-value
to the value of
.Ar option
in the lease.
Each
.Ic prepend
for
.Ar option
overrides any previous
.Ic append ,
.Ic default ,
.Ic prepend
or
.Ic supersede
for
.Ar option .
.It Ic request Op Ar option , ... ;
Ask that any lease contain values
for the listed options.
Each
.Ic request
overrides any previous one.
The default is to request the options
bootfile-name
broadcast-address,
classless-static-routes,
host-name,
domain-name,
domain-name-servers,
domain-search,
routers,
subnet-mask,
tftp-server
and
time-offset.
.It Ic send Ar option option-value ;
Include
.Ar option-value
in requests for a lease.
To include multiple options in requests,
.Ic send
can be used multiple times.
.It Ic supersede Ar option option-value ;
Use
.Ar option-value
for the given
.Ar option
regardless of the value in the lease.
Each
.Ic supersede
for
.Ar option
overrides any previous
.Ic append ,
.Ic default ,
.Ic prepend
or
.Ic supersede
for
.Ar option .
.El
.Sh OTHER DECLARATIONS
.Bl -tag -width Ds
.It Ic interface Qo Ar name Qc No { Ar declaration ; ... ; No }
Apply any
.Ar declaration
only to the named interface.
.Ar interface
declarations cannot be nested.
.It Ic reject Ar ip-address ;
Discard leases from the specified address.
If more than one
.Ic reject
is present all leases from any of the
addresses will be discarded.
.It Ic require Op Ar option , ... ;
Discard leases that do not contain all the listed options.
Each
.Ic require
overrides any previous one.
.El
.Sh SEE ALSO
.Xr dhclient.leases 5 ,
.Xr dhcp-options 5 ,
.Xr dhcpd.conf 5 ,
.Xr dhclient 8 ,
.Xr dhcpd 8
