openbsd/src/sbin/dhclient/dhclient.leases.5
.\"	$OpenBSD: dhclient.leases.5,v 1.11 2017/10/23 13:01:20 krw Exp $
.\"
.\" Copyright (c) 1997 The Internet Software Consortium.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of The Internet Software Consortium nor the names
.\"    of its contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE INTERNET SOFTWARE CONSORTIUM AND
.\" CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE INTERNET SOFTWARE CONSORTIUM OR
.\" CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\" ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" This software has been written for the Internet Software Consortium
.\" by Ted Lemon <mellon@fugue.com> in cooperation with Vixie
.\" Enterprises.  To learn more about the Internet Software Consortium,
.\" see ``http://www.isc.org/isc''.  To learn more about Vixie
.\" Enterprises, see ``http://www.vix.com''.
.\"
.Dd $Mdocdate: October 23 2017 $
.Dt DHCLIENT.LEASES 5
.Os
.Sh NAME
.Nm dhclient.leases
.Nd DHCP client lease database
.Sh DESCRIPTION
.Xr dhclient 8
keeps a persistent database of leases that it has acquired that are still
valid.
The database is a free-form ASCII file containing one valid declaration
per lease.
The file is written as a log, so the last declaration is the most recent
lease obtained.
.Pp
The lease file is named
.Pa /var/db/dhclient.leases . Ns Aq Ar IFNAME ,
where
.Qq IFNAME
represents the network interface
.Xr dhclient 8
acquired the lease on.
For example, if
.Xr dhclient 8
is configured for the em0 network device,
the lease file will be named
.Pa /var/db/dhclient.leases.em0 ,
.Pp
A lease statement has the format
.Pp
.D1 Ic lease No { Ar lease-declaration ; ... ; No }
.Pp
Where
.Ar lease\-declaration
is one of:
.Pp
.Bl -tag -width Ds -compact
.It Ic bootp
The lease was acquired using the
BOOTP protocol rather than the DHCP protocol.
.Pp
.It Ic expire Ar date
.It Ic rebind Ar date
.It Ic renew Ar date
.Ic expire
defines when
.Xr dhclient 8
will no longer use the lease to configure the interface.
.Ic rebind
specifies when
.Xr dhclient 8
begins tring to renew the lease with broadcasts to any server.
.Ic renew
specifies when
.Xr dhclient 8
begins trying to renew the lease with unicasts to the originating server.
.Pp
Dates are specified in accordance with the
.Xr strptime 3
format:
.Pp
.D1 %w %Y/%m/%d \&%T UTC
.Pp
For example:
.Pp
.Dl renew 1 2017/10/16 14:03:49 UTC
.Pp
.It Ic filename Qq Ar string
The boot filename.
.Pp
.It Ic fixed-address Ar ip-address
The IPv4 address of the lease.
This is required for all lease statements.
The IPv4 address is specified as a dotted quad (e.g. 12.34.56.78).
.Pp
.It Ic interface Qq Ar string
The interface on which the lease is valid.
Every lease must contain an
.Ic interface
declaration.
.Pp
.It Ic next-server Ar ip-address
The IPv4 address of the boot server.
The IPv4 address is specified as a dotted quad (e.g. 12.34.56.78).
.Pp
.It Ic option Ar option option-value
The value of
.Ar option .
DHCP options are described in
.Xr dhcp-options 5 .
.Pp
.It Ic server-name Qq Ar string
The name of the boot server.
.Pp
.It Ic ssid Qq Ar string
The SSID to which the lease applies.
.El
.Sh FILES
.Bl -tag -width "/var/db/dhclient.leases.IFNAME   "
.It Pa /var/db/dhclient.leases . Ns Aq Ar IFNAME
Persistent database of leases for
.Aq Ar IFNAME .
.El
.Sh SEE ALSO
.Xr dhclient.conf 5 ,
.Xr dhcp-options 5 ,
.Xr dhcpd.conf 5 ,
.Xr dhclient 8 ,
.Xr dhcpd 8
