openbsd/src/usr.sbin/user/groupinfo.8
.\" $OpenBSD: groupinfo.8,v 1.14 2013/07/16 11:13:34 schwarze Exp $
.\" $NetBSD: groupinfo.8,v 1.3 2000/10/03 19:32:23 bjh21 Exp $
.\"
.\" Copyright (c) 1999 Alistair G. Crooks.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Alistair G. Crooks.
.\" 4. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
.\" NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
.\" SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt GROUPINFO 8
.Os
.Sh NAME
.Nm groupinfo
.Nd display group information
.Sh SYNOPSIS
.Nm groupinfo
.Op Fl e
.Ar group
.Sh DESCRIPTION
The
.Nm
utility displays the name, group ID (GID),
and members of the specified
.Ar group .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl e
Do not display anything (quiet mode).
This form of the command is useful for
scripts which need to check whether a particular group
name or GID is already in use on the system.
.El
.Pp
The
.Ar group
argument may be either a group name or a GID.
.Sh EXIT STATUS
The
.Nm
utility exits 0 if
.Ar group
exists, and non-zero if it does not.
.Sh SEE ALSO
.Xr group 5 ,
.Xr passwd 5 ,
.Xr group 8 ,
.Xr userinfo 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Ox 2.7 .
.Sh AUTHORS
The
.Nm
utility was written by
.An Alistair G. Crooks Aq Mt agc@NetBSD.org .
.Sh CAVEATS
If the specified
.Ar group
is the primary group of a user, but that user is not listed as a
member of the
.Ar group
in the
.Xr group 5
file, the
.Nm
utility fails to list that user as a member of the
.Ar group .
