openbsd/src/usr.sbin/user/userinfo.8
.\" $OpenBSD: userinfo.8,v 1.7 2001/08/02 18:37:35 mpech Exp $ */
.\" $NetBSD: userinfo.8,v 1.2 2000/02/28 05:10:57 enami Exp $ */
.\"
.\"
.\" Copyright (c) 1999 Alistair G. Crooks.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Alistair G. Crooks.
.\" 4. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
.\" NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
.\" SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd November 30, 1999
.Dt USERINFO 8
.Os
.Sh NAME
.Nm userinfo
.Nd displays user information
.Sh SYNOPSIS
.Nm userinfo
.Op Fl e
.Op Fl v
.Ar user
.Sh DESCRIPTION
The
.Nm
utility retrieves the user information from the system.
.Pp
The following command line options are recognised:
.Bl -tag -width Ds
.It Fl e
return 0 if the user exists, and non-zero if the
user does not exist, on the system. No information is
displayed. This form of the command is useful for
scripts which need to check whether a particular user
name or uid is already in use on the system.
.It Fl v
perform any actions in a verbose manner.
.El
.Pp
The user argument may either be a user's name, or a uid.
.Pp
The
.Nm
utility exits 0 if the user name or uid exists, and non-zero if it does not.
.Sh FILES
.Bl -tag -width /etc/usermgmt.conf -compact
.It Pa /etc/usermgmt.conf
.El
.Sh SEE ALSO
.Xr passwd 5
.Sh HISTORY
The
.Nm
utility first appeared in
.Ox 2.7 .
.Sh AUTHORS
The
.Nm
utility was written by Alistair G. Crooks (agc@netbsd.org).
