openbsd/src/usr.sbin/user/userdel.8
.\" $OpenBSD: userdel.8,v 1.4 2000/04/25 19:00:21 jakob Exp $ */
.\" $NetBSD: userdel.8,v 1.5 2000/03/13 23:22:55 soren Exp $ */
.\"
.\"
.\" Copyright (c) 1999 Alistair G. Crooks.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Alistair G. Crooks.
.\" 4. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
.\" NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
.\" SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd November 30, 1999
.Dt USERDEL 8
.Os NetBSD
.Sh NAME
.Nm userdel
.Nd remove a user from the system
.Sh SYNOPSIS
.Nm userdel
.Op Fl D
.Op Fl p Ar preserve-value
.Nm userdel
.Op Fl p
.Op Fl r
.Op Fl v
user
.Sh DESCRIPTION
The
.Nm
utility removes a user from the system, optionally
removing that user's home diretory and any subdirectories.
.Pp
The first format of the command shown above (utilising the -D option)
sets and displays the defaults for the
.Nm
utility.
.Bl -tag -width Ds
.It Fl D
without any further options, -D will show the current defaults which
will be used by the
.Nm
utility. Together with one of the options shown for the first version
of the command, -D will set the default to be the new value.
.It Fl p Ar preserve-value
sets the preservation value. If this value is one of "true", "false",
or a non-zero number, then the user login information will be preserved.
.El
.Pp
The following command line options are recognised:
.Bl -tag -width Ds
.It Fl p
preserve the user information in the password file,
but do not allow the user to login, by switching the
password to an "impossible" one, and by setting the
user's shell to the false(1) program.
This option can be helpful in preserving a user's
files for later use by members of that person's
group after the user has moved on.
This value can also be set in the
.Pa /etc/usermgmt.conf
file, using the "preserve" field. If the field
has any of the values "true", "yes", or a non-zero number,
then user information preservation will take place.
.It Fl r
remove the user's home directory, any subdirectories,
and any files and other entries in them.
.It Fl v
perform any actions in a verbose manner.
.El
.Pp
The
.Nm
utility exits 0 on success, and >0 if an error occurs.
.Sh FILES
.Bl -tag -width /etc/usermgmt.conf -compact
.It Pa /etc/usermgmt.conf
.El
.Sh SEE ALSO
.Xr false 1 ,
.Xr passwd 5
.Sh HISTORY
The
.Nm
utility first appeared in
.Nx 1.5 .
.Sh AUTHOR
The
.Nm
utility was written by Alistair G. Crooks (agc@netbsd.org).
