openbsd/src/usr.sbin/user/usermod.8
.\" $NetBSD: usermod.8,v 1.4 2000/02/28 05:10:57 enami Exp $ */
.\"
.\"
.\" Copyright (c) 1999 Alistair G. Crooks.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Alistair G. Crooks.
.\" 4. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
.\" NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
.\" SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd November 30, 1999
.Dt USERMOD 8
.Os NetBSD
.Sh NAME
.Nm usermod
.Nd modify user login information
.Sh SYNOPSIS
.Nm
.Op Fl G Ar secondary-group
.Op Fl c Ar comment
.Op Fl d Ar home-dir
.Op Fl e Ar expiry-time
.Op Fl f Ar inactive-secs
.Op Fl g Ar gid/name/=uid
.Op Fl l Ar new-login
.Op Fl m
.Op Fl o
.Op Fl p Ar password
.Op Fl s Ar shell
.Op Fl u Ar uid
.Op Fl v
.Ar user
.Sh DESCRIPTION
The
.Nm
utility modifies user login information on the system.
Default values for the user are taken from the information
provided in the
.Pa /etc/usermgmt.conf
file.
.Pp
After setting any defaults, and then values from that file,
the command line options are processed:
.Bl -tag -width Ds
.It Fl G Ar secondary-group
is the secondary group to which the user will be added in the
.Pa /etc/group
file.
.It Fl c Ar comment
is the comment field (also, for historical reasons known as the
GECOS field) which will be added for the user, and typically will include
the username, and, perhaps, contact information for the user.
.It Fl d Ar home-directory
is the home directory which will be created and populated for the user,
should the -m option be specified.
.It Fl e Ar secs-to-expiry
provides the number of seconds since the epoch (UTC) at
which the current password change expire. This
can be used to implement password aging.
A value of
0 can be used to switch off this feature.
The default value for this field is 0.
See
.Xr passwd 5
for more details.
This value can be preset for all users
by using the
.Ar expire
field in the
.Pa /etc/usermgmt.conf
file - it has the format:
.Ar expire <secs-to-expiry> .
.It Fl g Ar gid/name/=uid
gives the group name or identifier to be used for the new user's primary group.
If this is
.Ar "-g=uid" ,
then a uid and gid will be picked which are both unique
and the same, and a line added to
.Pa /etc/group
to describe the new group.
This value can be preset for all users
by using the
.Ar gid
field in the
.Xr /usr/share/adduser/defaults
file - it has the format:
.Ar group <groupname/groupid/=uid> .
.It Fl l Ar new-user
gives the new user name.
It must consist of alphanumeric characters, or the characters '.', '-' or '_'.
.It Fl m
moves the home directory from its old position to the new one.
.It Fl o
allows duplicate uids to be given.
.It Fl p Ar password
specifies an already-encrypted password for the new user.
This password can then be changed by using the
.Xr chpass 1
utility.
This value can be preset for all users
by using the
.Ar password
field in the
.Pa /etc/usermgmt.conf
file - it has the format:
.Ar password <encrypted-password> .
.It Fl s Ar shell
specifies the login shell for the new user.
This value can be preset for all users
by using the
.Ar shell
field in the
.Xr /usr/share/adduser/defaults
file - it has the format:
.Ar shell <login-shell> .
.It Fl u Ar uid
specifies a new uid for the user.
Boundaries for this value can be preset for all users
by using the
.Ar range
field in the
.Pa /etc/usermgmt.conf
file - they have the format:
.Ar range <starting-uid>..<ending_uid> .
.It Fl v
enables verbose mode - explain the commands as they are executed.
.El
.Pp
The
.Nm
utility exits 0 on success, and >0 if an error occurs.
.Sh FILES
.Bl -tag -width /etc/usermgmt.conf -compact
.It Pa /etc/usermgmt.conf
.It Pa /etc/skel/.[A-z]*
.It Pa /usr/share/examples/usermgmt
.El
.Sh SEE ALSO
.Xr chpass 1 ,
.Xr passwd 5 ,
.Xr group 5
.Sh HISTORY
The
.Nm
utility first appeared in
.Nx 1.5 .
It is based on the
.Ar addnerd
package by the same author.
.Sh AUTHOR
The
.Nm
utility was written by Alistair G. Crooks (agc@netbsd.org).
