openbsd/src/usr.sbin/user/user.8
.\" $OpenBSD: user.8,v 1.17 2009/01/21 16:56:02 sobrado Exp $
.\" $NetBSD: user.8,v 1.9 2001/06/05 11:31:21 wiz Exp $
.\"
.\" Copyright (c) 1999 Alistair G. Crooks.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Alistair G. Crooks.
.\" 4. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
.\" NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
.\" SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd $Mdocdate: January 21 2009 $
.Dt USER 8
.Os
.Sh NAME
.Nm user
.Nd manage user login information on the system
.Sh SYNOPSIS
.Nm user
.Bk -words
.Cm add
.Fl D
.Op Fl b Ar base-directory
.Op Fl e Ar expiry-time
.Op Fl f Ar inactive-time
.Op Fl g Ar gid/name/=uid
.Op Fl L Ar login-class
.Op Fl r Ar low..high
.Ek
.Nm user
.Bk -words
.Cm add
.Op Fl mov
.Op Fl b Ar base-directory
.Op Fl c Ar comment
.Op Fl d Ar home-directory
.Op Fl e Ar expiry-time
.Op Fl f Ar inactive-time
.Op Fl G Ar secondary-group
.Op Fl g Ar gid/name/=uid
.Op Fl k Ar skel-directory
.Op Fl L Ar login-class
.Op Fl p Ar password
.Op Fl r Ar low..high
.Op Fl s Ar shell
.Op Fl u Ar uid
.Ar user
.Ek
.Nm user
.Cm del
.Fl D
.Op Fl p Ar preserve-value
.Nm user
.Cm del
.Op Fl prv
.Ar user
.Nm user
.Cm info
.Op Fl ev
.Ar user
.Nm user
.Bk -words
.Cm mod
.Op Fl mov
.Op Fl c Ar comment
.Op Fl d Ar home-directory
.Op Fl e Ar expiry-time
.Op Fl f Ar inactive-time
.Op Fl G Ar secondary-group
.Op Fl g Ar gid/name/=uid
.Op Fl L Ar login-class
.Op Fl l Ar new-login
.Op Fl p Ar password
.Op Fl s Ar shell
.Op Fl u Ar uid
.Ar user
.Ek
.Sh DESCRIPTION
The
.Nm
utility acts as a frontend to the
.Xr useradd 8 ,
.Xr usermod 8 ,
.Xr userinfo 8 ,
and
.Xr userdel 8
commands.
.Pp
For a full explanation of the options, please see the relevant manual page.
.Pp
.Ex -std user
.Sh FILES
.Bl -tag -width /etc/usermgmt.conf -compact
.It Pa /etc/skel/.[A-z]*
Skeleton files for new user
.It Pa /etc/usermgmt.conf
Configuration file for
.Nm user ,
.Xr group 8
and those backend commands
.El
.Sh SEE ALSO
.Xr chpass 1 ,
.Xr group 5 ,
.Xr passwd 5 ,
.Xr usermgmt.conf 5 ,
.Xr useradd 8 ,
.Xr userdel 8 ,
.Xr userinfo 8 ,
.Xr usermod 8
.Sh STANDARDS
Other implementations of the
.Nm user
utilities use the
.Ar inactive-time
parameter to refer to the maximum number of days allowed between logins (this
is used to lock "stale" accounts that have not been used for a period of time).
However, on
.Ox
systems this parameter refers instead to the password change time.
This is due to differences in the
.Xr passwd 5
database compared to other operating systems.
.Sh HISTORY
The
.Nm
utility first appeared in
.Ox 2.7 .
.Sh AUTHORS
The
.Nm
utility was written by
.An Alistair G. Crooks Aq agc@NetBSD.org .
