openbsd/src/usr.sbin/user/usermod.8
.\" $OpenBSD: usermod.8,v 1.26 2011/07/18 23:01:10 schwarze Exp $
.\" $NetBSD: usermod.8,v 1.17 2003/02/14 16:11:37 grant Exp $
.\"
.\" Copyright (c) 1999 Alistair G. Crooks.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Alistair G. Crooks.
.\" 4. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
.\" NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
.\" SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd $Mdocdate: July 18 2011 $
.Dt USERMOD 8
.Os
.Sh NAME
.Nm usermod
.Nd modify user login information
.Sh SYNOPSIS
.Nm usermod
.Bk -words
.Op Fl mov
.Op Fl c Ar comment
.Op Fl d Ar home-directory
.Op Fl e Ar expiry-time
.Op Fl f Ar inactive-time
.Op Fl G Ar secondary-group Ns Op , Ns Ar group , Ns ...
.Op Fl g Ar gid | name | Li =uid
.Op Fl L Ar login-class
.Op Fl l Ar new-login
.Op Fl p Ar password
.Op Fl s Ar shell
.Op Fl u Ar uid
.Ar user
.Ek
.Sh DESCRIPTION
The
.Nm
utility modifies user login information on the system.
.Pp
Default values are taken from the information provided in the
.Pa /etc/usermgmt.conf
file, which, if running as root, is created using the built-in defaults if
it does not exist.
.Pp
After setting any defaults, and then reading values from
.Pa /etc/usermgmt.conf ,
the following command line options are processed:
.Bl -tag -width Ds
.It Fl c Ar comment
Sets the comment field (also, for historical reasons known as the
GECOS field) which will be added for the user, and typically will include
the user's full name, and, perhaps, contact information for the user.
.It Fl d Ar home-directory
Sets the home directory to
.Ar home-directory
without populating it; if the
.Fl m
option is specified, tries to move the old home directory to
.Ar home-directory .
.It Fl e Ar expiry-time
Sets the time at which the account expires.
It should be entered in the form
.Dq month day year ,
where month is the month name (the first three characters are
sufficient), day is the day of the month, and year is the year.
Time in seconds since the Epoch (UTC) is also valid.
A value of 0 can be used to disable this feature.
This value can be preset for new users using the
.Ar expire
field in the
.Pa /etc/usermgmt.conf
file.
See
.Xr usermgmt.conf 5
for more details.
.It Fl f Ar inactive-time
Sets the time at which the password expires.
See the
.Fl e
option.
.It Fl G Ar secondary-group Ns Op , Ns Ar group , Ns ...
Sets the secondary groups the user will be a member of in the
.Pa /etc/group
file.
.It Xo
.Fl g Ar gid | name | Li =uid
.Xc
Gives the group name or identifier to be used for the user's primary group.
If this is
.Ql =uid ,
then a UID and GID will be picked which are both unique
and the same, and a line added to
.Pa /etc/group
to describe the new group.
This value can be preset for all users
by using the
.Ar gid
field in the
.Pa /etc/usermgmt.conf
file.
See
.Xr usermgmt.conf 5
for more details.
.It Fl L Ar login-class
This option sets the login class for the user being created.
See
.Xr login.conf 5
for more information on user login classes.
This value can be preset for all users by using the
.Ar class
field in the
.Pa /etc/usermgmt.conf
file.
.Xr usermgmt.conf 5
for more details.
.It Fl l Ar new-login
Gives the new user name.
It must consist of alphanumeric characters, or the characters
.Ql \&. ,
.Ql \&-
or
.Ql \&_ .
.It Fl m
Moves the home directory from its old position to the new one.
If
.Fl d
is not specified, the
.Ar new-user
argument of the
.Fl l
option is used; one of
.Fl d
and
.Fl l
is needed.
.It Fl o
Allows duplicate UIDs to be given.
.It Fl p Ar password
Specifies an already-encrypted password for the user.
This password can then be changed by using the
.Xr chpass 1
utility.
This value can be preset for all users
by using the
.Ar password
field in the
.Pa /etc/usermgmt.conf
file.
See
.Xr usermgmt.conf 5
for more details.
.It Fl s Ar shell
Specifies the login shell for the user.
This value can be preset for all users
by using the
.Ar shell
field in the
.Pa /etc/usermgmt.conf
file.
See
.Xr usermgmt.conf 5
for more details.
.It Fl u Ar uid
Specifies a new UID for the user.
Boundaries for this value can be preset for all users
by using the
.Ar range
field in the
.Pa /etc/usermgmt.conf
file.
See
.Xr usermgmt.conf 5
for more details.
.It Fl v
Enables verbose mode - explain the commands as they are executed.
.El
.Pp
Once the information has been verified,
.Nm
uses
.Xr pwd_mkdb 8
to update the user database.
This is run in the background, and,
at very large sites could take several minutes.
Until this update is completed, the password file is unavailable for other
updates and the new information is not available to programs.
.Sh FILES
.Bl -tag -width /etc/usermgmt.conf -compact
.It Pa /etc/usermgmt.conf
.El
.Sh EXIT STATUS
.Ex -std usermod
.Sh SEE ALSO
.Xr chpass 1 ,
.Xr group 5 ,
.Xr passwd 5 ,
.Xr usermgmt.conf 5 ,
.Xr pwd_mkdb 8
.Sh STANDARDS
Other implementations of the
.Nm usermod
utility use the
.Ar inactive-time
parameter to refer to the maximum number of days allowed between logins (this
is used to lock "stale" accounts that have not been used for a period of time).
However, on
.Ox
systems this parameter refers instead to the password change time.
This is due to differences in the
.Xr passwd 5
database compared to other operating systems.
.Sh HISTORY
The
.Nm
utility first appeared in
.Ox 2.7 .
.Sh AUTHORS
The
.Nm
utility was written by
.An Alistair G. Crooks Aq agc@NetBSD.org .
