openbsd/src/share/man/man4/man4.riscv64/aplic.4
.\"	$OpenBSD: aplic.4,v 1.1 2026/07/24 11:06:28 kettenis Exp $
.\"
.\" Copyright (c) 2026 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 24 2026 $
.Dt APLIC 4 riscv64
.Os
.Sh NAME
.Nm aplic
.Nd Advanced Platform-Level Interrupt Controller
.Sh SYNOPSIS
.Cd "aplic* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver supports the Advanced Platform-Level Interrupt Controller
(APLIC) that is part of the RISC-V Advanced Interrupt Architecture.
.Sh SEE ALSO
.Xr imsic 4 ,
.Xr intro 4
.Rs
.%T The RISC-V Advanced Interrupt Architecture version
.%N Version 1.0
.Sh HISTORY
.Re
The
.Nm
driver first appeared in
.Ox 8.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
