openbsd/src/usr.sbin/gspa/gspa/gspa.1
.\"	$OpenBSD: gspa.1,v 1.2 2002/03/26 23:37:40 miod Exp $
.\"
.\" Copyright (c) 2002 Miodrag Vallat.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL
.\" THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
.\" EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
.\" PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
.\" OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
.\" ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 19, 2002
.Dt GSPA 1
.Os
.Sh NAME
.Nm gspa
.Nd TMS34010 GSP assembler
.Sh SYNOPSIS
.Nm gspa
.Op Fl l Ar file
.Op Fl o Ar file
.Op Ar file
.Sh DESCRIPTION
The
.Nm
command is an assembler for the TMS34010 graphics processor assembly language.
.Pp
Input is taken from the named
.Ar file ,
or from standard input if no file is given.
The options are as follows:
.Bl -tag -width Ds
.It Fl l Ar file
Generate a listing file into
.Ar file .
.It Fl o Ar file
Output the binary code into
.Ar file .
If this option is not specified, the standard output will be used.
.El
.Sh SEE ALSO
.Xr gspahextoc 1
.Sh AUTHORS
Paul Mackerras
.Sh HISTORY
The
.Nm
command appeared in
.Nx 1.1 .
