openbsd/src/share/man/man4/man4.socppc/ipic.4
.\"     $OpenBSD: ipic.4,v 1.1 2008/05/19 20:35:12 kettenis Exp $
.\"
.\" Copyright (c) 2008 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 19 2008 $
.Dt IPIC 4 socppc
.Os
.Sh NAME
.Nm ipic
.Nd integrated programmable interrupt controller
.Sh SYNOPSIS
.Cd ipic0 at obio? addr 0x00700
.Sh DESCRIPTION
The
.Nm
driver manages the integrated programmable interrupt controller (IPIC)
found on the Freescale MPC8349E processor family.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr obio 4 ,
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
