openbsd/src/share/man/man4/man4.socppc/sociic.4
.\"     $OpenBSD: sociic.4,v 1.4 2013/07/16 16:05:49 schwarze Exp $
.\"
.\" Copyright (c) 2008 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt SOCIIC 4 socppc
.Os
.Sh NAME
.Nm sociic
.Nd socppc onboard I2C controller
.Sh SYNOPSIS
.Cd "sociic0 at obio? addr 0x03000 ivec 14"
.Cd "sociic1 at obio? addr 0x03100 ivec 15"
.Cd "iic* at alipm?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the I2C controller found on the Freescale
MPC8349E processor family.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr obio 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
