openbsd/src/share/man/man4/man4.hp300/apci.4
.\"	$OpenBSD: apci.4,v 1.10 2005/09/27 22:05:33 miod Exp $
.\
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
.\" Science Department.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)dca.4	8.1 (Berkeley) 6/9/93
.\"
.Dd September 27, 2005
.Dt APCI 4 hp300
.Os
.Sh NAME
.Nm apci
.Nd Apollo utility chip serial communications interface
.Sh SYNOPSIS
.Cd "apci* at frodo?"
.Sh DESCRIPTION
The
.Nm
driver supports the non-keyboard 8250-like UART connected to the
.Xr frodo 4
Apollo utility chip.
The first UART is used to communicate with the Domain keyboard.
The second is the serial console port when the firmware is in Domain/OS
mode, and is mapped to select code 9 by the HP-UX firmware (except
on 425e models).
As such, the second UART is handled by the
.Xr dca 4
driver on all models but the 425e.
.Pp
There is no tty attached to the first UART as it lacks modem/flow
control and is directly connected to the keyboard connector.
.Pp
Input and output for each line may be set to one of the following baud rates:
50, 75, 110, 134.5, 150, 300, 600, 1200, 1800, 2400, 4800, 9600,
19200, or 38400.
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/ttya[0-3]
.It Pa /dev/cuaa[0-3]
.El
.Sh DIAGNOSTICS
.Bl -diag
.It apci%d: silo overflow.
The single-character input
.Dq silo
has overflowed and incoming data has been lost.
.El
.Sh SEE ALSO
.Xr dca 4 ,
.Xr dcm 4 ,
.Xr dnkbd 4 ,
.Xr frodo 4 ,
.Xr intro 4 ,
.Xr tty 4
.Sh BUGS
Much of the code in the
.Nm
driver could be shared with the
.Xr dca 4
driver.
