openbsd/src/share/man/man4/man4.hp300/dca.4
.\"	$OpenBSD: dca.4,v 1.6 2002/10/01 07:12:30 miod Exp $
.\
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
.\" Science Department.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)dca.4	8.1 (Berkeley) 6/9/93
.\"
.Dd June 9, 1993
.Dt DCA 4 hp300
.Os
.Sh NAME
.Nm dca
.Nd
.Tn HP 98644A
serial communications interface
.Sh SYNOPSIS
.Cd "dca0 at dio? scode 9 flags 1" Pq "on-board serial interfaces"
.Cd "dca* at dio? scode ?"
.Sh DESCRIPTION
The
.Tn 98644A
is a single port
.Tn EIA
.Tn RS-232C
.Pf ( Tn CCITT
.Tn V.28 )
communications interface with a single character buffer.
Such an interface is built-in to all series 300 machines.
.Pp
Input and output for each line may set to one of following baud rates:
50, 75, 110, 134.5, 150, 300, 600, 1200, 1800, 2400, 4800, 9600,
19200, 38400.
.Pp
An optional argument
.Ar flags
may be set to 1 if the line should be treated as hard-wired
with carrier always present or 0 if modem control is desired.
.Sh FILES
.Bl -tag -width Pa
.It Pa /dev/tty[0-3]
.It Pa /dev/cua[0-3]
.El
.Sh DIAGNOSTICS
.Bl -diag
.It dca%d: silo overflow.
The single-character input
.Dq silo
has overflowed and incoming data has been lost.
.El
.Sh SEE ALSO
.Xr apci 4 ,
.Xr dcm 4 ,
.Xr intro 4 ,
.Xr tty 4
.Sh BUGS
Data loss is possible on busy systems with baud rates greater than 300.
The
.Nm
has never been tested with modem control enabled or on anything but the
built-in interface.
