openbsd/src/share/man/man4/man4.hp300/dio.4
.\"	$OpenBSD: dio.4,v 1.9 2008/06/26 05:42:07 ray Exp $
.\"     $NetBSD: dio.4,v 1.2 2002/01/15 01:31:30 wiz Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: June 26 2008 $
.Dt DIO 4 hp300
.Os
.Sh NAME
.Nm dio
.Nd
.Tn DIO/DIO-II bus
.Sh SYNOPSIS
.Cd "dio0 at mainbus0"
.Sh DESCRIPTION
This driver is for the DIO/DIO-II bus on HP 9000/3xx and 9000/4xx series
workstations.
.Sh SUPPORTED DEVICES
The following
.Tn DIO
devices are supported:
.Ss Framebuffers
.Bl -tag -width XXXXXX_4_ -offset indent -compact
.It Xr dvbox 4
.Tn HP98730
.Dq DaVinci
frame buffer
.It Xr gbox 4
.Tn HP98700
.Dq Gatorbox
frame buffer
.It Xr hyper 4
.Tn A1096A
.Dq Hyperion
frame buffer
.It Xr rbox 4
.Tn HP98720
.Dq Renaissance
frame buffer
.It Xr topcat 4
.Tn HP98544
.Dq Topcat ,
.Tn HP98550
.Dq Catseye
and
.Tn A1416A
.Dq Kathmandu
frame buffers
.It Xr tvrx 4
HP98705
TurboVRX
.Dq Tigershark
frame buffer
.El
.Ss Serial interfaces
.Bl -tag -width XXXXXX_4_ -offset indent -compact
.It Xr dca 4
.Tn HP98644A
serial communications interface
.It Xr dcm 4
.Tn HP98642A
serial communications multiplexer
.El
.Ss Network interfaces
.Bl -tag -width XXXXXX_4_ -offset indent -compact
.It Xr le 4
.Tn HP98643
built-in and add-on Ethernet boards
.El
.Ss HP-IB interfaces
.Bl -tag -width XXXXXX_4_ -offset indent -compact
.It Xr fhpib 4
.Dq fast
HP-IB interface
.It Xr nhpib 4
.Dq normal
HP-IB interface
.El
.Ss SCSI interfaces
.Bl -tag -width XXXXXX_4_ -offset indent -compact
.It Xr spc 4
HP 98658 SCSI host adaptor
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sgc 4
