openbsd/src/share/man/man4/man4.hp300/dnkbd.4
.\"	$OpenBSD: dnkbd.4,v 1.8 2007/05/31 19:19:54 jmc Exp $
.\"
.\" Copyright (c) 2005, Miodrag Vallat
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt DNKBD 4 hp300
.Os
.Sh NAME
.Nm dnkbd
.Nd Apollo Domain keyboard and mouse
.Sh SYNOPSIS
.Cd "dnkbd0   at frodo?"
.Cd "wskbd*   at dnkbd? mux 1"
.Cd "wsmouse* at dnkbd? mux 0"
.Sh DESCRIPTION
The
.Nm
driver supports the first 8250-like UART connected to the
.Xr frodo 4
Apollo utility chip;
this UART is physically connected to the
.Sq Domain keyboard
connector.
The Apollo mouse plugs itself in a dedicated connector on the top left of
the keyboard.
.Pp
The
.Nm
driver doesn't provide any direct entry point, but makes its functionality
available through the internal
.Xr wskbd 4
and
.Xr wsmouse 4
interfaces.
.Pp
The
.Nm
driver supports all the keyboard layouts, which can be selected with
.Xr wsconsctl 8
(variable:
.Dq keyboard.encoding ) .
The layouts are:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It KB_DE
.Pq de
German with
.Dq dead accents .
.It KB_DK
.Pq dk
Norwegian/Danish with
.Dq dead accents .
.It KB_FR
.Pq fr
French.
.It KB_JP
.Pq jp
Japanese.
.It KB_SG
.Pq sg
Swiss German with
.Dq dead accents .
.It KB_SV
.Pq sv
Swedish/Finnish with
.Dq dead accents .
.It KB_UK
.Pq uk
UK English.
.It KB_US
.Pq us
US English (this is the default mapping).
.El
.Pp
All layouts with
.Dq dead accents
can be used in the KB_NODEAD
.Pq .nodead
variant.
This switches off the
.Dq dead accents .
.Sh SEE ALSO
.Xr apci 4 ,
.Xr frodo 4 ,
.Xr hilkbd 4 ,
.Xr hilms 4 ,
.Xr intro 4 ,
.Xr wskbd 4 ,
.Xr wsconsctl 8
.Sh CAVEATS
The Domain keyboard provides ten function keys, numbered
.Em F0
to
.Em F9 ,
while the common
.Ux
usage is to number them from
.Em F1
onwards.
To attempt minimizing confusion between the actual key labels and their
associated actions,
.Ox
assigns the
.Em F10
functionality to the
.Em F0
key, and the
.Em F1
to
.Em F9
functionality to the corresponding keys.
.Pp
Due to hardware peculiarities, it is not possible to remap the
.Sq Caps Lock
key as a modifier key, such as
.Sq Control .
