openbsd/src/share/man/man4/man4.hp300/dvbox.4
.\"	$OpenBSD: dvbox.4,v 1.7 2005/01/14 22:39:21 miod Exp $
.\"
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
.\" Science Department.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)dv.4	8.1 (Berkeley) 6/9/93
.\"
.Dd January 12, 2005
.Dt DVBOX 4 hp300
.Os
.Sh NAME
.Nm dvbox
.Nd
.Tn HP98730
DaVinci frame buffer
.Sh SYNOPSIS
.Cd "dvbox*     at intio?"
.Cd "dvbox*     at dio?"
.Cd "wsdisplay* at dvbox?"
.Sh DESCRIPTION
The
.Tn HP98730
and
.Tn HP98731
are stackable 4-bit color frame buffers,
also known as the DaVinci.
By adding up to 7
.Tn HP98732A
frame buffer extensions, it is possible to add overlay planes.
.Pp
The
.Nm
driver provides a frame buffer abstraction to the
.Xr wscons 4
console framework.
.Pp
The DaVinci can be configured at either the ``internal'' address
(frame buffer address 0x200000, control register space address 0x560000)
or at an external select code less than 32.
The hardware installation manual describes the procedure for
setting these values.
.Sh SEE ALSO
.Xr gbox 4 ,
.Xr hyper 4 ,
.Xr intro 4 ,
.Xr rbox 4 ,
.Xr sti 4 ,
.Xr topcat 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh BUGS
This driver has not been tested with all possible combinations of frame
buffer boards and scan boards installed in the device.
