openbsd/src/share/man/man4/man4.hp300/gbox.4
.\"	$OpenBSD: gbox.4,v 1.1 2003/03/16 20:12:50 miod Exp $
.\"
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
.\" Science Department.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)gb.4	8.1 (Berkeley) 6/9/93
.\"
.Dd March 16, 2003
.Dt GBOX 4 hp300
.Os
.Sh NAME
.Nm gbox
.Nd
.Tn HP98700
.Dq Gatorbox
frame buffer
.Sh SYNOPSIS
.Cd "gbox* at intio?"
.Cd "gbox* at dio? scode ?"
.Cd "grf*  at gbox?"
.Sh DESCRIPTION
The
.Tn HP98700
and
.Tn HP98710
are 4- and 8-bit color frame buffers,
also known as the Gatorbox.
.Pp
The term
.Dq Gator
will often be used, and it is not to be
confused with
.Dq Gator
used in reference to an
.Tn HP
9837 or 200/237 machine.
Also, the term
.Dq Gatorbox
is used for the 98700 alone, with the 98701 frame
buffer memory or with the 98710 accelerator installed.
.Pp
The
.Nm
driver provides a frame buffer abstraction to the
.Xr grf 4
driver, and the associated
.Xr ite 4
console framework.
.Pp
The 98700 can be used as the only graphics device on a system, in which case
it will be used as the system console.
It can also be installed as a secondary display device.
For the first case, the
.Tn HP98287A M.A.D.
interface card
should be set to internal control space.
This will put the frame buffer at the DIO address 0x200000 and the control
registers at 0x560000.
At this address it will be the ``preferred'' console device (see
.Xr cons 4 ) .
For use as a secondary device,
the 98287A should be set to frame buffer address 0x300000,
and to an external select code.
.Pp
It should be noted that this configuration will conflict with the 98547
display card which has a 2 megabyte frame buffer starting at address 0x200000.
The 98700 should only be installed as a secondary device in a machine with a
1 bit 98544 display card or 4 bit 98545 card.
The
.%T 98700H Installation Guide
contains further configuration information.
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr dvbox 4 ,
.Xr grf 4 ,
.Xr hyper 4 ,
.Xr intro 4 ,
.Xr rbox 4 ,
.Xr topcat 4
