openbsd/src/share/man/man4/man4.hp300/hd.4
.\"	$OpenBSD: hd.4,v 1.17 2013/06/02 20:42:27 tedu Exp $
.\"
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
.\" Science Department.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)rd.4	8.1 (Berkeley) 6/9/93
.\"
.Dd $Mdocdate: June 2 2013 $
.Dt HD 4 hp300
.Os
.Sh NAME
.Nm hd
.Nd
.Tn CS/80
disk interface
.Sh SYNOPSIS
.Cd "hd* at hpibbus?"
.Sh DESCRIPTION
This is a generic
.Tn CS/80
disk driver.
Only a small number of possible
.Tn CS/80
drives are supported,
but others can easily be added by adding tables to the driver.
.Sh DISK SUPPORT
The driver interrogates the controller
to determine the type of drive attached.
The driver recognizes the following drives:
7912, 7914, 7933, 7936, 7937, 7945,
.Tn 757A/B ,
.Tn 7958A/B ,
.Tn 7959B ,
7962, 7963, 9122, 9134, 7912, 7936,
and 9122,
not all of which have been tested.
.Sh FILES
.Bl -tag -width /dev/rhd[0-7][a-p] -compact
.It Pa /dev/hd[0-7][a-p]
block files
.It Pa /dev/rhd[0-7][a-p]
raw files
.El
.Sh DIAGNOSTICS
.Bl -diag
.It "hd0 err: vNN uNN, R0xXX F0xXX A0xXX I0xXX, block N"
An unrecoverable data error occurred during transfer of the
specified block on the specified disk.
.El
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr \&ct 4 ,
.Xr hpibbus 4 ,
.Xr intro 4 ,
.Xr sd 4 ,
.Xr st 4 ,
.Xr uk 4
.Sh BUGS
.Tn CS/80
drives have 256 byte sectors which are mapped to 512 byte
``sectors'' by the driver.
Since some
.Tn CS/80
drives have an odd number of sectors per cylinder,
the disk geometry used is not always accurate.
.Pp
A program to analyze the logged error information (even in its
present reduced form) is needed.
