openbsd/src/share/man/man4/man4.hp300/hyper.4
.\"	$OpenBSD: hyper.4,v 1.2 2003/03/18 15:50:48 miod Exp $
.\"
.\" Copyright (c) 2003, Miodrag Vallat.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 16, 2003
.Dt HYPER 4 hp300
.Os
.Sh NAME
.Nm hyper
.Nd
.Tn HP A1096A
.Dq Hyperion
frame buffer
.Sh SYNOPSIS
.Cd "hyper* at dio? scode ?"
.Cd "grf*   at hyper?"
.Sh DESCRIPTION
The
.Dq Hyperion
is a monochrome frame buffer.
.Pp
The
.Nm
driver provides a frame buffer abstraction to the
.Xr grf 4
driver, and the associated
.Xr ite 4
console framework.
.Sh SEE ALSO
.Xr dvbox 4 ,
.Xr gbox 4 ,
.Xr grf 4 ,
.Xr intro 4 ,
.Xr ite 4 ,
.Xr rbox 4 ,
.Xr topcat 4
