openbsd/src/share/man/man4/man4.hp300/intro.4
.\"	$OpenBSD: intro.4,v 1.32 2011/12/30 12:47:20 miod Exp $
.\"
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)intro.4	8.1 (Berkeley) 6/5/93
.\"
.Dd $Mdocdate: December 30 2011 $
.Dt INTRO 4 hp300
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files,
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Sx SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Sx DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the
.Tn HP
9000/300 and 9000/400 series.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system will have to be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.
Pseudo-devices are not listed.
Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
Occasionally, new devices of a similar type may be added
simply by creating appropriate table entries in the driver;
for example, new
.Tn CS/80
drives.
.Pp
.Bl -tag -width 10n -compact -offset indent
.It Xr apci 4
Apollo utility chip serial communications interface
.It Xr arcofi 4
Siemens PSB2160 audio codec
.It Xr \&ct 4
CS/80 cartridge tape interface
.It Xr dca 4
HP 98644A serial communications interface
.It Xr dcm 4
HP 98642A serial communications multiplexer
.It Xr dio 4
DIO/DIO-II bus
.It Xr dnkbd 4
Apollo Domain keyboard and mouse
.It Xr dvbox 4
HP98730 DaVinci frame buffer
.It Xr frodo 4
Apollo Utility Chip
.It Xr gbox 4
HP98700 Gatorbox frame buffer
.It Xr hd 4
CS/80 disk interface
.It Xr hil 4
introduction to HP-HIL support
.It Xr hpibbus 4
HP-IB bus interface
.It Xr hyper 4
HP A1096A Hyperion frame buffer
.It Xr isabr 4
Frodo ISA bridge
.It Xr le 4
AMD LANCE Ethernet device
.It Xr nhpib 4
built-in 98624 and 98625 HP-IB interfaces
.It Xr ppi 4
HP-IB printer/plotter interface
.It Xr rbox 4
HP98720 Renaissance frame buffer
.It Xr sgc 4
Standard Graphics Connection bus
.It Xr spc 4
HP 98658 SCSI host adaptor driver
.It Xr sti 4
HP Standard Text Interface
.It Xr topcat 4
Topcat, Catseye and Kathmandu frame buffers
.It Xr tvrx 4
HP98705 PersonalVRX
.Dq Tigershark
frame buffer
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HISTORY
The
.Tn HP300
.Nm intro
first appeared in
.Bx 4.3 Reno .
