openbsd/src/share/man/man4/man4.hp300/intro.4
.\"	$OpenBSD: intro.4,v 1.15 2003/03/19 11:14:25 miod Exp $
.\"
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)intro.4	8.1 (Berkeley) 6/5/93
.\"
.Dd June 5, 1993
.Dt INTRO 4 hp300
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files, 
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the
.Tn HP
9000/300 series.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system will have to be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.
Pseudo-devices are not listed. 
Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
Occasionally, new devices of a similar type may be added
simply by creating appropriate table entries in the driver;
for example, new
.Tn CS/80
drives.
.Pp
.Bl -tag -width topcat_4_ -compact -offset indent
.It Xr apci 4
Apollo utility chip serial interface.
.It Xr \&ct 4
7946/9144 CS/80 cartridge tape.
.It Xr dca 4
98644 built-in serial interface.
.It Xr dcm 4
HP 98642A communications multiplexer.
.It Xr dio 4
DIO/DIO-II bus.
.It Xr dvbox 4
.Tn HP98730
.Dq DaVinci
frame buffer.
.It Xr gbox 4
.Tn HP98700
.Dq Gatorbox
frame buffer.
.It Xr grf 4
Generic frame buffer interface for
.Xr ite 4 .
.It Xr hd 4
CS/80 disk interface.
.It Xr hil 4
HIL interface.
.It Xr hpibbus 4
Built-in and 98625 HP-IB interface.
.It Xr hyper 4
.Tn A1096A
.Dq Hyperion
frame buffer.
.It Xr ite 4
HP Internal Terminal Emulator.
.It Xr le 4
98643 Lance-based ethernet interface.
.It Xr oscsi
Old HP300 SCSI interface.
.It Xr ppi 4
HP-IB printer/plotter interface.
.It Xr rbox 4
.Tn HP98720
.Dq Renaissance
frame buffer.
.It Xr sd 4
SCSI disk drives.
.It Xr st 4
CCS SCSI tape drives.
.It Xr topcat 4
.Tn HP98544
.Dq Topcat ,
.Tn HP98550
.Dq Catseye
and
.Tn A1416A
.Dq Kathmandu
frame buffers.
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HISTORY
The
.Tn HP300
.Nm intro
first appeared in
.Bx 4.3 Reno .
