openbsd/src/share/man/man4/man4.hp300/isabr.4
.\"	$OpenBSD: isabr.4,v 1.3 2007/05/31 19:19:54 jmc Exp $
.\"
.\" Copyright (c) 2007 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice, this permission notice, and the disclaimer below
.\" appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt ISABR 4 hp300
.Os
.Sh NAME
.Nm isabr
.Nd Frodo ISA bridge
.Sh SYNOPSIS
.Cd "isabr0 at frodo?"
.Cd "isa* at isabr?"
.Sh DESCRIPTION
The
.Nm
driver provides access to the ISA slot found in model
.Sq t
HP 9000/4xx workstations.
.Sh SEE ALSO
.Xr frodo 4 ,
.Xr intro 4 ,
.Xr isa 4
.Sh CAVEATS
Interrupt numbers 0, 1, 2 and 8 are permanently masked on hp300 systems.
Therefore ISA devices should not configured to use them.
.Sh BUGS
ISA interrupts are not handled correctly.
Some devices cause the
.Xr frodo 4
chip to interrupt, but without any change in its status registers;
others will correctly interrupt, but
.Xr frodo 4
will not ack the interrupt, resulting in an interrupt storm.
.Pp
The 4-slot EISA bridge found in model
.Sq s
workstations is not supported yet.
