openbsd/src/share/man/man4/man4.hp300/nhpib.4
.\"	$OpenBSD: nhpib.4,v 1.8 2008/04/01 14:22:28 jmc Exp $
.\"     $NetBSD: hpib.4,v 1.2 2002/01/15 01:35:44 wiz Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: April 1 2008 $
.Dt NHPIB 4 hp300
.Os
.Sh NAME
.Nm nhpib ,
.Nm fhpib
.Nd built-in 98624 and 98625 HP-IB interfaces
.Sh SYNOPSIS
.Cd "nhpib*	at dio?                " Pq "built-in and 98624 HP-IB interface"
.Cd "hpibbus*	at nhpib?"
.Cd "fhpib*	at dio?                " Pq "98625 fast HP-IB interface"
.Cd "hpibbus*	at fhpib?"
.Sh DESCRIPTION
The
.Nm
driver supports the built-in and 98624 HP-IB interfaces, while the
.Nm fhpib
driver supports the faster 98625 HP-IB interface.
.Sh SEE ALSO
.Xr dio 4 ,
.Xr hpibbus 4 ,
.Xr intro 4
