openbsd/src/share/man/man4/man4.hp300/oscsi.4
.\"	$OpenBSD: oscsi.4,v 1.1 2003/03/16 20:12:51 miod Exp $
.\"     $NetBSD: oscsi.4,v 1.2 2002/01/15 01:36:36 wiz Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 11, 2001
.Dt OSCSI 4 hp300
.Os
.Sh NAME
.Nm oscsi
.Nd
.Tn old HP300 CCS SCSI interface
.Sh SYNOPSIS
.Cd "oscsi*  at dio? scode ?"
.Cd "sd*     at oscsi? target ? lun ?"
.Cd "st*     at oscsi? target ? lun ?"
.Cd "ac*     at oscsi? target ? lun ?"
.Sh DESCRIPTION
The
.Nm
driver supports the SCSI interface on HP 9000/3xx and 9000/4xx series
workstations.
.Sh SEE ALSO
.\".Xr ac 4 ,
.Xr dio 4 ,
.Xr intro 4 ,
.Xr sd 4 ,
.Xr st 4
.Sh BUGS
The current interface should be replaced with the
machine-independent SCSI subsystem.
