openbsd/src/share/man/man4/man4.hp300/sgc.4
.\"	$OpenBSD: sgc.4,v 1.3 2007/05/31 19:19:54 jmc Exp $
.\"
.\" Copyright (c) 2005, Miodrag Vallat
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt SGC 4 hp300
.Os
.Sh NAME
.Nm sgc
.Nd Standard Graphics Connection bus
.Sh SYNOPSIS
.Cd "sgc0 at mainbus0"
.Sh DESCRIPTION
The SGC bus was designed by
.Tn HP
as a standard interface to connect graphics products to workstations.
The
.Nm
driver provides support for the SGC bus found on some HP 9000/4xx series
workstations.
.Sh SUPPORTED DEVICES
The following SGC devices are supported:
.Ss Framebuffers
.Bl -tag -width xxxxxx -offset indent -compact
.It Xr sti 4
HP Standard Text Interface
.El
.Sh SEE ALSO
.Xr dio 4 ,
.Xr intro 4 ,
.Xr sti 4
