openbsd/src/share/man/man4/man4.hp300/spc.4
.\"	$OpenBSD: spc.4,v 1.6 2012/08/14 01:08:19 dlg Exp $
.\"	$NetBSD: spc.4,v 1.1 2003/08/01 02:36:04 tsutsui Exp $
.\"
.\" Copyright (c) 2003 Izumi Tsutsui.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: August 14 2012 $
.Dt SPC 4 hp300
.Os
.Sh NAME
.Nm spc
.Nd HP 98658 SCSI host adaptor driver
.Sh SYNOPSIS
.Cd "spc* at dio? flags 0x00"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn Fujitsu
MB87030/MB89352
.Tn SCSI
Protocol Controller (SPC) chips, used as part of the
.Tn HP
98658 SCSI interface.
If the device
.Cm flags
are specified with a value of 1, the driver will not attempt to use DMA.
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr dio 4 ,
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr st 4 ,
.Xr uk 4
.Sh BUGS
Synchronous data transfers are not currently supported.
