openbsd/src/share/man/man4/man4.hp300/topcat.4
.\"	$OpenBSD: topcat.4,v 1.11 2005/01/16 01:43:06 jmc Exp $
.\"
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
.\" Science Department.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)tc.4	8.1 (Berkeley) 6/9/93
.\"
.Dd January 12, 2005
.Dt TOPCAT 4 hp300
.Os
.Sh NAME
.Nm topcat
.Nd
Topcat,
Catseye
and
Kathmandu
frame buffers
.Sh SYNOPSIS
.Cd "topcat*    at intio?"
.Cd "topcat*    at dio?"
.Cd "wsdisplay* at topcat?"
.Sh DESCRIPTION
The
HP98543, HP98544, HP98545A and HP98547A Topcat,
as well as the
HP98548A, HP98549A and HP98550A Catseye
and the
A1416A Kathmandu
are accelerated frame buffers, with the following resolution and color depth:
.Pp
.Bl -tag -width A1416A -offset indent -compact
.It 98543
512x400 4-bit color Topcat
.It 98544
1024x768 monochrome Topcat
.It 98545A
1024x768 4-bit color Topcat
.It 98547A
1024x768 6-bit color Topcat
.It 98548A
1280x1024 monochrome Catseye
.It 98549A
1024x768 6-bit color Catseye
.It 98550A
1280x1024 8-bit color Catseye
.It A1416A
1280x1024 8-bit color Kathmandu
.El
.Pp
The
.Nm
driver provides a frame buffer abstraction to the
.Xr wscons 4
console framework.
.Pp
The Topcat display cards are not user configurable.
If one is present on a
system, it will always have a frame buffer address of 0x200000 and a control
register address of 0x560000.
.Pp
The Catseye and Kathmandu cards can be configured using the on-board 8 DIP
switches selector to define the
.Dq select code .
A select code of 1 will use the same settings as the Topcat cards.
.Sh SEE ALSO
.Xr dvbox 4 ,
.Xr gbox 4 ,
.Xr hyper 4 ,
.Xr intro 4 ,
.Xr rbox 4 ,
.Xr sti 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
