openbsd/src/share/man/man4/man4.hp300/tvrx.4
.\"	$OpenBSD: tvrx.4,v 1.3 2008/03/26 08:11:08 jmc Exp $
.\"
.\" Copyright (c) 2006, Miodrag Vallat
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 26 2008 $
.Dt TVRX 4 hp300
.Os
.Sh NAME
.Nm tvrx
.Nd HP98705 TurboVRX
.Dq TigerShark
frame buffer
.Sh SYNOPSIS
.Cd "tvrx*      at dio?"
.Cd "wsdisplay* at tvrx?"
.Sh DESCRIPTION
The TurboVRX frame buffer is an accelerated, high resolution
.Pq 1280x1024
external display, connected to a 98702 DIO-II interface board.
Models 98705A and 98705C are 8-bit color frame buffers, while model
98705B is 16-bit color with a 16-bit Z-buffer.
All models also have four overlay planes.
.Pp
The
.Nm
driver provides a frame buffer abstraction to the
.Xr wscons 4
console framework.
.Pp
Currently, the driver can only use one overlay plane, and will run as an
unaccelerated monochrome frame buffer.
.Pp
The TurboVRX cards can be configured using the 5 DIP switches selector on
the interface board to define the
.Dq select code .
The select code value is computed by adding 133 to the number made from the
five binary digits.
The default settings, with the two MSB switches set to 1 and the three LSB
switches set to 0, provide a select code of 157.
.Sh SEE ALSO
.Xr dio 4 ,
.Xr intro 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
