openbsd/src/usr.bin/rpcinfo/rpcinfo.8
.\"	$OpenBSD: rpcinfo.8,v 1.13 2007/05/31 19:20:15 jmc Exp $
.\"	from: @(#)rpcinfo.8c	2.2 88/08/03 4.0 RPCSRC; from 1.24 88/02/25 SMI
.\"
.\" Copyright (C) 1986, Sun Microsystems, Inc.
.\"
.\"
.\" Sun RPC is a product of Sun Microsystems, Inc. and is provided for
.\" unrestricted use provided that this legend is included on all tape
.\" media and as a part of the software program in whole or part.  Users
.\" may copy or modify Sun RPC without charge, but are not authorized
.\" to license or distribute it to anyone else except as part of a product or
.\" program developed by the user.
.\"
.\" SUN RPC IS PROVIDED AS IS WITH NO WARRANTIES OF ANY KIND INCLUDING THE
.\" WARRANTIES OF DESIGN, MERCHANTIBILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE, OR ARISING FROM A COURSE OF DEALING, USAGE OR TRADE PRACTICE.
.\"
.\" Sun RPC is provided with no support and without any obligation on the
.\" part of Sun Microsystems, Inc. to assist in its use, correction,
.\" modification or enhancement.
.\"
.\" SUN MICROSYSTEMS, INC. SHALL HAVE NO LIABILITY WITH RESPECT TO THE
.\" INFRINGEMENT OF COPYRIGHTS, TRADE SECRETS OR ANY PATENTS BY SUN RPC
.\" OR ANY PART THEREOF.
.\"
.\" In no event will Sun Microsystems, Inc. be liable for any lost revenue
.\" or profits or other special, indirect and consequential damages, even if
.\" Sun has been advised of the possibility of such damages.
.\"
.\" Sun Microsystems, Inc.
.\" 2550 Garcia Avenue
.\" Mountain View, California  94043
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt RPCINFO 8
.Os
.Sh NAME
.Nm rpcinfo
.Nd report RPC information
.Sh SYNOPSIS
.Nm rpcinfo
.Fl b Ar program version
.Nm rpcinfo
.Fl d Ar program version
.Nm rpcinfo
.Fl p Op Ar host
.Nm rpcinfo
.Fl s Ar program version port
.Nm rpcinfo
.Op Fl n Ar portnum
.Fl t Ar host program
.Op Ar version
.Nm rpcinfo
.Op Fl n Ar portnum
.Fl u Ar host program
.Op Ar version
.Sh DESCRIPTION
.Nm
makes an
.Tn RPC
call to an
.Tn RPC
server and reports what it finds.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl b
Make an
.Tn RPC
broadcast to procedure 0 of the specified
.Ar program
and
.Ar version
using
.Tn UDP
and report all hosts that respond.
.It Fl d
Delete registration for the
.Tn RPC
service of the specified
.Ar program
and
.Ar version .
Registrations which point at ports numbered below 1024 can only be
deleted by the superuser.
.It Fl n Ar portnum
Use
.Ar portnum
as the port number for the
.Fl t
and
.Fl u
options instead of the port number given by the portmapper.
.It Fl p
Probe the portmapper on
.Ar host ,
and print a list of all registered
.Tn RPC
programs.
If
.Ar host
is not specified, it defaults to the value returned by
.Xr hostname 1 .
.It Fl s
Create a registration for the
.Tn RPC
service of the specified
.Ar program
and
.Ar version ,
located at port
.Ar port .
Registrations which point at ports numbered below 1024 can only be
created (or changed) by the superuser.
.It Fl t
Make an
.Tn RPC
call to procedure 0 of
.Ar program
on the specified
.Ar host
using
.Tn TCP ,
and report whether a response was received.
.It Fl u
Make an
.Tn RPC
call to procedure 0 of
.Ar program
on the specified
.Ar host
using
.Tn UDP ,
and report whether a response was received.
.El
.Pp
The
.Ar program
argument can be either a name or a number.
.Pp
If a
.Ar version
is specified,
.Nm
attempts to call that version of the specified
.Ar program .
Otherwise,
.Nm
attempts to find all the registered version
numbers for the specified
.Ar program
by calling version 0 (which is presumed not
to exist; if it does exist,
.Nm
attempts to obtain this information by calling
an extremely high version
number instead) and attempts to call each registered version.
Note: the version number is required for
.Fl b
and
.Fl d
options.
.Sh EXAMPLES
To show all of the
.Tn RPC
services registered on the local machine use:
.Pp
.Dl $ rpcinfo -p
.Pp
To show all of the
.Tn RPC
services registered on the machine named
.Ar klaxon
use:
.Pp
.Dl $ rpcinfo -p klaxon
.Pp
To show all machines on the local net that are running the Yellow Pages
service use:
.Pp
.Dl $ rpcinfo -b ypserv 'version' | uniq
.Pp
where 'version' is the current Yellow Pages version obtained from the
results of the
.Fl p
switch above.
.Pp
To delete the registration for version 1 of the
.Nm walld
service use:
.Pp
.Dl $ rpcinfo -d walld 1
.Sh SEE ALSO
.Xr rpc 5 ,
.Xr portmap 8
.Rs
.%T "RPC Programming Guide"
.Re
.Sh BUGS
In releases prior to SunOS 3.0, the Network File System (NFS) did not
register itself with the portmapper;
.Nm
cannot be used to make
.Tn RPC
calls to the
.Tn NFS
server on hosts running such releases.
