openbsd/src/usr.sbin/wsconscfg/wsconscfg.8
.\"	$OpenBSD: wsconscfg.8,v 1.20 2010/07/01 02:46:06 maja Exp $
.\"	$NetBSD: wsconscfg.8,v 1.5 1999/05/15 14:45:06 drochner Exp $
.\"
.\" Copyright (c) 1999
.\" 	Matthias Drochner.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: July 1 2010 $
.Dt WSCONSCFG 8
.Os
.Sh NAME
.Nm wsconscfg
.Nd configure virtual terminals on a wscons display
.Sh SYNOPSIS
.Nm wsconscfg
.Op Fl dFkm
.Op Fl e Ar emul
.Op Fl f Ar ctldev
.Op Fl t Ar type
.Ar index
.Sh DESCRIPTION
The
.Nm
tool allows for the creation and removal of virtual terminals
on display devices controlled by the wscons terminal framework,
as long as the underlying display hardware driver supports multiple screens.
Furthermore, it controls the assignment of keyboards to displays.
.Pp
The
.Ar index
argument specifies which virtual terminal is to be configured.
Valid numbers range from 0 to an implementation-specified value
(currently 11, allowing for 12 virtual terminals on a display).
In keyboard configuration mode
(see
.Fl k ,
below),
it specifies the
.Xr wskbd 4
device to attach or detach.
Without further option arguments, a virtual terminal is created with
implementation specific properties and a default terminal emulation variant
selected at kernel compile time.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d
Delete the specified terminal.
Any specified terminal that is currently open by a program will not be deleted
unless the
.Fl F
option is also given.
Terminals used by the operating system console or a graphics program (X server)
cannot be deleted.
With the
.Fl k
flag, the keyboard specified by
.Ar index
will be detached from the wscons display.
With the
.Fl m
flag, the multiplexor specified by
.Ar index
will be detached from the wscons display.
.It Fl e Ar emul
Specify the terminal emulation to use for the virtual terminal.
The set of available terminal emulations is determined at kernel compile time.
See
.Xr wscons 4
for details.
.It Fl F
Force deletion of a terminal, keyboard, or multiplexor,
even if it is in use by a userspace program.
.It Fl f Ar ctldev
Specify the control device of the wscons display to operate on.
The default is
.Pa /dev/ttyCcfg .
.It Fl k
Do keyboard related operations instead of virtual screen configuration.
Without other flags, a keyboard will be attached to the display device.
The
.Ar index
argument can be omitted: in that case the first free keyboard will be used.
.It Fl m
Do multiplexor related operations instead of virtual screen configuration.
Without other flags, a multiplexor will be attached to the display device.
.It Fl t Ar type
Specify a screen type to use.
Screen types refer to display format, color depth, and other low-level
display properties.
Valid
.Ar type
arguments are defined by the underlying display device driver.
.El
.\" .Pp
.\" Typically, the
.\" .Nm
.\" utility will be invoked in system startup by the
.\" .Pa /etc/rc.wscons
.\" script, controlled by the
.\" .Pa /etc/wscons.conf
.\" configuration file.
.Sh EXAMPLES
Configure screen 1 (i.e., the second) for type
.Dq 80x50
and VT100 terminal emulation.
(Note:
.Dq 80x50
is a screen type offered by the
.Xr vga 4
display driver.
In this particular case, an 8x8-font must be loaded beforehand to make the
screen useful.
See
.Xr wsfontload 8 . )
.Pp
.D1 # wsconscfg -t 80x50 -e vt100 1
.Pp
Connect the first unconnected keyboard to the display:
.Pp
.Dl # wsconscfg -k
.\" .Sh FILES
.\" .Bl -tag -width /etc/wscons.conf -compact
.\" .It Pa /etc/wscons.conf
.\" wscons configuration file
.\" .El
.Sh SEE ALSO
.Xr wscons 4 ,
.Xr wskbd 4 ,
.Xr wsconsctl 8 ,
.Xr wsfontload 8
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 2.8 .
