openbsd/src/sbin/fsck/fsck.8
.\"	$OpenBSD: fsck.8,v 1.23 2004/07/28 21:27:52 jmc Exp $
.\"	$NetBSD: fsck.8,v 1.14 1996/10/03 20:08:29 christos Exp $
.\"
.\" Copyright (c) 1996 Christos Zoulas.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Christos Zoulas.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 23, 1996
.Dt FSCK 8
.Os
.Sh NAME
.Nm fsck
.Nd filesystem consistency check and interactive repair
.Sh SYNOPSIS
.Nm fsck
.Bk -words
.Op Fl dfnpvy
.Op Fl l Ar maxparallel
.Oo Xo
.Fl T
.Ar fstype Ns : Ns Ar fsoptions
.Oc
.Xc
.Op Fl t Ar fstype
.Ar special | node ...
.Ek
.Sh DESCRIPTION
The
.Nm
command invokes filesystem-specific programs to check the
special devices listed in the
.Xr fstab 5
file or on the command line for consistency.
The options are as follows:
.Bl -tag -width Ds
.It Fl d
Debugging mode.
Just print the commands without executing them.
Available only if
.Nm
is compiled to support it.
.It Fl f
Force checking of filesystems, even when they are marked clean (for filesystems
that support this).
.It Fl l Ar maxparallel
Limit the number of parallel checks to
.Ar maxparallel .
By default, the limit is the number of
disks, running one process per disk.
If a smaller limit is given,
the disks are checked round-robin, one filesystem at a time.
.It Fl n
Cause
.Nm
to assume
.Dq no
as the answer to all operator questions, except
.Dq CONTINUE? .
This is assumed to be the default when dealing with filesystems currently
mounted writeable.
.It Fl p
Enter preen mode.
.It Xo
.Fl T
.Ar fstype Ns : Ns Ar fsoptions
.Xc
List of comma separated filesystem specific options for the specified
filesystem type, in the same format as
.Xr mount 8 .
.It Fl t Ar fstype
Invoke
.Nm
only in the comma separated list of filesystem types.
If the list starts with
.Dq no ,
invoke
.Nm
only in the filesystem types that are
.Em not
specified in
the list.
.It Fl v
Print the commands before executing them.
.It Fl y
Cause
.Nm
to assume
.Dq yes
as the answer to all operator questions.
.El
.Sh FILES
.Bl -tag -width /etc/fstab -compact
.It Pa /etc/fstab
filesystem table
.El
.Sh SEE ALSO
.Xr fstab 5 ,
.Xr fsck_ext2fs 8 ,
.Xr fsck_ffs 8 ,
.Xr fsck_msdos 8 ,
.Xr fsdb 8 ,
.Xr growfs 8 ,
.Xr mount 8
