openbsd/src/kerberosIV/kpropd/kpropd.8
.\"
.\" Copyright (c) 1997 Jason L. Wright.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Jason L. Wright
.\" 4. The name of Jason L. Wright may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Jason L. Wright ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Jason L. Wright BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 2, 1997
.Dt KPROPD 8
.Sh NAME
.Nm kpropd
.Nd network utility for Kerberos database propagation
.Sh SYNOPSIS
.Nm kpropd [-r realm] [-s srvtab] [-d database_file] [-l logfile]
.Nm [-p kdb_util_path] output_file
.Sh DESCRIPTION
This daemon runs on a Kerberos slave and waits to receive the
Kerberos database propagated from a
.Nm kprop
process on a Kerberos master.
The first parameter,
.Nm output_file ,
that you must supply to the daemon is the name of a text file in which
data will be placed when it comes over the network.
.Pp
This utility executes the
.Nm kdb_util
utility, which loads the database
from the file specified in
.Nm output_file ,
puts it in
.Nm db(3)
format, and copies it into the Kerberos database in the directory
.Pa /etc/kerberosIV .
.Ss Parameters
.Bl -tag -width Fl
.It Fl r
Specifies the receiver realm for which data is accepted;
.Pa /etc/kerberosIV/krb.conf
specifies the default.
.It Fl s
Specifies the service table file from which to read the password
of the daemon, because a password cannot be entered manually when
running as a daemon.  The default is:
.Pa /etc/kerberosIV/srvtab .
.It Fl d
Specifies the primary Kerberos database file of a
Kerberos slave.
This file receives a new or updated
database propagated from the Kerberos master.
The default is the database
.Pa /etc/kerberosIV/principal.db .
.It Fl i
Run stand-alone.  If this flag is not given, it is assumed to have
been started by inetd.
.It Fl l
Specifies the name of the log file to be used.  The default is:
.Pa /var/log/kpropd.log .
.It Fl p
Specifies the full path (with directory and command) to the program
.Nm kdb_util .
The default is just:
.Nm kdb_util
which relies on the PATH environment variable to be searched to find it.
.It Fl P
Synonym for
.Nm -p .
.Sh BUGS
This utility does not support the transfer of encrypted data.
.Pp
If the
.Nm -P
or 
.Nm -p
options are not specified and the PATH environment variable does not
contain the directory with
.Nm kdb_util ,
this program will fail.
.Sh SEE ALSO
.Xr kerberos 1 ,
.Xr kprop 8 ,
.Xr kdb_util 8
