openbsd/src/sys/arch/aviion/stand/a2coff/a2coff.8
.\"	$OpenBSD: a2coff.8,v 1.3 2013/09/21 21:00:02 miod Exp $
.\"
.\" Copyright (c) 2006, Miodrag Vallat
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: September 21 2013 $
.Dt A2COFF 8 aviion
.Os
.Sh NAME
.Nm a2coff
.Nd convert standalone a.out or ELF binaries to 88KBCS COFF format
.Sh SYNOPSIS
.Nm a2coff
.Ar source
.Ar destination
.Sh DESCRIPTION
.Nm a2coff
converts standalone binaries, such as kernels or boot blocks, from
.Xr a.out 5
or ELF format to COFF format, suitable for booting from the
.Tn Data General
.Tn AViiON
PROMs.
.Sh SEE ALSO
.Xr a.out 5 ,
.Xr elf 5
