openbsd/src/share/man/man4/man4.loongson/glxclk.4
.\"	$OpenBSD: glxclk.4,v 1.4 2013/02/05 10:06:08 dlg Exp $
.\"
.\" Copyright (c) 2013 Paul Irofti.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 5 2013 $
.Dt GLXCLK 4 loongson
.Os
.Sh NAME
.Nm glxclk
.Nd AMD Geode CS5536 multi-function general purpose timer
.Sh SYNOPSIS
.Cd "glxclk* at glxpcib?"
.Sh DESCRIPTION
The
.Nm
driver enables two of the multi-function general purpose timers found on the
Geode companion chip to be used as the system clock and the statistics clock.
.Pp
The statistics clock is implemented with interval variance support based on
Chris Torek's paper on randomized sampling.
.Sh SEE ALSO
.Xr glxpcib 4 ,
.Xr intro 4
.Rs
.%A Steven McCanne
.%A Chris Torek
.%T "A Randomized Sampling Clock for CPU Utilization Estimation and Code Profiling"
.%B "In Proc. Winter 1993 USENIX Conference"
.%D 1993
.%P 387-394
.%I USENIX Association
.%U ftp://ftp.ee.lbl.gov/papers/statclk-usenix93.ps.Z
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Paul Irofti Aq pirofti@openbsd.org .
