openbsd/src/share/man/man4/man4.loongson/mem.4
.\"	$OpenBSD: mem.4,v 1.2 2010/02/10 08:35:31 jmc Exp $
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This software was developed by the Computer Systems Engineering group
.\" at Lawrence Berkeley Laboratory under DARPA contract BG 91-66 and
.\" contributed to Berkeley.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)mem.4	8.1 (Berkeley) 6/5/93
.\"
.Dd $Mdocdate: February 10 2010 $
.Dt MEM 4 loongson
.Os
.Sh NAME
.Nm mem ,
.Nm kmem
.Nd memory files
.Sh DESCRIPTION
The file
.Pa /dev/mem
is an interface to the physical memory of the
computer.
Byte offsets in this file are interpreted as physical memory addresses.
Reading and writing this file is equivalent to reading and writing
memory itself.
An error will be returned if an attempt is made to reference
an offset outside of
.Pa /dev/mem .
.Pp
Kernel virtual memory is accessed via the file
.Pa /dev/kmem
in the same manner as
.Pa /dev/mem .
Only kernel virtual addresses that are currently mapped to memory are allowed.
.Pp
On the loongson, physical memory is always contiguous, but can be accessed
from two distinct physical address windows:
.Pp
.Bl -bullet -compact
.It
From address
.Ad 0x00000000
to
.Ad 0x0fffffff ,
the lowest 256 megabytes of memory.
.It
From address
.Ad 0x80000000
to
.Ad 0xffffffff ,
the whole memory, up to 2 gigabytes.
.El
.Pp
This layout implies that a given memory location within the first 256
megabytes may indifferently be addressed in the
.Ad 0x00000000 -
.Ad 0x0fffffff
address range or the
.Ad 0x80000000 -
.Ad 0x8fffffff
address range.
.Pp
The kernel virtual memory begins at address
.Ad 0xc000000000000000 .
.Pp
Writeability of these devices is controlled by the system
.Xr securelevel 7 .
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/mem
.It Pa /dev/kmem
.El
.Sh SEE ALSO
.Xr securelevel 7
.Sh HISTORY
The
.Pa /dev/mem
and
.Pa /dev/kmem
files appeared in
.At v6 .
