openbsd/src/share/man/man4/man4.loongson/mfokclock.4
.\"	$OpenBSD: mfokclock.4,v 1.2 2018/06/18 06:06:52 jmc Exp $
.\"
.\" Copyright (c) 2010 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 18 2018 $
.Dt MFOKCLOCK 4 loongson
.Os
.Sh NAME
.Nm mfokclock
.Nd M41T8x real-time clock
.Sh SYNOPSIS
.Cd "mfokclock* at iic? addr 0x68"
.Sh DESCRIPTION
The
.Nm
driver supports two-wire real-time clock chips of the M41T8x family.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4
