openbsd/src/share/man/man4/man4.loongson/ykbec.4
.\"	$OpenBSD: ykbec.4,v 1.5 2018/01/12 04:36:44 deraadt Exp $
.\"
.\" Copyright (c) 2010 Otto Moerbeek
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 12 2018 $
.Dt YKBEC 4 loongson
.Os
.Sh NAME
.Nm ykbec
.Nd Ene Technology KB3110B embedded controller chip
.Sh SYNOPSIS
.Cd "ykbec0 at isa?"
.Sh DESCRIPTION
The
.Nm
driver supports the Ene Technology KB3110B embedded controller chip found
in the Lemote Yeeloong.
.Pp
This chip provides general purpose I/O and handles several
dedicated functions, including:
.Pp
.Bl -dash -compact -offset indent
.It
Fan control
.It
Battery control
.It
Button events
.It
Power management
.It
Lid state
.El
.Pp
Fan, battery, and lid information is made available via the
.Xr sysctl 2
hardware sensor interface.
Not all the device interfaces are supported under
.Ox .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr isa 4
