openbsd/src/usr.sbin/hilinfo/hilinfo.8
.\"	$OpenBSD: hilinfo.8,v 1.1 2002/02/19 19:51:54 miod Exp $
.\"
.\" Copyright (c) 2002 Miodrag Vallat.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistribution of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd February 19, 2002
.Dt HILINFO 1 HP300
.Os
.Sh NAME
.Nm hilinfo
.Nd provides information on HIL devices
.Sh SYNOPSIS
.Nm hilinfo
.Op Fl a
.Op Fl t
.Ar device ...
.Sh DESCRIPTION
.Nm
prints information about the
.Ar device
list.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl a
For each
.Ar device ,
display the type and the complete hil information bitstring.
.It Fl t
For each
.Ar device ,
display the type.
.El
.Pp
If no options are given, the type will be printed (that is,
.Nm
will behave as if
.Fl t
had been passed).
.Sh SEE ALSO
.Xr hil 4
.Sh HISTORY
A
.Nm
command appeared in
.Bx 4.4 .
