openbsd/src/share/man/man4/man4.alpha/intro.4
.\"     $OpenBSD: intro.4,v 1.20 2003/07/08 14:25:51 mickey Exp $
.\"
.\" Copyright (c) 1998 The OpenBSD Project
.\" All Rights Reserved.
.\"
.Dd March 7, 1998
.Dt INTRO 4 alpha
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files,
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the
Alpha
platform.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities in
the system probe for the device and, if found, enable the software support
for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system will have to be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported hardware and devices is given below.
.Sh SUPPORTED SYSTEMS
.Tn DEC
and
.Tn Compaq
have produced a series of the
.Tn Alpha
.Tn CPU ,
some of which are listed below, along with some systems which contain them.
.Pp
.Qq EV
stands for
.Qq Extended VAX
.Po
or
.Qq Electro Vlassic
.Pc
and the number following is a reference to the
.Tn CMOS
process used to make the chips.
.Qq LCA
stands for Low Cost Alpha, and
.Qq PCA
stands for PC-architecture Alpha.
.Pp
.Bl -hang -width 9n
.It 21064
.Sy EV4
.Po
100-200
.Tn MHz ,
0.75 micron
.Pc
.Pp
AlphaPC 64
.Pq EB64
.br
.Bl -hang -width 4n
.It Avanti family
.br
Digital's lower-end PCI-based workstations.
.Pp
AlphaStation 200 4/100-166
.Pq Mustang
.br
AlphaStation 400 4/166
.Pq Chinet
.It Pelican family
.br
Low-end
.Tn TURBOchannel
based workstations.
.Pp
DEC 3000/300
.Pq 150 Tn MHz
.Pq Pelican
.br
DEC 3000/300X
.Pq 175 Tn MHz
.Pq Pelican+
.br
DEC 3000/300L
.Pq 100 Tn MHz
.Pq Pelica
.br
DEC 3000/300LX
.Pq 125 Tn MHz
.Pq Pelica+
.It Sandpiper family
.br
High-end
.Tn TURBOchannel
based workstations.
.Pp
DEC 3000/400
.Pq 133 Tn MHz
.Pq Sandpiper
.br
DEC 3000/600
.Pq 175 Tn MHz
.Pq Sandpiper+
.It Flamingo family
.br
High-end
.Tn TURBOchannel
based workstations.
.Pp
DEC 3000/500
.Pq 150 Tn MHz
.Pq Flamingo
.br
DEC 3000/500X
.Pq 200 Tn MHz
.Pq Hot Pink
.br
DEC 3000/800
.Pq 200 Tn MHz
.Pq Flamingo II
.br
.El
.It 21064-A
.Sy EV45
.Po
225-333
.Tn MHz ,
0.50 micron
.Pc
.Pp
DEC 3000/700
.Pq 225 Tn MHz
.Pq Sandpiper45
.br
DEC 3000/900
.Pq 275 Tn MHz
.Pq Flamingo45
.Pp
.Bl -hang -width 4n
.It Avanti family
.br
Digital's lower-end PCI-based workstations.
.Pp
AlphaStation 200 4/233
.Pq Mustang+
.br
AlphaStation 205 4/133-333
.Pq LX3
.br
AlphaStation 250 4/300
.Pq M3+
.br
AlphaStation 255 4/133-333
.Pq LX3+
.br
AlphaStation 300 4/266
.Pq Melmac
.br
AlphaStation 400 4/233-300
.Pq Avanti
.br
.El
.It 21066
.Sy LCA4
.Po
166-233
.Tn MHz ,
0.75 micron
.Pc
.Bl -hang -width 4n
.It NoName family
.br
Digital's lowest-end family of PCI-based systems.
.Pp
DEC AXPpci33
.Pq NoName
.br
Universal Desktop Box AXPpci166MT
.Pq UDB/Multia
.El
.Pp
21066 evaluation motherboard
.Pq EB66
.It 21066-A
.Sy LCA45
.Po
233
.Tn MHz ,
0.50 micron
.Pc
.Pp
21066-A evaluation motherboard
.Pq EB66+
.It 21068
.Sy LCA4s
.Po
66-233
.Tn MHz ,
0.75 micron
.Pc
.Pp
Universal Desktop Box AXPpci233MT
.Pq UDB/Multia
.It 21164
.Sy EV5
.Po
250-366
.Tn MHz ,
0.50 micron
.Pc
.Pp
.Bl -hang -width 4n
.It Mikasa family
.br
AlphaServer 1000 5/300
.Pq Pinnacle
.It Noritake family
.br
AlphaServer 1000A 5/300
.Pq Pinnacle
.Pp
21164 evaluation motherboard
.Pq EB164
.br
.El
.It 21164-A
.Sy EV56
.Po
400-766
.Tn MHz ,
0.35 micron, BWX
.Pc
.Pp
.Bl -hang -width 4n
.It Personal Workstation Pq PWS
.br
PWS 433a/433au
.Pq Miata
.br
PWS 500a/500au
.Pq Miata
.br
PWS 600a/600au
.Pq Miata
.It Mikasa family
.br
AlphaServer 1000 5/333-500
.Pq Primo
.It Noritake family
.br
AlphaServer 1000A 5/333-500
.Pq Primo
.br
AlphaServer 800 5/333-500
.Pq Corelle
.It EB164 family
.br
AlphaPC 164 motherboard
.Pq EB164
.br
AlphaPC 164LX motherboard
.Pq EB164
.br
.El
.Pp
DigitalServer 3300
.Po
rebadged AlphaServer 800 for NT
.Pc
.Pp
.It 21164-PC
.Sy PCA56
.Po
400-600
.Tn MHz ,
0.35 micron, MVI, no L2 cache
.Pc
.Pp
AlphaPC 164SX motherboard
.Pq EB164
.Pp
PWS 466au
.Pq Miata
.br
PWS 550au
.Pq Miata
.It 21264
.Sy EV6
.Po
450-600
.Tn MHz ,
0.35 micron
.Pc
.Pp
APi UP1000 and UP1100;
AMD 751-based EV6 systems.
.Pp
264DP, XP1000, DS10, DS20
Tsunami-based systems.
.It 21264-A
.Sy EV67
.Po
600-833
.Tn MHz ,
0.28 micron
.Pc
.El
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.
Pseudo-devices are not listed.
Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width 12n -compact -offset ind
.It Xr adv 4
AdvanSys PCI narrow SCSI Host Adapters.
.It Xr adw 4
AdvanSys PCI wide SCSI Host Adapters.
.It Xr ahc 4
Adaptec 2xxx and 3xxx series PCI/VLB/EISA SCSI adapter boards.
.It Xr aic 4
Adaptec AIC-6260, Adaptec AIC-6360, Adaptec 152x, and SoundBlaster SCSI boards.
.It Xr ami 4
American Megatrends Inc.
MegaRAID Controllers.
.It Xr an 4
Aironet Communications 4500/4800 IEEE 802.11DS wireless network adapter.
.It Xr asc 4
NCR 53c[f]94 on-board or TURBOchannel SCSI controller.
.It Xr aue 4
ADMtek AN986-based USB Ethernet adapters.
.It Xr bge 4
Broadcom BCM570x (Tigon3) Gigabit Ethernet boards.
.It Xr cmpci 4
C-Media CMI8x38 audio.
.It Xr com 4
NS8250-, NS16450-, NS16550-, ST16550- and TI16750-based asynchronous
serial communications.
.It Xr cue 4
CATC USB-EL1201A based USB Ethernet adapters.
.It Xr cy 4
Cyclades Cyclom-4Y, -8Y, and -16Y asynchronous serial adapters.
.It Xr dc 4
DEC tulip clone ethernet cards (Macronix, Lite-On, Davicom, ADMtek).
.It Xr de 4
DEC tulip-based ethernet cards.
.It Xr dpt 4
DPT SmartCache/SmartRAID III and IV SCSI controllers.
.It Xr eap 4
Ensoniq AudioPCI (ES137x) audio.
.It Xr ec 4
3Com EtherLink II Ethernet (3C503).
.It Xr em 4
Intel i82542, i82543, and i82544 Pro/1000 Gigabit Ethernet.
.It Xr ep 4
3Com EtherLink III Ethernet (3C5x9, 3C59x).
.It Xr eso 4
ESS Technology Solo-1 PCI AudioDrive (ES1938/ES1946) audio.
.It Xr fea 4
.Tn DEC
DEFEA PCI FDDI controller.
.It Xr fms 4
Forte Media FM801 audio.
.It Xr fpa 4
.Tn DEC
DEFPA PCI FDDI controller.
.It Xr fxp 4
.Tn Intel
EtherExpress PRO/100 Ethernet.
.It Xr gdt 4
ICP-Vortex GDT RAID controllers.
.It Xr hifn 4
Hi/Fn 7751 Encryption Accelerator.
.It Xr ises 4
Securealink PCC-ISES hardware crypto accelerator.
.It Xr isp 4
QLogic PCI SCSI controllers.
.It Xr lc 4
DEC EtherWORKS III Ethernet interfaces.
.It Xr le 4
AMD Lance Ethernet.
.It Xr lmc 4
Lan Media Corporation SS1/DS1/HSSI/DS3 PCI WAN adapters.
.It Xr lpt 4
Parallel port.
.It Xr ne 4
Novell NE1000 and 2000 Ethernet interface.
.It Xr pckbc 4
Traditional PC (ISA) keyboard.
.It Xr pms 4
PS/2 auxiliary port mouse, for generic mice.
.It Xr rl 4
Realtek 8129/8139 Ethernet.
.It Xr sf 4
Adaptec AIC-6915 Starfire PCI Fast Ethernet.
.It Xr siop 4
LSI/Symbios Logic/NCR 53c8xx SCSI adapter boards.
.It Xr sis 4
SiS 900, Sis 7016 and NS DP83815 Fast Ethernet.
.It Xr sk 4
SysKonnect 984x Gigabit Ethernet (9841/9842/9843/9844).
.It Xr speaker 4
Console speaker.
.It Xr stge 4
Sundance/Tamarack TC9021 Gigabit Ethernet.
.It Xr ti 4
Alteon Tigon I & II Gigabit ethernet (3Com 3C985, Netgear GA620, etc).
.It Xr tl 4
Texas Instruments ThunderLAN ethernet.
.It Xr twe 4
3ware Escalade RAID controller.
.It Xr tx 4
SMC 9432 10/100 Mbps Ethernet cards.
.It Xr txp 4
3Com 3XP Typhoon/Sidewinder (3CR990) Ethernet.
.It Xr ubsec 4
Broadcom Bluesteelnet uBsec 5501, 5601, 5805, and 5820.
.\" keep commented until USB is enabled by default... and bring up-to-date
.\" when it isn't anymore.
.\" .It Xr uftdi 4
.\" FTDI FT8U100AX-based USB serial adapters.
.\" .It Xr upl 4
.\" Prolific PL2301/PL2302-based host-to-host USB connectors.
.\" .It Xr uplcom 4
.\" I/O Data USB-RSAQ2 USB serial adapters.
.\" .It Xr urio 4
.\" Diamond Multimedia Rio MP3 device interface.
.\" .It Xr uvisor 4
.\" Handspring Visor device interface.
.\" .It Xr uyap 4
.\" YAP phone firmware interface.
.It Xr vga 4
PC display adapter driver for VGA compatible adapters.
.It Xr vr 4
VIA Rhine Ethernet.
.It Xr wb 4
Winbond W89C840F fast ethernet.
.It Xr wdc 4
Standard ISA Western Digital type hard drive controllers.
MFM, RLL, ESDI, and IDE.
.It Xr we 4
Western Digital/SMC WD 80x3, SMC Elite Ultra and SMC EtherEZ Ethernet cards.
.It Xr wss 4
Windows Sound System audio.
.It Xr xl 4
3Com EtherLink XL and Fast EtherLink XL (3c9xx).
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HISTORY
The
Alpha
.Nm intro
first appeared in
.Ox 2.3 .
