openbsd/src/share/man/man4/man4.alpha/pms.4
.\"
.\"	$OpenBSD: pms.4,v 1.2 2001/08/20 06:09:32 mpech Exp $
.\"
.\" Copyright (c) 1996, Jason Downs.
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 12, 1996
.Dt PMS 4 alpha
.Os
.Sh NAME
.Nm pms
.Nd PS/2 auxiliary port mouse driver
.Sh SYNOPSIS
.Cd "pms0 at pcppi?"
.Sh DESCRIPTION
This driver provides an interface to a PS/2 auxiliary port mice.  The driver
offers two modes of operation, both a raw and the old style translated
input stream.  The translating portion of the driver provides BusMouse
codes; in raw mode no translations are performed.
The
.Nm
driver provides three
.Em ioctls
for getting mouse status and changing modes.  They are defined in the
following include:
.Bd -literal -offset indent
#include <machine/mouse.h>
.Ed

The
.Dv MOUSEIOCREAD
.Em ioctl
is used to read the current mouse stats, and takes the
.Dv "struct mouseinfo"
as an argument to store the data in.

The
.Dv MOUSEIOCSRAW
.Em ioctl
puts the device into raw mode, if it is not already, and the
.Dv MOUSEIOCSCOOKED
.Em ioctl
puts it into translated (or cooked) mode.  If the mode of the
.Nm
device driver changes, all pending but not yet read input is flushed.
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/psm0
PS/2 mouse device file, defaulting to raw mode
.It Pa /dev/pms0
PS/2 mouse device file, defaulting to translating mode
.El
