openbsd/src/usr.sbin/ypserv/ypserv/securenet.5
.\"	$OpenBSD: securenet.5,v 1.8 2002/07/19 02:38:40 deraadt Exp $
.\"
.\" Copyright (c) 1994 Mats O Jansson <moj@stacken.kth.se>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Mats O Jansson
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 27, 1994
.Dt SECURENET 5
.Os
.Sh NAME
.Nm securenet
.Nd
.Xr ypserv 8
configuration file for secure networks
.Sh DESCRIPTION
The
.Nm
file controls which hosts can connect to the
.Nm YP
server.
.Pp
The format is rather simple.
Each row consists of two items.
The first item is the network mask.
The second item is the network.
.Sh EXAMPLES
A configuration file might look like the following:
.Bd -literal
#
# Only my local net is secure.
#
255.255.255.0 139.58.253.0
.Ed
.Sh FILES
.Bl -tag -width /var/yp/securenet -compact
.It Pa /var/yp/securenet
a
.Xr ypserv 8
configuration file
.El
.Sh SEE ALSO
.Xr ypserv.acl 5 ,
.Xr yp 8 ,
.Xr ypserv 8
.Sh HISTORY
The
.Xr securenet 5
file was added to
.Tn NIS
by Sun Microsystems, Inc. as a bugfix for weak security.
