openbsd/src/usr.sbin/ypserv/ypserv/ypserv.8
.\" Copyright (c) 1994 Mats O Jansson <moj@stacken.kth.se>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id: ypserv.8,v 1.2 1996/04/24 12:37:48 deraadt Exp $
.\"
.Dd June 27, 1994
.Dt YPSERV 8
.Os
.Sh NAME
.Nm ypserv
.Nd YP server daemon
.Sh SYNOPSIS
.Nm ypserv
.Op Fl a Ar aclfile
.Op Fl d
.Op Fl x
.Sh DESCRIPTION
.Nm Ypserv
is a fundamental part of the network information system called YP.
This server provides information from YP maps to the YP clients
on the network.
.Pp
A YP map is stored on the server as a
.Xr db 3
database. A number of YP maps is grouped together in a domain.
.Ar Ypserv
determines the domains it serves by looking for a directory with
the domain name in 
.Ar /var/yp .
.Pp
YP hasn't been known for high security through the years. In recent years
security has improved by restricting access to the server. In SunOS 4.1
has a new file occured named
.Ar /var/yp/securenet .
It contains networks the server can assume is secure. For information about
file format see
.Xr securenet 5 .
.Pp
Before the author of this server had seen 
.Xr securenet 5
another format was implemented
.Xr ypserv.acl 5 .
This file format makes it possible to allow and deny hosts and networks
access to the server.
.Pp
If a host isn't secure all queries to the server will result in a YP_NODOM
result. It would be better to add the security to
.Xr portmap 8
and not allow unsecure host to bind to this rpc service.
.Pp
IF the file
.Nm /var/yp/ypserv.log
exists then messages will be written to the file.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl a Ar aclfile
Don't use 
.Ar /var/yp/securenet .
Use another file with another file format. For futher information see
man page for
.Ar ypserv.acl .
.It Fl d
Use Internet Domain Name System. If a query to map
.Ar hosts.byname
or
.Ar hosts.byaddr
fails, make a DNS query and return the result if successful.
.It Fl x
Terminate the server after processing
.Ar aclfile
or
.Ar /var/yp/securenet .
.El
.Sh FILES
.Bl -tag -width /var/yp/ypserv.log -compact
.It Pa /var/yp/ypserv.log
.It Pa /var/yp/securenet
.It Pa /var/yp/ypserv.acl
.El
.Sh SEE ALSO
.Xr yp 8 ,
.Xr ypserv.acl 5 ,
.Xr securenet 5 ,
.Xr ypbind 1 
.Sh AUTHOR
Mats O Jansson <moj@stacken.kth.se>
