openbsd/src/usr.sbin/sensorsd/sensorsd.conf.5
.\"	$OpenBSD: sensorsd.conf.5,v 1.1 2003/09/24 20:32:49 henning Exp $
.\"
.\" Copyright (c) 2003 Henning Brauer <henning@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\" 
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd September 20, 2003
.Dt SENSORSD.CONF 5
.Os
.Sh NAME
.Nm sensorsd.conf
.Nd configuration file for
.Xr sensorsd 8
.Sh SYNOPSIS
.Nm sensorsd.conf
.Sh DESCRIPTION
The
.Nm
file is read by
.Xr sensorsd 8
to configure hardware sensor monitoring.
Each entry represents one sensor and may specify high and low limits.
If the sensor data is out of range of the low and the high limits,
.Xr sensorsd 8 's
alert functionality is triggered.
.Pp
.Nm
follows the syntax of configuration databases as documented in
.Xr getcap 3 .
.Pp
Example:
.Bd -literal -offset indent
hw.sensors.0:high=80C
hw.sensors.1:high=170F
hw.sensors.2:low=4.8V:high=5.2V
hw.sensors.3:low=1000:high=8000
.Ed
.Pp
The values for temperature sensors can be given in degrees Celsius or
Fahrenheit, for voltage sensors in volts, and fan speed sensors take a
unit-less number representing RPM.
.Sh FILES
.Bl -tag -width "/etc/sensorsd.conf"
.It /etc/sensorsd.conf
Configuration file for
.Xr sensorsd 8 .
.El
.Sh SEE ALSO
.Xr sensorsd 8
.Sh HISTORY
The
.Nm
file format first appeared in
.Ox 3.5 .
