openbsd/src/usr.sbin/sensorsd/sensorsd.8
.\"	$OpenBSD: sensorsd.8,v 1.24 2017/07/23 19:41:58 schwarze Exp $
.\"
.\" Copyright (c) 2003 Henning Brauer <henning@openbsd.org>
.\" Copyright (c) 2005 Matthew Gream <matthew.gream@pobox.com>
.\" Copyright (c) 2007 Constantine A. Murenin <cnst@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 23 2017 $
.Dt SENSORSD 8
.Os
.Sh NAME
.Nm sensorsd
.Nd hardware sensors monitor
.Sh SYNOPSIS
.Nm sensorsd
.Op Fl d
.Op Fl c Ar check
.Op Fl f Ar file
.Sh DESCRIPTION
The
.Nm
utility retrieves sensor monitoring data like fan speed,
temperature, voltage and RAID logical disk status from the
.Xr sysctl 3
.Va hw.sensors
subtree.
When the state of any monitored sensor changes, an alert is triggered.
Every alert logs a message to
.Xr syslog 3
using the
.Cm daemon
facility.
Optionally, an alert can be configured to execute a command.
.Pp
By default,
.Nm
monitors status changes on all sensors that keep their state,
thus sensors that automatically provide status do not require
any additional configuration.
In addition, for every sensor,
no matter whether it automatically provides its state or not,
custom low and high limits may be set,
so that a local notion of sensor status can be computed by
.Nm ,
indicating whether the sensor is within or is exceeding its limits.
.Pp
Limit and command values for a particular sensor may be specified in the
.Xr sensorsd.conf 5
configuration file.
This file is reloaded upon receiving
.Dv SIGHUP .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl c Ar check
Check sensors every
.Ar check
seconds.
The default is 20.
The state of a sensor is not yet regarded as changed when a check
returns a new state for the first time, but only when the two
subsequent checks both confirm the new state.
.It Fl d
Do not daemonize.
If this option is specified,
.Nm
will run in the foreground.
.It Fl f Ar file
Read configuration from
.Ar file
instead of the default configuration file
.Pa /etc/sensorsd.conf .
.El
.Sh FILES
.Bl -tag -width "/etc/sensorsd.conf"
.It Pa /etc/sensorsd.conf
Configuration file for
.Nm .
.El
.Sh SEE ALSO
.Xr sysctl 3 ,
.Xr sensorsd.conf 5 ,
.Xr syslog.conf 5 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 3.5 .
.Sh CAVEATS
Certain sensors may erratically flip status from time to time.
To guard against false reports,
.Nm
requires two confirmations before reporting a state change.
However, this inevitably introduces
an additional delay in status reporting and command execution,
e.g. one may notice that
.Nm
makes its initial report about the state of monitored sensors
not immediately, but by default about 60 seconds after it is started.
