openbsd/src/share/man/man4/man4.cats/fcom.4
.\"	$OpenBSD: fcom.4,v 1.3 2007/05/31 19:19:54 jmc Exp $
.\"
.\" Copyright (c) 2004, Miodrag Vallat.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt FCOM 4 cats
.Os
.Sh NAME
.Nm fcom
.Nd Footbridge serial communications driver
.Sh SYNOPSIS
.Cd "fcom0 at footbridge?"
.Sh DESCRIPTION
The
.Nm
device handles the UART found on the
.Xr footbridge 4
device, which provides an RS-232 serial port.
The
.Nm
driver supports all of the standard
.Xr tty 4
ioctl calls.
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr footbridge 4 ,
.Xr intro 4 ,
.Xr tty 4
.Sh HISTORY
A
.Nm
driver appeared in
.Ox 3.5 .
