openbsd/src/share/man/man4/man4.cats/intro.4
.\"	$OpenBSD: intro.4,v 1.3 2004/08/15 22:52:40 jmc Exp $
.\"
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 7, 2004
.Dt INTRO 4 cats
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files,
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the cats platform.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system will have to be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.
Pseudo-devices are not listed.
Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width pcdisplay(4) -compact -offset indent
.It Xr adv 4
AdvanSys PCI narrow SCSI Host Adapters.
.It Xr ahc 4
Adaptec 2xxx and 3xxx series PCI/VLB/EISA SCSI adapter boards.
.It Xr aue 4
ADMtek AN986-based USB Ethernet adapters.
.It Xr com 4
NS8250-, NS16450-, NS16550-, ST16550-, TI16750- and XR16850-based asynchronous
serial communications.
.\" cpu
.It Xr cue 4
CATC USB-EL1201A based USB Ethernet adapters.
.It Xr dc 4
DEC tulip clone Ethernet cards (Macronix, Lite-On, Davicom, ADMtek).
.It Xr de 4
DEC tulip-based Ethernet cards.
.\" ds1687rtc
.It Xr em 4
Intel i82542, i82543, and i82544 Pro/1000 Gigabit Ethernet.
.It Xr ep 4
3Com EtherLink III Ethernet (3C5x9, 3C59x).
.\" fcom
.It Xr footbridge 4
DC21285 PCI bridge.
.It Xr fxp 4
.Tn Intel
EtherExpress PRO/100 Ethernet.
.It Xr iha 4
Initio INIC-940 and INIC-950 based SCSI interfaces.
.It Xr kue 4
Kawasaki LSI KL5KUSB101B-based USB Ethernet.
.It Xr lpt 4
Parallel port.
.It Xr ne 4
Novell NE1000 and 2000 Ethernet interface.
.It Xr pckbc 4
Traditional PC (ISA) keyboard.
.It Xr pcscp 4
Advanced Micro Devices Am53c974 PCscsi-PCI SCSI driver.
.It Xr pms 4
PS/2 auxiliary port mouse, for generic mice.
.\" .It Xr pmsi 4
.\" PS/2 auxiliary port mouse, for wheel mice.
.It Xr siop 4
LSI/Symbios Logic/NCR 53c8xx SCSI adapter boards.
.\" todclock
.It Xr uaudio 4
USB audio devices.
.It Xr uftdi 4
FTDI FT8U100AX-based USB serial adapters.
.It Xr ukbd 4
USB keyboard.
.It Xr ulpt 4
USB printers.
.It Xr umass 4
USB mass storage.
.It Xr umct 4
MCT USB-RS232 serial adapter.
.It Xr umidi 4
USB MIDI devices.
.It Xr umodem 4
USB modems.
.It Xr ums 4
USB mouse.
.It Xr upl 4
Prolific PL2301/PL2302-based host-to-host USB connectors.
.It Xr uplcom 4
I/O Data USB-RSAQ2 USB serial adapters.
.It Xr urio 4
Diamond Multimedia Rio MP3 device interface.
.It Xr uscanner 4
USB scanners.
.It Xr usscanner 4
SCSI-over-USB scanners.
.It Xr uvisor 4
Handspring Visor device interface.
.It Xr uyap 4
YAP phone firmware interface.
.It Xr vga 4
PC display adapter driver for VGA compatible adapters.
.It Xr vr 4
VIA Rhine Ethernet.
.It Xr xl 4
3Com EtherLink XL and Fast EtherLink XL (3c9xx).
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HISTORY
The
cats
.Nm intro
first appeared in
.Ox 3.5 .
