openbsd/src/kerberosIV/man/krb.realms.5
.\"
.\" This source code is no longer held under any constraint of USA
.\" `cryptographic laws' since it was exported legally.  The cryptographic
.\" functions were removed from the code and a "Bones" distribution was
.\" made.  A Commodity Jurisdiction Request #012-94 was filed with the
.\" USA State Department, who handed it to the Commerce department.  The
.\" code was determined to fall under General License GTDA under ECCN 5D96G,
.\" and hence exportable.  The cryptographic interfaces were re-added by Eric
.\" Young, and then KTH proceeded to maintain the code in the free world.
.\"
.\"Copyright (C) 1989 by the Massachusetts Institute of Technology
.\"
.\"Export of this software from the United States of America is assumed
.\"to require a specific license from the United States Government.
.\"It is the responsibility of any person or organization contemplating
.\"export to obtain such a license before exporting.
.\"
.\"WITHIN THAT CONSTRAINT, permission to use, copy, modify, and
.\"distribute this software and its documentation for any purpose and
.\"without fee is hereby granted, provided that the above copyright
.\"notice appear in all copies and that both that copyright notice and
.\"this permission notice appear in supporting documentation, and that
.\"the name of M.I.T. not be used in advertising or publicity pertaining
.\"to distribution of the software without specific, written prior
.\"permission.  M.I.T. makes no representations about the suitability of
.\"this software for any purpose.  It is provided "as is" without express
.\"or implied warranty.
.\"
.\"	$OpenBSD: krb.realms.5,v 1.7 1999/07/04 16:13:35 aaron Exp $
.Dd June 15, 1999
.Os
.Dt KRB.REALMS 5
.Sh NAME
.Nm krb.realms
.Nd host to Kerberos realm translation file
.Sh DESCRIPTION
.Nm
provides a translation from a hostname to the Kerberos realm name for
the services provided by that host.
.Pp
Each line of the translation file is in one of the following forms
.Pf ( Fa domain_name
should be of the form .XXX.YYY, e.g. .LCS.MIT.EDU):
.Bd -literal -offset indent
host_name kerberos_realm
domain_name kerberos_realm
.Ed
.Pp
If a hostname exactly matches the
.Fa host_name
field in a line of the first form, the corresponding
.Fa kerberos_realm
is the realm of the host.  If a hostname does not match any
.Fa host_name
in the file, but its domain exactly matches the
.Fa domain_name
field in a line of the second form, the corresponding
.Fa kerberos_realm
is the realm of the host.
.Pp
If no translation entry applies, the host's realm is considered to be
the hostname's domain portion converted to upper case.
.Sh SEE ALSO
.Xr krb_realmofhost 3
