openbsd/src/kerberosIV/man/krb.conf.5
.\"
.\" This source code is no longer held under any constraint of USA
.\" `cryptographic laws' since it was exported legally.  The cryptographic
.\" functions were removed from the code and a "Bones" distribution was
.\" made.  A Commodity Jurisdiction Request #012-94 was filed with the
.\" USA State Department, who handed it to the Commerce department.  The
.\" code was determined to fall under General License GTDA under ECCN 5D96G,
.\" and hence exportable.  The cryptographic interfaces were re-added by Eric
.\" Young, and then KTH proceeded to maintain the code in the free world.
.\"
.\"Copyright (C) 1989 by the Massachusetts Institute of Technology
.\"
.\"Export of this software from the United States of America is assumed
.\"to require a specific license from the United States Government.
.\"It is the responsibility of any person or organization contemplating
.\"export to obtain such a license before exporting.
.\"
.\"WITHIN THAT CONSTRAINT, permission to use, copy, modify, and
.\"distribute this software and its documentation for any purpose and
.\"without fee is hereby granted, provided that the above copyright
.\"notice appear in all copies and that both that copyright notice and
.\"this permission notice appear in supporting documentation, and that
.\"the name of M.I.T. not be used in advertising or publicity pertaining
.\"to distribution of the software without specific, written prior
.\"permission.  M.I.T. makes no representations about the suitability of
.\"this software for any purpose.  It is provided "as is" without express
.\"or implied warranty.
.\"
.\"	$OpenBSD: krb.conf.5,v 1.8 1999/07/04 16:13:35 aaron Exp $
.Dd June 15, 1999
.Os
.Dt KRB.CONF 5
.Sh NAME
.Nm krb.conf
.Nd Kerberos configuration file
.Sh DESCRIPTION
.Nm
contains configuration information describing the Kerberos realm and the
Kerberos key distribution center (KDC) servers for known realms.
.Pp
The first line of
.Nm
contains the name of the local realm. If the first character in the first line
is a hash sign
.Pq Ql # ,
then Kerberos authentication is disabled.
.Pp
Subsequent lines are of the form
.Bd -ragged -offset indent
.Fa realm
.Fa KDC_server
.Op admin server
.Ed
.Pp
where
.Fa realm
is a Kerberos realm name and
.Fa KDC_server
is the name of a host running a KDC for
.Fa realm .
The words
.Dq admin server
following
.Fa KDC_server
indicate that the host also provides an administrative database server.
.Sh EXAMPLES
A krb.conf file for a host in the ATHENA.MIT.EDU realm might look like:
.Bd -literal -offset indent
ATHENA.MIT.EDU
ATHENA.MIT.EDU kerberos-1.mit.edu admin server
ATHENA.MIT.EDU kerberos-2.mit.edu
LCS.MIT.EDU kerberos.lcs.mit.edu admin server
.Ed
.Sh SEE ALSO
.Xr krb_get_krbhst 3 ,
.Xr krb_get_lrealm 3 ,
.Xr krb.realms 5
