openbsd/src/sbin/shutdown/shutdown.8
.\"	$OpenBSD: shutdown.8,v 1.40 2015/01/21 19:29:52 naddy Exp $
.\"	$NetBSD: shutdown.8,v 1.6 1995/03/18 15:01:07 cgd Exp $
.\"
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)shutdown.8	8.1 (Berkeley) 6/5/93
.\"
.Dd $Mdocdate: January 21 2015 $
.Dt SHUTDOWN 8
.Os
.Sh NAME
.Nm shutdown
.Nd close down the system at a given time
.Sh SYNOPSIS
.Nm shutdown
.Op Fl
.Op Fl dfhknpr
.Ar time
.Op Ar warning-message ...
.Sh DESCRIPTION
.Nm
provides an automated shutdown procedure for superusers
to nicely notify users when the system is shutting down,
saving them from system administrators, hackers, and gurus, who
would otherwise not bother with such niceties.
When the
.Nm
command is issued without options the system is placed in single
user mode at the indicated time after shutting down all system
services.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d
When used with
.Fl h ,
.Fl p ,
or
.Fl r
causes system to perform a dump.
This option is useful for debugging system dump procedures or capturing the
state of a corrupted or misbehaving system.
See
.Xr savecore 8
for information on how to recover this dump.
.It Fl f
Create the file
.Pa /fastboot
so that the file systems will
.Em not
be checked by
.Xr fsck 8
during the next boot.
(See
.Xr rc 8 ) .
.It Fl h
The system is halted at the specified
.Ar time
when
.Nm
execs
.Xr halt 8 .
.It Fl k
Kick everybody off.
The
.Fl k
option
does not actually halt the system, but leaves the
system multi-user with logins disabled (for all but superuser).
.It Fl n
When used with
.Fl h ,
.Fl p ,
or
.Fl r
prevents the normal
.Xr sync 2
before stopping the system.
.It Fl p
The system is powered down at the specified
.Ar time .
The
.Fl p
flag is passed on to
.Xr halt 8 ,
causing machines which support automatic power down to do so after halting.
.It Fl r
.Nm
execs
.Xr reboot 8
at the specified
.Ar time .
.It Ar time
.Ar time
is the time at which
.Nm
will bring the system down and
may be the word
.Ar now
(indicating an immediate shutdown) or
specify a future time in one of two formats:
.Ar +number ,
or
.Ar yymmddhhmm ,
where the year, month, and day may be defaulted
to the current system values.
The first form brings the system down in
.Ar number
minutes and the second at the absolute time specified.
.It Ar warning-message
Any other arguments comprise the warning message that is broadcast
to users currently logged into the system.
.It Fl
If
.Sq Fl
is supplied as an option, the warning message is read from the standard
input.
.El
.Pp
At intervals, becoming more frequent as apocalypse approaches
and starting at ten hours before shutdown, warning messages are displayed
on the terminals of all users logged in.
Five minutes before
shutdown, or immediately if shutdown is in less than 5 minutes,
logins are disabled by creating
.Pa /etc/nologin
and copying the
warning message there.
If this file exists when a user attempts to log in,
.Xr login 1
prints its contents and exits.
The file is removed just before
.Nm
exits.
.Pp
At shutdown time a message is written in the system log, containing the
time of shutdown, who initiated the shutdown and the reason.
A terminate
signal is then sent to
.Em init
to bring the system down to single-user state (depending on above
options).
The time of the shutdown and the warning message
are placed in
.Pa /etc/nologin
and should be used to
inform the users about when the system will be back up
and why it is going down (or anything else).
.Pp
You can cancel a scheduled shutdown with the
.Xr kill 1
command by killing the shutdown process.
.Sh FILES
.Bl -tag -width /etc/rc.shutdown -compact
.It Pa /etc/nologin
tells login not to let anyone log in
.It Pa /etc/rc.shutdown
run by
.Xr rc 8
before the system is shutdown
.It Pa /fastboot
tells
.Xr rc 8
not to run
.Xr fsck 8
during the next boot
.El
.Sh SEE ALSO
.Xr kill 1 ,
.Xr login 1 ,
.Xr wall 1 ,
.Xr halt 8 ,
.Xr rc.shutdown 8 ,
.Xr reboot 8
.Sh STANDARDS
The hours and minutes in the second time format may be separated by
a colon
.Pq Sq \&:
for backward compatibility.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.0 .
