openbsd/src/libexec/getNAME/getNAME.8
.\"	$NetBSD: getNAME.8,v 1.2.2.1 1997/11/10 19:54:39 thorpej Exp $
.\"
.\" Copyright (c) 1997 Matthew R. Green
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd October 31, 1997
.Dt GETNAME 8
.Os NetBSD
.Sh NAME
.Nm getNAME
.Nd get NAME sections from manual source for whatis/apropos data base
.Sh SYNOPSIS
.Nm
.Op Fl itw
.Ar path Op Ar path ...
.Sh DESCRIPTION
The
.Nm
program looks inside manual sources to retrieve the NAME section of 
the manual page.  It can be used to create a table of contents, report 
the style of manual, or to create an introduction to the manual section.  
By default,
.Nm
returns data for use in an
.Xr apropos 1
database.
.Nm
is designed to be called from
.Xr makewhatis 8
or other manual grovelling tools, not to be used directly.
.Sh OPTIONS
The following options are available:
.Bl -tag -width Ds
.It Fl i
The
.Fl i
option returns information useful in creating an introduction to a manual
section.  See
.Xr intro 1 ,
.Xr intro 2 ,
etc. for examples.
.It Fl t
The
.Fl t
option returns information useful for creating a table of contents.
.It Fl w
The
.Fl w
option determines whether traditional man
.Pq Dq OLD ,
new mandoc
.Pq Dq NEW ,
or some unknown
.Pq Dq UNKNOWN
format exists.
.El
.Sh HISTORY
The
.Nm
command first appeared
.Bx 2.0
.Sh BUGS
It would be nice if
.Nm
could deal with preformatted manuals.
.Sh SEE ALSO
.Xr man 1 ,
.Xr catman 8 ,
.Xr makewhatis 8
