openbsd/src/share/man/man4/man4.sgi/grtwo.4
.\"	$OpenBSD: grtwo.4,v 1.2 2015/01/15 20:37:36 schwarze Exp $
.\"	$NetBSD: grtwo.4,v 1.3 2006/12/26 04:43:10 rumble Exp $
.\"
.\" Copyright (c) 2006 Stephen M. Rumble
.\" Copyright (c) 2003 Ilpo Ruotsalainen
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" <<Id: LICENSE_GC,v 1.1 2001/10/01 23:24:05 cgd Exp>>
.\"
.Dd $Mdocdate: January 15 2015 $
.Dt GRTWO 4 sgi
.Os
.Sh NAME
.Nm grtwo
.Nd SGI Express graphics
.Sh SYNOPSIS
.Cd "grtwo* at gio?"
.Cd "wsdisplay* at grtwo?"
.Sh DESCRIPTION
The
.Nm
driver supports the SGI
.Sq Express
series of graphics controllers, also known as
.Sq XS ,
.Sq XZ ,
.Sq Elan
and
.Sq Extreme ,
which may be found on Indigo, Crimson, Personal Iris, Indy and Indigo2
systems.
.Sh SEE ALSO
.Xr gio 4 ,
.Xr impact 4 ,
.Xr light 4 ,
.Xr newport 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 2.0 .
It was significantly reworked and improved in
.Ox 5.2 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Christopher SEKIYA .
