openbsd/src/share/man/man4/man4.sgi/hpc.4
.\"	$OpenBSD: hpc.4,v 1.5 2012/03/29 08:47:35 jmc Exp $
.\"	$NetBSD: hpc.4,v 1.12 2008/04/30 13:10:56 martin Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This document is derived from work contributed to The NetBSD Foundation
.\" by Antti Kantee.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE
.\" LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 29 2012 $
.Dt HPC 4 sgi
.Os
.Sh NAME
.Nm hpc
.Nd SGI High performance Peripheral Controller
.Sh SYNOPSIS
.Cd "hpc0 at gio0 addr 0x1fb80000"
.Cd "hpc1 at gio0 addr 0x1fb00000"
.Cd "hpc2 at gio0 addr 0x1fb98000"
.\" .Cd "hpc3 at gio0 addr 0x1fb90000"
.Sh DESCRIPTION
.Nm
interfaces the peripherals connected to it to the
.Xr gio 4
bus.
.Nm
is found on the Indigo, Indy, Challenge S, Challenge M,
and Indigo2 machines.
.Pp
There are three different numerical revisions of the
.Nm
controller.
Revisions 1 and 1.5 exist on Indigo machines,
as well as GIO32bis expansion cards such as the E++ SEEQ-based
Ethernet adapter.
Revision 1.5 supports bi-endian operation.
Revision 3 exists on Indy, Challenge S, Indigo2, and Challenge M systems.
It is possible to have an on-board HPC3 as well as HPC1.5-based
GIO32bis adapters in the Indy and Challenge S systems.
Additionally, the Challenge S may have a secondary HPC3 if the IOPLUS
(a.k.a. ''mezzanine'') board is installed.
.Sh LIST OF DEVICES
The devices currently supported are:
.Pp
.Bl -tag -width 10n -offset 3n -compact
.It Xr dpclock 4
DP8573A realtime clock
.It Xr dsclock 4
DS1286 realtime clock
.\" .It Xr haltwo 4
.\" HAL2 audio controller
.It Xr sq 4
Seeq 8003/80C03 Ethernet controller
.It Xr wdsc 4
WD33c93 SCSI controller
.It Xr zs 4
Zilog 8530 (ZSCC) Serial Communications Controller
.El
.Sh SEE ALSO
.Xr gio 4 ,
.Xr imc 4 ,
.Xr intro 4
.Sh BUGS
.Nm
revisions 1 and 1.5 support DMA buffer pointers of only 28 bits
and may therefore only address 256 megabytes of memory.
The R4k Indigo and Indy are the only systems that support sufficient
memory to illustrate this drawback.
A software workaround is not currently implemented.
Revision 3, with 32-bit pointers, does not have this limitation.
