openbsd/src/share/man/man4/man4.sgi/intro.4
.\"	$OpenBSD: intro.4,v 1.19 2009/05/17 22:08:34 miod Exp $
.\"     $NetBSD: intro.4,v 1.8 2004/02/10 16:54:19 wiz Exp $
.\"
.\" Copyright (c) 2003 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 17 2009 $
.Dt INTRO 4 sgi
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files,
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Sx SYNOPSIS
section of each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Sx DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation; see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices which may be configured into
the system and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the sgi platform.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then
compiled into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration time it is not
accessible at any time afterwards.
To enable a device which did not autoconfigure, the system must be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh HARDWARE
The following systems are supported:
.Pp
.Bl -column "Family" "Model"
.It Li Family Ta Model
.It Li " " " "
.It Li IP27 Ta Origin 200
.It Li IP27 Ta Origin 2000, Onyx 2
.It Li IP30 Ta "Octane, Octane 2 (Speedracer)"
.It Li IP32 Ta "O2, O2+ (Moosehead)"
.It Li IP35 Ta Fuel
.It Li IP35 Ta Origin 300, Onyx 300
.It Li IP35 Ta Origin 350, Onyx 350
.It Li IP35 Ta Origin 3000, Onyx 3000
.It Li IP35 Ta Onyx 4
.It Li IP35 Ta Tezro
.El
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of the
system.
.\" Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width 10n -offset 3n -compact
.It Xr ahc 4
Adaptec VL/EISA/PCI SCSI interface
.It Xr com 4
serial communications interface
.It Xr gbe 4
SGI Graphics Back End (GBE) frame buffer
.It Xr macebus 4
Multimedia, Audio and Communications Engine I/O ASIC
.It Xr mainbus 4
SGI main processor bus device
.It Xr mavb 4
Moosehead A/V Board audio device
.It Xr mec 4
MAC-110 10/100 Ethernet device
.It Xr power 4
power button
.It Xr xbow 4
Octane and Origin family XIO bus
.El
.Pp
A further list of available devices is contained within the pages
describing the system buses and controllers.
For example, a PCI device would be listed in the
.Xr pci 4
man page.
The following buses and controllers list these devices:
.Pp
.Bl -tag -width "cardbus(4)XX" -offset 3n -compact
.It Xr pci 4
introduction to PCI bus support
.It Xr usb 4
introduction to Universal Serial Bus support
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HISTORY
This
.Tn sgi
.Nm
appeared in
.Ox 3.6 .
