openbsd/src/share/man/man4/man4.sgi/intro.4
.\"	$OpenBSD: intro.4,v 1.4 2004/08/28 22:46:41 jmc Exp $
.\"     $NetBSD: intro.4,v 1.8 2004/02/10 16:54:19 wiz Exp $
.\"
.\" Copyright (c) 2003 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 24, 2004
.Dt INTRO 4 sgi
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files,
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation; see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices which may be configured into
the system and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the sgi platform.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then
compiled into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration time it is not
accessible at any time afterwards.
To enable a device which did not autoconfigure, the system must be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh HARDWARE
The following systems are supported:
.Pp
.Bl -tag -width 8n -offset indent -compact
.It O2
IP32
.Pq Dq Moosehead
.\" .It Indy
.\" IP24
.\" .Pq Dq Guinness
.\" .It Indigo 2
.\" IP22
.\" .Pq Dq Fullhouse
.\" .It Indigo R4k
.\" IP20
.\" .Pq Dq Blackjack
.\" .It Indigo R3k
.\" IP12
.\" .Pq Dq Hollywood
.El
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of the
system.
Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width 8n -offset indent -compact
.\" .It crime
.\" found on the O2
.\" .It dsclock
.\" real-time clock
.\" .It dpclock
.\" real-time clock
.\" .It gio
.\" PCI-like bus
.\" .It hpc
.\" High performance Peripheral Controller
.\" .It imc
.\" Indigo R4k/Indy/Indigo2 bus arbitrator
.It macebus
O2 main bus controller
.It mec
O2 on-board MAC110 Ethernet
.\" .It newport
.\" entry framebuffer on Indy and Indigo2
.\" .It pic
.\" Personal Iris 4D/3x and Indigo R3k bus arbitrator
.\" .It sbic
.\" WD33C93 SCSI interface
.\" .It sq
.\" SEEQ 8003/80C03 Ethernet
.\" .It wdsc
.\" WD33C93 SCSI interface
.El
.Pp
PCI devices are supported through the
.Xr pci 4
bus and associated device drivers.
.Sh SEE ALSO
.Xr autoconf 4 ,
.\" .Xr crime 4 ,
.\" .Xr gio 4 ,
.\" .Xr hpc 4 ,
.\" .Xr imc 4 ,
.Xr macebus 4 ,
.\" .Xr pic 4 ,
.Xr config 8
.Sh HISTORY
This
.Tn sgi
.Nm
appeared in
.Ox 3.6 .
