openbsd/src/share/man/man4/man4.sgi/iockbc.4
.\"	$OpenBSD: iockbc.4,v 1.3 2009/11/18 19:03:21 miod Exp $
.\"
.\" Copyright (c) 2009 Joel Sing <jsing@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 18 2009 $
.Dt IOCKBC 4 sgi
.Os
.Sh NAME
.Nm iockbc
.Nd IOC PS/2 keyboard and mouse interface
.Sh SYNOPSIS
.Cd "iockbc* at ioc?"
.Cd "iockbc* at iof?"
.Cd "pckbd* at iockbc?"
.Cd "pms* at iockbc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the keyboard and mouse interface found on
.Xr ioc 4
and
.Xr iof 4
devices.
.Sh SEE ALSO
.Xr ioc 4 ,
.Xr iof 4 ,
.Xr pckbd 4 ,
.Xr pms 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.7 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Joel Sing .
