openbsd/src/share/man/man4/man4.sgi/macebus.4
.\"	$OpenBSD: macebus.4,v 1.8 2008/03/27 13:47:08 jsing Exp $
.\"	$NetBSD: mace.4,v 1.4 2004/02/10 16:54:02 wiz Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE
.\" LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 27 2008 $
.Dt MACEBUS 4 sgi
.Os
.Sh NAME
.Nm macebus
.Nd Multimedia, Audio and Communications Engine I/O ASIC
.Sh SYNOPSIS
.Cd "macebus0 at mainbus0"
.Pp
.Cd "clock0 at macebus0"
.Cd "com0 at macebus0 base 0x00390000 irq 5"
.Cd "com1 at macebus0 base 0x00398000 irq 5"
.Cd "mavb0 at macebus0 base 0x00300000 irq 7"
.Cd "mec0 at macebus0 base 0x00280000 irq 4"
.Cd "mkbc0 at macebus0 base 0x00320000 irq 6"
.Cd "power0 at macebus0 irq 6"
.Pp
.Cd "macepcibr0 at macebus0"
.Cd "pci* at macepcbir?"
.Sh DESCRIPTION
The
.Nm
driver provides access to the MACE I/O ASIC, which manages all
on-board devices in an SGI O2 machine.
The
.Nm
also provides a
.Tn PCI
bridge.
.Sh SEE ALSO
.Xr com 4 ,
.Xr intro 4 ,
.Xr mainbus 4 ,
.Xr mavb 4 ,
.Xr mec 4 ,
.Xr mkbc 4 ,
.Xr pci 4 ,
.Xr power 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.6 .
