openbsd/src/share/man/man4/man4.sgi/mec.4
.\"	$OpenBSD: mec.4,v 1.9 2009/11/02 18:48:10 miod Exp $
.\"
.\"	Written by Michael Shalayeff, 2004. Public Domain.
.\"
.Dd $Mdocdate: November 2 2009 $
.Dt MEC 4 sgi
.Os
.Sh NAME
.Nm mec
.Nd MAC-110 10/100 Ethernet device
.Sh SYNOPSIS
.Cd "mec0 at macebus0"
.Cd "icsphy* at mii?"
.Cd "nsphy* at mii?"
.Cd "ukphy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the MAC-110 Fast Ethernet controller
found on
.Tn O2
machines.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr icsphy 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr macebus 4 ,
.Xr netintro 4 ,
.Xr nsphy 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 3.6 .
.Sh AUTHORS
The
.Nm
device driver was written by Izumi Tsutsui and Christopher SEKIYA.
The
.Ox
port was done by Michael Shalayeff.
