openbsd/src/share/man/man4/man4.sgi/newport.4
.\"	$OpenBSD: newport.4,v 1.6 2012/04/19 13:47:09 jmc Exp $
.\"	$NetBSD: newport.4,v 1.6 2006/12/26 04:43:10 rumble Exp $
.\"
.\" Copyright (c) 2003 Ilpo Ruotsalainen
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" <<Id: LICENSE_GC,v 1.1 2001/10/01 23:24:05 cgd Exp>>
.\"
.Dd $Mdocdate: April 19 2012 $
.Dt NEWPORT 4 sgi
.Os
.Sh NAME
.Nm newport
.Nd SGI Newport graphics
.Sh SYNOPSIS
.Cd "newport* at gio?"
.Cd "wsdisplay* at newport?"
.Sh DESCRIPTION
The
.Nm
driver supports the SGI
.Sq Newport
series of graphics controllers, also known as
.Sq Indy 8-bit ,
.Sq Indy 24-bit ,
.Sq XGE
and
.Sq XL ,
which may be found on Indy and Indigo2 systems.
.Sh SEE ALSO
.Xr gio 4 ,
.Xr grtwo 4 ,
.Xr impact 4 ,
.Xr light 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 2.0
and was ported to
.Ox 5.2 .
