openbsd/src/share/man/man4/man4.sgi/newport.4
.\"	$OpenBSD: newport.4,v 1.1 2004/08/06 23:51:59 mickey Exp $
.\"	$NetBSD: newport.4,v 1.4 2004/02/10 16:55:43 wiz Exp $
.\"
.\" Copyright (c) 2003 Ilpo Ruotsalainen
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" <<Id: LICENSE_GC,v 1.1 2001/10/01 23:24:05 cgd Exp>>
.\"
.Dd December 15, 2003
.Dt NEWPORT 4 sgi
.Os
.Sh NAME
.Nm newport
.Nd SGI NG1 graphics controller
.Sh SYNOPSIS
.Cd "newport* at gio? slot ?"
.Cd "wsdisplay* at newport? console ?"
.Sh DESCRIPTION
The
.Nm
driver supports the SGI NG1 (a.k.a. Indy 8-bit, Indy 24-bit, and
XL) graphics controllers, often found on Indy and Indigo2 machines.
.Sh SEE ALSO
.Xr gio 4 ,
.Xr wscons 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.6 .
