openbsd/src/share/man/man4/man4.sgi/odyssey.4
.\"     $OpenBSD: odyssey.4,v 1.2 2010/03/07 14:13:58 jsing Exp $
.\"
.\" Copyright (c) 2010 Joel Sing <jsing@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 7 2010 $
.Dt ODYSSEY 4 sgi
.Os
.Sh NAME
.Nm odyssey
.Nd SGI VPro (aka Odyssey) graphics
.Sh SYNOPSIS
.Cd "odyssey* at xbow?"
.Cd "wsdisplay* at odyssey?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the VPro (aka Odyssey) graphics card, which can be
found in SGI
.Tn Octane ,
.Tn Octane2 ,
.Tn Fuel ,
.Tn Tezro
and
.Tn Onyx
systems.
Console support is provided by the
.Xr wscons 4
console framework.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4 ,
.Xr xbow 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.7 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Joel Sing .
