openbsd/src/share/man/man4/man4.sgi/panel.4
.\"	$OpenBSD: panel.4,v 1.1 2012/04/18 18:01:56 miod Exp $
.\"
.\"
.\" Copyright (c) 2012 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 18 2012 $
.Dt PANEL 4 sgi
.Os
.Sh NAME
.Nm panel
.Nd front-panel buttons
.Sh SYNOPSIS
.Cd "panel* at hpc?"
.Sh DESCRIPTION
The
.Nm
driver handles the front-panel power and, on Indy, volume buttons.
If the
.Va hw.allowpowerdown
.Xr sysctl 8
is set to 1,
.Nm will signal
.Xr init 8
to do a clean
.Xr shutdown 8
when the power button is pressed.
.Sh SEE ALSO
.Xr hpc 4 ,
.Xr intro 4 ,
.Xr init 8 ,
.Xr rc.shutdown 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.2 .
.\" .Sh AUTHORS
.\" The
.\" .Nm
.\" driver was written by
.\" .An Miod Vallat .
