openbsd/src/share/man/man4/man4.sgi/power.4
.\"     $OpenBSD: power.4,v 1.4 2011/06/24 19:47:48 naddy Exp $
.\"
.\" Copyright (c) 2007 Jasper Lievisse Adriaanse <jasper@openbsd.org>
.\" All rights reserved.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 24 2011 $
.Dt POWER 4 sgi
.Os
.Sh NAME
.Nm power
.Nd power button
.Sh SYNOPSIS
.Cd "power0 at macebus0" Pq "O2"
.Cd "power0 at mainbus0" Pq "Octane"
.Sh DESCRIPTION
The SGI O2 and Octane machines generate an interrupt when the power button
on the front panel is pressed.
The
.Nm
driver catches that interrupt.
If the
.Va hw.allowpowerdown
.Xr sysctl 8
is set to 1,
.Nm
will then signal
.Xr init 8
to do a clean
.Xr shutdown 8 .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr macebus 4 ,
.Xr init 8 ,
.Xr rc.shutdown 8 ,
.Xr sysctl 8
.Sh HISTORY
Support for the
.Nm
driver first appeared in
.Ox 4.3 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Jasper Lievisse Adriaanse Aq jasper@openbsd.org .
