openbsd/src/share/man/man4/man4.sgi/wdsc.4
.\" $OpenBSD: wdsc.4,v 1.5 2012/03/28 20:44:23 miod Exp $
.\" $NetBSD: wdsc.4,v 1.10 2009/03/09 19:24:30 joerg Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Steve C. Woodford.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 28 2012 $
.Dt WDSC 4 sgi
.Os
.Sh NAME
.Nm wdsc
.Nd WD33c93 SCSI controller
.Sh SYNOPSIS
.Cd "wdsc* at hpc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Western Digital WD33c93 and WD33c93B SCSI
controllers.
.Pp
In addition to sending the required SCSI commands to
target devices on the SCSI bus, the
.Nm
driver deals with DMA, device interrupts, sync/async negotiation,
and target disconnects/reconnects.
.Sh DEVICE FLAGS
.Bl -tag -width "Bits XX-XX" -compact
.It Bits 0-7
Disable disconnect/reselect for the corresponding target
.It Bits 8-15
Disable synchronous negotiation for target "[bit - 8]"
.It Bits 16-23
Disable tagged queuing for target "[bit - 16]"
.El
.Pp
The
.Nm
device flags may be OR'd together to enable any combination of
the features listed above.
Tape devices should be allowed to disconnect for the SCSI bus to operate
acceptably.
.Sh SEE ALSO
.Xr hpc 4 ,
.Xr intro 4 ,
.Xr scsibus 4
