openbsd/src/share/man/man4/man4.sgi/xbridge.4
.\"	$OpenBSD: xbridge.4,v 1.6 2015/11/21 08:04:20 jmc Exp $
.\"
.\" Copyright (c) 2009 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 21 2015 $
.Dt XBRIDGE 4 sgi
.Os
.Sh NAME
.Nm xbridge ,
.Nm xbpci
.Nd XIO-PCI bridge
.Sh SYNOPSIS
.Cd "xbridge* at xbow?"
.Cd "xbpci* at xbridge?"
.Cd "pci* at xbpci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the XIO-PCI and XIO-PCI-X bridges commonly found
on Octane and Origin family systems.
.Pp
All these systems feature at least one
.Nm
device to which the on-board devices are connected.
.Pp
.Nm
devices support up to 8 different PCI devices, or two distinct
buses of 4 PCI-X devices.
Each PCI or PCI-X device is attached to a logical
.Nm xbpci
device.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr xbow 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
Support for the PCI-X bridges was added in
.Ox 4.7 .
.\" .Sh AUTHORS
.\" The
.\" .Nm
.\" driver was written by
.\" .An Miod Vallat .
