openbsd/src/share/man/man4/man4.sgi/zs.4
.\"	$OpenBSD: zs.4,v 1.4 2012/04/29 09:51:25 jmc Exp $
.\"	$NetBSD: zstty.4,v 1.14 2011/06/07 20:22:56 wiz Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gordon W. Ross.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: April 29 2012 $
.Dt ZS 4 sgi
.Os
.Sh NAME
.Nm zs ,
.Nm zskbd ,
.Nm zsms ,
.Nm zstty
.Nd Zilog 8530 (ZSCC) Serial Communications Controller
.Sh SYNOPSIS
.Cd "zs0    at hpc0"
.Cd "zs1    at hpc0"
.Cd "zskbd* at zs1 channel 0  " Pq "Indigo"
.Cd "zsms*  at zs1 channel 1  " Pq "Indigo"
.Cd "zstty* at zs0 channel ?"
.Sh DESCRIPTION
The
.Nm
driver provides TTY support for Zilog 8530 Dual UART chips.
On Indigo systems, one of the interfaces is hardwired for use by the
keyboard and mouse.
The
.Nm zskbd
devices connect keyboard devices to the generic keyboard driver
.Nm wskbd .
The
.Nm zsms
devices connect mice to the generic mouse driver
.Xr wsmouse 4 .
The remaining additional
.Nm zstty
interfaces provide RS-423
and RS-232 serial ports for general purpose use.
.Pp
The
.Nm
driver supports all of the standard
.Xr tty 4
ioctl calls.
The status of the DTR, RTS, CTS, and DCD signals can be queried with
TIOCMGET command, but, due to limitations in the hardware,
only the DTR and RTS signals can be modified with TIOCMSET, TIOCMBIC,
and TIOCMBIS
.Xr ioctl 2
commands.
.Pp
Input and output for each line may set to any baud rate in the
range 50 to 38400 (and higher on some machines).
.Pp
On some Indigo systems, the state of the CTS, DCD, DTR and RTS are
reported to be inverted.
The
.Nm zstty
driver can be told to expect this inverted wiring by setting
.Ar flags
to
.Ar 1
(either via
.Xr config 8
or
.Xr boot_config 8 ) .
Misconfiguration of these line settings usually leads to
.Xr getty 8
processes being unable to open the device or sleeping on
.Sq Dv ttyopn .
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/ttya
.It Pa /dev/ttyb
.El
.Sh DIAGNOSTICS
.Bl -tag -width indent
.It zs0*: fifo overflow
.br
The on-chip
.Dq FIFO
has overflowed and incoming data has been lost.
This generally means the machine is not responding to
interrupts from the ZS chip fast enough, which can be
remedied only by using a lower baud rate.
.It zs0*: ring overflow
.br
The software input
.Qq ring
has overflowed.
This usually means input flow-control is not configured correctly
.Pq i.e. incorrect cable wiring .
.El
.Sh SEE ALSO
.Xr hpc 4 ,
.Xr intro 4 ,
.Xr tty 4 ,
.Xr wskbd 4 ,
.Xr wsmouse 4
