openbsd/src/usr.sbin/sysmerge/sysmerge.8
.\"	$OpenBSD: sysmerge.8,v 1.58 2014/08/26 21:29:56 ajacoutot Exp $
.\"
.\" Copyright (c) 2008 Antoine Jacoutot <ajacoutot@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 26 2014 $
.Dt SYSMERGE 8
.Os
.Sh NAME
.Nm sysmerge
.Nd update system configuration files
.Sh SYNOPSIS
.Nm
.Bk -words
.Op Fl bdS
.Op Fl p | Op Fl x Ar xetcXX.tgz
.Ek
.Sh DESCRIPTION
.Nm
is a
.Xr ksh 1
script designed to help the administrator update configuration files
after upgrading to a new release or snapshot.
.Pp
.Nm
works by comparing a temporary reference root directory
against currently installed files.
The reference files are created from
.Pa /usr/share/sysmerge/etc.tgz
and
.Pa xetcXX.tgz .
All work is done under
.Pa ${TMPDIR}/sysmerge.XXXXXXXXXX
(known as the
.Em work directory ) .
The temporary root directory
.Pa temproot
is created under the work directory.
Each modified and/or replaced file is saved under the
.Pa backup
directory inside the work directory.
.Pp
If no path to
.Pa xetcXX.tgz
is specified on the command line,
.Nm
uses
.Xr ftp 1
to fetch and cryptographically verify the set from the URL pointed
to by the
.Ev SM_PATH
environment variable.
If no such variable is set,
.Pa xetcXX.tgz
is skipped.
.Pp
.Nm
will work through the fileset,
offering the chance to merge any differences using ${MERGE_CMD}.
Merged files may be edited using the default editor or be left to deal
with at a later date.
Should any problems occur,
such as a failure to upgrade a file,
the user will be notified and will have to deal with the issue by hand.
.Pp
By default (if
.Fl d
is not used)
.Nm
only compares files whose reference sources have changed since the last run
and attempts to automatically upgrade them to the newest version,
provided that they have no local changes.
It automatically installs missing files and binaries,
and updates files differing only by CVS Id.
Files whose reference sources have matching CVS Id are skipped from comparison.
.Pa /etc/fbtab
and
.Pa /etc/ttys
are created using helper scripts and are
.Sy always
compared.
Users and groups that are missing from the current installation but
present in the new
.Xr master.passwd 5
and
.Xr group 5
files will
.Sy always
be automatically (re)created.
.Pp
Each time
.Nm
is run it will compare the checksum of each file stored under
.Pa /etc/examples
against the previous one, then warn if it does not match and the
corresponding file exists under
.Pa /etc .
.Pp
.Nm
will finish by running
.Xr mtree 8
to make sure the directory structure has correct permissions.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl b
Batch mode.
.Nm
runs non-interactively,
saving differing files for later manual processing.
.It Fl d
Diff mode.
.Nm
does not take any automatic action, allowing for a full diff comparison.
.It Fl p
Package mode.
.Nm
compares the default configuration files of installed
.Xr packages 7
against their target on the system (@sample).
This option is mutually exclusive with
.Fl x .
.It Fl x Ar xetcXX.tgz
Specify a path to an
xetcXX.tgz tarball.
A tarball path specified as a URL will be passed
to
.Xr ftp 1 .
.El
.Pp
Files can be excluded from comparison by listing them in
.Pa /etc/sysmerge.ignore .
The following files will always be skipped from comparison:
.Pa /etc/*.db ,
.Pa /etc/localtime ,
.Pa /etc/mail/*.db ,
.Pa /etc/passwd ,
.Pa /etc/motd ,
.Pa /etc/myname ,
.Pa /var/db/locate.database ,
.Pa /usr/share/sysmerge/etcsum ,
.Pa /usr/share/sysmerge/examplessum ,
.Pa /usr/share/sysmerge/xetcsum ,
.Pa /var/mail/root .
.Pp
The
.Xr sendmail 8
configuration files
.Pa /etc/mail/localhost.cf ,
.Pa /etc/mail/sendmail.cf
and
.Pa /etc/mail/submit.cf
will always differ because they include their build date and directories.
A special test was added to handle this
and they are offered for comparison only if they really differ.
.Sh ENVIRONMENT
.Bl -tag -width "DESTDIRXXX"
.It Ev DBDIR
Directory in which checksum files are stored.
If unset, this defaults to
.Pa /usr/share/sysmerge .
.It Ev DESTDIR
Directory in which to merge and install files.
If unset, this defaults to
.Pa / .
.It Ev EDITOR , VISUAL
Specifies an editor to use.
If both
.Ev EDITOR
and
.Ev VISUAL
are set,
.Ev VISUAL
takes precedence.
If neither
.Ev EDITOR
nor
.Ev VISUAL
are set,
the default is
.Xr vi 1 .
.It Ev FTP_KEEPALIVE
Have
.Xr ftp 1
send a byte after every
.Ev FTP_KEEPALIVE
seconds,
so that incorrectly configured network equipment won't aggressively drop it.
See
.Dq ftp -k
for more information.
.It Ev MERGE_CMD
Command used to merge diffs.
This will be called with three arguments: the first argument is the
output file to create, the second argument is the currently installed
file and the third argument is the reference file.
If unset, this defaults to
.Dq sdiff -as -w ${SWIDTH} -o .
.It Ev PAGER
Specifies the pagination program to use.
.It Ev REPORT
Log summary which may contain information for further, manual,
updating.
Defaults to
.Pa ${WRKDIR}/sysmerge.log .
.It Ev SM_PATH
A URL, specifying the directory to search for
.Pa xetcXX.tgx
matching the
currently running release if none is specified on the command line.
.It Ev TMPDIR
Directory in which the work directory is created.
If unset, this defaults to
.Pa /var/tmp .
.El
.Sh FILES
.Bl -tag -width "${TMPDIR}/sysmerge.XXXXXXXXXX" -compact
.It ${TMPDIR}/sysmerge.XXXXXXXXXX
Default work directory.
The
.Sy temproot
and
.Sy backup
directories are created relative to this.
.It ${WRKDIR}/sysmerge.log
Default log file.
.It /etc/sysmerge.ignore
Files and directories to ignore from comparison.
.It /usr/share/sysmerge/etc.tgz
Base system
.Em etc
set corresponding to the currently installed release.
.El
.Sh SEE ALSO
.Xr more 1 ,
.Xr sdiff 1
.Pp
.Lk http://www.openbsd.org/faq/current.html
.Lk http://www.openbsd.org/faq/upgradeXX.html
.Sh HISTORY
The
.Nm
script first appeared in
.Ox 4.4 .
.Sh AUTHORS
.An -nosplit
The
.Nm
shell script was written by
.An Antoine Jacoutot Aq Mt ajacoutot@openbsd.org
using
.Fx
mergemaster written by
.An Douglas Barton Aq Mt DougB@FreeBSD.org
as a base.
