openbsd/src/usr.sbin/tcpdrop/tcpdrop.8
.\"	$OpenBSD: tcpdrop.8,v 1.3 2004/04/28 05:55:11 otto Exp $
.\"
.\" Copyright (c) 2004 Markus Friedl <markus@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd March 21, 2004
.Dt TCPDROP 8
.Os
.Sh NAME
.Nm tcpdrop
.Nd drop a TCP connection
.Sh SYNOPSIS
.Nm tcpdrop
.Ar laddr
.Ar lport
.Ar faddr
.Ar fport
.Sh DESCRIPTION
The
.Nm
command drops the TCP connection specified by the local address
.Ar laddr ,
port
.Ar laddr
and the foreign address
.Ar faddr ,
port
.Ar faddr .
Addresses and ports can be specified by name or numeric value.
.Sh EXAMPLE
If one connection to, e.g.
.Xr httpd 8
is causing congestion on a network link one can drop the TCP session
in charge:
.Bd -literal
# fstat | egrep 'httpd.*internet.*<--'
www      httpd      21307    3* internet stream tcp \\
	0xd1007ca8 192.168.5.41:80 <-- 192.168.5.1:26747
.Ed
.Pp
The following command will drop the connection:
.Bd -literal
# tcpdrop 192.168.5.41 80 192.168.5.1 26747
.Ed
.Sh SEE ALSO
.Xr fstat 1 ,
.Xr netstat 1
