openbsd/src/sys/arch/i386/stand/biosboot/biosboot.8
.\"	$OpenBSD: biosboot.8,v 1.3 1997/09/05 17:59:27 mickey Exp $
.\"
.\" Copyright (c) 1997 Michael Shalayeff
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Michael Shalayeff.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR 
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd September 1, 1997
.Dt BIOSBOOT 8 i386
.Os
.Sh NAME
.Nm biosboot
.Nd
primary system bootstrap program
.Sh DESCRIPTION
This small program (about of 256 bytes of code) is responsible for
loading second stage
.Xr boot 8
program, which in turn, will load the kernel.
It is small, robust and takes neither input nor options.
Location of the
.Xr boot 8
program is stored in the block table inside of the
.Nm
by the
.Xr installboot 8
program, and is very machine dependant. So, you have to run
.Xr installboot 8
program every time you are moving your disk between machines and/or
controllers.
.Pp
When it receives control from either BIOS or MBR it will print message:
.Pp
.Dl loading /boot
.Pp
followed by a dot for every successfully loaded block,
and then put cursor on the next line right before switching into the
protected mode and transferring control to the just loaded /boot program.
.Sh DIAGNOSTICS
Diagnostics consist of two error messages:
.Bl -tag -width read_error_
.It Er Read error
Some kind of error returned by the BIOS read call. This might be
any media error.
.It Er Bad magic
Just loaded /boot image contains bad magic in it's header.
This might indicate some kind of hardware problem.
This may also means that
.Ar boot
argument for
.Xr installboot 8
program was actually not a valid /boot program.
.El
Other common reason for those errors to appear is a wrong BIOS geometry
had been used in
.Xr installboot 8
for the device you are booting from.
.Sh FILES
.Bl -tag -width /usr/mdec/biosbootxx -compact
.It Pa /usr/mdec/mbr
Master Boot Record block
.It Pa /usr/mdec/biosboot
primary bootstrap
.It Pa /boot
system bootstrap
.It Pa /bsd
system code
.El
.Sh SEE ALSO
.Xr boot_i386 8 ,
.Xr fdisk 8 ,
.Xr installboot 8 ,
.Xr boot 8 .
.Sh BUGS
It contains fake fdisk table and the stuff, that it should not.
.Pp
It should check checksum over the loaded /boot image.
.Pp
There is neither BIOS error number reported nor the error location.
.Pp
There is a lot of strange behaviour with different BIOSes, the one of well
known lobotomy cases is a wrong boot drive number passed to boot program
by BIOS.
.Pp
You can pick your motherboard, and you can pick your BIOS,
but you can't pick your motherboard's BIOS.
.Sh HISTORY
This program was written by Michael Shalayeff for
.Ox 2.1 .
However it's based on bootstrap code from older versions of this
operating system, other operating systems, other programs, and
other people's works.
