openbsd/src/usr.sbin/httpd/src/support/apachectl.8
.\"	$OpenBSD: apachectl.8,v 1.10 2010/09/03 11:22:36 jmc Exp $
.\"
.\" ====================================================================
.\" The Apache Software License, Version 1.1
.\"
.\" Copyright (c) 2000-2003 The Apache Software Foundation.  All rights
.\" reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\"
.\" 3. The end-user documentation included with the redistribution,
.\"    if any, must include the following acknowledgment:
.\"       "This product includes software developed by the
.\"        Apache Software Foundation (http://www.apache.org/)."
.\"    Alternately, this acknowledgment may appear in the software itself,
.\"    if and wherever such third-party acknowledgments normally appear.
.\"
.\" 4. The names "Apache" and "Apache Software Foundation" must
.\"    not be used to endorse or promote products derived from this
.\"    software without prior written permission. For written
.\"    permission, please contact apache@apache.org.
.\"
.\" 5. Products derived from this software may not be called "Apache",
.\"    nor may "Apache" appear in their name, without prior written
.\"    permission of the Apache Software Foundation.
.\"
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESSED OR IMPLIED
.\" WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE APACHE SOFTWARE FOUNDATION OR
.\" ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\" ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" ====================================================================
.\"
.\" This software consists of voluntary contributions made by many
.\" individuals on behalf of the Apache Software Foundation.  For more
.\" information on the Apache Software Foundation, please see
.\" <http://www.apache.org/>.
.\"
.\" Portions of this software are based upon public domain software
.\" originally written at the National Center for Supercomputing Applications,
.\" University of Illinois, Urbana-Champaign.
.\"
.Dd $Mdocdate: September 3 2010 $
.Dt APACHECTL 8
.Os
.Sh NAME
.Nm apachectl
.Nd Apache HTTP server control interface
.Sh SYNOPSIS
.Nm
.Ar command
.Op Ar ...
.Sh DESCRIPTION
.Nm
is a front end to the Apache HyperText Transfer Protocol (HTTP) server.
It is designed to help the administrator control the
functioning of the Apache
.Xr httpd 8
daemon.
.Pp
.Ar command
can be any one or more of the following options:
.Bl -tag -width "configtestXX"
.It Ic configtest
Run a configuration file syntax test.
It parses the configuration files and either reports
.Dq Syntax OK
or detailed information about the particular syntax error.
.It Ic fullstatus
Display a full status report from
.Dq mod_status .
For this to work, you need to have mod_status enabled on your server
and a text-based browser such as
.Xr lynx 1
available on your system.
The URL used to access the status report can be set by editing the
.Dv STATUSURL
variable in the
.Nm
script.
.It Ic graceful
Gracefully restart
.Xr httpd 8
by sending it a
.Dv SIGUSR1 .
If the daemon is not running, it is started.
This differs from a normal restart
in that currently open connections are not aborted.
A side effect is that old log files will not be closed immediately.
This means that if used in a log rotation script,
a substantial delay may be necessary to ensure that
the old log files are closed before processing them.
This command automatically checks the configuration files via
.Ic configtest
before initiating the restart to make sure httpd doesn't die.
.It Ic help
Display a short help message.
.It Ic restart
Restart
.Xr httpd 8
by sending it a
.Dv SIGHUP .
If the daemon is not running, it is started.
This command automatically checks the configuration files via
.Ic configtest
before initiating the restart to make sure
.Xr httpd 8
doesn't die.
If httpd runs chrooted
(default in
.Ox )
and 3rd party modules are loaded,
restart may fail due to path inconsistency.
Completely stop and start the daemon instead.
.It Ic start
Start
.Xr httpd 8 .
If the daemon is already running,
a warning is given and no action is taken.
.It Ic startssl
Start
.Xr httpd 8
with SSL enabled;
see
.Xr ssl 8
for more information.
If the daemon is already running,
a warning is given and no action is taken.
.It Ic status
Display a brief status report.
Similar to the
.Ic fullstatus
option,
except that the list of requests currently being served is omitted.
.It Ic stop
Stop
.Xr httpd 8 .
.El
.Sh EXIT STATUS
The exit codes returned are:
.Pp
.Bl -tag -width "XXX" -offset indent -compact
.It 0
operation completed successfully
.It 2
usage error
.It 3
httpd could not be started
.It 4
httpd could not be stopped
.It 5
httpd could not be started during a restart
.It 6
httpd could not be restarted during a restart
.It 7
httpd could not be restarted during a graceful restart
.It 8
configuration syntax error
.El
.Pp
When multiple arguments are given,
only the error from the last one is reported.
.Sh SEE ALSO
.Xr httpd 8 ,
.Xr ssl 8
.Pp
Full documentation for httpd can be found at
.Pa /usr/share/doc/html/httpd/ .
