openbsd/src/usr.sbin/httpd/src/support/apachectl.8
.\"	$OpenBSD: apachectl.8,v 1.6 2004/12/06 11:17:41 jmc Exp $
.\"
.\" ====================================================================
.\" The Apache Software License, Version 1.1
.\"
.\" Copyright (c) 2000-2003 The Apache Software Foundation.  All rights
.\" reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\"
.\" 3. The end-user documentation included with the redistribution,
.\"    if any, must include the following acknowledgment:
.\"       "This product includes software developed by the
.\"        Apache Software Foundation (http://www.apache.org/)."
.\"    Alternately, this acknowledgment may appear in the software itself,
.\"    if and wherever such third-party acknowledgments normally appear.
.\"
.\" 4. The names "Apache" and "Apache Software Foundation" must
.\"    not be used to endorse or promote products derived from this
.\"    software without prior written permission. For written
.\"    permission, please contact apache@apache.org.
.\"
.\" 5. Products derived from this software may not be called "Apache",
.\"    nor may "Apache" appear in their name, without prior written
.\"    permission of the Apache Software Foundation.
.\"
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESSED OR IMPLIED
.\" WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE APACHE SOFTWARE FOUNDATION OR
.\" ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\" ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" ====================================================================
.\"
.\" This software consists of voluntary contributions made by many
.\" individuals on behalf of the Apache Software Foundation.  For more
.\" information on the Apache Software Foundation, please see
.\" <http://www.apache.org/>.
.\"
.\" Portions of this software are based upon public domain software
.\" originally written at the National Center for Supercomputing Applications,
.\" University of Illinois, Urbana-Champaign.
.\"
.Dd December 6, 2004
.Dt APACHECTL 8
.Os
.Sh NAME
.Nm apachectl
.Nd Apache HTTP server control interface
.Sh SYNOPSIS
.Nm
.Ar command
.Op Ar ...
.Sh DESCRIPTION
.Nm
is a front end to the Apache HyperText Transfer Protocol (HTTP) server.
It is designed to help the administrator control the
functioning of the Apache
.Xr httpd 8
daemon.
.Pp
NOTE:
If your Apache installation uses non-standard paths,
you will need to edit the
.Nm
script to set the appropriate paths to your PID file and your
.Xr httpd 8
binary.
See the comments in the script for details.
.Pp
The
.Nm
script returns a 0 exit value on success, and \*(Gt0 if an error occurs.
For more details, view the comments in the script.
.Pp
Full documentation for Apache is available at
.Pa http://httpd.apache.org/ .
.Sh OPTIONS
.Ar command
can be any one or more of the following options:
.Bl -tag -width "configtestXX"
.It Ic configtest
Run a configuration file syntax test.
It parses the configuration files and either reports
.Dq Syntax Ok
or detailed information about the particular syntax error.
.It Ic fullstatus
Displays a full status report from
.Dq mod_status .
For this to work, you need to have mod_status enabled on your server
and a text-based browser such as
.Xr lynx 1
available on your system.
The URL used to access the status report can be set by editing the
.Dv STATUSURL
variable in the script.
.It Ic graceful
Gracefully restarts the Apache daemon by sending it a
.Dv SIGUSR1 .
If the daemon is not running, it is started.
This differs from a normal restart
in that currently open connections are not aborted.
A side effect is that old log files will not be closed immediately.
This means that if used in a log rotation script,
a substantial delay may be necessary to ensure that
the old log files are closed before processing them.
This command automatically checks the configuration files via
.Ic configtest
before initiating the restart to make sure Apache doesn't die.
.It Ic help
Displays a short help message.
.It Ic restart
Restarts the Apache daemon by sending it a
.Dv SIGHUP .
If the daemon is not running, it is started.
This command automatically checks the configuration files via
.Ic configtest
before initiating the restart to make sure Apache doesn't die.
If the Apache daemon runs chrooted
(default in
.Ox )
and 3rd party modules are loaded,
restart may fail due to path inconsistency.
Completely stop and start the daemon instead.
.It Ic start
Start the Apache daemon.
Gives an error if it is already running.
.It Ic status
Displays a brief status report.
Similar to the fullstatus option,
except that the list of requests currently being served is omitted.
.It Ic stop
Stops the Apache daemon.
.El
.Sh SEE ALSO
.Xr httpd 8
