openbsd/src/usr.sbin/httpd/src/support/rotatelogs.8
.\"	$OpenBSD: rotatelogs.8,v 1.7 2004/12/20 15:23:46 jaredy Exp $
.\" ====================================================================
.\" The Apache Software License, Version 1.1
.\"
.\" Copyright (c) 2000-2003 The Apache Software Foundation.  All rights
.\" reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\"
.\" 3. The end-user documentation included with the redistribution,
.\"    if any, must include the following acknowledgment:
.\"       "This product includes software developed by the
.\"        Apache Software Foundation (http://www.apache.org/)."
.\"    Alternately, this acknowledgment may appear in the software itself,
.\"    if and wherever such third-party acknowledgments normally appear.
.\"
.\" 4. The names "Apache" and "Apache Software Foundation" must
.\"    not be used to endorse or promote products derived from this
.\"    software without prior written permission. For written
.\"    permission, please contact apache@apache.org.
.\"
.\" 5. Products derived from this software may not be called "Apache",
.\"    nor may "Apache" appear in their name, without prior written
.\"    permission of the Apache Software Foundation.
.\"
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESSED OR IMPLIED
.\" WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE APACHE SOFTWARE FOUNDATION OR
.\" ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\" ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" ====================================================================
.\"
.\" This software consists of voluntary contributions made by many
.\" individuals on behalf of the Apache Software Foundation.  For more
.\" information on the Apache Software Foundation, please see
.\" <http://www.apache.org/>.
.\"
.\" Portions of this software are based upon public domain software
.\" originally written at the National Center for Supercomputing Applications,
.\" University of Illinois, Urbana-Champaign.
.\"
.Dd December 18, 2004
.Dt ROTATELOGS 8
.Os
.Sh NAME
.Nm rotatelogs
.Nd rotate Apache logs without having to kill the server
.Sh SYNOPSIS
.Nm rotatelogs
.Ar logfile rotationtime Op Ar offset
.Sh DESCRIPTION
.Nm
is a simple program for use in conjunction with Apache's piped logfile
feature which can be used like this:
.Bd -literal -offset indent
TransferLog "| rotatelogs /path/to/logs/access_log 86400"
.Ed
.Pp
This creates the files
.Pa /path/to/logs/access_log.nnnn
where
.Em nnnn
is the system time at which the log nominally starts (this time will
always be a multiple of the rotation time, so you can synchronize
.Xr cron 1
scripts with it).
At the end of each rotation time (here, after 24 hours), a new log is
started.
.Pp
The arguments are as follows:
.Bl -tag -width rotationtime
.It Ar logfile
The path plus basename of the logfile.
If
.Ar logfile
includes any percent characters
.Pq Sq % ,
it is treated as a format string for
.Xr strftime 3 .
Otherwise, the suffix
.Em .nnnn
is automatically added and is the time at which the logfile was created.
.It Ar rotationtime
The rotation time in seconds.
.It Ar offset
The number of minutes offset from UTC.
If omitted, zero is assumed and UTC is used.
For example, to use local time in the zone UTC \-5 hours, specify a
value of \-300 for this argument.
.El
.Sh SEE ALSO
.Xr cron 1 ,
.Xr strftime 3 ,
.Xr httpd 8
