openbsd/src/usr.sbin/httpd/src/support/suexec.8
.\"	$OpenBSD: suexec.8,v 1.13 2007/05/31 19:20:24 jmc Exp $
.\" ====================================================================
.\" The Apache Software License, Version 1.1
.\"
.\" Copyright (c) 2000-2003 The Apache Software Foundation.  All rights
.\" reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\"
.\" 3. The end-user documentation included with the redistribution,
.\"    if any, must include the following acknowledgment:
.\"       "This product includes software developed by the
.\"        Apache Software Foundation (http://www.apache.org/)."
.\"    Alternately, this acknowledgment may appear in the software itself,
.\"    if and wherever such third-party acknowledgments normally appear.
.\"
.\" 4. The names "Apache" and "Apache Software Foundation" must
.\"    not be used to endorse or promote products derived from this
.\"    software without prior written permission. For written
.\"    permission, please contact apache@apache.org.
.\"
.\" 5. Products derived from this software may not be called "Apache",
.\"    nor may "Apache" appear in their name, without prior written
.\"    permission of the Apache Software Foundation.
.\"
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESSED OR IMPLIED
.\" WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE APACHE SOFTWARE FOUNDATION OR
.\" ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\" ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" ====================================================================
.\"
.\" This software consists of voluntary contributions made by many
.\" individuals on behalf of the Apache Software Foundation.  For more
.\" information on the Apache Software Foundation, please see
.\" <http://www.apache.org/>.
.\"
.\" Portions of this software are based upon public domain software
.\" originally written at the National Center for Supercomputing Applications,
.\" University of Illinois, Urbana-Champaign.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt SUEXEC 8
.Os
.Sh NAME
.Nm suexec
.Nd switch user for Apache CGI execution
.Sh SYNOPSIS
.Nm suexec
.Fl V
.Sh DESCRIPTION
.Nm
is the
.Dq wrapper
support program for the
.Em suexec
behaviour for the Apache
.Xr httpd 8
server.
It is run from within the server automatically to switch the user when
an external program has to be run under a different user.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl V
Display the list of compile-time settings used when
.Nm
was built.
No other action is taken.
.El
.Pp
Because this program is only used internally by
.Xr httpd 8 ,
there are no other ways to directly invoke
.Nm .
.Pp
In order to work correctly,
the
.Nm
binary should be owned by
.Dq root
and have the SETUID execution bit set.
.Ox
currently does not install
.Nm
with the SETUID bit set,
so a change of file mode is necessary to enable it:
.Pp
.Dl # chmod u+s /usr/sbin/suexec
.Sh SEE ALSO
.Xr httpd 8
.Pp
Apache suEXEC Support:
.Pa /var/www/htdocs/manual/suexec.html
