openbsd/src/usr.sbin/grfconfig/grfconfig.8
.\"	$NetBSD: grfconfig.8,v 1.3 1995/12/27 07:59:00 chopps Exp $
.\"
.\" Copyright (c) 1994 Ezra Story
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Ezra Story.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd October 7, 1994
.Dt GRFCONFIG 8 amiga
.Os 
.Sh NAME
.Nm grfconfig 
.Nd alter grf device screen mode definitions at run time
.Sh SYNOPSIS
.Nm grfconfig
.Op Fl r
.Ar device
.Op Ar file
.Sh DESCRIPTION
.Nm Grfconfig
is used to change or view the screen mode definition list contained
in a grf device.  You may also alter the console screen definition as well
as the definitions for the graphic screen.  The console will automatically
reinitialize itself to the new screen mode.
.Pp
The following flags and arguments are interpreted by
.Nm grfconfig :
.Bl -tag -width indent
.It Fl r
Print out a raw listing of the mode definitions instead of the
pretty list normally shown.
.It Ar device
The grf device to manipulate.  This argument is required.
.It Ar file
The file which contains the mode definitions.  If this argument
is not specified, 
.Nm grfconfig
will print out of a list of the modes currently loaded into
the grf device.  
.Pp
.Sh MODE DEFINITION FILE
The mode definitions are taken from a file which has lines of the format:
.Pp
num clk wid hi dep hbs hss hse hbe ht vbs vss vse vbe vt
.Pp
.Bl -tag -width indent
.It Ar num
The mode number for 'c' for the console mode.
.It Ar clk
The pixel clock in Hz.
.It Ar wid
The screen mode's width.
.It Ar hi
The screen mode's height.
.It Ar dep
The bitdepth of the mode.
.It Ar hbs hss hse hbe ht
The horizonatal timing parameters for the mode in pixel values.  All the
values are relative to the end of the horizontal blank (beginning of the
displayed area).
.It Ar vbs vss vse vbe vt
The vertical timing paramters for the mode in line values.  All the
values are relative to the end of vertical blank (beginning of the displayed
area).  If vbs is half the width, the grf device will interlace the
display.
If the vbs is twice the width, the grf device will scan double the display.
This is provided the grf device supports those two modes of operation.
.El
.Pp
.nf
 ------------------------------------------------------
 |                           ^                        |
 |                          vse                       |
 |      (0,0)                                         |
 |        *-----------------------------------        |
 |        |                  ^        ^      |        |
 |        |                 vbe       !      |        |
 |        |                           !      |        |
 |        |                           !      |        |
 |<-hse   |<-hbe                      !      |<-hbs   |      |      |
 |        |                           !      |   hss->| hse->| hbe->|
 |        |                          hi      |        |      |      |
 |        |                           !      |        |
 |        |                           !      |        |
 |        |<============ wid =========+=====>|        |
 |        |                           !      |        |
 |        |                           !      |        |
 |        |                           !      |        |
 |        |                           v      |        |
 |        ------------------------------------        |
 |                           ^                        |
 |                          vbs                       |
 |                                                    |
 ------------------------------------------------------
                             ^
                            vss
                        - ------- -
                             ^
                            vse
                        - ------- -
                             ^
                            vbe



.Sh BUGS
Some grf devices only understand horizontal cycle values instead of 
horizontal pixel values.  Add
the option
.Nm -o
to make grfconfig interpret values from the grf device as cycle values.
