openbsd/src/usr.sbin/amd/fsinfo/fsinfo.8
.\"	$OpenBSD: fsinfo.8,v 1.8 2007/05/31 19:20:22 jmc Exp $
.\" Copyright (c) 1993 Jan-Simon Pendry.
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)fsinfo.8	8.1 (Berkeley) 6/28/93
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt FSINFO 8
.Os
.Sh NAME
.Nm fsinfo
.Nd co-ordinate site-wide filesystem information
.Sh SYNOPSIS
.Nm fsinfo
.Bk -words
.Op Fl v
.Op Fl a Ar autodir
.Op Fl b Ar bootparams
.Op Fl d Ar dumpsets
.Op Fl e Ar exports
.Op Fl f Ar fstabs
.Op Fl h Ar hostname
.Op Fl m Ar automounts
.Op Fl I Ar dir
.Op Fl D Ar string[=string]]
.Op Fl U Ar string[=string]]
.Ar config ...
.Ek
.Sh DESCRIPTION
The
.Nm fsinfo
utility takes a set of system configuration information, and generates
a co-ordinated set of
.Xr amd 8 ,
.Xr mount 8
and
.Xr mountd 8
configuration files.
.Pp
The
.Nm fsinfo
command is fully described in the document
.%T "Amd - The 4.4BSD Automounter" .
.Sh SEE ALSO
.Xr amd 8 ,
.Xr mount 8 ,
.Xr mountd 8
.Sh HISTORY
The
.Nm fsinfo
command first appeared in
.Bx 4.4 .
