openbsd/src/libexec/spamd-setup/spamd-setup.8
.\"	$OpenBSD: spamd-setup.8,v 1.19 2009/02/19 17:11:20 jmc Exp $
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: February 19 2009 $
.Dt SPAMD-SETUP 8
.Os
.Sh NAME
.Nm spamd-setup
.Nd parse and load file of spammer addresses
.Sh SYNOPSIS
.Nm spamd-setup
.Op Fl bDdn
.Sh DESCRIPTION
The
.Nm
utility sends blacklist data to
.Xr spamd 8 ,
as well as configuring mail rejection messages for
blacklist entries.
.Pp
When
.Nm
is run in blacklist only mode,
it also sends blacklist data to the
.Xr pf 4
table
.Aq Ar spamd .
The
.Aq Ar spamd
table must then be used in conjunction with a
.Xr pf 4
redirection rule to selectively redirect mail connections
to
.Xr spamd 8 .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl b
Blacklisting only mode.
Blacklist data is normally stored only in
.Xr spamd 8 .
With this flag, data is stored in both
.Xr spamd 8
and
.Xr pf 4 .
Use this flag if
.Xr spamd 8
is running with the
.Fl b
flag too.
.It Fl D
Daemonize;
run
.Nm
in the background.
.It Fl d
Debug mode reports a few pieces of information.
.It Fl n
Dry-run mode.
No data is shipped.
.El
.Pp
Lists are specified in the configuration file
.Pa /etc/mail/spamd.conf
and are processed in the order specified in the
.Ar all
tag.
Output is concatenated and sent to a running
.Xr spamd 8 .
Addresses are sent
along with the message spamd will give on mail rejection when a
matching client connects.
The configuration port for
.Xr spamd 8
is found from
.Xr services 5 ,
by looking for the named service
.Em spamd-cfg .
.Pp
.Nm
reads all configuration information from the
.Xr spamd.conf 5
file.
.Sh FILES
.Bd -literal
/etc/mail/spamd.conf
.Ed
.Sh SEE ALSO
.Xr pf.conf 5 ,
.Xr services 5 ,
.Xr spamd.conf 5 ,
.Xr spamd 8
.Sh BUGS
Blacklists removed from
.Pa /etc/mail/spamd.conf
are not automatically removed from the running
.Xr spamd 8 .
If an entry is removed from
.Pa /etc/mail/spamd.conf
that is currently in use, it is necessary to restart
.Xr spamd 8 .
This applies only to blacklists that are removed entirely, not those
that are simply modified.
