openbsd/src/libexec/spamd-setup/spamd-setup.8
.\"	$OpenBSD: spamd-setup.8,v 1.2 2003/03/08 19:33:10 beck Exp $
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jason L. Wright
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 14, 2003
.Dt SPAMD-SETUP 8
.Os
.Sh NAME
.Nm spamd-setup
.Nd parse and load file of spammer addresses
.Sh SYNOPSIS
.Nm spamd-setup
.Op Ar file ...
.Sh DESCRIPTION
The
.Nm
utility adds blacklists by adding addresses to the
.Xr pf 4
table
.Aq spamd ,
as well as configuring mail rejection messages for
the added list of addresses in
.Xr spamd 8 .
The
.Aq spamd
table is used in conjuction with a
.Xr pf 4
redirection rule to selectively redirect mail connections
to the
.Xr spamd 8
daemon.
.Pp
blacklists and whitelists are specified in the configuration file
.Pa /etc/spamd.conf
and are processed in the order specified in the 
.Ar all
tag. 
output is concatenated to build up a table for
.Xr pf 4 .
Then the blacklist addresses are sent to a running
.Xr spamd 8
along with the message spamd will give on mail rejection when a
matching client connects.
.Pp
.Nm
reads all configuration information from a 
.Xr spamd.conf 5
file.
.Sh FILES
.Pa /etc/spamd.conf
.Pp
.Sh SEE ALSO
.Xr ftp 1 ,
.Xr pf 4 ,
.Xr spamd 8,
.Xr spamd.conf 5
