openbsd/src/usr.sbin/nsd/nsd-notify.8
.TH "nsd\-notify" "8" "Jan  6, 2010" "NLnet Labs" "nsd 3.2.4"
.\" Copyright (c) 2001\-2008, NLnet Labs. All rights reserved.
.\" See LICENSE for the license.
.SH "NAME"
.LP 
.B nsd\-notify 
\- program to send NOTIFY's to remote nameservers.
.SH "SYNOPSIS"
.LP
.B nsd\-notify
.RB [ \-4 ]
.RB [ \-6 ]
.RB [ \-h ]
.RB [ \-a
.IR address[@port] ]
.RB [ \-p
.IR port ]
.RB [ \-y
.IR key:secret[:algorithm] ]
.B \-z
.I zone servers
.SH "DESCRIPTION"
.LP 
.B Nsd\-notify 
is simple program to send NOTIFY's to remoter nameservers.
.B NSD 
is a complete implementation of an authoritative DNS nameserver.
.SH "OPTIONS"
.TP
.B \-4
Only send to IPv4 addresses.
.TP
.B \-6
Only send to IPv6 addresses.
.TP
.B \-h
Print help information and exit.
.TP 
.B \-a\fI address[@port]
Specify the source address (and port) to send from.
.TP 
.B \-p\fI port
Specify the port to send to.
.TP 
.B \-y\fI key:secret[:algorithm]
Specify a TSIG key and base64 encoded secret to sign the notification with. If 
the TSIG algorithm is not defined, MD5 is used.
.TP 
.B z\fI zone
Specify the zone to notify about.
.TP 
.I servers
List of nameservers to send to.
.SH "EXAMPLES"
.LP 
To run this program the standard way type:
.LP 
.B # nsd\-notify \-z foobar.cz 1.2.3.4
.SH "SEE ALSO"
.LP 
nsd(8), nsdc(8), nsd.conf(5), nsd\-checkconf(8),
nsd\-patch(8), nsd\-xfer(8), zonec(8)
.SH "AUTHORS"
.B NSD
was written by NLnet Labs and RIPE NCC joint team. Please see CREDITS
file in the distribution for further details.
