openbsd/src/share/man/man5/bsd.port.arch.mk.5
.\" $OpenBSD: bsd.port.arch.mk.5,v 1.2 2011/09/25 18:12:12 jmc Exp $
.\"
.\" Copyright (c) 2011 Marc Espie
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: September 25 2011 $
.Dt BSD.PORT.ARCH.MK 5
.Os
.Sh NAME
.Nm bsd.port.arch.mk
.Nd ports tree Makefile fragment, concerned with arch issues
.Sh SYNOPSIS
.Bd -literal
# Set up such as
MULTI_PACKAGES = -main -special
ONLY_FOR_ARCHS-special = i386
.Ed
.Pp
.Fd .include <bsd.port.arch.mk>
.Bd -literal
#some more lines such as
\&.if ${BUILD_PACKAGES:M-special}
CONFIGURE_ARGS += --enable-special
\&.endif
.Ed
.Pp
.Fd .include <bsd.port.mk>
.Sh DESCRIPTION
.Nm
holds the logic used for arch-dependent builds in the ports tree.
It is normally included as part of the larger
.Xr bsd.port.mk 5 ,
but it is also available separately for ports that require it.
.Nm
assumes the following variables are already defined:
.Bl -tag -offset indent -compact -width ONLY_FOR_ARCH-<sub>
.It MULTI_PACKAGES
.It FLAVOR
.It Ev NOT_FOR_ARCHS-<sub>
.It Ev ONLY_FOR_ARCHS-<sub>
.El
and optionally, if the default won't be appropriate
.Bl -tag -offset indent -compact -width ONLY_FOR_ARCH-<sub>
.It Ev NO_SHARED_LIBS
.It Ev IGNORE-<sub>
.El
.Pp
It will set up the following variables for use in the rest of the
.Pa Makefile :
.Bl -tag -offset indent -compact -width ONLY_FOR_ARCH-<sub>
.It Ev ARCH
.It Ev ALL_ARCHS
.It Ev APM_ARCHS
.It Ev COMPILER_VERSION
.It Ev GCC2_ARCHS
.It Ev GCC3_ARCHS
.It Ev GCC4_ARCHS
.It Ev LP64_ARCHS
.It Ev NO_SHARED_ARCHS
.It Ev NO_SHARED_LIBS
.It Ev IGNORE-<sub>
.It Ev BUILD_PACKAGES
.El
.Pp
Most importantly,
.Ev BUILD_PACKAGES
will be correctly set up, taking
.Ev ONLY_FOR_ARCHS-<sub>
and
.Ev NOT_FOR_ARCHS-<sub>
limitations into account, as well as pseudo-flavors.
.Pp
Note that thanks to the way
.Xr make 1
variables are evaluated, a setup such as
.Bd -literal -offset indent
ONLY_FOR_ARCHS-foo = ${LP64_ARCHS}
.Ed
.Pp
is perfectly admissible, since it will be used only after
.Ev LP64_ARCHS
is defined.
.Pp
A more detailed description of each variable is available in
.Xr bsd.port.mk 5 .
.Pp
.Nm
also takes care of including
.Pa ${.CURDIR}/../Makefile.inc ,
so its definitions can be used in the following lines.
However, please note that it does not handle
.Ev MODULES
inclusion.
.Sh SEE ALSO
.Xr bsd.port.mk 5
.Sh HISTORY
.Nm
was split from
.Xr bsd.port.mk 5
in
.Ox 5.1 .
