openbsd/src/share/man/man5/disktab.5
.\"	$OpenBSD: disktab.5,v 1.13 2011/07/11 09:37:51 jmc Exp $
.\"	$NetBSD: disktab.5,v 1.4 1994/11/30 19:31:15 jtc Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)disktab.5	8.1 (Berkeley) 6/5/93
.\"
.Dd $Mdocdate: July 11 2011 $
.Dt DISKTAB 5
.Os
.Sh NAME
.Nm disktab
.Nd disk description file
.Sh SYNOPSIS
.Fd #include <disktab.h>
.Sh DESCRIPTION
.Nm
is a simple database which describes disk geometries and
disk partition characteristics.
It is used
to initialize the disk label on the disk.
The format is patterned after the
.Xr termcap 5
terminal database.
Entries in
.Nm
consist of a number of colon
.Pq Ql \&:
separated fields.
The first entry for each disk gives the names which are
known for the disk, separated by
.Dq \&|
characters.
The last name given should be a long name fully identifying the disk.
.Pp
The following list indicates the normal values stored for each disk entry:
.Bl -column "indent" "boolx"
.It Sy Name	Type	Description
.It "\&ty	str	Type of disk (e.g., removable, winchester)."
.It "\&dt	str	Type of controller (e.g.,"
.Tn SMD , ESDI ,
floppy).
.It "\&ns	num	Number of sectors per track."
.It "\&nt	num	Number of tracks per cylinder."
.It "\&nc	num	Total number of cylinders on the disk."
.It "\&sc	num	Number of sectors per cylinder (default: ns*nt)."
.It "\&su	num	Number of sectors per unit (default: sc*nc)."
.It "\&se	num	Sector size in bytes (default:"
.Dv DEV_BSIZE ) .
.It "\&sf	bool	Controller supports bad144-style bad sector forwarding."
.It "\&rm	num	Rotation speed in RPM (default: 3600)."
.It "\&sk	num	Sector skew per track (default: 0)."
.It "\&cs	num	Sector skew per cylinder (default: 0)."
.It "\&hs	num	Headswitch time in usec (default: 0)."
.It "\&ts	num	One-cylinder seek time in usec (default: 0)."
.It "\&il	num	Sector interleave (n:1) (default: 1)."
.It "\&d[0-4]	num	Drive-type-dependent parameters."
.It "\&b0	str	Pathname to primary bootstrap."
.It "\&b1	str	Pathname to secondary bootstrap."
.It "\&bs	num	Boot block size (default:"
.Dv BBSIZE ) .
.It "\&sb	num	Superblock size (default: "
.Dv SBSIZE ) .
.Pp
.It "\&ba	num	Block size for partition"
.Dq a
(bytes).
.It "\&bd	num	Block size for partition"
.Dq d
(bytes).
.It "\&be	num	Block size for partition"
.Dq e
(bytes).
.It [...]
.It "\&bp	num	Block size for partition"
.Dq p
(bytes).
.Pp
.It "\&fa	num	Fragment size for partition"
.Dq a
(bytes).
.It "\&fd	num	Fragment size for partition"
.Dq d
(bytes).
.It "\&fe	num	Fragment size for partition"
.Dq e
(bytes).
.It [...]
.It "\&fp	num	Fragment size for partition"
.Dq p
(bytes).
.Pp
.It "\&oa	num	Offset of partition"
.Dq a
(sectors).
.It "\&ob	num	Offset of partition"
.Dq b
(sectors).
.It "\&oc	num	Offset of partition"
.Dq c
(sectors).
.It [...]
.It "\&op	num	Offset of partition"
.Dq p
(sectors).
.Pp
.It "\&pa	num	Size of partition"
.Dq a
(sectors).
.It "\&pb	num	Size of partition"
.Dq b
(sectors).
.It "\&pc	num	Size of partition"
.Dq c
(sectors).
.It [...]
.It "\&pp	num	Size of partition"
.Dq p
(sectors).
.Pp
.It "\&ta	str	Type of partition"
.Dq a
(4.2BSD, swap, etc.).
.It "\&tb	str	Type of partition"
.Dq b .
.It "\&tc	str	Type of partition"
.Dq c .
.It [...]
.It "\&tp	str	Type of partition"
.Dq p .
.El
.Sh FILES
.Bl -tag -width /etc/disktab -compact
.It Pa /etc/disktab
.El
.Sh SEE ALSO
.Xr getdiskbyname 3 ,
.Xr disklabel 5 ,
.Xr disklabel 8 ,
.Xr newfs 8
.Sh HISTORY
The
.Nm
description file appeared in
.Bx 4.2 .
