openbsd/src/share/man/man5/ethers.5
.\"	$OpenBSD: ethers.5,v 1.11 2000/03/19 19:25:27 aaron Exp $
.\"	$NetBSD: ethers.5,v 1.2 1994/11/30 19:31:16 jtc Exp $
.\"
.\"     Written by Roland McGrath <roland@frob.com>.  Public domain.
.\"
.Dd December 16, 1993
.Dt ETHERS 5
.Os
.Sh NAME
.Nm ethers
.Nd Ethernet host name data base
.Sh DESCRIPTION
The
.Nm
file maps Ethernet addresses to host names.
Lines consist of an address and a host name, separated by any number of blanks and/or tab characters.
A
.Dq #
indicates the beginning of a comment; characters up to the end of
the line are not interpreted by routines which search the file.
.Pp
Ethernet addresses are expressed as six hexadecimal numbers separated by
colons.
The functions described in
.Xr ethers 3
can read and produce this format.
.Pp
The
.Nm
file has support for YP functionality.
.Sh FILES
.Bl -tag -width /etc/ethers -compact
.It Pa /etc/ethers
.El
.Sh SEE ALSO
.Xr ethers 3 ,
.Xr diskless 8
.Sh BUGS
A name server should be used instead of a static file.
.Pp
Lines in
.Pa /etc/ethers
are limited to
.Dv BUFSIZE
characters (currently 1024).
Longer lines will be ignored.
.Sh HISTORY
The
.Nm
file format was adopted from SunOS and appeared in
NetBSD 0.9b.
