openbsd/src/share/man/man5/fbtab.5
.\"	$OpenBSD: fbtab.5,v 1.13 2007/05/31 19:19:58 jmc Exp $
.\"
.\" Copyright (c) 1996 Theo de Raadt
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt FBTAB 5
.Os
.Sh NAME
.Nm fbtab
.Nd change device protection upon login
.Sh DESCRIPTION
The
.Nm
file contains lines which specify how the permissions and ownership of
various system files should be changed based on the user's login device name.
.Pp
Comments start with a
.Ql #
and extend to the end of the line.
Blank lines or lines with only a comment are ignored.
.Pp
All other lines consist of three fields delimited by whitespace.
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It Login Device
The device you have logged in on (e.g.,
.Dq /dev/ttyv0 ) .
.It File Permission
An octal permission number (0600), as used by
.Xr chmod 2 .
.It Other devices
The final field is a colon
.Pq Ql \&:
delimited list of devices (e.g.,
.Dq /dev/console:/dev/fd0a ) .
All device names are absolute paths.
A path that ends in
.Dq /\&*
refers to all directory entries except
.Dq \&.
and
.Dq \&.\&. .
.El
.Pp
The
.Nm
file is used by
.Xr login 1
to
.Xr chown 2
the specified files to the user who has performed a login.
Additionally,
.Xr chmod 2
is used to set the devices to the specified permission.
When a user logs out,
.Xr init 8
is responsible for performing the inverse operation, which results in
the files once again belonging to root.
.Sh FILES
.Bl -tag -width /etc/fbtab -compact
.It Pa /etc/fbtab
.El
.Sh SEE ALSO
.Xr login 1 ,
.Xr login_fbtab 3 ,
.Xr init 8
.Sh AUTHORS
Guido van Rooij
