openbsd/src/share/man/man5/hostname.if.5
.\"	$OpenBSD: hostname.if.5,v 1.26 2001/10/04 10:28:20 wilfried Exp $
.\"	$NetBSD: hosts.5,v 1.4 1994/11/30 19:31:20 jtc Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)hosts.5	8.2 (Berkeley) 12/11/93
.\"
.Dd September 2, 1999
.Dt HOSTNAME.IF 5
.Os
.Sh NAME
.Nm hostname.if
and
.Nm bridgename.if
.Nd interface-specific configuration files
.Sh DESCRIPTION
The
.Nm hostname.*
and
.Nm bridgename.*
files contain information regarding the configuration of each network interface.
One file should exist for each interface that is to be configured, such as
.Pa hostname.fxp0
or
.Pa bridgename.bridge0 .
However, a configuration file is not needed for lo0.
Note that multiple entries can be used per configuration file.
.Pp
The following three formats are valid for
.Nm hostname.*
files.
.Pp
Regular ipv4 network setup:
.Bd -literal -offset xxxx
.Va addr_family [ alias ] addr netmask broadcast_addr options
.Li dest Va dest_addr
.Ed
.Pp
Regular ipv6 network setup:
.Bd -literal -offset xxxx
.Va addr_family [ alias ] addr prefixlen options
.Ed
.Pp
Other network setup:
.Bd -literal -offset xxxx
.Va addr_family Va options
.Ed
.Pp
A typical file contains only one line, but more extensive files are possible,
for example:
.Bd -literal -offset xxxx
inet 10.0.1.12 255.255.255.0 10.0.1.255 media 100baseTX
inet alias 10.0.1.13 255.255.255.255 10.0.1.13
inet alias 10.0.1.14 255.255.255.255 NONE
inet alias 10.0.1.15 255.255.255.255
inet alias 10.0.1.16 0xffffffff
inet6 alias fec0::1 64
inet6 alias fec0::2 64 anycast
# This is an example comment line.
!wicontrol \e$if -t 2  # Set to 2Mbps
.Ed
.Pp
The above formats have the following field values:
.Bl -tag -width indent -offset xxxx
.It Va addr_family
The address family of the interface, generally
.Dq inet
or
.Dq inet6.
.It Va addr
The optional address that belongs to the interface, such as
190.191.192.1 or fe80:2::1 .
It is also feasible to use a hostname as specified in
.Pa /etc/hosts .
It is recommended that an address be used instead of symbolic information
which might activate
.Xr resolver 3
library routines.
.Pp
If no address is specified, the
.Va netmask ,
.Va broadcast_addr ,
.Li dest ,
and
.Va dest_addr
options are invalid and will be ignored.
.It Va netmask
The optional network mask for the interface, i.e.,
255.255.255.0.
.It Va broadcast_addr
The optional broadcast address for the interface, i.e.,
190.191.192.255
.It Va options
Optional miscellaneous options to set on the interface, i.e.,
.Dq media 100baseTX mediaopt full-duplex .
.It Li dest
If the interface needs a destination address set, this is the literal text
.Dq dest .
As shown in the example, this declaration should start on a separate line.
.It Va dest_addr
The destination address to be set on the interface, such as
190.191.192.2.
It is also feasible to use a hostname as specified in
.Pa /etc/hosts .
It is recommended that an address be used instead of symbolic information
which might activate
.Xr resolver 3
library routines.
.It Va prefixlen
The prefixlen number, or number of bits in the netmask, to be set on
the interface, such as 64.
.It Va #
Comments are allowed.
Anything following a comment character is treated as a comment.
.It Va ! Ar command-line
Arbitrary shell commands can be executed using this directive.
Useful for doing interface specific configuration using commands like
.Xr wicontrol 8 ,
setting up custom routes using
.Xr route 8 ,
or establishing tunnels using
.Xr ifconfig 8 .
It is worth noting that
.Dq \e$if
in a command line will be replaced by the interface name.
.El
.Pp
A DHCP-configured network interface setup consists of
.Pp
.Bd -literal -offset xxxx
.Li dhcp Va options
.Ed
.Pp
For example,
.Bd -literal -offset xxxx
dhcp media 100baseTX mediaopt full-duplex
.Ed
.Pp
The above format has the following field values:
.Bl -tag -width indent -offset xxxx
.It Li dhcp
The literal string
.Dq dhcp
if the interface is to be configured using DHCP.
See
.Xr dhclient 8
and
.Xr dhclient.conf 5
for more details.
.It Va options
Optional miscellaneous options to set on the interface, i.e.,
.Dq media 100baseTX mediaopt full-duplex .
.El
.Pp
IPv6 stateless address autoconfiguration:
.Pp
.Bd -literal -offset xxxx
.Li rtsol Va options
.Ed
.Pp
The above format has the following field values:
.Bl -tag -width indent -offset xxxx
.It Li rtsol
The literal string
.Dq rtsol
if the interface is to be configured using
IPv6 stateless address autoconfiguration.
This should be used on single interface host only,
as IPv6 specifications are silent about the behavior on multi-interface case.
Also note that the kernel must be configured to accept
IPv6 router advertisement, and configured as host (non-router).
Add the following lines into
.Xr sysctl.conf 5 :
.Bd -literal -offset xxxx
.Li net.inet6.ip6.forwarding=0
.Li net.inet6.ip6.accept_rtadv=1
.Ed
.It Va options
Optional miscellaneous options to set on the interface, e.g.,
.Dq media 100baseTX mediaopt full-duplex .
.El
.Pp
An addressless network interface setup (useful for
.Xr bridge 4
member interfaces and interfaces to be used with
.Xr pppoe 8 )
consists of
.Pp
.Bd -literal -offset xxxx
.Li up Va options
.Ed
.Pp
The above format has the following field values:
.Bl -tag -width indent -offset xxxx
.It Li up
The literal string
.Dq up
if the interface is to be simply brought up.
.It Va options
Optional miscellaneous options to set on the interface, e.g.,
.Dq media 100baseTX mediaopt full-duplex .
.El
.Pp
The final file format only applies to
.Nm bridgename.bridge*
files.
A bridge interface setup consists of
.Pp
.Bd -literal -offset xxxx
.Va brconfig-arguments
.Va brconfig-arguments
\&...
.Ed
.Pp
For example,
.Bd -literal -offset xxxx
add fxp0
add ep1
-learn fxp0
#
!ipsecadm flush
#
static fxp0 8:0:20:1e:2f:2b
up    # and finally enable it
.Ed
.Pp
The options are as follows:
.Bl -tag -width indent -offset xxxx
.It Va brconfig-arguments
.Xr brconfig 8
is called for each successive line.
Comments starting with
.Ql #
and commands to be executed
prefixed by
.Ql !
are permitted.
.El
.Sh SEE ALSO
.Xr hosts 5 ,
.Xr dhcp 8 ,
.Xr ifconfig 8 ,
.Xr rc 8
