openbsd/src/share/man/man5/motd.5
.\"	$OpenBSD: motd.5,v 1.5 2000/10/26 00:37:05 aaron Exp $
.\"	$NetBSD: motd.5,v 1.2 1994/12/28 18:58:53 glass Exp $
.\"
.\" This file is in the public domain.
.\"
.Dd December 28, 1994
.Dt MOTD 5
.Os
.Sh NAME
.Nm motd
.Nd message of the day
.Sh DESCRIPTION
The
.Pa /etc/motd
file is normally displayed by
.Xr login 1
after a user has logged in but before the shell is run.
It is generally used for important system-wide announcements.
During system startup, a line containing the kernel version string is
prepended to this file.
.Pp
Individual users may suppress the display of this file by creating a file named
.Pa .hushlogin
in their home directories.
.Sh EXAMPLES
.Bd -literal
OpenBSD 1.2 (GENERIC) #3: Fri Jun 28 22:47:57 MDT 1996

Make sure you have a .forward file...

4/17	Machine will be down for backups all day Saturday.
.Ed
.Sh FILES
.Bl -tag -width /etc/motd -compact
.It Pa /etc/motd
.El
.Sh SEE ALSO
.Xr login 1
