openbsd/src/share/man/man5/networks.5
.\"	$OpenBSD: networks.5,v 1.19 2014/08/23 07:25:54 jmc Exp $
.\"	$NetBSD: networks.5,v 1.9 1999/03/17 20:19:47 garbled Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)networks.5	8.1 (Berkeley) 6/5/93
.\"
.Dd $Mdocdate: August 23 2014 $
.Dt NETWORKS 5
.Os
.Sh NAME
.Nm networks
.Nd Internet Protocol network name database
.Sh DESCRIPTION
The
.Nm
file is used as a local source to translate between Internet Protocol (IP)
network addresses and network names (and vice versa).
It can be used in conjunction with the Domain Name System (DNS).
.Pp
While the
.Nm
file was originally intended to be an exhaustive list of all IP
networks that the local host could communicate with, distribution
and update of such a list for the world-wide
.Tn Internet
(or, indeed, for any large "enterprise" network) has proven to be
prohibitive, so the Domain Name System is used instead, except as noted.
.Pp
For each IP network, a single line should be present with the following
information:
.Bd -unfilled -offset indent
official network name
ip network number
aliases
.Ed
.Pp
Items are separated by any number of blanks and/or tab characters.
.Pp
A hash mark
.Pq Ql #
indicates the beginning of a comment; subsequent characters up to the end of
the line are not interpreted by routines which search the file.
.Pp
Network number may be specified in the conventional
.Ql \&.
(dot) notation using the
.Xr inet_addr 3
routine from the IP address manipulation library.
Network names may contain
.Qq a
through
.Qq z ,
zero through nine, and dash
.Pq Ql \&- .
.Pp
IP network numbers on the Internet
are generally assigned to a site by its Internet Service Provider (ISP),
who, in turn, get network address space assigned to them by one of
the regional Internet Registries (e.g., ARIN, RIPE NCC, APNIC).
These registries, in turn, answer to the Internet Assigned Numbers
Authority (IANA).
.Pp
If a site changes its ISP from one to another, it will generally
be required to change all its assigned IP addresses as part of the
conversion; that is, return the previous network numbers to the previous ISP
and assign addresses to its hosts from IP network address space given by the
new ISP.
Thus, it is best for a savvy network manager to configure his
hosts for easy renumbering, to preserve his ability to easily change his
ISP should the need arise.
.Sh FILES
.Bl -tag -width /etc/networks -compact
.It Pa /etc/networks
.El
.Sh SEE ALSO
.Xr getnetent 3 ,
.Xr resolver 3 ,
.Xr resolv.conf 5 ,
.Xr hostname 7 ,
.Xr nsd 8 ,
.Xr unbound 8
.Sh STANDARDS
.Rs
.%A P. Mockapetris
.%D April 1989
.%R RFC 1101
.%T DNS Encoding of Network Names and Other Types
.Re
.Pp
.Rs
.%A Y. Rekhter
.%A B. Moskowitz
.%A D. Karrenberg
.%A G. J. de Groot
.%A E. Lear
.%D February 1996
.%R RFC 1918
.%T Address Allocation for Private Internets
.Re
.Pp
.Rs
.%A H. Eidnes
.%A G. de Groot
.%A P. Vixie
.%D March 1998
.%R RFC 2317
.%T Classless IN-ADDR.ARPA delegation
.Re
.Pp
.Rs
.%A V. Fuller
.%A "T. Li"
.%D August 2006
.%R RFC 4632
.%T Classless Inter-domain Routing (CIDR): The Internet Address Assignment and Aggregation Plan
.Re
.Sh HISTORY
The
.Nm
file format appeared in
.Bx 4.2 .
