openbsd/src/share/man/man5/passwd.conf.5
.\" $OpenBSD: passwd.conf.5,v 1.3 1997/04/10 20:05:10 provos Exp $
.\" Copyright 1997 Niels Provos <provos@physnet.uni-hamburg.de>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Niels Provos.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.Dd February 24, 1997
.Dt PASSWD.CONF 5
.Os
.Sh NAME
.Nm passwd.conf
.Nd format of the password configuration file
.Sh DESCRIPTION
The
.Nm /etc/passwd.conf
file describes the configuration of the password cipher used
to encrypt local or YP passwords. The
.Nm passwd.conf
consists of stanzas. 
.Pp
There are default, user and group specific stanzas. If no user 
or group
stanza to a specific option is available the default stanza
is used.
.Pp
To differentiate between user and group stanzas, groups are prefixed 
with a single dot.
.Pp
Some of the fields  and  their possible values that can appear in
this file are:
.Pp
.Bl -tag -width localcipher -offset indent
.It localcipher
The cipher to use for local passwords. Possible values are: 'old', 'newsalt', 'md5'
or 'blowfish,<rounds>' where rounds is a value between 4 and 31.
.It ypcipher
The cipher to use for YP passwords. The possible values are the same as
for localcipher.
.El
.Pp
To retrieve information from this file use
.Xr pw_getconf 3 .
.Pp
.Sh EXAMPLE
To use blowfish as local cipher and some more rounds for root and wheel
members. The old unix crypt is used as YP cipher:
.Pp
 default:
.Pp
      localcipher = blowfish,4
.Pp
      ypcipher = old
.Pp
 root:
.Pp
      localcipher = blowfish,7
.Pp
 .wheel:
.Pp
      localcipher = blowfish,5
.Pp
.Sh SEE ALSO
.Xr passwd 1 ,
.Xr passwd 5 ,
.Xr pw_getconf 3
