openbsd/src/share/man/man5/phones.5
.\"	$OpenBSD: phones.5,v 1.11 2007/05/31 19:19:58 jmc Exp $
.\"	$NetBSD: phones.5,v 1.3 1994/11/30 19:31:25 jtc Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)phones.5	8.1 (Berkeley) 6/5/93
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt PHONES 5
.Os
.Sh NAME
.Nm phones
.Nd remote host phone number file
.Sh DESCRIPTION
.Nm
files are used by
.Xr tip 1
to find phone numbers not included in the
.Xr remote 5
database(s) being used.
.Pp
The default file is
.Pa /etc/phones ,
which is used unless the
.Ev PHONES
environment variable has been set.
.Pa /etc/phones
is world readable by default, and should
.Em not
contain privileged information.
.Pp
The format of the file is a series of lines of the form:
.Pp
.D1 Li <system name>[\ \et]*<phone number>
.Pp
The system name must start at the first character on the line.
The phone number is any sequence of characters terminated by a
.Ql \&,
or the end of the line.
Thus the phone number field can contain arbitrary dialing strings, not
just phone numbers.
.Pp
Certain auto-call units or modems can use
.Ql \&,
in their dialing strings.
For these units (currently Hayes, Courier and Telebit)
.Xr tip 1
will translate a
.Ql \&=
in the phone number to a
.Ql \&,
when actually dialing the number.
.Pp
If the auto-call unit is a Racal-Vadic 831,
.Xr tip 1
will translate a
.Ql \&_
in the phone number to a
.Ql \&= .
.Pp
.Xr tip 1
ignores all lines with a system name other than the one being
looked up.
Comments can be inserted into the file by making the first character
on a line something not used to start any system name in the
.Xr remote 5
database(s) being used, such as
.Ql # .
.Pp
Only one phone number per line is permitted.
To associate more than one phone number with a system name you must
create multiple lines that have the same system name.
.Xr tip 1
will try each number in sequence until it makes a connection or
reaches the end of the file.
.Sh FILES
.Bl -tag -width /etc/phones -compact
.It Pa /etc/phones
The default
.Nm
file for
.Xr tip 1 .
.El
.Sh SEE ALSO
.Xr tip 1 ,
.Xr remote 5
.Sh HISTORY
The
.Nm
file appeared in
.Bx 4.2 .
