openbsd/src/share/man/man5/shells.5
.\"	$OpenBSD: shells.5,v 1.6 2002/09/26 22:12:43 miod Exp $
.\"	$NetBSD: shells.5,v 1.3 1994/11/30 19:31:32 jtc Exp $
.\"
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)shells.5	8.1 (Berkeley) 6/5/93
.\"
.Dd June 5, 1993
.Dt SHELLS 5
.Os
.Sh NAME
.Nm shells
.Nd shell database
.Sh DESCRIPTION
The
.Nm
file contains a list of valid shells available on the system.
A shell is a command line interpreter that reads user input and executes
commands.
For each shell a single line should be present, consisting of the
shell's path, relative to root.
.Pp
A hash mark
.Pq Sq #
indicates the beginning of a comment; subsequent
characters up to the end of the line are not interpreted by the
routines which search the file.
Blank lines are also ignored.
.Pp
The
.Xr chpass 1
program will not let regular users change their default shell to one not
listed in the
.Nm
file.
The
.Xr ftpd 8
daemon denies access to users who are not using one of the listed shells.
.Sh FILES
.Bl -tag -width /etc/shells -compact
.It Pa /etc/shells
.El
.Sh SEE ALSO
.Xr chpass 1 ,
.Xr login 1 ,
.Xr getusershell 3 ,
.Xr nologin 8
.Sh HISTORY
The
.Nm
file format appeared in
.Bx 4.3 tahoe .
