openbsd/src/share/man/man5/sysctl.conf.5
.\" $OpenBSD: sysctl.conf.5,v 1.3 1998/11/26 04:25:59 aaron Exp $
.\"
.\" Copyright (c) 1998 Todd C. Miller <Todd.Miller@courtesan.com>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL
.\" THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
.\" EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
.\" PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
.\" OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
.\" ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 25, 1998
.Os
.Dt SYSCTL.CONF 5
.Sh NAME
.Nm sysctl.conf
.Nd sysctl variables to set at bootup
.Sh DESCRIPTION
.Nm sysctl.conf
contains a list of
.Xr sysctl 8
variable assignments that is read on bootup by
.Xr rc 8
early on in the boot sequence.
.Pp
The file is made up of
.Xr sysctl 8
variable assignments
.Pq Ar variable Ns No = Ns Ar value
with comments designated by a hash mark
.Pq Sq # .
.Sh EXAMPLES
To turn on IP forwarding, one would use the following line:
.Bd -literal -offset indent
net.inet.ip.forwarding=1
.Ed
.Pp
To cause the kernel to reboot on a panic, instead of dropping into
the debugger, the following can be used:
.Bd -literal -offset indent
ddb.panic=0
.Ed
.Sh FILES
.Bl -tag -width /etc/sysctl.conf -compact
.It Pa /etc/sysctl.conf
.El
.Sh SEE ALSO
.Xr rc 8 ,
.Xr sysctl 8
.Sh HISTORY
A
.Nm sysctl.conf
file first appeared in
.Ox 2.3 .
