openbsd/src/sys/arch/aviion/stand/vdmtool/vdmtool.8
.\"	$OpenBSD: vdmtool.8,v 1.1 2013/10/01 20:32:30 miod Exp $
.\"
.\" Copyright (c) 2013 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 1 2013 $
.Dt VDMTOOL 8 aviion
.Os
.Sh NAME
.Nm vdmtool
.Nd display or initialize DG/UX disk volume information
.Sh SYNOPSIS
.Nm vdmtool
.Op Fl iv
.Ar rawdev
.Sh DESCRIPTION
.Nm vdmtool
displays
.\" rather crude
information about the DG/UX volume information found on a disk.
It may also be used to setup a "boot area" on a new disk, to turn it into
a bootable device.
.Pp
The options are as follows:
.Bl -tag -width rawdev
.It Fl i
Do not display volume information, but initialize a "boot area" instead.
This will overwrite the first sector of the disk with a valid boot area
descriptor, which declares the first 251KB of the disk as a boot area.
.It Fl v
Be more verbose, printing out VDIT sector information, as well as any
unparsed byte in the VDIT structures.
.It Ar rawdev
The name of the raw disk device to operate upon.
It may be abbreviated into a form recognizable by
.Xr opendev 3 .
.El
.Sh SEE ALSO
.Xr disklabel 8 ,
.Xr installboot 8
