openbsd/src/usr.bin/aucat/aucat.1
.\"	$OpenBSD: aucat.1,v 1.9 2000/07/01 19:54:36 millert Exp $
.\"
.\" Copyright (c) 1997 Kenneth Stailey.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Institute of Electrical and Electronics Engineers, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd January 2, 1997
.Dt AUCAT 1
.Os
.Sh NAME
.Nm aucat
.Nd concatenate and play audio files
.Sh SYNOPSIS
.Nm aucat
.Op Fl f Ar device
.Ar file ...
.Sh DESCRIPTION
The
.Nm
utility reads files sequentially, writing them to the specified device.
By default,
.Nm
plays audio through the
.Pa /dev/audio
device.
The
.Ar file
operands are processed in command line order.
If a Sun .au header is
detected it is skipped over and not copied to
.Pa /dev/audio .
Otherwise, the
entire file is copied to
.Pa /dev/audio .
.Pp
The options are as follows:
.Bl -tag -width "-f device"
.It Fl f Ar device
Specifies an alternate audio device.
.El
.Pp
The
.Nm
utility exits 0 on success or >0 if an error occurred.
.Sh ENVIRONMENT
The following environment variables affect the execution of
.Nm aucat :
.Bl -tag -width AUDIODEVICE
.It Ev AUDIODEVICE
The audio device to use.
.El
.Sh SEE ALSO
.Xr mixerctl 1 ,
.Xr audio 4
.Sh HISTORY
An
.Nm
utility appeared in
.Ox 2.0 .
