openbsd/src/libexec/login_radius/login_radius.8
.\" $OpenBSD: login_radius.8,v 1.1 2001/07/08 17:56:33 millert Exp $
.\"
.\" Copyright (c) 1996 Berkeley Software Design, Inc. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Berkeley Software Design,
.\"	Inc.
.\" 4. The name of Berkeley Software Design, Inc.  may not be used to endorse
.\"    or promote products derived from this software without specific prior
.\"    written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY BERKELEY SOFTWARE DESIGN, INC. ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL BERKELEY SOFTWARE DESIGN, INC. BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	BSDI $From: login_radius.8,v 1.2 1996/11/11 18:42:02 prb Exp $
.\"
.Dd August 23, 1996
.Dt LOGIN_RADIUS 8
.Os
.Sh NAME
.Nm login_radius
.Nd contact radiusd for authentication
.Sh SYNOPSIS
.Nm login_radius
.Op Fl s Ar service
.Op Fl v Ar name=value
.Ar user
.Op Ar class
.Sh DESCRIPTION
The
.Nm
utility contacts the
.Xr radiusd 8
daemon to authenticate a user.
When executed as the name
.Pa login_ Ns Ar style
it will request
.Xr radiusd 8
to use the authentication specified by
.Xr style .
.Pp
Available options are:
.Bl -tag -width indent
.It Fl s
Specify the service.
Currently only
.Li challenge ,
.Li login ,
and
.Li response
are supported.
.It Fl v
This option and its value are ignored.
.El
.Pp
The
.Nm
utility needs to know a shared secret for each radius server it talks to.
Shared secrets are stored in the file
.Pa /etc/raddb/servers
with the format:
.Bd -literal -offset indent
server shared_secret
.Ed
.Pp
The primary and possible secondary radius servers are defined in the
.Xr login.conf 5
file by the fields:
.Li radius-server
and
.Li radius-server-alt .
.Pp
It is expected that rather than requesting the radius style directly
(in which case the
.Xr radiusd 8
server uses a default style)
that
.Nm
will be linked to the various mechanisms desired.
For instance, to have all CRYPTOCard and ActivCard authentication take
place on a remote server via the radius protocol, remove the
.Pa login_activ
and
.Pa login_crypto
modules and link
.Pa login_radius
to both of those names.
Now when the user requests one of those authentication styles,
.Nm
will automatically forward the request to the remote
.Xr radiusd 8
and request it do the requested style of authentication.
.Pp
Unless the the style being used is listed in the
.Li radius-challenge-styles
entry of the
.Pa /etc/login.conf
file, a password will be requested before sending the request to the
radius server.
.Sh SEE ALSO
.Xr login.conf 5 ,
.Xr login 8 ,
.Xr radiusd 8
