openbsd/src/libexec/rpc.yppasswdd/rpc.yppasswdd.8
.\"	$OpenBSD: rpc.yppasswdd.8,v 1.10 1999/07/09 13:35:52 aaron Exp $
.\"
.\" Copyright (c) 1994 Mats O Jansson <moj@stacken.kth.se>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Mats O Jansson
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd July 3, 1994
.Dt RPC.YPPASSWDD 8
.Os
.Sh NAME
.Nm rpc.yppasswdd
.Nd YP update password file daemon
.Sh SYNOPSIS
.Nm rpc.yppasswdd
.Op Fl d Ar directory
.Op Fl noshell
.Op Fl nogecos
.Op Fl nopw
.Op Fl m Ar arg1 arg2 ...
.Sh DESCRIPTION
.Nm rpc.yppasswdd
must be running on the YP master server to allow users to change information
in the password file. If the user needs to change his password this is
normally done with a program called
.Nm yppasswd .
This program doesn't exist in OpenBSD but is integrated into
.Xr passwd 1 .
.Nm passwd
will automatically determine which password database should
be modified.
To force a change of a YP password when a local one also exists, use
.Nm passwd -y .
.Pp
Other user information can be changed with
.Xr chpass 1 .
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl d Ar directory
Use the specified directory to get at the password-related files instead
of /etc.
.It Fl noshell
Don't allow changes of the shell field in the passwd file.
.It Fl nogecos
Don't allow changes of the gecos field in the passwd file.
.It Fl nopw
Don't allow changes of the password in the passwd file.
.It Fl m Ar arg1 arg2 ...
Don't use
.Ar /var/yp/securenet .
Use another file with another file format. For futher information see
man page for
.Ar ypserv.acl .
.El
.Sh FILES
.Bl -tag -width /etc/master.passwd -compact
.It Pa /etc/passwd
.It Pa /etc/master.passwd
.El
.Sh SEE ALSO
.Xr ypbind 1 ,
.Xr securenet 5 ,
.Xr ypserv.acl 5 ,
.Xr yp 8
.Sh AUTHOR
Mats O Jansson <moj@stacken.kth.se>
