openbsd/src/usr.sbin/pkg_add/package.5
.\"	$OpenBSD: package.5,v 1.20 2014/02/11 08:04:18 espie Exp $
.\" Copyright (c) 2005-2006 Marc Espie <espie@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.Dd $Mdocdate: February 11 2014 $
.Dt PACKAGE 5
.Os
.Sh NAME
.Nm package
.Nd format for
.Ox
binary packages
.Sh DESCRIPTION
Binary packages for
.Ox
can be created using
.Xr pkg_create 1
and are usually manipulated using
.Xr pkg_add 1 ,
.Xr pkg_mklocatedb 1 ,
or
.Xr pkg_info 1 .
.Pp
The basic underlying format is an archive following the ustar specification
that can be handled with
.Xr tar 1
and compressed using
.Xr gzip 1 .
.Pp
Package names always end in
.Dq .tgz ;
the file name itself should conform to
.Xr packages-specs 7 .
.Pp
Note that the base distribution tarballs of
.Ox
(e.g.\&
.Pa baseXX.tgz ,
.Pa compXX.tgz ,
\&...) are not binary packages fit for
.Xr pkg_add 1 .
.Pp
All types of archive contents can be present in a package,
including files, directories, hardlinks, symlinks, fifos, block and character
devices.
.Pp
In order to allow just-in-time extraction,
packages always begin with a table of contents, named
.Pa +CONTENTS .
This table of contents can be read using the API described in
.Xr OpenBSD::PackingList 3p .
.Pp
All the remaining information in the archive should be referenced in
the packing-list, including all relevant information: symlinks destinations,
special permissions, and file owners
.Po
.Xr pkg_create 1
and
.Xr pkg_add 1
actually enforce this
.Pc .
See
.Xr pkg_create 1
for annotation details.
.Pp
This table of contents is always followed by a few special files, some of
which are optional: the package description (+DESC),
a display message (+DISPLAY), etc.
.Pp
The basic ustar format has some limitations with respect to file names.
Accordingly, the package tools will replace very long names with
.Pa LongName#n
and long link names with
.Pa LongLink#n .
The packing-list will hold the real file names, and the package tools
will reconstitute the correct names behind the scenes.
Extended ustar headers are currently recognized, but not supported.
.Sh PACKING LIST ANNOTATIONS
User annotations are described in
.Xr pkg_create 1 .
The following annotations are automatically inserted during package creation
and installations:
.Pp
.Bl -tag -width Ds -compact
.It Cm @arch Ar arches
List of architectures for which this package is intended.
This corresponds to
.Fl A Ar arches
of
.Xr pkg_create 1
.Pp
.It Cm @comment pkgpath=path cdrom=yes/no ftp=yes/no
Historical accident.
This specific comment encodes the actual
.Fl D Ar FULLPKGPATH ,
.Fl D Ar CDROM ,
and
.Fl D Ar FTP
arguments to
.Xr pkg_create 1 .
.Pp
.It Xo
.Cm @depend
.Sm off
.Ar pkgpath :
.Ar pkgspec :
.Ar default
.Sm on
.Xc
Record a dependency declared using the option
.Fl P
of
.Xr pkg_create 1 .
.Pp
.It Xo
.Cm @digital-signature
.Sm off
.Ar style :
.Ar date :
.Ar b64sig
.Sm on
.Xc
Record a digital signature of the packing-list, corresponding
to
.Xr pkg_create 1 Ns 's
.Fl s
option.
.Pp
.It Cm @link Ar name
Added after a file entry by
.Nm
to record that the entry is actually a hard link.
.Pp
.It Cm @localbase Ar base
Used internally to record the settings of
.Fl L
option.
.Pp
.It Cm @name Ar pkgname
Set the name of the package.
This name is potentially different than the name of
the file it came in, and is used when keeping track of the package
for later deinstallation.
.Xr pkg_create 1
will derive this field from the package file name.
.Pp
.It Cm @option Ar name
Some options are automatically inserted by the package tools:
.Bl -tag -width indent
.It Ar firmware
Set by
.Xr fw_update 1
to trigger firmware-specific handling.
In particular, firmwares are hidden from normal updates.
.It Ar manual-installation
Record that a package has been explicitly installed by the user,
and not as a result of a dependency look-up.
Refer to
.Xr pkg_add 1 Ns 's
.Fl a
option for details.
.El
.Pp
.It Cm @sha
Added after a file entry by
.Xr pkg_create 1
to record the files's cryptographic checksum,
as a sha256 digest encoded in base64.
.Pp
.It Cm @size
Added after a file entry by
.Xr pkg_create 1
to record a file size.
.Pp
.It Cm @symlink Ar name
Added after a file entry by
.Xr pkg_create 1
to record that the entry is actually a symbolic link.
.Pp
.It Cm @url
Original location of the package, automatically recorded in installed packages
by
.Xr pkg_add 1 .
.Pp
.It Cm @signer
Internal annotation necessary to identify packages signed with
.Xr signify 1
keys, as those keys don't carry any identity.
.Pp
.It Cm @wantlib Ar libspec
Record a library requirement declared using the option
.Fl W
of
.Xr pkg_create 1 .
.El
.Sh PACKAGE SIGNATURES
All information within a package is checksummed, using SHA256 since
.Ox 4.4 .
During creation and installation, meta-information, such as file owners and
permissions, are also checked: any important stuff that isn't recorded
in the packing-list is an error.
.Pp
Packing-lists can be signed.
If a signature is found, then it will be checked
during installation, and failure to verify will prevent the package from
installing correctly.
Currently,
.Xr signify 1
and X.509-style signatures are supported.
X.509 signatures rely on a certificate authority file being present as
.Pa /etc/ssl/pkgca.pem
and all signatures will be checked against it.
Once the packing-list signature is checked, all individual packing elements
will be checksummed, resulting in a
.Sq just-in-time
signature checking.
.Pp
Fat packages were removed in
.Ox 5.1 ,
since no practical application was found.
.Sh SEE ALSO
.Xr pkg_add 1 ,
.Xr pkg_create 1 ,
.Xr pkg_info 1 ,
.Xr pkg_sign 1 ,
.Xr packages 7 ,
.Xr packages-specs 7
.Sh STANDARDS
Packages are valid gzip'ed ustar archives that can be extracted using
.Xr tar 1 .
In particular, hardlink names should be valid, and all items will
extract to different names.
However, it may be a bit difficult to make sense of the package contents
without peeking at the packing-list.
