openbsd/src/usr.sbin/pkg_add/pkg.1
.\"	$OpenBSD: pkg.1,v 1.4 2010/05/10 09:17:54 espie Exp $
.\"
.\" Copyright (c) 2001-2004 Marc Espie <espie@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 10 2010 $
.Dt PKG 1
.Os
.Sh NAME
.Nm pkg
.Nd replacement-to-be of pkg_* tools
.Sh DESCRIPTION
.Nm
is meant to be a replacement of the old pkg_* tools.
For the time being, it should only be invoked internally by
.Xr pkg_add 1 ,
to handle dependencies.
.Sh SEE ALSO
.Xr pkg_add 1
.Sh AUTHORS
This program was written by Marc Espie.
.Sh BUGS
This program's design is not even finished yet.
