openbsd/src/usr.sbin/pkg_add/pkg.1
.\"	$OpenBSD: pkg.1,v 1.8 2010/06/05 17:15:32 espie Exp $
.\"
.\" Copyright (c) 2010 Marc Espie <espie@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 5 2010 $
.Dt PKG 1
.Os
.Sh NAME
.Nm pkg
.Nd front-end to package tools
.Sh DESCRIPTION
.Nm
is the actual script that starts
.Xr pkg_add 1 ,
.Xr pkg_check 8 ,
.Xr pkg_create 1 ,
.Xr pkg_delete 1 ,
and
.Xr pkg_info 1 .
.Pp
It can be invoked as a link to those commands, or with
.Ar add ,
.Ar create ,
.Ar delete ,
.Ar fsck ,
.Ar info
as first argument.
.Pp
Refer to the documentation of those commands for further info.
.Sh SEE ALSO
.Xr pkg_add 1 ,
.Xr pkg_create 1 ,
.Xr pkg_delete 1 ,
.Xr pkg_info 1 ,
.Xr pkg_check 8
.Sh AUTHORS
This program was written by Marc Espie.
