openbsd/src/usr.sbin/pkg_add/pkg_delete.1
.\"	$OpenBSD: pkg_delete.1,v 1.7 2004/02/25 21:56:12 espie Exp $
.\"
.\" FreeBSD install - a package for the installation and maintenance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" Jordan K. Hubbard
.\"
.\"
.\"     from FreeBSD: @(#)pkg_delete.1
.\"
.Dd November 25, 1994
.Dt PKG_DELETE 1
.Os
.Sh NAME
.Nm pkg_delete
.Nd a utility for deleting previously installed software package distributions
.Sh SYNOPSIS
.Nm pkg_delete
.Op Fl cDnqv
.Op Fl B Ar pkg-destdir
.Op Fl f Ar keys
.Ar pkgname Op Ar ...
.Sh DESCRIPTION
The
.Nm
command is used to delete packages that have been previously installed
with the
.Xr pkg_add 1
command.
.Pp
Package names may be specified either as the package name itself, or as a
filename which consists of the package name plus the
.Dq .tgz
suffix, or as a full pathname like
.Pa /var/db/pkg/pkgname ,
so that shell wildcards can be used.
.Pp
Version numbers and flavors
.Po
see
.Xr packages-specs 7
.Pc
can be omitted, unless the resulting specification is ambiguous.
.Pp
The options are as follows:
.Bl -tag -width BB-pkg-destdir
.It Fl B Ar pkg-destdir
Set
.Ar pkg-destdir
as the prefix to prepend to any object deleted.
.It Fl v
Turn on verbose output.
.It Fl D
If a deinstallation script exists for a given package, do not execute it.
.It Fl n
Don't actually deinstall a package, just report the steps that
would be taken if it were.
.It Fl f Ar keys
Force removal of the package.
.Ar keys
is a comma-separated list of keywords that state what failsafes
should be waived.
These include:
.Bl -tag -width keyword
.It Ar ambiguous
delete all packages matching ambiguous package specifications.
.It Ar dependencies
also delete the whole set of packages that depends upon the requested packages.
.It Ar nonroot
uninstall even if not running as root.
.It Ar uninstalled
proceed even if some package names don't resolve to installed package names.
.El
.It Fl c
Delete extra configuration file, mentioned as
.Bd -literal
@extra file
.Ed
in the packing-list.
.It Fl q
Delete package quickly, do not bother checking md5s before removing files.
.El
.Sh TECHNICAL DETAILS
.Nm
examines installed package records for the
.Ar pkgname
specified,  checks inter-dependencies between installed packages,
deletes the package contents in an order respecting dependencies
(e.g., packages with dependencies get removed first), and finally
removes the package records.
.Pp
If a package is required by other installed packages not mentioned in
the list of packages to remove,
.Nm
will list those dependent packages and refuse to delete the package.
.Pp
If the package contains a
.Ar require
file (see
.Xr pkg_create 1 ) ,
then this is executed first as
.Bd -filled -offset indent
.Cm require
.Ar <pkg-name>
.Ar DEINSTALL
.Ed
.Pp
(where
.Ar pkgname
is the name of the package in question and
.Ar DEINSTALL
is a keyword denoting that this is a deinstallation)
to see whether or not deinstallation should continue.
A non-zero exit status means no, unless the
.Fl f
option is specified.
.Pp
If a
.Cm deinstall
script exists for the package, it is executed before any files are removed.
Such a script can be used to remove messy dynamic files created by the
package on installation or during usage.
The
.Nm deinstall
script is called as:
.Bd -filled -offset indent
.Cm deinstall
.Ar <pkg-name>
.Ar DEINSTALL
.Ed
.Pp
Passing the keyword
.Ar DEINSTALL
lets you potentially write only one program/script that handles all
aspects of installation and deletion.
.Pp
.Sh ENVIRONMENT
.Bl -tag -width PKG_DESTDIR
.It Ev PKG_DBDIR
Where to look for installed packages instead of
.Pa /var/db/pkg .
.It Ev PKG_DESTDIR
Value for
.Ar pkg-destdir ,
if no
.Fl B
option is specified;
value passed to any
.Cm DEINSTALL
or
.Cm REQUIRE
script invoked from the package.
.El
.Sh SEE ALSO
.Xr pkg_add 1 ,
.Xr pkg_create 1 ,
.Xr pkg_info 1 ,
.Xr mkstemp 3 ,
.Xr mtree 8
.Sh AUTHORS
.Bl -tag -width indent -compact
.It "Jordan Hubbard"
initial design
.It "Marc Espie"
complete rewrite
.El
