openbsd/src/usr.sbin/pkg_add/pkg_delete.1
.\"	$OpenBSD: pkg_delete.1,v 1.3 2003/11/14 23:03:55 espie Exp $
.\"
.\" FreeBSD install - a package for the installation and maintenance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" Jordan K. Hubbard
.\"
.\"
.\"     from FreeBSD: @(#)pkg_delete.1
.\"
.Dd November 25, 1994
.Dt PKG_DELETE 1
.Os
.Sh NAME
.Nm pkg_delete
.Nd a utility for deleting previously installed software package distributions
.Sh SYNOPSIS
.Nm pkg_delete
.Op Fl cvDnfq
.Ar pkg-name Op Ar ...
.Sh DESCRIPTION
The
.Nm
command is used to delete packages that have been previously installed
with the
.Xr pkg_add 1
command.
.Pp
Package names may be specified either as the package name itself, or as filenames which consist of the package name plus the
.Dq .tgz
,
.Dq .tar.gz
, or the
.Dq .tar
suffix.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Ar pkg-name Op Ar ...
The named packages are deinstalled.
.It Fl v
Turn on verbose output.
.It Fl D
If a deinstallation script exists for a given package, do not execute it.
.It Fl n
Don't actually deinstall a package, just report the steps that
would be taken if it were.
.It Fl f
Force removal of the package, even if a dependency is recorded or the
deinstall or require script fails.
.It Fl c
Delete extra configuration file, mentioned as
.Bd -literal
@extra file
.Ed
in the packing-list.
.It Fl q
Delete package quickly, do not bother checking md5s before removing files.
.El
.Sh TECHNICAL DETAILS
.Nm
does pretty much what it says.
It examines installed package records in
.Pa /var/db/pkg/<pkg-name> ,
deletes the package contents, and finally removes the package records.
.Pp
If a package is required by other installed packages,
.Nm
will list those dependent packages and refuse to delete the package
(unless the
.Fl f
option is given).
.Pp
If the package contains a
.Ar require
file (see
.Xr pkg_create 1 ) ,
then this is executed first as
.Bd -filled -offset indent
.Cm require
.Ar <pkg-name>
.Ar DEINSTALL
.Ed
.Pp
(where
.Ar pkg-name
is the name of the package in question and
.Ar DEINSTALL
is a keyword denoting that this is a deinstallation)
to see whether or not deinstallation should continue.
A non-zero exit status means no, unless the
.Fl f
option is specified.
.Pp
If a
.Cm deinstall
script exists for the package, it is executed before any files are removed.
It is this script's responsibility to clean up any additional messy details
around the package's installation, since all
.Nm
knows how to do is delete the files created in the original distribution.
The
.Nm deinstall
script is called as:
.Bd -filled -offset indent
.Cm deinstall
.Ar <pkg-name>
.Ar DEINSTALL
.Ed
.Pp
Passing the keyword
.Ar DEINSTALL
lets you potentially write only one program/script that handles all
aspects of installation and deletion.
.Pp
.Sh SEE ALSO
.Xr pkg_add 1 ,
.Xr pkg_create 1 ,
.Xr pkg_info 1 ,
.Xr mkstemp 3 ,
.Xr mtree 8
.Sh AUTHORS
.Bl -tag -width indent -compact
.It "Jordan Hubbard"
initial design
.It "Marc Espie"
complete rewrite
.El
