openbsd/src/usr.sbin/rtrd/rtrd.8
.\"	$OpenBSD: rtrd.8,v 1.3 2026/09/19 17:23:52 schwarze Exp $
.\"
.\" Copyright (c) 2026 Ralph Covelli <rcovelli@he.net>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 19 2026 $
.Dt RTRD 8
.Os
.Sh NAME
.Nm rtrd
.Nd RPKI-to-Router (RTR) daemon
.Sh SYNOPSIS
.Nm rtrd
.Op Fl fvV
.Op Fl b Ar bind_address
.Op Fl m Ar max_version
.Op Fl p Ar port
.Op Fl s Ar socket
.Sh DESCRIPTION
The
.Nm
daemon is an RPKI-to-Router (RTR) cache server.
The
.Nm
program supports RTR protocol versions 0, 1, and 2.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl b Ar bind_address
Use
.Ar bind_address
as the listener address for connections from clients.
The default
.Ar bind_address
is
.Sq 0.0.0.0 .
.It Fl f
Remain in foreground.
.It Fl m Ar max_version
Use
.Ar max_version
as the maximum supported version in protocol version negotiation.
The default protocol is version 2.
.It Fl p Ar port
Listen on
.Ar port
for client connections.
The default port is 323.
.It Fl s Ar socket
Use
.Ar socket
instead of the default
.Pa /var/run/rtrd.sock
for communication with
.Xr rtrctl 8 .
.It Fl v
Increase verbosity.
.It Fl V
Display version and exit.
.El
.Sh FILES
.Bl -tag -width "/var/run/rtrd.sock" -compact
.It Pa /var/run/rtrd.sock
Unix-domain socket used for communication with
.Xr rtrctl 8 .
.El
.Sh EXIT STATUS
.Ex -std
.Sh SEE ALSO
.Xr bgpd 8 ,
.Xr rpki-client 8 ,
.Xr rtrctl 8
.Sh STANDARDS
.Rs
.%T RPKI to Router Protocol
.%R RFC 6810
.Re
.Pp
.Rs
.%T RPKI to Router Protocol, Version 1
.%R RFC 8210
.Re
.Pp
.Rs
.%T RPKI to Router Protocol, Version 2
.%U https://datatracker.ietf.org/doc/html/draft-ietf-sidrops-8210bis-27
.%D Aug, 2026
.Re
.Sh AUTHORS
.An -nosplit
.An Ralph Covelli Aq Mt rcovelli@he.net
and
.An Job Snijders Aq Mt job@bsd.nl .
