openbsd/src/sys/arch/amiga/stand/loadbsd/loadbsd.8
.\"	$OpenBSD: loadbsd.8,v 1.6 2000/06/07 15:39:24 espie Exp $
.\" Copyright (c) 1999 Marc Espie
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.Dd September 9, 1999
.Dt LOADBSD 8 amiga
.Os
.Sh NAME
.Nm loadbsd
.Nd load OpenBSD from AmigaOS
.Sh SYNOPSIS
.Nm
.Op Fl abchkpstADRSVZ
.Op Fl C Ar machine
.Op Fl m Ar mem
.Op Fl n Ar flags
.Op Fl I Ar sync-inhibit
.Op Ar file
.Sh DESCRIPTION
The
.Nm
utility loads the
.Ox
kernel from
.Ar file 
(default file name: bsd)
under AmigaOS, and starts 
.Ox .
.Nm 
only runs under AmigaOS 2.0 or better,
but it no longer needs ixemul.
.Pp
.Nm 
supports multiple root devices. By default,
.Nm
boots to multi-user mode, with debugging symbols.
.Pp
Options are as follows:
.Bl -tag -width Ds
.It Fl a
Boot up to multiuser mode (default).
.It Fl A
Use AGA display mode, if available.
.It Fl b
Prompt for root device.
.It Fl C Ar machine
Explicitly set machine type (e.g., 3000). Set
.Ar machine 
to 32000+N for DraCo revision N.
Normally,
.Nm
guesses the machine type itself, but there are some cases
where it guesses wrong, thanks to AmigaOS lame design.
.It Fl c
User configuration mode.
.It Fl D
Enter ddb on startup.
.It Fl h
Display help.
.It Fl I Ar sync-inhibit
Inhibit sync-negotiation. 
.Ar sync-inhibit
is bit-encoded targets.
.It Fl k
Reserve the first 4M of fast mem.
.\" Try to find out what this is used for.
.It Fl m Ar mem
Tweak available memory to find the minimum amount necessary to use a
kernel. Set fastmem size to
.Ar mem 
in Kbytes.
.It Fl n Ar flags
Multiple non-contiguous memory mode.
Disable if
.Ar flags 
is 0. Set to two segments if
.Ar flags
is 1. Set to all avail segments if
.Ar flags
is 2.
.\" Check what 3 means (same as 2 ?)
.It Fl p
Use highest priority fastmem segment instead of the largest
segment. The higher priority segment is usually faster
(i.e. 32 bit memory), but some people have smaller amounts
of 32 bit memory.
.It Fl s
Boot up in single user mode.
.It Fl R
Remove kernel symbol table.
.It Fl S
Include kernel symbol table (default).
.It Fl t
Test configuration.  Check the machine, and loads the kernel,
but stop without actually starting 
.Ox .
.It Fl V
Print version.
.It Fl Z
Force kernel to chipmem.
.El
.Sh DIAGNOSTICS
.Bl -diag
.It "cpu not supported"
.Nm
doesn't run without a MMU, nor with a 68851. So 68000, 68010 and 68020 don't
work.
.It "failed malloc"
.Nm
couldn't find a contiguous chunk of memory large enough for the kernel.
The required size is displayed in bytes.
If you have enough memory, reboot to remove fragmentation problems.
.It "lseek for symbols"
You asked for symbols with
.Fl S
but
.Nm 
doesn't find any. Probably a stripped kernel.
.It "newer loadbsd required"
.Nm
can't load all kernels, because it needs to pass parameters to the
kernel at startup, and the interface may change.
.It "unable to read kernel image"
The
.Ar file
is not a valid a.out executable. The header matches, but the contents
are wrong.  Might come from a transfer problem, or an attempt to cross-compile
kernels on a different endian machines. The toolchain doesn't support cross-endianess
up to 
.Ox 2.5
included.
.It "unknown binary"
The file
.Ar file
is not a kernel image. Note that
.Nm 
currently cannot read gzipped kernels.
.\" Not all diagnostics are documented, 
.\" but the remaining ones come from arcane options,
.\" so the user is expected to refer to the source.
.El
.Sh SEE ALSO
.Xr ddb 4
.Sh HISTORY
.Nm
was originally developed for
.Nx .
ixemul requirement removal and poolmem recognition features
were added for
.Ox 
by Marc Espie.
