openbsd/src/usr.bin/audioctl/audioctl.1
.\" $NetBSD: audioctl.1,v 1.5 1997/10/18 12:05:22 lukem Exp $
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Author: Lennart Augustsson
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS 
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 4, 1997
.Dt AUDIOCTL 1
.Os
.Sh NAME
.Nm audioctl
.Nd control audio device
.Sh SYNOPSIS
.Nm
.Op Fl f Ar file
.Op Fl n
.Fl a
.br
.Nm
.Op Fl f Ar file
.Op Fl n
.Ar name ...
.br
.Nm
.Op Fl f Ar file
.Op Fl n
.Fl w
.Ar name=value ...
.Sh DESCRIPTION
The 
.Nm
command displays or sets various audio system driver variables.
If a list of variables is present on the command line, then
.Nm
prints the current value of those variables for the specified device.
If the 
.Fl a
flag is specified, all variables for the device are printed.
If the
.Fl w
flag is specified
.Nm
attempts to set the specified variables to the given values.
.Pp
The
.Fl f
flag can be used to give an alternative audio control device, the default is
.Pa /dev/audioctl .
.Pp
The
.Fl n
flag suppresses printing of the variable name.
.Sh EXAMPLES
To set the playing sampling rate to 11025 you can enter
.Dl audioctl -w play.sample_rate=11025
Note that many of the variables that can be inspected and changed
with
.Nm
are reset when the device is opened.  This can be circumvented
like this
.Dl (cat file.au; audioctl -f /dev/stdout -a) > /dev/audio
or
.Dl (audioctl -f /dev/stdout -w blocksize=1024; cat file.au) > /dev/audio
.Sh FILES
.Bl -tag -width /dev/audioctl
.It Pa /dev/audioctl
audio device
.El
.Sh SEE ALSO
.Xr mixerctl 1 ,
.Xr audio 4 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 1.3 .
