openbsd/src/usr.bin/audioctl/audioctl.1
.\" $OpenBSD: audioctl.1,v 1.26 2008/06/26 05:42:20 ray Exp $
.\" $NetBSD: audioctl.1,v 1.7 1998/04/27 16:55:23 augustss Exp $
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Author: Lennart Augustsson
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: June 26 2008 $
.Dt AUDIOCTL 1
.Os
.Sh NAME
.Nm audioctl
.Nd control audio device
.Sh SYNOPSIS
.Nm audioctl
.Op Fl an
.Op Fl f Ar file
.Nm audioctl
.Op Fl n
.Op Fl f Ar file
.Ar name ...
.Nm audioctl
.Op Fl n
.Op Fl f Ar file
.Ar name Ns = Ns Ar value ...
.Sh DESCRIPTION
The
.Nm
command displays or sets various audio system driver variables.
If a list of variables is present on the command line,
.Nm
prints the current value of those variables for the specified device.
By default,
.Nm
operates on the
.Pa /dev/audioctl
device.
.Pp
The options are as follows:
.Bl -tag -width "name=valueXX"
.It Fl a
Print all device variables and their current values.
This is the default, if no parameters are given to
.Nm .
.It Fl f Ar file
Specify an alternative audio control device.
.It Fl n
Suppress printing of the variable name.
.It Ar name Ns = Ns Ar value
Attempt to set the specified variable
.Ar name
to
.Ar value .
.El
.Sh ENVIRONMENT
.Bl -tag -width AUDIOCTLDEVICE
.It Ev AUDIOCTLDEVICE
Audio control device to use.
.El
.Sh FILES
.Bl -tag -width /dev/audioctl
.It Pa /dev/audioctl
default audio control device
.El
.Sh EXAMPLES
To set the playing sampling rate to 11025 you can enter:
.Pp
.Dl $ audioctl play.sample_rate=11025
.Pp
Note that many of the variables that can be inspected and changed
are reset when the
.Pa /dev/audio
device is opened.
This can be circumvented like so:
.Pp
.Dl $ (cat file.au; audioctl -f /dev/audioctl) \*(Gt /dev/audio
or
.Bd -literal -offset indent -compact
$ (audioctl -f /dev/audioctl play.block_size=1024; cat file.au) \e
	\*(Gt /dev/audio
.Ed
.Sh SEE ALSO
.Xr aucat 1 ,
.Xr cdio 1 ,
.Xr mixerctl 1 ,
.Xr audio 4 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 1.3 .
