openbsd/src/usr.bin/audioctl/audioctl.1
.\" $OpenBSD: audioctl.1,v 1.8 2000/03/04 20:41:44 aaron Exp $
.\" $NetBSD: audioctl.1,v 1.7 1998/04/27 16:55:23 augustss Exp $
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Author: Lennart Augustsson
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 4, 1997
.Dt AUDIOCTL 1
.Os
.Sh NAME
.Nm audioctl
.Nd control audio device
.Sh SYNOPSIS
.Nm audioctl
.Op Fl f Ar file
.Op Fl n
.Fl a
.Nm audioctl
.Op Fl f Ar file
.Op Fl n
.Ar name
.Op Ar ...
.Nm audioctl
.Op Fl f Ar file
.Op Fl n
.Fl w
.Ar name=value
.Op Ar ...
.Sh DESCRIPTION
The
.Nm
command displays or sets various audio system driver variables.
If a list of variables is present on the command line,
.Nm
prints the current value of those variables for the specified device.
By default,
.Nm
operates on the
.Pa /dev/audioctl
device.
.Pp
The options are as follows:
.Bl -tag -width "-w name=value"
.It Fl a
Print all device variables and their current values.
.It Fl w Ar name=value
Attempt to set the specified variable
.Ar name
to
.Ar value .
.It Fl f Ar file
Specify an alternative audio control device.
.It Fl n
Suppress printing of the variable name.
.El
.Sh EXAMPLES
To set the playing sampling rate to 11025 you can enter
.Pp
.Dl audioctl -w play.sample_rate=11025
.Pp
Note that many of the variables that can be inspected and changed
are reset when the device is opened.
This can be circumvented like so:
.Pp
.Dl (cat file.au; audioctl -f /dev/stdout -a) > /dev/audio
.Pp
or
.Pp
.Dl (audioctl -f /dev/stdout -w blocksize=1024; cat file.au) > /dev/audio
.Sh ENVIRONMENT
.Bl -tag -width AUDIOCTLDEVICE
.It Ev AUDIOCTLDEVICE
The audio control device to use.
.Sh FILES
.Bl -tag -width /dev/audioctl
.It Pa /dev/audioctl
default audio control device
.El
.Sh SEE ALSO
.Xr mixerctl 1 ,
.Xr audio 4 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 1.3 .
