openbsd/src/share/man/man6/intro.6
.\"	$OpenBSD: intro.6,v 1.7 2003/10/25 07:32:48 jmc Exp $
.\"
.\" Copyright (c) 1999 Hugh Graham
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 8, 1999
.Dt INTRO 6
.Os
.Sh NAME
.Nm intro
.Nd "introduction to the games"
.Sh DESCRIPTION
The manual pages in section 6 contain information about the
various games and diversions optionally installed in
.Pa /usr/games .
Currently available games are:
.Bl -tag -width "teachgammon"
.It adventure
An exploration game.
See
.Xr adventure 6 .
.It arithmetic
Quiz on simple arithmetic.
See
.Xr arithmetic 6 .
.It atc
Air traffic controller game.
See
.Xr atc 6 .
.It backgammon
The backgammon game.
See
.Xr backgammon 6 .
.It banner
Print strings in large letters.
See
.Xr banner 6 .
.It battlestar
A tropical adventure game.
See
.Xr battlestar 6 .
.It bcd
Reformat input as punch cards.
See
.Xr bcd 6 .
.It boggle
Word search game.
See
.Xr boggle 6 .
.It bs
Battleships game.
See
.Xr bs 6 .
.It ceasar
Decrypt ceasar cyphers.
See
.Xr caesar 6 .
.It canfield
A version of the solitaire card game.
See
.Xr canfield 6 .
.It cfscores
Print out the current status of a
.Xr canfield 6
account.
See
.Xr cfscores 6 .
.It cribbage
The card game cribbage.
See
.Xr cribbage 6 .
.It factor
Factor a number.
See
.Xr factor 6 .
.It fish
Play
.Dq Go Fish! .
See
.Xr fish 6 .
.It fortune
Print a random adage.
See
.Xr fortune 6 .
.It gomoku
Game of 5 in a row.
See
.Xr gomoku 6 .
.It grdc
Grand Digital Clock.
See
.Xr grdc 6 .
.It hack
Explore the Dungeons of Doom.
See
.Xr hack 6 .
.It hangman
Play hangman.
See
.Xr hangman 6 .
.It hunt
A multi-player, multi-terminal game.
See
.Xr hunt 6 .
.It huntd
.Xr hunt 6
daemon.
See
.Xr huntd 6 .
.It mille
Play Mille Bornes.
See
.Xr mille 6 .
.It monop
Play monopoly.
See
.Xr monop 6 .
.It morse
Reformat input as morse code.
See
.Xr morse 6 .
.It number
Convert Arabic numerals to English.
See
.Xr number 6 .
.It phantasia
An interterminal fantasy game.
See
.Xr phantasia 6 .
.It pig
Eformatray inputway asway Igpay Atinlay.
Eesay
.Xr igpay 6 .
.It pom
Display the phase of the moon.
See
.Xr pom 6 .
.It ppt
Reformat input as paper tape.
See
.Xr ppt 6 .
.It primes
Generate primes.
See
.Xr primes 6 .
.It quiz
Random knowledge tests.
See
.Xr quiz 6 .
.It rain
Animated raindrops display.
See
.Xr rain 6 .
.It random
Display random lines from a file or random numbers.
See
.Xr random 6 .
.It robots
Fight off villanous robots.
.It rot13
Decrypt ceasar cyphers, rotated by 13 characters.
See
.Xr rot13 6 .
.It sail
Multi-user wooden ships and iron men.
See
.Xr sail 6 .
.It snake
Display chase game.
See
.Xr snake 6 .
.It snscore
Display
.Xr snake 6
scores.
See
.Xr snscore 6 .
.It teachgammon
Backgammon rules and tutorial.
See
.Xr backgammon 6 .
.It tetris
Play tetris.
See
.Xr tetris 6 .
.It trek
Trekkie game.
See
.Xr trek 6 .
.It wargames
Would you like to play a game?
.It worm
Play the growing worm game.
See
.Xr worm 6 .
.It worms
Animate worms on a display terminal.
See
.Xr worms 6 .
.It wump
Hunt the wumpus in an underground cave.
See
.Xr wump 6 .
.El
.Sh FILES
.Bl -tag -width "/usr/share/doc/usd/31.trek" -compact
.It Pa /usr/games
Location of games, if installed.
.It Pa /usr/share/games
Data files for games.
.It Pa /usr/share/doc/usd/31.trek
User Supplementary Documents for
.Xr trek 6 .
.El
.Sh SEE ALSO
.Xr adventure 6 ,
.Xr arithmetic 6 ,
.Xr atc 6 ,
.Xr backgammon 6 ,
.Xr banner 6 ,
.Xr battlestar 6 ,
.Xr bcd 6 ,
.Xr boggle 6 ,
.Xr bs 6 ,
.Xr caesar 6 ,
.Xr canfield 6 ,
.Xr cfscores 6 ,
.Xr cribbage 6 ,
.Xr factor 6 ,
.Xr fish 6 ,
.Xr fortune 6 ,
.Xr gomoku 6 ,
.Xr grdc 6 ,
.Xr hack 6 ,
.Xr hangman 6 ,
.Xr hunt 6 ,
.Xr huntd 6 ,
.Xr mille 6 ,
.Xr monop 6 ,
.Xr morse 6 ,
.Xr number 6 ,
.Xr phantasia 6 ,
.Xr pig 6 ,
.Xr pom 6 ,
.Xr ppt 6 ,
.Xr primes 6 ,
.Xr quiz 6 ,
.Xr rain 6 ,
.Xr random 6 ,
.Xr robots 6 ,
.Xr rot13 6 ,
.Xr sail 6 ,
.Xr snake 6 ,
.Xr snscore 6 ,
.Xr tetris 6 ,
.Xr trek 6 ,
.Xr worm 6 ,
.Xr worms 6 ,
.Xr wump 6
.Sh HISTORY
The
.Nm intro
section manual page appeared in
.Ox 2.5 .
