openbsd/src/share/man/man6/intro.6
.\"	$OpenBSD: intro.6,v 1.14 2010/01/10 10:53:33 jmc Exp $
.\"
.\" Copyright (c) 1999 Hugh Graham
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: January 10 2010 $
.Dt INTRO 6
.Os
.Sh NAME
.Nm intro
.Nd introduction to the games
.Sh SYNOPSIS
Would you like to play a game?
.Sh DESCRIPTION
The manual pages in section 6 contain information about the
various games and diversions optionally installed in
.Pa /usr/games .
Currently available games are:
.Bl -ohang -offset indent
.It Xr adventure 6
An exploration game.
.It Xr arithmetic 6
Quiz on simple arithmetic.
.It Xr atc 6
Air traffic controller game.
.It Xr backgammon 6
The backgammon game.
.It Xr banner 6
Print strings in large letters.
.It Xr battlestar 6
A tropical adventure game.
.It Xr bcd 6
Reformat input as punch cards.
.It Xr boggle 6
Word search game.
.It Xr bs 6
Battleships game.
.It Xr caesar 6
Decrypt caesar cyphers.
.It Xr canfield 6
A version of the solitaire card game.
.It Xr cfscores 6
Print out the current status of a
.Xr canfield 6
account.
.It Xr cribbage 6
The card game cribbage.
.It Xr factor 6
Factor a number.
.It Xr fish 6
Play
.Dq Go Fish! .
.It Xr fortune 6
Print a random adage.
.It Xr gomoku 6
Game of 5 in a row.
.It Xr grdc 6
Grand Digital Clock.
.It Xr hack 6
Explore the Dungeons of Doom.
.It Xr hangman 6
Play hangman.
.It Xr hunt 6
A multi-player, multi-terminal game.
.It Xr huntd 6
.Xr hunt 6
daemon.
.It Xr mille 6
Play Mille Bornes.
.It Xr monop 6
Play monopoly.
.It Xr morse 6
Reformat input as morse code.
.It Xr number 6
Convert Arabic numerals to English.
.It Xr phantasia 6
An interterminal fantasy game.
.It Xr pig 6
Eformatray inputway asway Igpay Atinlay.
Eesay
.Xr igpay 6 .
.It Xr pom 6
Display the phase of the moon.
.It Xr ppt 6
Reformat input as paper tape.
.It Xr primes 6
Generate primes.
.It Xr quiz 6
Random knowledge tests.
.It Xr rain 6
Animated raindrops display.
.It Xr random 6
Display random lines from a file or random numbers.
.It Xr robots 6
Fight off villainous robots.
.It Xr rot13 6
Decrypt caesar cyphers, rotated by 13 characters.
.It Xr sail 6
Multi-user wooden ships and iron men.
.It Xr snake 6
Display chase game.
.It teachgammon
Backgammon rules and tutorial.
See
.Xr backgammon 6 .
.It Xr tetris 6
Play tetris.
.It Xr trek 6
Trekkie game.
.It wargames
Would you like to play a game?
.It Xr worm 6
Play the growing worm game.
.It Xr worms 6
Animate worms on a display terminal.
.It Xr wump 6
Hunt the wumpus in an underground cave.
.El
.Sh FILES
.Bl -tag -width "/usr/share/gamesXXX" -compact
.It Pa /usr/games
Location of games, if installed.
.It Pa /usr/share/games
Data files for games.
.El
.Sh SEE ALSO
.Xr adventure 6 ,
.Xr arithmetic 6 ,
.Xr atc 6 ,
.Xr backgammon 6 ,
.Xr banner 6 ,
.Xr battlestar 6 ,
.Xr bcd 6 ,
.Xr boggle 6 ,
.Xr bs 6 ,
.Xr caesar 6 ,
.Xr canfield 6 ,
.Xr cfscores 6 ,
.Xr cribbage 6 ,
.Xr factor 6 ,
.Xr fish 6 ,
.Xr fortune 6 ,
.Xr gomoku 6 ,
.Xr grdc 6 ,
.Xr hack 6 ,
.Xr hangman 6 ,
.Xr hunt 6 ,
.Xr huntd 6 ,
.Xr mille 6 ,
.Xr monop 6 ,
.Xr morse 6 ,
.Xr number 6 ,
.Xr phantasia 6 ,
.Xr pig 6 ,
.Xr pom 6 ,
.Xr ppt 6 ,
.Xr primes 6 ,
.Xr quiz 6 ,
.Xr rain 6 ,
.Xr random 6 ,
.Xr robots 6 ,
.Xr rot13 6 ,
.Xr sail 6 ,
.Xr snake 6 ,
.Xr tetris 6 ,
.Xr trek 6 ,
.Xr worm 6 ,
.Xr worms 6 ,
.Xr wump 6
.Sh HISTORY
The
.Nm intro
section manual page appeared in
.Ox 2.5 .
