openbsd/src/share/man/man6/intro.6
.\"	$OpenBSD: intro.6,v 1.1 1999/07/09 21:38:54 hugh Exp $
.\"
.\" Copyright (c) 1999 Hugh Graham
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Hugh Graham
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 8, 1999
.Dt INTRO 6
.Os
.Sh NAME
.Nm intro
.Nd "introduction to the games"
.Sh DESCRIPTION
This section contains information about the various games and diversions
optionally installed in
.Pa /usr/games .
A listing of the section's entries can be displayed with the command:
.Pp
$ apropos '(6)'
.Sh SEE ALSO
.Xr intro 1 ,
.Xr dm 8
.Pp
Tutorials in the
.%T "UNIX User's Manual Supplementary Documents" .
.Sh FILES
.Bl -tag -width date
.It Pa /usr/games
location of games, if installed
.It Pa /usr/share/doc/usd/{30.rogue,31.trek}
supplementary documents
.El
.Sh HISTORY
The
.Nm intro
section manual page appeared in
.Ox 2.5 .
