openbsd/src/libexec/login_skey/login_skey.8
.\" $OpenBSD: login_skey.8,v 1.1 2000/12/12 02:35:18 millert Exp $
.\"
.\" Copyright (c) 1995 Berkeley Software Design, Inc. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Berkeley Software Design,
.\"	Inc.
.\" 4. The name of Berkeley Software Design, Inc.  may not be used to endorse
.\"    or promote products derived from this software without specific prior
.\"    written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY BERKELEY SOFTWARE DESIGN, INC. ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL BERKELEY SOFTWARE DESIGN, INC. BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	BSDI $From: login_skey.8,v 1.3 1995/11/27 17:43:21 polk Exp $
.\"
.Dd April 7, 1994
.Dt LOGIN_SKEY 8
.Os
.Sh NAME
.Nm login_skey
.Nd provide S/Key authentication
.Sh SYNOPSIS
.Nm
.Op Fl s Ar service
.Ar user
.Op Ar class
.Sh DESCRIPTION
.Pp
The
.Nm
program is typically called from
.Xr login 8
or
.Xr ftpd 8 .
The
.Ar service
argument determines what protocol is used with the program
requesting authentication.
Currently only the
.Ar ftp
and
.Ar login
protocol are supported.
See
.Xr login_passwd 8
for a description of the protocols.
.Pp
.Nm
will look up
.Ar user
in the the file
.Pa /etc/skeykeys
and the password file.
.Nm
will issue a challenge, and if the user
is able to correctly respond (by using an S/Key calculator)
and they have a valid account
.Nm
will authenticate the user.
The
.Ar class
argument is unused.
.Sh FILES
.Bl -tag -width xetcxskeykeysx
.It Pa /etc/skeykeys
data base of information for S/Key system
.El
.Sh SEE ALSO
.Xr skey 1 ,
.Xr skeyinfo 1 ,
.Xr skeyinit 1 ,
.Xr login.conf 5 ,
.Xr ftpd 8 ,
.Xr login 8 ,
.Xr login_passwd 8
