openbsd/src/libexec/login_skey/login_skey.8
.\" $OpenBSD: login_skey.8,v 1.4 2002/07/14 23:37:02 millert Exp $
.\"
.\" Copyright (c) 2000, 2002 Todd C. Miller <Todd.Miller@courtesan.com>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL
.\" THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
.\" EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
.\" PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
.\" OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
.\" ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 14, 2002
.Dt LOGIN_SKEY 8
.Os
.Sh NAME
.Nm login_skey
.Nd provide S/Key authentication type
.Sh SYNOPSIS
.Nm
.Op Fl s Ar service
.Ar user
.Op Ar class
.Sh DESCRIPTION
The
.Nm
utility is called by
.Xr login 1 ,
.Xr su 1 ,
.Xr ftpd 8 ,
and others to authenticate the
.Ar user
with S/Key authentication.
.Pp
The
.Ar service
argument specifies which protocol to use with the
invoking program.
The allowed protocols are
.Em login ,
.Em challenge ,
and
.Em response .
The default protocol is
.Em login .
.Pp
The
.Ar user
argument is the login name of the user to be authenticated.
.Pp
The
.Ar class
argument is not used.
.Pp
.Nm
will look up
.Ar user
in the S/Key database and, depending on the desired protocol,
will do one of three things:
.Bl -tag -width challenge
.It login
Present
.Ar user
with an S/Key challenge, accept a response and report back to the
invoking program whether or not the authentication was successful.
.It challenge
Return the current S/Key challenge for
.Ar user .
.It response
Report back to the invoking program whether or not the specified
response matches the current S/Key challenge for
.Ar user .
.El
.Pp
If
.Ar user
does not have an entry in the S/Key database, a fake challenge will
be generated by the S/Key library.
.Sh FILES
.Bl -tag -width /etc/skey
.It Pa /etc/skey
directory containing user entries for S/Key
.El
.Sh SEE ALSO
.Xr login 1 ,
.Xr skey 1 ,
.Xr skeyinfo 1 ,
.Xr skeyinit 1 ,
.Xr login.conf 5 ,
.Xr ftpd 8
