openbsd/src/share/man/man8/man8.vax/boot_vax.8
.\"	$OpenBSD: boot_vax.8,v 1.12 2014/01/19 22:01:48 schwarze Exp $
.\"	$NetBSD: boot_vax.8,v 1.3 1995/04/23 10:33:39 cgd Exp $
.\"
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)boot_vax.8	8.2 (Berkeley) 4/19/94
.\"
.Dd $Mdocdate: January 19 2014 $
.Dt BOOT_VAX 8 vax
.Os
.Sh NAME
.Nm boot_vax
.Nd VAX-specific system bootstrapping procedures
.Sh DESCRIPTION
.Ss Power fail and crash recovery
Normally, the system will reboot itself at power-up or after crashes.
Provided the auto-restart is enabled on the machine's front panel,
an automatic consistency check of the file systems will be performed,
and unless this fails, the system will resume multi-user operations.
.Ss Cold starts
The system boot procedure loads a boot parameter block
from block 0 of the disk configured as the boot device.
The
.Nm boot
program
finds the corresponding file on the given device
.Pf ( Pa bsd
by default), loads that file
into memory location zero, and starts the program at the entry address
specified in the program header (after clearing off the high bit
of the specified entry address).
.Pp
The file specifications used with
.Dq BOOT ANY
or
.Dq \&B/3
are of the form:
.Pp
.Dl device(adaptor,controller,unit,minor)
.Pp
where
.Ar device
is the type of the device to be searched,
.Ar adaptor
is the number of the adaptor to which the device is attached,
.Ar controller
is the unit number of the controller or
tape formatter on that adaptor,
.Ar unit
is the unit number of the disk or transport slave unit of the tape,
and
.Ar minor
is the disk partition or tape file number.
Leading adaptor or controller numbers default to 0.
Normal line editing characters can be used when typing the file specification.
The following list of supported devices may vary from installation to
installation:
.Bd -unfilled -offset indent
hd	MFM disk connected to the MFM controller on some VAXstation systems
mt	tape drive connected to an MSCP-compatible controller
ra	disk drive connected to an MSCP-compatible controller
sd	SCSI disk
st	SCSI tape
.Ed
.Pp
For example,
to boot from a file system in partition
.Sq a
of unit 0 of a SCSI disk, type
.Dq sd(0,0)bsd
at the boot prompt;
.Dq sd(2,0,1,0)bsd
would specify drive 1 on the second SCSI controller.
For tapes, the minor device number gives a file offset;
.Dq mt(1,2,3,4)
would specify the fifth file on slave 3 of the formatter
at
.Dq drive
2 on mba 1.
.Sh FILES
.Bl -tag -width /usr/mdec/xxboot -compact
.It Pa /bsd
default system kernel
.It Pa /bsd.rd
standalone installation kernel, suitable for disaster recovery
.It Pa /usr/mdec/xxboot
primary boot block, xx is disk type
.It Pa /usr/mdec/boot
secondary bootstrap (usually also installed as
.Pa /boot )
.El
.Sh SEE ALSO
.Xr disklabel 8 ,
.Xr halt 8 ,
.Xr reboot 8 ,
.Xr shutdown 8
