openbsd/src/share/man/man8/man8.vax/installboot.8
.\" Copyright (c) 1986, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)installboot.8	7.2 (Berkeley) 3/16/91
.\"	$Id: installboot.8,v 1.4 1999/05/23 14:11:22 aaron Exp $
.\"
.Dd March 16, 1991
.Dt INSTALLBOOT 8
.Os
.Sh NAME
.Nm VAX installboot
.Nd installs a boot program in a file system
.Sh SYNOPSIS
.Nm installboot
.Ar bootblock bootprog special
.Sh DESCRIPTION
.Xr Installboot
concatentates
.Ar bootblock
and
.Ar bootprog
and writes at most
.Dv BBSIZE
bytes (from
.Aq Pa sys/fs.h )
of them on the first bytes of
.Ar special .
.Sh FILES
.Bl -tag -width /usr/mdec/bootxxx -compact
.It Pa /usr/mdec/??boot
boot blocks
.It Pa /usr/mdec/boot??
boot programs
.El
.Sh SEE ALSO
.Xr dd 1 ,
.Xr newfs 8
.Sh EXAMPLES
.Bd -literal -offset indent -compact
cd /usr/mdec
installboot raboot bootra /dev/ra0a
.Ed
.Sh BUGS
There is no convenient way to determine the names of the boot blocks
and boot programs without
.Em a priori
knowledge of one's make of disk.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 tahoe .
This manual page was written by Geoff Collyer.
