openbsd/src/share/man/man8/man8.vax/installboot.8
.\"	$OpenBSD: installboot.8,v 1.13 2007/05/31 19:20:00 jmc Exp $
.\" Copyright (c) 1986, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)installboot.8	7.2 (Berkeley) 3/16/91
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt INSTALLBOOT 8 vax
.Os
.Sh NAME
.Nm installboot
.Nd installs a boot program in a file system
.Sh SYNOPSIS
.Nm installboot
.Ar bootblock bootprog special
.Sh DESCRIPTION
.Nm installboot
concatenates
.Ar bootblock
and
.Ar bootprog
and writes at most
.Dv BBSIZE
bytes (from
.Aq Pa sys/fs.h )
of them on the first bytes of
.Ar special .
.Sh FILES
.Bl -tag -width /usr/mdec/bootxxx -compact
.It Pa /usr/mdec/??boot
boot blocks
.It Pa /usr/mdec/boot??
boot programs
.El
.Sh EXAMPLES
.Bd -literal -offset indent
cd /usr/mdec
installboot raboot bootra /dev/ra0a
.Ed
.Sh SEE ALSO
.Xr dd 1 ,
.Xr newfs 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 tahoe .
.Sh AUTHORS
This manual page was written by Geoff Collyer.
.Sh BUGS
There is no convenient way to determine the names of the boot blocks
and boot programs without
.Em a priori
knowledge of one's make of disk.
