openbsd/src/share/man/man8/man8.vax/MAKEDEV.8
.\" $OpenBSD: MAKEDEV.8,v 1.26 2005/01/10 07:58:02 dlg Exp $
.\"
.\" THIS FILE AUTOMATICALLY GENERATED.  DO NOT EDIT.
.\" generated from:
.\"
.\"	OpenBSD: etc.vax/MAKEDEV.md,v 1.20 2004/08/20 00:18:08 deraadt Exp 
.\"	OpenBSD: MAKEDEV.common,v 1.13 2005/01/10 07:53:57 dlg Exp 
.\"	OpenBSD: MAKEDEV.man,v 1.3 2004/03/12 18:12:12 miod Exp 
.\"	OpenBSD: MAKEDEV.mansub,v 1.2 2004/02/20 19:13:01 miod Exp 
.\"
.\" Copyright (c) 2004, Miodrag Vallat
.\" Copyright (c) 2001-2004 Todd T. Fries <todd@OpenBSD.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd January 10, 2005
.Dt MAKEDEV 8 vax
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Op Ar ...
.Sh DESCRIPTION
The shell script
.Nm ,
found in the
.Pa /dev
directory, is used to create various special files.
See
.Xr intro 4
for a more complete discussion of special files.
.Pp
.Nm
takes any number of device names as arguments, where the names are
the common abbreviation for the device or group of devices.
.Pp
Where a device name is followed by a star
.Sq * ,
the star must be replaced by a unit number.
If units are expected for a device but not provided,
.Nm
will supply the standard numbers in most cases.
.Pp
The vax supports the following devices:
.Pp
.Sy Special device names
.Bl -tag -width tenletters -compact
.It Ar all
Creates special files for all devices on vax.
.It Ar ramdisk
Ramdisk kernel devices.
.It Ar std
Creates the
.Sq standard
devices (console, drum, klog, kmem, ksyms, mem, null,
stderr, stdin, stdout, tty, zero)
which are absolutely necessary for the system to function properly.
.It Ar local
Creates configuration-specific devices, by invoking the shell file
.Pa MAKEDEV.local .
.El
.Pp
.Sy Disks
.Bl -tag -width tenletters -compact
.It Ar ccd*
Concatenated disk devices, see
.Xr ccd 4 .
.It Ar cd*
ATAPI and SCSI CD-ROM drives, see
.Xr cd 4 .
.It Ar fd*
Floppy disk drives (3 1/2", 5 1/4"), see
.Xr fd 4 .
.It Ar hk*
UNIBUS RK06 and RK07 disks, see
.Xr hk 4 .
.It Ar hd*
HDC9224 disks, see
.Xr hd 4 .
.It Ar hp*
MASSBUSS disks, see
.Xr hp 4 .
.It Ar ra*
MSCP disks, see
.Xr ra 4 .
.It Ar raid*
RAIDframe disk devices, see
.Xr raid 4 .
.It Ar rb*
730 IDC w/ RB80 and/or RB02, see
.Xr rb 4 .
.It Ar rd*
.Dq rd
pseudo-disks, see
.Xr rd 4 .
.It Ar rl*
UNIBUS RL02, see
.Xr rl 4 .
.It Ar rx*
RX02 floppy disks, see
.Xr rx 4 .
.It Ar sd*
SCSI disks, including flopticals, see
.Xr sd 4 .
.It Ar up*
Other UNIBUS devices, see
.Xr up 4 .
.It Ar vnd*
.Dq file
pseudo-disk devices, see
.Xr vnd 4 .
.El
.Pp
.Sy Tapes
.Bl -tag -width tenletters -compact
.It Ar ch*
SCSI media changers, see
.Xr ch 4 .
.It Ar ht*
MASSBUS TM03 and TU?? devices, see
.Xr ht 4 .
.It Ar mt*
(Magnetic) 9-track reel tape drives, see
.Xr mt 4 .
.It Ar st*
SCSI tape drives, see
.Xr st 4 .
.It Ar tm*
UNIBUS TM11 and TE10 emulations (e.g. Emulex TC-11), see
.Xr tm 4 .
.It Ar ts*
UNIBUS TS11, see
.Xr ts 4 .
.It Ar ut*
UNIBUS TU45 emulations (e.g. 9700), see
.Xr ut 4 .
.El
.Pp
.Sy Terminal ports
.Bl -tag -width tenletters -compact
.It Ar dh*
UNIBUS DH11 and emulations (e.g. Able dmax, Emulex CS-11), see
.Xr dh 4 .
.It Ar dhu*
UNIBUS DHU11, see
.Xr dhu 4 .
.It Ar dl*
UNIBUS DL11, see
.Xr dl 4 .
.It Ar dmf*
UNIBUS DMF32, see
.Xr dmf 4 .
.It Ar dmz*
UNIBUS DMZ32, see
.Xr dmz 4 .
.It Ar dz*
UNIBUS DZ11 and DZ32, see
.Xr dz 4 .
.It Ar vt*
console, see
.Xr vt 4 .
.El
.Pp
.Sy Pseudo terminals
.Bl -tag -width tenletters -compact
.It Ar ptm
pty master device, see
.Xr ptm 4 .
.It Ar pty*
Set of 62 master pseudo terminals, see
.Xr pty 4 .
.It Ar tty*
Set of 62 slave pseudo terminals, see
.Xr tty 4 .
.El
.Pp
.Sy Special purpose devices
.Bl -tag -width tenletters -compact
.It Ar bpf*
Berkeley Packet Filter, see
.Xr bpf 4 .
.It Ar fd
fd/* nodes for fdescfs, see
.Xr mount_fdesc 8 .
.It Ar lkm
Loadable kernel modules interface, see
.Xr lkm 4 .
.It Ar pf*
Packet Filter, see
.Xr pf 4 .
.It Ar *random
In-kernel random data source, see
.Xr random 4 .
.It Ar ses*
SES/SAF-TE SCSI devices, see
.Xr ses 4 .
.It Ar ss*
SCSI scanners, see
.Xr ss 4 .
.It Ar systrace*
System call tracing device, see
.Xr systrace 4 .
.It Ar tun*
Network tunnel driver, see
.Xr tun 4 .
.It Ar uk*
Unknown SCSI devices, see
.Xr uk 4 .
.It Ar xfs*
XFS filesystem node, see
.Xr mount_xfs 8 .
.El
.Sh FILES
.Bl -tag -width /dev -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
