openbsd/src/share/man/man8/man8.vax/MAKEDEV.8
.\"	$OpenBSD: MAKEDEV.8,v 1.11 2002/10/02 17:40:22 miod Exp $
.\" Copyright (c) 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)MAKEDEV.8	5.2 (Berkeley) 3/22/91
.\"
.Dd March 22, 1991
.Dt MAKEDEV 8 vax
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Op Ar ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the
.Pa /dev
directory, is used to create the common special files.
See
.Xr intro 4
for a more complete discussion of special files.
.Pp
.Nm MAKEDEV
takes any number of device names as arguments, where the names are
the common abbreviation for the device.
There are three special device names,
.Ar all ,
.Ar std
and
.Ar local .
If
given,
.Ar all
creates device files for all devices on the vax.
If units are expected for a device,
.Nm MAKEDEV
will supply the standard numbers.
The
.Ar std
argument creates only the standard devices for the vax.
Finally
.Ar local
is for devices specific to the local site, and executes the shell file
.Pa MAKEDEV.local .
.Pp
The vax supports the following devices.
Where a device name is followed by a hash sign ("#"), the hash sign
must be replaced by a unit number.
.Pp
.Sy Pseudo\-names
.Bl -tag -width indent -compact
.It Ar all
All known devices for the vax.
.It Ar std
The standard devices (console, drum, fd/*, klog, kmem, mem, null, stderr,
stdin, stdout, tty, zero)
.It Ar local
Configuration specific devices
.El
.Pp
.Sy Device\-names
.Bl -tag -width indent -compact
.It Ar ad#
Unibus interface to data translation a/d converter
.It Ar bpf#
Berkeley Packet Filters
.It Ar ccd#
``Concatenated'' pseudo-disks
.It Ar cd#
SCSI CD-ROM drives
.It Ar ch#
SCSI changer
.It Ar ct#
Unibus parallel interface to CAT typesetter
.It Ar dh#
Unibus dh11 and emulations (e.g. Able dmax, Emulex cs-11)
.It Ar dhu#
Unibus dhu11
.It Ar dmf#
Unibus dmf32
.It Ar dmz#
Unibus dmz32
.It Ar dn#
Unibus dn11 and emulations (e.g. Able Quadracall)
.It Ar dz#
Unibus dz11 and dz32
.It Ar hk#
Unibus rk06 and rk07
.It Ar hp#
Massbus rm??
.It Ar ht#
Massbus tm03 & tu??
.It Ar ik#
Unibus interface to ikonas frame buffer
.It Ar lp#
Unibus lp11 parallel interface
.It Ar md#
Memory pseudo-disk devices
.It Ar mt#
MSCP tape drives (TU81, TK50, etc.)
.It Ar np#
Unibus Ethernet co-processor interface, for downloading.
.It Ar ps#
Unibus interface to e&s picture system 2
.It Ar pty#
Set of master and slave pseudo terminals
.It Ar qv#
QVSS (MicroVAX) display
.It Ar ra#
Unibus uda50 w/ ra??
.It Ar random
Random number generator
.It Ar rb#
730 idc w/ rb80 and/or rb02
.It Ar rl#
Unibus rl02
.It Ar rx#
Unibus rx211 floppy disk
.It Ar sd#
SCSI disks
.It Ar ss#
SCSI scanner
.It Ar st#
SCSI tape drives
.It Ar tm#
Unibus tm11 & te10 emulations (e.g. Emulex tc-11)
.It Ar ts#
Unibus ts11
.It Ar ttyv0
QVSS (MicroVAX) display reserved pty
.It Ar uk#
SCSI unknown
.It Ar up#
Other Unibus devices (e.g. on Emulex sc-21v controller)
.It Ar ut#
Unibus TU45 emulations (e.g. 9700)
.It Ar uu#
TU58 cassettes on dl11 controller
.It Ar va#
Unibus Varian parallel interface
.It Ar vnd#
.Dq file
pseudo-disks
.It Ar vp#
Unibus Versatec parallel interface
.El
.Sh FILES
.Bl -tag -width /dev -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
