openbsd/src/libexec/rpc.rusersd/rpc.rusersd.8
.\"	$OpenBSD: rpc.rusersd.8,v 1.7 2007/05/31 19:19:40 jmc Exp $
.\"
.\" Copyright (c) 1985, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id: rpc.rusersd.8,v 1.7 2007/05/31 19:19:40 jmc Exp $
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt RPC.RUSERSD 8
.Os
.Sh NAME
.Nm rpc.rusersd
.Nd logged in users server
.Sh SYNOPSIS
.Nm rpc.rusersd
.Sh DESCRIPTION
.Nm rpc.rusersd
is a server which returns information about users
currently logged in to the system.
At startup,
.Nm
opens
.Pa /var/run/utmp
and subsequently performs a
.Xr chroot 2
to
.Pa /var/empty
and switches to user
.Va nobody .
.Pp
The currently logged in users are queried using the
.Xr rusers 1
command.
The
.Nm rpc.rusersd
daemon is normally invoked by
.Xr inetd 8 .
.Pp
.Nm rpc.rusersd
uses an RPC protocol defined in
.Pa /usr/include/rpcsvc/rnusers.x .
.Sh SEE ALSO
.Xr rusers 1 ,
.Xr w 1 ,
.Xr who 1 ,
.Xr inetd 8
