openbsd/src/usr.sbin/ypserv/ypinit/ypinit.8
.\"	$OpenBSD: ypinit.8,v 1.2 1999/03/12 15:34:00 aaron Exp $
.\" Copyright (c) 1997 Mats O Jansson <moj@stacken.kth.se>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Mats O Jansson
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 19, 1997
.Dt YPINIT 8
.Os
.Sh NAME
.Nm ypinit
.Nd create a YP server (master or slave)
.Sh SYNOPSIS
.Nm ypinit
.Fl m Op Ar domainname
.Nm ypinit
.Fl s Ar master_server Op Ar domainname
.Nm ypinit
.Fl u Op Ar domainname
.Sh DESCRIPTION
.Nm
may be used to setup a YP server, or to change the ypserver map.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl m Ar domainname
Setup a master YP server. If 
.Ar domainname
is not given the default domainname will be used.
.It Fl s Ar master_server Op Ar domainname
Setup a slave YP server. If
.Ar domainname
is not given the default domainname will be used.
.Ar master_server
must be a running YP master server.
.It Fl u Op Ar domainname
Update the ypserver map on a YP master server. If 
.Ar domainname
is not given the default domainname will be used.
.El
.Sh SEE ALSO
.Xr yp 8 ,
.Xr ypserv 8 
.Sh AUTHOR
Mats O Jansson <moj@stacken.kth.se>
