openbsd/src/usr.sbin/map-mbone/map-mbone.8
.\"	$OpenBSD: map-mbone.8,v 1.6 2000/03/19 17:57:08 aaron Exp $
.\"	$NetBSD: map-mbone.8,v 1.2 1995/10/03 23:16:53 thorpej Exp $
.\"
.Dd June 13, 1999
.Dt MAP-MBONE 8
.Os
.Sh NAME
.Nm map-mbone
.Nd Multicast connection mapper
.Sh SYNOPSIS
.Nm map-mbone
.Op Fl d Ar level
.Op Fl fgn
.Op Fl r Ar count
.Op Fl t Ar seconds
.Op Ar starting_router
.Sh DESCRIPTION
.Nm
attempts to display all multicast routers that are reachable from the multicast
router
.Ar starting_router .
If not specified on the command line,
.Ar starting_router
is
.Dq localhost .
.Pp
.Nm
sends an
.Dv ASK_NEIGHBORS
.Tn IGMP
message to
.Ar starting_router .
A response contains the
multicast version number
of
.Ar starting_router
and the addresses of
all its neighboring multicast routers.
If the multicast version number is recent, then
.Nm
requests additional information such as metrics, thresholds, and flags.
.Pp
If a recursive search has been requested (see
.Fl f ) ,
.Nm
repeats the above operation for each new
multicast router in the list of neighbors and
continues the process until no new multicast routers are reported.
.Pp
.Nm
must be run as root.
.Pp
.Em Options
.Bl -tag -width "-t seconds"
.It Fl d Ar level
Sets the debug level to
.Ar level .
When the debug level is greater than
0, additional debugging messages are printed to stderr.
Regardless of
the debug level, an error condition will always write an error message and will
cause
.Nm
to terminate.
Non-zero debug levels are
.Bl -tag -width "1: " -offset indent
.It 1 :
Print packet warnings, plus level 0 messages.
.It 2 :
Print notifications of down networks, plus level 1 messages.
.It 3 :
Print notifications of all packet timeouts, plus level 2 messages.
.El
.Pp
Default is 0.
.It Fl f
Causes a recursive (flooding) search.
If no
.Ar starting_router
is specified, a recursive search is always performed.
.It Fl g
Sets graphing format to GraphEd format.
.It Fl n
Disables DNS lookup for the names of the multicast routers.
.It Fl r Ar count
Sets the neighbor query retry limit to
.Ar count .
Default is 1.
.It Fl t Ar seconds
Sets the number of seconds to wait for a neighbor query
reply before retrying to
.Ar seconds .
Default is 2.
.Sh SEE ALSO
.Xr mrinfo 8 ,
.Xr mrouted 8 ,
.Xr mtrace 8
.Sh AUTHOR
Pavel Curtis
