openbsd/src/libexec/makewhatis/makewhatis.8
.\"	$OpenBSD: makewhatis.8,v 1.14 2007/05/31 19:19:40 jmc Exp $
.\"	$NetBSD: makewhatis.8,v 1.2.2.1 1997/11/10 19:57:45 thorpej Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Robert Dobbs <banshee@gabriella.resort.com>.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt MAKEWHATIS 8
.Os
.Sh NAME
.Nm makewhatis
.Nd create a whatis.db database
.Sh SYNOPSIS
.Nm makewhatis
.Op Fl p
.Op Ar manpath ...
.Nm makewhatis
.Op Fl p
.Fl d Ar manpath
.Ar files ...
.Nm makewhatis
.Op Fl p
.Fl u Ar manpath
.Ar files ...
.Nm makewhatis
.Op Fl p
.Fl t
.Ar files
.Sh DESCRIPTION
.Nm
strips the NAME lines from compiled or raw
.Xr man 1
pages and creates
a whatis.db database (that is, a subject index)
for use with
.Xr apropos 1 ,
.Xr whatis 1 ,
and
.Xr man 1 's
.Fl k
option.
If
.Ar manpath
is unspecified,
.Nm
by default creates databases for each directory prefixed by
the _whatdb keyword in
.Pa /etc/man.conf .
Man pages compressed with
.Xr compress 1
and
.Xr gzip 1
are uncompressed before processing.
.Pp
If the
.Fl d
option is used,
.Nm
merges the description of
.Ar files
with an existing
.Pa whatis.db
database in
.Ar manpath .
.Pp
If the
.Fl u
option is used,
.Nm
removes the description of
.Ar files
from an existing
.Pa whatis.db
database in
.Ar manpath .
.Pp
If the
.Fl p
option is used,
.Nm
is less forgiving and warns about incorrect man pages.
.Pp
The
.Fl t
option can be used to check a set of potential man pages without
changing any
.Pa whatis.db
database.
.Sh FILES
.Bl -tag -width /etc/man.conf -compact
.It Pa whatis.db
index to man pages in directory
.It Pa /etc/man.conf
man configuration information
.El
.Sh SEE ALSO
.Xr apropos 1 ,
.Xr man 1 ,
.Xr nroff 1 ,
.Xr whatis 1 ,
.Xr man.conf 5
.Sh BUGS
.Nm
should parse
.Pa /etc/man.conf
and deal with extra configuration information.
In particular, it does not handle
.Xr nroff 1
.Cm me
format.
Likewise, its use of
heuristics to retrieve subjects from most man pages is not 100% accurate.
