openbsd/src/libexec/makewhatis/makewhatis.8
.\"	$OpenBSD: makewhatis.8,v 1.3 1998/12/16 03:05:34 aaron Exp $
.\"	$NetBSD: makewhatis.8,v 1.2.2.1 1997/11/10 19:57:45 thorpej Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Robert Dobbs <banshee@gabriella.resort.com>.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 17, 1997
.Dt MAKEWHATIS 8
.Sh NAME
.Nm makewhatis
.Nd create a whatis.db database
.Sh SYNOPSIS
.Nm makewhatis
.Op Ar manpath
.Sh DESCRIPTION
.Nm
strips the NAME lines from compiled or raw
.Xr man 1
pages and creates
a whatis.db database
for use in
.Xr apropos 1
or with
.Xr man 1 's
.Fl k
option.
If
.Ar manpath
is unspecified,
.Nm
by default creates a database for
.Pa /usr/share/man .
Man pages compressed with
.Xr compress 1
and
.Xr gzip 1
are uncompressed before processing, unformatted man pages
will be processed by
.Xr getNAME 8 .
.Sh BUGS
.Nm
should find its search paths using
.Pa /etc/man.conf .
.Sh SEE ALSO
.Xr man 1 ,
.Xr man.conf 5 ,
.Xr getNAME 8
