openbsd/src/sbin/ncheck_ffs/ncheck_ffs.8
.\"	$OpenBSD: ncheck_ffs.8,v 1.9 1999/10/05 20:53:10 aaron Exp $
.\"
.\" Copyright (c) 1995, 1996 SigmaSoft, Th. Lockert <tholo@sigmasoft.com>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by SigmaSoft, Th. Lockert
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 24, 1996
.Dt NCHECK_FFS 8
.Os
.Sh NAME
.Nm ncheck_ffs
.Nd generate names from inode-numbers
.Sh SYNOPSIS
.Nm ncheck_ffs
.Op Fl i Ar numbers
.Op Fl ams
.Ar filesystem
.Sh DESCRIPTION
.Nm
generates a list of filenames and inode numbers for the given
file system.  Names of directories are followed by a
.Dq \&. .
.Pp
The report is not sorted.
.Pp
The options to
.Nm
are as follows:
.Bl -tag -width indent
.It Fl i Ar numbers
Report only those files whose inode numbers follows.
.It Fl a
Print the file names
.Dq \&.
and
.Dq \&.\&. ,
which are ordinarily skipped.
.It Fl m
Give more verbose information on inodes
.It Fl s
Report only special files and files with set-user-ID or set-group-ID
set.  This is meant to find hidden violations of security policies.
.El
.Sh SEE ALSO
.Xr sort 1 ,
.Xr fsck 8
.Sh HISTORY
The
.Nm
command was designed to be similar in functionality to the corresponding
command in
.Tn "SunOS 4.1.3" .
.Sh AUTHOR
Thorsten Lockert <tholo@sigmasoft.com>
