openbsd/src/usr.sbin/afs/src/appl/vos/vos.8
.\"     $OpenBSD: vos.8,v 1.6 2003/02/17 07:24:33 jmc Exp $
.\"	$KTH: vos.8,v 1.1 2000/08/07 12:10:49 lha Exp $
.Dd March 26, 2000
.Dt VOS 8
.Os
.Sh NAME
.Nm vos
.Nd manage AFS volumes and the VLDB
.Sh SYNOPSIS
.Nm vos
.Op Ar command
.Op Ar args
.Sh DESCRIPTION
The
.Nm
utility is used to manage AFS volumes and the volume location database (VLDB).
.Pp
.Nm
provides several commands:
.Pp
.Bl -tag -width createentry -compact
.It Cm addsite
not yet implemented
.It Cm apropos
apropos
.It Cm backup
not yet implemented
.It Cm backupsys
not yet implemented
.It Cm changeaddr
not yet implemented
.It Cm create
create a volume
.It Cm createentry
create a vldb entry
.It Cm delentry
not yet implemented
.It Cm dump
dump a volume
.It Cm endtrans
end a transaction
.It Cm examine
print information about a volume
.It Cm volinfo
print information about a volume
.It Cm help
print help
.It Cm ?
print help
.It Cm listpart
list partitions on a server
.It Cm listvldb
list volumes in volume-location-database
.It Cm listvol
list volumes on a server
.It Cm lock
not yet implemented
.It Cm move
not yet implemented
.It Cm partinfo
print partition information on a server
.It Cm release
not yet implemented
.It Cm remove
not yet implemented
.It Cm remsite
not yet implemented
.It Cm rename
not yet implemented
.It Cm restore
not yet implemented
.It Cm status
show volume server transactions
.It Cm syncserv
not yet implemented
.It Cm syncvldb
not yet implemented
.It Cm syncsite
print the syncsite
.It Cm unlock
not yet implemented
.It Cm unlockvldb
not yet implemented
.It Cm zap
not yet implemented
.It Cm quit
exit interactive mode
.El
.Pp
Most
.Nm
commands accept the following general arguments:
.Pp
.Bd -filled -offset indent -compact
.Op Fl cell Ar cellname
Specifies which AFS cell to use, if the default cell is not to be used.
.Pp
.Op Fl noauth
Specifies that
.Nm
should not try to authenticate the connection to the server.
This may be
useful with shell scripts, or if there is a problem with the AFS cell.
Note that the server will reject many commands if
.Fl noauth
is specified.
.Pp
.Op Fl localauth
Create a ticket using the AFS server key, that is, you don't need a token.
This will generally only work on AFS servers, and is very useful for
performing automatic tasks.
.Ed
.Pp
The syntax of the
.Nm
commands:
.Pp
.Ic vos addsite
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos apropos
.Ar string
.Bd -filled -offset indent -compact
Search for a command matching
.Ar string Ns .
.Ed
.Pp
.Ic vos backup
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos backupsys
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos changeaddr
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos create
.Op Fl server
.Ar servername
.Op Fl part
.Ar partition
.Op Fl volume
.Ar volumename
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
.Op Fl verbose
.Bd -filled -offset indent -compact
Create a new volume named
.Ar volumename
on server
.Ar servername
partition
.Ar partition .
Note that
.Ar volumename
can be no longer than 22 characters.
.Ed
.Pp
.Ic vos createentry
.Op Fl id
.Ar volumeid
.Op Fl host
.Ar host
.Op Fl fsserver
.Ar fileserver
.Op Fl rw
.Ar rwvolumeid
.Op Fl ro
.Ar rovolumeid
.Op Fl bk
.Ar bkvolumeid
.Op Fl noauth
.Op Fl localauth
.Bd -filled -offset indent -compact
Create a vldb entry manually.
This command should
.Em not
be used unless you know
.Em exactly
what you are doing.
.Ed
.Pp
.Ic vos delentry
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos dump
.Op Fl id
.Ar volume
.Op Fl server Ar fileserver
.Op Fl partition Ar partition
.Op Fl cell Ar cellname
.Op Fl file Ar filename
.Op Fl noauth
.Op Fl localauth
.Op Fl verbose
.Bd -filled -offset indent -compact
Dump
.Ar volume
on
.Ar fileserver
to a
.Ar filename Ns .
.Ed
.Pp
.Ic vos endtrans
.Op Fl server
.Ar server
.Op Fl trans
.Ar transaction
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl verbose
.Bd -filled -offset indent -compact
End a transaction.
.Ed
.Pp
.Ic vos examine
.Op Fl id
.Ar volume
.Op Fl host
.Ar server
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
.Op Fl verbose
.Op Fl extended
.Bd -filled -offset indent -compact
Print detailed information about
.Ar volume
on
.Ar server Ns .
.Ed
.Pp
.Ic vos volinfo
.Bd -filled -offset indent -compact
.Ic vos volinfo
is an alias for the
.Ic vos examine
command.
.Ed
.Pp
.Ic vos help
.Bd -filled -offset indent -compact
Print help.
.Ed
.Pp
.Ic vos ?
.Bd -filled -offset indent -compact
Shorthand for
.Nm help Ns .
.Ed
.Pp
.Ic vos listpart
.Op Fl server
.Ar fileserver
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
.Op Fl verbose
.Bd -filled -offset indent -compact
List partitions on a fileserver.
.Ed
.Pp
.Ic vos listvldb
.Op Fl server
.Op Ar fileserver
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
.Op Fl verbose
.Bd -filled -offset indent -compact
List volumes in the volume location database without reading them on the
fileserver, optionally restricting the list to the volumes located on a
specific
.Ar fileserver Ns .
.Ed
.Pp
.Ic vos listvol
.Op Fl server
.Ar fileserver
.Op Fl partition
.Ar partition
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
.Op Fl verbose
.Bd -filled -offset indent -compact
List volumes on
.Ar fileserver Ns ,
without consulting the volume location database, optionally restricting
the list to the volumes located on a specific
.Ar partition Ns .
.Ed
.Pp
.Ic vos lock
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos move
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos partinfo
.Op Fl server
.Ar fileserver
.Op Fl partition
.Ar partition
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl localauth
.Op Fl verbose
.Bd -filled -offset indent -compact
List the total and remaining diskspace on 
.Ar fileserver Ns ,
optionally restricting the list to a specific
.Ar partition Ns .
.Ed
.Pp
.Ic vos release
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos remove
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos remsite
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos rename
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos restore
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos status
.Op Fl server
.Ar fileserver
.Op Fl cell Ar cellname
.Op Fl noauth
.Op Fl verbose
.Bd -filled -offset indent -compact
Show volume server transactions.
.Ed
.Pp
.Ic vos syncserv
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos syncvldb
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos syncsite
.Bd -filled -offset indent -compact
Print the syncsite.
.Ed
.Pp
.Ic vos unlock
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos unlockvldb
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos zap
.Bd -filled -offset indent -compact
Not yet implemented.
.Ed
.Pp
.Ic vos quit
.Bd -filled -offset indent -compact
Exit interactive mode.
.Ed
.Sh SEE ALSO
.Xr fs 1 ,
.Xr pts 1 ,
.Xr afsd 8 ,
.Xr bos 8
.Sh STANDARDS
The Arla authors are trying to mimic the behaviour of the original AFS
utilities.
.Sh AUTHORS
The Arla project <http://www.stacken.kth.se/project/arla/>.
.Sh BUGS
Quite a lot of commands are not implemented yet.
