openbsd/src/sys/arch/i386/stand/installboot/installboot.8
.\"	$OpenBSD: installboot.8,v 1.8 1997/09/24 08:31:18 mickey Exp $
.\"
.\"
.\" Copyright (c) 1997 Michael Shalayeff
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Michael Shalayeff.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR 
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd 1 Sep 1997
.Dt INSTALLBOOT 8
.Os 
.Sh NAME
.Nm installboot
.Nd install a bootstrap on a UFS disk or partition
.Sh SYNOPSIS
.Nm installboot
.Op Fl n
.Op Fl v
.Oo Fl s Ar spt Oc
.Oo Fl h Ar tpc Oc
.Ar boot
.Ar biosboot
.Ar disk
.Sh DESCRIPTION
.Nm installboot
is used to install a "first-stage" boot program into the boot area
of a UFS or a FFS disk partition, and initialize the table of block
numbers the
.Ar biosboot
program uses to load the second-stage boot program.
.Pp
The options are as follows:
.Bl -tag -width flag_opt
.It Fl n
Do not actually write anything on the disk.
.It Fl v
Be verbose, printing out the CHS (Cylinder, Head, Sector)
triples that are stored in
.Ar biosboot
along with lots of other information.
.It Fl s Ar spt
Used to specify the sectors-per-track value if the drive has
sector translation activated, and
.Nm
is unable to determine the translated geometry.
If not specified, this defaults to d_nsectors from the disklabel.
.It Fl h Ar tpc
Used to specify the tracks-per-cylinder value if the drive has
sector translation activated, and
.Nm
is unable to determine the translated geometry.
If not specified, this defaults to d_ntracks from the disklabel.
.El
.Pp
The arguments are:
.Bl -tag -width biosboot
.It Ar boot
The name of the second-stage boot program in the mounted file system
where the first-stage boot program is to be installed.
.It Ar biosboot
The name of the prototype file for the first stage boot program,
usually /usr/mdec/biosboot.
.It Ar disk
The name of the disk containing the partition in which the
first-stage boot program is to be installed.
This might be the raw partition
of the block device on which the file system containing
.Ar boot
is mounted.  Note that you must be in single-user mode or have your
kernel in insecure mode (see 
.Xr sysctl 8 's
kern.securelevel variable or /etc/rc.securelevel) to be able
to access the raw partition of a mounted disk.
.El
.Sh BUGS
The disklabel d_type field must be set to a value other than "unknown".
.Pp
You cannot run
.Nm installboot
for drives/partitions others then the one you want /bsd loaded from.
.Sh SEE ALSO
.Xr disklabel 8 ,
.Xr init 8 ,
.Xr fdisk 8 ,
.Xr biosboot 8 .
