openbsd/src/usr.sbin/iscsictl/iscsictl.8
.\"	$OpenBSD: iscsictl.8,v 1.3 2014/04/20 22:22:18 claudio Exp $
.\"
.\" Copyright (c) 2010 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 20 2014 $
.Dt ISCSICTL 8
.Os
.Sh NAME
.Nm iscsictl
.Nd control the Internet SCSI (iSCSI) daemon
.Sh SYNOPSIS
.Nm
.Op Fl s Ar socket
.Ar command
.Op Ar argument ...
.Sh DESCRIPTION
The
.Nm
program controls the
.Xr iscsid 8
daemon.
Commands may be abbreviated to the minimum unambiguous prefix.
.Pp
The following options are available:
.Bl -tag -width Ds
.It Fl s Ar socket
Use
.Ar socket
instead of the default
.Pa /var/run/iscsid.sock
to communicate with
.Xr iscsid 8 .
.El
.Pp
The following commands are available:
.Bl -tag -width Ds
.It Cm reload
Reload the configuration file.
.It Cm show Cm vscsi Cm stats
Show statistics of about
.Xr vscsi 4
usage.
It shows how many calls were issued and how many bytes were read or written.
.El
.Sh FILES
.Bl -tag -width "/var/run/iscsid.sockXX" -compact
.It /etc/iscsi.conf
Default
.Xr iscsid 8
configuration file.
.It /var/run/iscsid.sock
.Ux Ns -domain
socket used for communication with
.Xr iscsid 8 .
.El
.Sh SEE ALSO
.Xr iscsi.conf 5 ,
.Xr iscsid 8
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 4.9 .
