openbsd/src/usr.bin/ctfconv/ctfconv.1
.\"	$OpenBSD: ctfconv.1,v 1.8 2017/10/17 22:47:58 schwarze Exp $
.\"
.\" Copyright (c) 2016 Martin Pieuchot <mpi@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 17 2017 $
.Dt CTFCONV 1
.Os
.Sh NAME
.Nm ctfconv
.Nd generates a raw CTF section from debug data
.Sh SYNOPSIS
.Nm ctfconv
.Op Fl d
.Fl l Ar label
.Fl o Ar outfile
.Ar file
.Sh DESCRIPTION
The
.Nm
utility parses DWARF debug sections of
.Ar file
to generate
.Dv CTF
data.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d
Display types as if they would be dumped from a
.Dv .SUNW_ctf
section by
.Xr ctfdump 1
and exit.
This option cannot be used in conjunction with other modes of operation.
.It Fl l Ar label
Set the
.Dv CTF
label to
.Ar label .
.It Fl o Ar outfile
Write the raw section in
.Ar outfile .
.El
.Sh EXIT STATUS
.Ex -std ctfconv
.Sh SEE ALSO
.Xr ctfdump 1 ,
.Xr ctfstrip 1
.Sh HISTORY
The
.Nm
utility first appeared in
.Ox 6.2 .
.Sh AUTHORS
.An Martin Pieuchot Aq Mt mpi@openbsd.org
