openbsd/src/share/man/man4/man4.atari/floppy.4
.\"	$NetBSD: floppy.4,v 1.2 1995/11/28 08:03:27 jtc Exp $
.\"
.\" Copyright (c) 1995 Leo Weppelman
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Leo Weppelman.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd October 15, 1995
.Dt FLOPPY 4 Atari
.Os
.Sh NAME
.Nm floppy
.Nd
.Tn Atari
floppy interface
.Sh SYNOPSIS
.Cd "fd0 at fdc0 unit 0"
.Cd "fd1 at fdc0 unit 1"
.Sh DESCRIPTION
This is an interface to the buildin and external floppy drives on the Atari.
Currently, there is no disklabel support for the floppy drives. Instead, the
floppy interface uses the partition number embedded in the minor device number
to distinguise between various floppy formats.
.Pp
Currently, the following formats are supported:
.Bl -column header Partition Size sides tracks sectors/track
.Sy    "Partition   Size   sides  tracks  sectors/track"
    a       360Kb    1      80          9
    b       720Kb    2      80          9
    c      1.44Mb    2      80         18
.Sh FILES
.Bl -tag -width /dev/rfd[01][abc] -compact
.It Pa /dev/fd[01][abc]
Block files
.It Pa /dev/rfd[01][abc]
Raw files
.El
.Sh DIAGNOSTICS
None.
