openbsd/src/usr.sbin/rcctl/rcctl.8
.\"	$OpenBSD: rcctl.8,v 1.11 2014/12/24 13:04:43 ajacoutot Exp $
.\"
.\" Copyright (c) 2014 Antoine Jacoutot <ajacoutot@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: December 24 2014 $
.Dt RCCTL 8
.Os
.Sh NAME
.Nm rcctl
.Nd configure and control daemons and services
.Sh SYNOPSIS
.Nm rcctl
.Op Fl df
.Sm off
.Cm enable | disable | status | default | order | Ar action
.Sm on
.Op Ar service | daemon Oo Cm flags Oo Ar arguments Oc Oc | Ar daemons
.Sh DESCRIPTION
The
.Nm
utility can enable or disable a base system
.Ar service
or a base system or package
.Ar daemon
in
.Xr rc.conf.local 8
or display its status.
For a daemon, it can also change the command line arguments or call its
.Xr rc.d 8
.Ar daemon
control script.
.Pp
The following commands are available:
.Bl -tag -width Ds
.It Cm enable Ar service | daemon Op Cm flags Op Ar arguments
Enable the service or daemon in
.Xr rc.conf.local 8 .
For a daemon, optionally set the variable
.Ar daemon Ns _flags
to the specified
.Ar arguments .
If
.Cm flags
is appended without any
.Ar arguments ,
.Ar daemon Ns _flags
is reset to its default value.
If
.Ar daemon
is already enabled,
.Ar daemon Ns _flags
is reset to the optionally provided
.Cm flags .
.It Cm disable Ar service | daemon
Disable the service or daemon in
.Xr rc.conf.local 8 .
.It Cm status Op Ar service | daemon
Display the value of
.Ar service
or
.Ar daemon Ns _flags .
Without an argument, display all services and
.Ar daemon Ns _flags
with their values in a format compatible with
.Xr rc.conf 8 .
.It Cm default Op Ar service | daemon
For a daemon, display the flags that will be used if
.Dq Cm enable Ar daemon Cm flags
is called without
.Ar arguments .
For a base system service, display whether it is enabled by default.
.It Cm order Op Ar daemons
Order
.Sy enabled
.Xr packages 7
daemons startup by prepending
.Ar daemons
to the pkg_scripts line.
If
.Ar daemons
is empty, display the current order.
.It Oo Fl df Oc Ar action daemon
Run the
.Xr rc.d 8
.Ar daemon
script with the
.Ar action
argument, passing through the specified options, if any.
.El
.Sh EXIT STATUS
.Nm Ar action
returns with the exit status of the
.Xr rc.d 8
.Ar daemon
script.
.Nm Cm status
exits with 0 if the daemon or service is enabled and 1 if it is not.
.Nm Cm default
exits with 0 if the daemon or service is enabled by default
and 1 if it is not.
Otherwise, the
.Nm
utility exits 0 on success, and >0 if an error occurs
.Po 2 indicates a non-existent
.Ar service
.Pc .
.Sh EXAMPLES
Enable and set
.Xr ntpd 8
flags:
.Bd -literal -offset indent
# rcctl enable ntpd flags -s
# rcctl status ntpd
-s
# echo $?
0
.Ed
.Sh SEE ALSO
.Xr rc.conf.local 8 ,
.Xr rc.d 8
.Sh HISTORY
.Nm
first appeared in
.Ox 5.7 .
.Sh AUTHORS
.Nm
was written by
.An Antoine Jacoutot Aq Mt ajacoutot@openbsd.org .
