openbsd/src/lib/libc/sys/adjfreq.2
.\"	$OpenBSD: adjfreq.2,v 1.3 2007/05/31 19:19:32 jmc Exp $
.\"
.\" Copyright (c) 2006 Otto Moerbeek
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt ADJFREQ 2
.Os
.Sh NAME
.Nm adjfreq
.Nd "correct the rate of the system clock"
.Sh SYNOPSIS
.Fd #include <sys/types.h>
.Fd #include <sys/time.h>
.Ft int
.Fn adjfreq "const int64_t *freq" "int64_t *oldfreq"
.Sh DESCRIPTION
.Fn adjfreq
adjusts the rate in which time progresses if
.Fa freq
is non-null.
The unit of the rate of adjustment is nanoseconds per second,
shifted left 32 bits to allow for fractional values.
.Pp
If
.Fa oldfreq
is non-null, the current value is returned.
.Pp
Only the superuser may adjust the frequency.
.Sh RETURN VALUES
A return value of 0 indicates that the call succeeded.
A return value of \-1 indicates that an error occurred, and in this
case an error code is stored in the global variable
.Va errno .
.Sh ERRORS
.Fn adjfreq
will fail if:
.Bl -tag -width Er
.It Bq Er EFAULT
Either of the arguments point outside the process's allocated address space.
.It Bq Er EPERM
The
.Fa freq
argument is non-null and the process's effective user ID is not that
of the superuser.
.El
.Sh SEE ALSO
.Xr date 1 ,
.Xr adjtime 2 ,
.Xr gettimeofday 2 ,
.Xr ntpd 8 ,
.Xr timed 8 ,
.Xr timedc 8
.Rs
.%T "TSP: The Time Synchronization Protocol for UNIX 4.3BSD"
.%A R. Gusella
.%A S. Zatti
.Re
.Sh HISTORY
The
.Fn adjfreq
function call first appeared in
.Ox 4.0 .
