openbsd/src/lib/libc/sys/getpeereid.2
.\"	$OpenBSD: getpeereid.2,v 1.8 2007/05/31 19:19:32 jmc Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.Dd $Mdocdate: May 31 2007 $
.Dt GETPEEREID 2
.Os
.Sh NAME
.Nm getpeereid
.Nd get effective user and group identification of locally-connected peer
.Sh SYNOPSIS
.Fd #include <sys/types.h>
.Fd #include <sys/socket.h>
.Ft int
.Fn getpeereid "int s" "uid_t *euid" "gid_t *egid"
.Sh DESCRIPTION
.Fn getpeereid
returns the effective user ID and group ID of the peer connected to
a
.Ux
domain socket (see
.Xr unix 4 ) .
The argument
.Fa s
must be of type
.Dv SOCK_STREAM .
.Pp
One common use is for
.Ux
domain servers to determine the credentials
of clients that have connected to it.
.Pp
.Fn getpeereid
takes three parameters:
.Bl -bullet
.It
.Fa s
contains the file descriptor of the socket whose peer credentials
should be looked up.
.It
.Fa euid
points to a
.Li uid_t
variable into which the effective user ID for the connected peer will
be stored.
.It
.Fa egid
points to a
.Li gid_t
variable into which the effective group ID for the connected peer will
be stored.
.El
.Sh RETURN VALUES
If the call succeeds, a 0 is returned and
.Fa euid
and
.Fa egid
are set to the effective user ID and group ID of the connected peer.
Otherwise,
.Va errno
is set and a value of \-1 is returned.
.Sh ERRORS
On failure,
.Va errno
is set to one of the following:
.Bl -tag -width Er
.It Bq Er EBADF
The argument
.Fa s
is not a valid descriptor.
.It Bq Er ENOTSOCK
The argument
.Fa s
is a file, not a socket.
.It Bq Er EOPNOTSUPP
The socket is not in the
.Ux
domain.
.It Bq Er ENOTCONN
The socket is not connected.
.It Bq Er ENOBUFS
Insufficient resources were available in the system
to perform the operation.
.It Bq Er EFAULT
The
.Fa euid
or
.Fa egid
parameters point to memory not in a valid part of the
process address space.
.El
.Sh SEE ALSO
.Xr accept 2 ,
.Xr bind 2 ,
.Xr getpeername 2 ,
.Xr getsockname 2 ,
.Xr socket 2 ,
.Xr unix 4
.Sh HISTORY
The
.Fn getpeereid
function call appeared in
.Ox 3.0 .
