openbsd/src/lib/libc/sys/getthrid.2
.\"	$OpenBSD: getthrid.2,v 1.2 2014/08/31 06:41:23 jmc Exp $
.\"	$NetBSD: getpid.2,v 1.5 1995/02/27 12:33:12 cgd Exp $
.\"
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)getpid.2	8.1 (Berkeley) 6/4/93
.\"
.Dd $Mdocdate: August 31 2014 $
.Dt GETTHRID 2
.Os
.Sh NAME
.Nm getthrid
.Nd get thread identifier
.Sh SYNOPSIS
.Fd #include <unistd.h>
.Ft pid_t
.Fn getthrid void
.Sh DESCRIPTION
.Nm
returns the thread ID of the calling thread.
This is used in the implementation of the thread library
.Pq Fl lpthread
and can appear in the output of system utilities such as
.Xr ps 1
and
.Xr kdump 1 .
.Pp
Thread IDs are not a stable interface and should not be used directly
by applications except for correlation with system utility output.
Applications should use the
.Vt pthread_t
values from
.Xr pthread_self 3
and
.Xr pthread_create 3
to identify threads within the process itself.
.Sh RETURN VALUES
This function is always successful, and no return value is
reserved to indicate an error.
.Sh SEE ALSO
.Xr __tfork 2 ,
.Xr getpid 2 ,
.Xr pthread_create 3 ,
.Xr pthread_self 3
.Sh STANDARDS
The
.Nm
syscall is specific to
.Ox
and should not be used in portable applications.
.Sh HISTORY
The
.Nm
syscall appeared in
.Ox 3.9 .
