openbsd/src/lib/libc/sys/msync.2
.\"	$OpenBSD: msync.2,v 1.27 2019/12/10 00:49:26 jsg Exp $
.\"	$NetBSD: msync.2,v 1.8 1995/10/12 15:41:09 jtc Exp $
.\"
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)msync.2	8.1 (Berkeley) 6/9/93
.\"
.Dd $Mdocdate: December 10 2019 $
.Dt MSYNC 2
.Os
.Sh NAME
.Nm msync
.Nd synchronize a mapped region
.Sh SYNOPSIS
.In sys/mman.h
.Ft int
.Fn msync "void *addr" "size_t len" "int flags"
.Sh DESCRIPTION
The
.Fn msync
system call writes all pages with shared modifications
in the specified region starting from
.Ar addr
and continuing for
.Ar len
bytes.
.Ar addr
should be a multiple of the page size.
Any required synchronization of memory caches
will also take place at this time.
Filesystem operations on a file that is mapped for shared modifications
are unpredictable except after an
.Fn msync .
.Pp
The
.Fa flags
argument is the bitwise OR of zero or more of the following values:
.Bd -literal -offset indent
MS_ASYNC	Perform asynchronous writes.
MS_SYNC		Perform synchronous writes.
MS_INVALIDATE	Invalidate cached data after writing.
.Ed
.Sh RETURN VALUES
.Rv -std
.Sh ERRORS
The following errors may be reported:
.Bl -tag -width Er
.It Bq Er EBUSY
The
.Dv MS_INVALIDATE
flag was specified and a portion of the specified region
was locked with
.Xr mlock 2 .
.It Bq Er EINVAL
The specified
.Fa flags
argument was invalid.
.It Bq Er EINVAL
The
.Fa addr
parameter was not page aligned or
.Fa addr
and
.Fa size
specify a region that would extend beyond the end of the address space.
.It Bq Er ENOMEM
Addresses in the specified region are outside the range allowed
for the address space of the process, or specify one or more pages
which are unmapped.
.It Bq Er EIO
An I/O error occurred while writing.
.El
.Sh SEE ALSO
.Xr madvise 2 ,
.Xr minherit 2 ,
.Xr mprotect 2 ,
.Xr munmap 2
.Sh HISTORY
The
.Fn msync
function first appeared in SunOS 4.0
and has been available since
.Bx 4.4 .
It was modified to conform to
.St -p1003.1b-93
.Sh BUGS
Writes are currently done synchronously even if the
.Dv MS_ASYNC
flag is specified.
