openbsd/src/lib/libc/sys/sendsyslog.2
.\"	$OpenBSD: sendsyslog.2,v 1.5 2016/02/22 22:22:30 bluhm Exp $
.\"
.\" Copyright (c) 2014 Theo de Raadt
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 22 2016 $
.Dt SENDSYSLOG 2
.Os
.Sh NAME
.Nm sendsyslog ,
.Nm sendsyslog2
.Nd send a message to syslogd
.Sh SYNOPSIS
.In sys/syslog.h
.In sys/types.h
.Ft int
.Fn sendsyslog "const void *msg" "size_t len"
.Ft int
.Fn sendsyslog2 "const void *msg" "size_t len" "int flags"
.Sh DESCRIPTION
The
.Fn sendsyslog
and
.Fn sendsyslog2
functions are used to transmit a
.Xr syslog 3
formatted message direct to
.Xr syslogd 8
without requiring the allocation of a socket.
.Pp
The
.Fa flags
argument of
.Fn sendsyslog2
accepts the
.Dv LOG_CONS
flag.
If
.Dv LOG_CONS
is specified, and
.Xr syslogd 8
is not accepting messages, the message will be sent directly to the
console.
This is used internally by
.Xr syslog_r 3 ,
so that messages can be sent during difficult situations.
.Sh RETURN VALUES
.Rv -std
.Sh ERRORS
.Fn sendsyslog
can fail if:
.Bl -tag -width Er
.It Bq Er ENOTCONN
The message cannot be sent, likely because
.Xr syslogd 8
is not running.
.El
.Sh SEE ALSO
.Xr syslog_r 3 ,
.Xr syslogd 8
.Sh HISTORY
The
.Fn sendsyslog
function call appeared in
.Ox 5.6 .
The
.Fn sendsyslog2
function call appeared in
.Ox 5.9 .
