openbsd/src/lib/libc/sys/setregid.2
.\" $OpenBSD: setregid.2,v 1.3 2004/01/25 14:48:32 jmc Exp $
.\"
.\" Copyright (c) 1980, 1991, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)setregid.2	8.2 (Berkeley) 4/16/94
.\"
.Dd January 29, 2003
.Dt SETREGID 2
.Os
.Sh NAME
.Nm setregid
.Nd set real and effective group IDs
.Sh SYNOPSIS
.Fd #include <unistd.h>
.Ft int
.Fn setregid "gid_t rgid" "gid_t egid"
.Sh DESCRIPTION
The real and effective group IDs of the current process
are set according to the arguments.
If the real group ID is changed, the saved group ID is changed to the
new value of the effective group ID.
.Pp
Unprivileged users may change either group ID to the current value
of the real, effective, or saved group ID.
Only the superuser may make other changes.
.Pp
Supplying a value of -1 for either the real or effective
group ID forces the system to substitute the current
ID in place of the -1 parameter.
.Pp
The
.Fn setregid
function was intended to allow swapping the real and
effective group IDs in set-group-ID programs to temporarily relinquish
the set-group-ID value.
This purpose is now better served by the use of the
.Fn setegid
function (see
.Xr setuid 2 ) .
.Pp
When setting the real and effective group IDs to the same value, the
.Fn setgid
function is preferred.
.Sh RETURN VALUES
Upon successful completion, a value of 0 is returned.
Otherwise, a value of -1 is returned and
.Va errno
is set to indicate the error.
.Sh ERRORS
.Bl -tag -width Er
.It Bq Er EPERM
The current process is not the superuser and a change
other than changing the effective group ID to the real group ID
was specified.
.El
.Sh SEE ALSO
.Xr getgid 2 ,
.Xr setegid 2 ,
.Xr setgid 2 ,
.Xr setresgid 2 ,
.Xr setuid 2
.Sh STANDARDS
The
.Fn setregid
function conforms to the
.St -p1003.1-2001
and
.St -xpg4.3 .
specifications.
.Pp
Note, however, that prior to
.St -p1003.1-2001 ,
the
.Fn setregid
function was not a part of the
.St -p1003.1
specification.
As a result, it may not be implemented on all systems.
.Sh HISTORY
The
.Fn setregid
function call appeared in
.Bx 4.2 .
A semantically different version appeared in
.Bx 4.4 .
The current version, with the original semantics restored, appeared in
.Ox 3.3 .
.Sh CAVEATS
The
.Fn setregid
function predates
.Tn POSIX
saved group IDs.
This implementation changes the saved group ID to the new value of
the effective group ID if the real group ID is changed.
Other implementations may behave differently.
