openbsd/src/lib/libc/sys/thrkill.2
.\"	$OpenBSD: thrkill.2,v 1.1 2015/11/10 04:30:59 guenther Exp $
.\"	$NetBSD: kill.2,v 1.7 1995/02/27 12:33:53 cgd Exp $
.\"
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)kill.2	8.3 (Berkeley) 4/19/94
.\"
.Dd $Mdocdate: November 10 2015 $
.Dt THRKILL 2
.Os
.Sh NAME
.Nm thrkill
.Nd send signal to a thread in the same process
.Sh SYNOPSIS
.In signal.h
.Ft int
.Fn thrkill "pid_t tid" "int sig" "void *tcb"
.Sh DESCRIPTION
The
.Fn thrkill
function sends the signal given by
.Fa sig
to
.Fa tid ,
a thread in the same process as the caller.
.Fn thrkill
will only succeed if
.Fa tcb
is either
.Dv NULL
or the address of the thread control block (TCB) of the target thread.
.Fa sig
may be one of the signals specified in
.Xr sigaction 2
or it may be 0, in which case
error checking is performed but no
signal is actually sent.
.Pp
If
.Fa tid
is zero then the current thread is targeted.
.Sh RETURN VALUES
.Rv -std
.Sh ERRORS
.Fn thrkill
will fail and no signal will be sent if:
.Bl -tag -width Er
.It Bq Er EINVAL
.Fa sig
is not a valid signal number.
.It Bq Er ESRCH
The process doesn't have a thread with thread ID
.Fa tid .
.It Bq Er ESRCH
.Fa tcb
is not
.Dv NULL
and not the TCB address of the thread with thread ID
.Fa tid .
.El
.Sh SEE ALSO
.Xr __get_tcb 2 ,
.Xr kill 2 ,
.Xr sigaction 2 ,
.Xr pthread_kill 3 ,
.Xr raise 3
.Sh STANDARDS
The
.Fn __thrsigdivert
function is specific to
.Ox
and should not be used in portable applications.
Use
.Xr pthread_kill 3
instead.
.Sh HISTORY
The
.Fn thrkill
system call appeared in
.Ox 5.9 .
