openbsd/src/usr.sbin/ospfctl/ospfctl.8
.\"	$OpenBSD: ospfctl.8,v 1.1 2005/01/28 14:18:46 claudio Exp $
.\"
.\" Copyright (c) 2004, 2005 Esben Norby <esben.norby@ericsson.com>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"

.Dd November 11, 2004
.Dt OSPFCTL 8
.Os
.Sh NAME
.Nm ospfctl
.Nd control the Open Shortest Path First daemon
.Sh SYNOPSIS
.Nm
.Ar command
.Op Ar arguments ...
.Sh DESCRIPTION
The
.Nm
program controls the
.Xr ospfd 8
daemon.
.Pp
The following commands are available:
.Bl -tag -width Ds
.It Cm show database
Show the entire link state database.
.It Cm show neighbor
Show neighbor summary.
.It Cm show interfaces
Show interface summary.
.Sh FILES
.Bl -tag -width "/etc/ospfd.confXXXX" -compact
.It /etc/ospfd.conf
.Xr ospfd 8
configuration file.
.El
.Sh SEE ALSO
.Xr ospfd 8
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 3.7 .
