openbsd/src/sbin/ipsecctl/ipsecctl.8
.\"	$OpenBSD: ipsecctl.8,v 1.11 2005/06/30 19:05:45 hshoexer Exp $
.\"
.\" Copyright (c) 2004, 2005 Hans-Joerg Hoexer <hshoexer@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd April 5, 2005
.Dt IPSECCTL 8
.Os
.Sh NAME
.Nm ipsecctl
.Nd control flows for IPsec
.Sh SYNOPSIS
.Nm ipsecctl
.Op Fl dFnv
.Op Fl f Ar file
.Op Fl s Ar modifier
.Sh DESCRIPTION
The
.Nm
utility controls flows that determine which packets are to be processed by
IPsec.
It allows ruleset configuration and retrieval of status information from the
kernel's SPD (Security Policy Database) and SADB (Security Association
Database).
.Pp
The ruleset grammar is described in
.Xr ipsec.conf 5 .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d
When the
.Fl d
option is set, specified flows will be deleted from the SPD.
Otherwise,
.Nm
will add flows.
.It Fl F
The
.Fl F
option flushes the SPD and the SADB.
.It Fl f Ar file
Load the rules contained in
.Ar file .
.It Fl n
Do not actually load rules, just parse them.
.It Fl s Ar modifier
Show the kernel's databases, specified by
.Ar modifier
(may be abbreviated):
.Pp
.Bl -tag -width xxxxxxxxxxxxx -compact
.It Fl s Cm flow
Show the ruleset loaded into the SPD.
.It Fl s Cm sa
Show the active SADB entries.
.It Fl s Cm all
Show all of the above.
.El
.It Fl v
Produce more verbose output.
A second use of
.Fl v
will produce even more verbose output.
.El
.\" The following requests should be uncommented and used where appropriate.
.\" This next request is for sections 2, 3, and 9 function return values only.
.\" .Sh RETURN VALUES
.\" This next request is for sections 1, 6, 7 & 8 only.
.\" .Sh ENVIRONMENT
.\" .Sh FILES
.\" .Sh EXAMPLES
.\" This next request is for sections 1, 4, 6, and 8 only.
.\" .Sh DIAGNOSTICS
.\" The next request is for sections 2, 3, and 9 error and signal handling only.
.\" .Sh ERRORS
.Sh SEE ALSO
.Xr ipsec.conf 5
.\" .Sh STANDARDS
.\" .Sh HISTORY
.\" .Sh AUTHORS
.\" .Sh CAVEATS
.\" .Sh BUGS
