openbsd/src/usr.bin/compress/compress.1
.\"	$OpenBSD: compress.1,v 1.32 2005/07/22 08:58:31 jmc Exp $
.\"	$NetBSD: compress.1,v 1.5 1995/03/26 09:44:34 glass Exp $
.\"
.\" Copyright (c) 1986, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" James A. Woods, derived from original work by Spencer Thomas
.\" and Joseph Orost.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)compress.1	8.2 (Berkeley) 4/18/94
.\"
.Dd April 18, 1994
.Dt COMPRESS 1
.Os
.Sh NAME
.Nm compress ,
.Nm uncompress ,
.Nm gzip ,
.Nm gunzip ,
.Nm zcat ,
.Nm gzcat
.Nd compress and expand data
.Sh SYNOPSIS
.Nm compress
.Op Fl LV
.Nm compress
.Op Fl 123456789cdfghlNnOqrtv
.Op Fl b Ar bits
.Op Fl o Ar filename
.Op Fl S Ar suffix
.Op Ar
.Nm uncompress
.Op Fl cfhlNnqrtv
.Op Fl o Ar filename
.Op Ar
.Pp
.Nm gzip
.Op Fl LV
.Nm gzip
.Op Fl 123456789cdfghlNnOqrtv
.Op Fl b Ar bits
.Op Fl o Ar filename
.Op Fl S Ar suffix
.Op Ar
.Nm gunzip
.Op Fl cfhlNnqrtv
.Op Fl o Ar filename
.Op Ar
.Pp
.Nm zcat
.Op Fl fghqr
.Op Ar
.Nm gzcat
.Op Fl fhqr
.Op Ar
.Sh DESCRIPTION
The
.Nm compress
and
.Nm gzip
utilities
reduce the size of the named files using adaptive Lempel-Ziv coding.
They are functionally identical, but use different algorithms for compression.
If invoked as
.Nm gzip
or
.Nm compress Fl g ,
the deflate mode of compression is chosen by default;
otherwise the older method of compression
.Pq compress mode
is used.
.Pp
Each
.Ar file
is renamed to the same name plus the extension
.Dq .Z ,
or
.Dq .gz
(in deflate mode).
As many of the modification time, access time, file flags, file mode,
user ID, and group ID as allowed by permissions are retained in the
new file.
If compression would not reduce the size of a
.Ar file ,
the file is ignored (unless
.Fl f
is used).
.Pp
The
.Nm uncompress
and
.Nm gunzip
utilities restore compressed files to their original form, renaming the
files by removing the extension (or by using the stored name if the
.Fl N
flag is specified).
When decompressing, the following extensions are recognized:
.Dq .Z ,
.Dq -Z ,
.Dq _Z ,
.Dq .gz ,
.Dq -gz ,
.Dq _gz ,
.Dq .tgz ,
.Dq -tgz ,
.Dq _tgz ,
.Dq .taz ,
.Dq -taz ,
and
.Dq _taz .
Extensions ending in
.Dq tgz
and
.Dq taz
are not removed when decompressing, instead they are converted to
.Dq tar .
.Pp
The
.Nm zcat
command is equivalent in functionality to
.Nm uncompress
.Fl c .
The
.Nm gzcat
command is equivalent in functionality to
.Nm gunzip
.Fl c .
.Pp
If renaming the files would cause files to be overwritten and the standard
input device is a terminal, the user is prompted (on the standard error
output) for confirmation.
If prompting is not possible or confirmation is not received, the files
are not overwritten.
.Pp
If no files are specified, the standard input is compressed or uncompressed
to the standard output.
If either the input or output files are not regular files, the checks for
reduction in size and file overwriting are not performed, the input file is
not removed, and the attributes of the input file are not retained.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl 1...9
Use deflate scheme with compression factor of
.Fl 1
to
.Fl 9 .
Compression factor
.Fl 1
is the fastest, but provides a poorer level of compression.
Compression factor
.Fl 9
provides the best level of compression, but is relatively slow.
The default is
.Fl 6 .
This option implies
.Fl g .
.It Fl b Ar bits
Specify the
.Ar bits
code limit
.Pq see below .
.It Fl c
Compressed or uncompressed output is written to the standard output.
No files are modified (force
.Nm zcat
or
.Nm gzcat
mode).
.It Fl d
Decompress the source files instead of compressing them (force
.Nm uncompress
mode).
.It Fl f
Force compression of
.Ar file ,
even if it is not actually reduced in size.
Additionally, files are overwritten without prompting for confirmation.
If the input data is not in a format recognized by
.Nm
and if the option
.Fl c
is also given, copy the input data without change
to the standard output: let
.Nm zcat
or
.Nm gzcat
behave as
.Xr cat 1 .
.It Fl g
Use deflate scheme which reportedly provides better compression rates (force
.Nm gzip
mode).
This flag need not be specified when invoked as
.Nm gzip .
.It Fl h
Print a short help message.
.It Fl l
List information for the specified compressed files.
The following information is listed:
.Bl -tag -width "compression ratio"
.It compressed size
Size of the compressed file.
.It uncompressed size
Size of the file when uncompressed.
.It compression ratio
Ratio of the difference between the compressed and uncompressed
sizes to the uncompressed size.
.It uncompressed name
Name the file will be saved as when uncompressing.
.El
.Pp
If the
.Fl v
option is specified, the following additional information is printed:
.Bl -tag -width "compression method"
.It compression method
Name of the method used to compress the file.
.It crc
32-bit CRC
.Pq cyclic redundancy code
of the uncompressed file.
.It "time stamp"
Date and time corresponding to the last data modification time
(mtime) of the compressed file (if the
.Fl n
option is specified, the time stamp stored in the compressed file
is printed instead).
.El
.It Fl N
When compressing, save the original file name and time stamp in the
compressed file.
This information is saved by default when the deflate scheme is used.
When uncompressing or listing, use the time stamp and file name stored
in the compressed file, if any, for the uncompressed version.
.It Fl n
When compressing, do not save the original file name and time stamp.
This information is saved by default when the deflate scheme is used.
When uncompressing, do not restore the original file name and time stamp.
By default, the uncompressed file inherits the time stamp of the
compressed version and the uncompressed file name is generated from
the name of the compressed file name as described above.
.It Fl O
Use old compression method.
.It Fl o Ar filename
Set the output file name.
.It Fl q
Be quiet, suppress all messages.
.It Fl r
Recursive mode,
.Nm
will descend into specified directories.
.It Fl S Ar suffix
Set suffix for compressed files.
.It Fl t
Test the integrity of each file leaving any files intact.
.It Fl V
Display the program version
.Pq RCS IDs of the source files
and exit.
.It Fl v
Print the percentage reduction of each file and other information.
.El
.Pp
In normal mode,
.Nm
uses a modified Lempel-Ziv algorithm
.Pq LZW .
Common substrings in the file are first replaced by 9-bit codes 257 and up.
When code 512 is reached, the algorithm switches to 10-bit codes and
continues to use more bits until the
limit specified by the
.Fl b
flag is reached.
.Ar bits
must be between 9 and 16
.Pq the default is 16 .
.Pp
After the
.Ar bits
limit is reached,
.Nm
periodically checks the compression ratio.
If it is increasing,
.Nm
continues to use the existing code dictionary.
However, if the compression ratio decreases,
.Nm
discards the table of substrings and rebuilds it from scratch.
This allows the algorithm to adapt to the next
.Dq block
of the file.
.Pp
.Nm gzip
uses a slightly different version of the Lempel-Ziv algorithm
.Pq LZ77 .
Common substrings are replaced by pointers to previous strings,
and are found using a hash table.
Unique substrings are emitted as a string of literal bytes,
and compressed as Huffman trees.
.Pp
The
.Fl b
flag is omitted for
.Nm uncompress
or
.Nm gunzip
since the
.Ar bits
parameter specified during compression
is encoded within the output, along with
a magic number to ensure that neither decompression of random data nor
recompression of compressed data is attempted.
.Pp
The amount of compression obtained depends on the size of the
input, the number of
.Ar bits
per code, and the distribution of common substrings.
Typically, text such as source code or English is reduced by 50 \- 60% using
.Nm
and by 60 \- 70% using
.Nm gzip .
Compression is generally much better than that achieved by Huffman
coding (as used in the historical command pack), or adaptive Huffman
coding (as used in the historical command compact), and takes less
time to compute.
.Pp
The
.Nm
and
.Nm gzip
utilities exit with 0 on success, 1 if an error occurred, or 2 if one or
more files were not compressed because they would have grown in
size (and
.Fl f
was not specified).
.Sh RETURN VALUES
The
.Nm
utility exits with one of the following values:
.Pp
.Bl -tag -width flag -compact
.It Li 0
The file was compressed successfully.
.It Li 1
An error occurred.
.It Li 2
A warning occurred.
.El
.Sh SEE ALSO
.Xr gzexe 1 ,
.Xr zdiff 1 ,
.Xr zforce 1 ,
.Xr zmore 1 ,
.Xr znew 1 ,
.Xr compress 3
.Pp
.Rs
.%A Welch, Terry A.
.%D June, 1984
.%T "A Technique for High Performance Data Compression"
.%J "IEEE Computer"
.%V 17:6
.%P pp. 8\-19
.Re
.Pp
.Bl -tag -width 12n -compact
.It RFC 1950
ZLIB Compressed Data Format Specification.
.It RFC 1951
DEFLATE Compressed Data Format Specification.
.It RFC 1952
GZIP File Format Specification.
.El
.Sh STANDARDS
The
.Nm
utility is compliant with the
.St -p1003.2-92
specification.
.Pp
The
.Nm gzip
and
.Nm gunzip
utilities are extensions.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
The deflate compression support was added in
.Ox 2.1 .
Full
.Nm gzip
compatibility was added in
.Ox 3.4 .
The
.Sq g
in this version of
.Nm gzip
stands for
.Dq gratis .
