openbsd/src/usr.sbin/rebound/rebound.8
.\" $OpenBSD: rebound.8,v 1.2 2015/10/15 19:51:45 tedu Exp $
.\"
.\"Copyright (c) 2015 Ted Unangst <tedu@openbsd.org>
.\"
.\"Permission to use, copy, modify, and distribute this software for any
.\"purpose with or without fee is hereby granted, provided that the above
.\"copyright notice and this permission notice appear in all copies.
.\"
.\"THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\"WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\"MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\"ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\"WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\"ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\"OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.Dd $Mdocdate: October 15 2015 $
.Dt REBOUND 8
.Os
.Sh NAME
.Nm rebound
.Nd DNS proxy
.Sh SYNOPSIS
.Nm rebound
.Op Fl c Ar config
.Sh DESCRIPTION
The
.Nm
daemon proxies DNS requests.
It listens on localhost and forwards queries to another server.
.Pp
At present, the config file consists of a single line containing the next
hop DNS server.
.Sh SEE ALSO
.Xr resolv.conf 5 ,
.Xr unbound 8
.Sh HISTORY
The
.Nm
daemon first appeared in
.Ox 5.9 .
.Sh AUTHORS
.An Ted Unangst Aq Mt tedu@openbsd.org
