openbsd/src/usr.bin/elf2olf/elf2olf.1
.\"	$OpenBSD: elf2olf.1,v 1.15 2007/05/31 19:20:09 jmc Exp $
.\"
.\" Copyright (c) 1996, 1997 Erik Theisen.
.\"	All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"     @(#)$Id: elf2olf.1,v 1.15 2007/05/31 19:20:09 jmc Exp $
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt ELF2OLF 1
.Os
.Sh NAME
.Nm elf2olf ,
.Nm olf2elf
.Nd convert between ELF and OLF object module format
.Sh SYNOPSIS
.Nm elf2olf
.Op Fl v
.Op Fl o Ar opsys
.Ar module ...
.Nm olf2elf
.Op Fl v
.Ar
.Sh DESCRIPTION
The
.Nm elf2olf
utility reads the specified
.Em ELF
version 1 module operands and converts them to the default operating system's
.Em OLF
object module format.
.Pp
The
.Nm olf2elf
utility reverses the process.
The
.Ar module
operands are processed in command line order.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl o Ar opsys
Specifies the operating system
.Em OLF
tag
.Em "opsys"
as follows:
.Pp
.Bl -tag -width Ds -compact
.It Ta Pa "openbsd" Ta "OpenBSD"
.It Ta Pa "netbsd" Ta "NetBSD"
.It Ta Pa "freebsd" Ta "FreeBSD"
.It Ta Pa "44bsd" Ta "4.4BSD"
.It Ta Pa "linux" Ta "Linux"
.It Ta Pa "svr4" Ta "AT&T System V Release 4"
.It Ta Pa "esix" Ta "esix UNIX"
.It Ta Pa "solaris" Ta "SunSoft Solaris"
.It Ta Pa "irix" Ta "SGI IRIX"
.It Ta Pa "sco	" Ta "SCO UNIX"
.It Ta Pa "dell" Ta "Dell SVR4"
.It Ta Pa "ncr  " Ta "NCR SVR4"
.El
.It Fl v
Operate in verbose mode.
.El
.Pp
The
.Nm elf2olf
and
.Nm olf2elf
utilities exit 0 on success or >0 if an error occurred.
.Sh HISTORY
The
.Nm elf2olf
and
.Nm olf2elf
utilities first appeared in
.Ox 2.1 .
.Sh AUTHORS
Erik Theisen
.Sh BUGS
The
.Em ELF
version 1 object module format lacks any real method to determine the native
operating system for any given binary thus mandating the existence of these
tools.
The converted binaries created by
.Nm elf2olf
will no longer execute on their native operating system, only on OLF
enabled platforms, although
.Nm olf2elf
will undo the damage.
