openbsd/src/usr.bin/ctfdump/ctfdump.1
.\"	$OpenBSD: ctfdump.1,v 1.4 2017/10/17 22:47:58 schwarze Exp $
.\"
.\" Copyright (c) 2016 Martin Pieuchot <mpi@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 17 2017 $
.Dt CTFDUMP 1
.Os
.Sh NAME
.Nm ctfdump
.Nd display CTF information
.Sh SYNOPSIS
.Nm ctfdump
.Op Fl dfhlst
.Ar
.Sh DESCRIPTION
The
.Nm
utility displays CTF information from the
.Dv .SUNW_ctf
section of an
.Xr elf 5
file or from a raw CTF file.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d
Display the object section.
.It Fl f
Display the function section.
.It Fl h
Dump the CTF header.
.It Fl l
Display the label section.
.It Fl s
Display the string table.
.It Fl t
Display the type section.
.El
.Sh EXIT STATUS
.Ex -std ctfdump
.Sh SEE ALSO
.Xr elf 5
.Sh HISTORY
The
.Nm
utility first appeared in
.Ox 6.2 .
.Sh AUTHORS
.An Martin Pieuchot Aq Mt mpi@openbsd.org
