openbsd/src/share/man/man4/man4.i386/aria.4
.\"	$OpenBSD: aria.4,v 1.5 1999/07/09 13:35:43 aaron Exp $
.\"	aria.4
.\" Copyright (c) 1996 Roland C. Dowdeswell
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Roland C. Dowdeswell.
.\" 4. The name of the authors may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR `AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd January 21, 1996
.Dt ARIA 4 i386
.Os
.Sh NAME
.Nm aria
.Nd
Aria 16 device driver
.Sh SYNOPSIS
.Cd "aria0 at isa? port 0xPPP irq X drq Y flags Z"
.Sh DESCRIPTION
The
.Nm
driver provides support for sound cards based on Sierra Semiconductor's
Aria chipset.  Cards based on this chipset are capable of recording and
playing 8- or 16-bit samples in mono or stereo up to 44.1KHz.  Some chipsets
only play linear or ADCPM, but others will also play Mu-law and A-law
sounds.  Three different mixer configurations are available.
.Pp
The I/O Port Base is selected from 0x280, 0x290, 0x2a0 and 0x2b0. The
selection method depends on the board. The Aria takes 8 ports.
.Pp
The IRQ is selected from 10, 11, or 12.
.Pp
The DRQ line is chosen from 5 or 6, this driver will work with or without
a DRQ.  If no DRQ is given, then the
.Nm aria
driver will simply use Direct I/O.
.Pp
The flags currently supported are 0x1, for the Prometheus Aria 16/Aria 16se.
This flag tells the driver to initialise the card.  It is a weird undocumented
piece of horribleness, but the card will not respond until you twiddle with
the joystick port...
.Sh BUGS
The driver has only been tested on a Prometheus Aria 16.
.Pp
No DMA support, yet, so don't bother setting a DRQ.
.Pp
The full-duplex features are horribly inconsistent (i.e., unusable).
.Pp
The card sometimes drops out, and needs to be reset.  This can be
accomplished by opening and closing
.Pa /dev/audio ,
e.g.,
.Dq echo -n >/dev/audio
.Pp
The joystick and MIDI port interfaces are not supported.
.Sh SEE ALSO
.Xr audio 4
.Sh AUTHOR
Roland C. Dowdeswell <roland@imrryr.org>
