openbsd/src/share/man/man4/man4.i386/bt.4
.\"
.\" Copyright (c) 1994 James A. Jegers
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 29, 1994
.Dt BT 4 i386
.Os 
.Sh NAME
.Nm bt
.Nd Buslogic SCSI adapter driver
.Sh SYNOPSIS
.Cd "bt0 at isa? port 0x330 irq ? drq ?"
.Cd "scsibus* at bt?"
.Sh DESCRIPTION
The
.Nm bt
driver supports the following Buslogic SCSI adapters:
.Pp
.Bl -tag -width -offset indent -compact
.It Buslogic BT-445		VLB
.It Buslogic BT-74x		EISA
.It Buslogic BT-9[45][68]	PCI
.El
.Pp
The Buslogic BT-930 is not supported.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sd 4 ,
.Xr st 4 ,
.Xr cd 4 ,
.Xr ch 4  
