openbsd/src/share/man/man4/man4.i386/cy.4
.\"	$OpenBSD: cy.4,v 1.3 1998/07/12 09:55:15 downsj Exp $
.\"
.\" Copyright (c) 1993 Andrew Herbert.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name Andrew Herbert may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd 5 October, 1993
.Dt CY 4 i386
.Sh NAME
.Nm cy
.Nd
Cyclades Cyclom-{4, 8, 16}Y asynchronous comms board device driver
.Sh SYNOPSIS
.Cd "cy0 at isa? tty irq 10 iomem 0xdc000 iosiz 8192 vector cyintr"
.Cd "cy1 at pci?"
.Sh DESCRIPTION
This driver provides an interface to Cyclades Cyclom-4Y, Cyclom-8Y and
Cyclom-16Y asynchronous multiport serial boards.  These boards are based
around Cirrus Logic CD1400 communication controllers.
.Pp
The device minor numbers for this driver are encoded as follows:
.Pp
.Bd -literal
    c c x x u u u u	- bits in the minor device number

    bits    meaning
    ----    -------
    uuuu    physical serial line (i.e. unit) to use
		0-7 on a cyclom-8Y, 0-15 on a cyclom-16Y

    xx      unused

    cc      carrier control mode
		00      complete hardware carrier control of the tty.
			DCD must be high for the open(2) to complete.
		01	reserved
		10      carrier ignored until a high->low transition
		11      carrier completed ignored
.Ed
.Sh DIAGNOSTICS
.Bl -diag
.It "cy%d: tty input queue overflow"
Incoming characters have been discarded due to a buffer overflow.  This is
caused by the process in control of the device not read(2)ing characters
fast enough.
.It "cy%d: receive fifo overrun"
Incoming characters have been discarded due to a CD1400 channel overrun.  This
is caused by interrupts not being serviced sufficiently quickly to prevent
the 12 byte receive FIFO on a serial channel from overflowing.  Reducing
the value of the \fIRxFifoThreshold\fR #define from 8 to something smaller may
help slow machines avoid this problem.  The driver must have been compiled
with the \fILogOverruns\fR option defined (the default) in order for this
condition to be logged.
.Sh SEE ALSO
.Xr com 4 ,
.Xr termios 4 ,
.Xr tty 4
.Sh AUTHORS
The driver was written by Andrew Herbert <andrew@werple.apana.org.au>, and
is still under development (from time to time :-).
.Sh HISTORY
Some ideas for the architecture of this driver's two-layer processing model
were derived from the fas 2.10 driver by Uwe Doering
<gemini@geminix.in-berlin.de> and the high-performance com driver by Bruce
Evans <bde@kralizec.zeta.org.au>.
.Pp
This work was made possible through the donation of a Cyclom-8Y board by the
manufacturer, Cyclades Corporation.  However, neither Cyclades nor the author
make any warranties regarding this software, nor guarantees of support.
.Sh BUGS
There is currently no BREAK handling - breaks are ignored.
There is no support for bad-character reporting, except via PARMRK.
The Cyclom-[48]Y boards do not listen to the RTS signal for receiver flow
control.
FIFO overruns are only logged when the termios IGNPAR setting is enabled.
