openbsd/src/share/man/man4/man4.i386/ed.4
.\"	$OpenBSD: ed.4,v 1.4 1998/07/12 09:55:16 downsj Exp $
.\"
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd
.Dt ED 4 i386
.Os
.Sh NAME
.Nm ed
.Nd Ethernet driver for DP8390- and WD83C690-based ethernet boards
.Sh SYNOPSIS
.Cd "ed0 at isa? port 0x280 irq 9 iomem 0xd0000"
.Cd "ed1 at isa? port 0x250 irq 9 iomem 0xd8000"
.Cd "ed2 at isa? port 0x300 irq 10 iomem 0xcc000"
.Cd "ed3 at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
interface provides access to a 10 Mb/s Ethernet network via the
DP8390 and WD83C690 Ethernet chips.  The ethernet cards supported
by the
.Nm
interface are:
.Pp
.Bl -tag -width -offset indent -compact
.It Western Digital 8003 Series
.It Western Digital 8013 Series
.It SMC Elite (80x3) Series
.It SMC Ultra (8216) Series
.It 3Com 3c503
.It Novell NE1000
.It Novell NE2000 and clones
.El
.Sh DIAGNOSTICS
The DP8390 Ethernet chip implements a shared-memory ring-buffer
to store incoming packets.  When this buffer overfills, the 
.Nm
driver produces a message similar to the following:
.Pp
.Bl -tag -width -offset indent -compact
.It ed1: warning - receiver ring buffer overrun
.El
.Pp
The 16bit boards (8013 series) have 16k of memory as well as
fast memory access speed.  Typical memory access speed on these
boards is about 4MB/second.  These boards generally have no
problems keeping up with full ethernet speed and the ring-buffer
seldom overfills.
.Pp
However, the 8bit boards (3c503, and 8003) usually have
only 8k bytes of shared memory.  This is only enough room for about
4 full-size (1500 byte) packets.  This can sometimes be a problem,
especially on the original WD8003E and 3c503, because these
boards' shared-memory access speed is quite slow; typically
only about 1MB/second.  The
overhead of this slow memory access, and the fact that there is
only room for 4 full-sized packets means that the ring-buffer
will occassionally overrun.  When this happens, the board must
be reset to avoid a lockup problem in early revision 8390's.
Resetting the board causes all of the data in the ring-buffer
to be lost, requiring it to be retransmitted/received, congesting
the board further.  Because of this, maximum throughput
on these boards is only about 400-600k per second.
.Pp
This problem is exasperated by NFS because the 8bit boards lack
sufficient memory to support the default 8k byte packets that NFS and
other protocols use as their default.  If these cards must be used
with NFS, use the NFS -r and -w options to limit NFS's packet size.
4096k byte packets generally work.
.Sh SEE ALSO
.Xr ifconfig 8 ,
.Xr intro 4 ,
.Xr eg 4 ,
.Xr el 4 ,
.Xr ep 4 ,
.Xr ie 4 ,
.Xr le 4
