openbsd/src/share/man/man4/man4.i386/elansc.4
.\"	$NetBSD: elansc.4,v 1.1 2002/08/12 03:45:25 thorpej Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 11, 2002
.Dt ELANSC 4
.Os
.Sh NAME
.Nm elansc
.Nd AMD Elan SC520 System Controller driver
.Sh SYNOPSIS
.Cd elansc* at pci? dev ? function ?
.Sh DESCRIPTION
The
.Nm
driver supports the system controller of the AMD Elan SC520 microcontroller.
The SC520 consists of an AMD Am5x86 processor core, integrated PCI host
controller, and several standard on-chip devices, such as NS16550-compatible
UARTs, real-time clock, and timers.
.Pp
The Elan SC520 also provides several special on-chip devices.  The following
are supported by the
.Nm
driver:
.Bl -bullet
.It
Watchdog timer.  The watchdog timer may be configured for a 1
second, 2 second, 4 second, 8 second, 16 second, or 32 second
expiration period.
.El
.Sh SEE ALSO
.Xr sysctl 8
.Sh AUTHORS
The
.Nm
driver was written by
.An Jason R. Thorpe Aq thorpej@netbsd.org .
.An Jasper Wallace
provided the work-around for a hardware bug related to the watchdog timer
in some steppings of the SC520 CPU.
