openbsd/src/share/man/man4/man4.i386/fdc.4
.\"	$OpenBSD: fdc.4,v 1.8 1998/07/12 09:55:19 downsj Exp $
.\"	$NetBSD: fdc.4,v 1.6 1996/03/22 01:55:14 andrew Exp $
.\"
.\" Copyright (c) 1996 Andrew C. Wheadon
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)fdc.4	8.1 (Berkeley) 3/22/96
.\"
.Dd March 25, 1996
.Dt FDC 4 i386
.Os
.Sh NAME
.Nm fdc
.Nd NEC765 compatible floppy disk driver
.Sh SYNOPSIS
.Cd "fdc0 at isa? port 0x3f0 irq 6 drq 2"
.Cd "fd* at fdc? drive ? flags Z"
.Sh DESCRIPTION
The
.Nm fdc
driver supports the standard AT floppy 
disk controllers. These include standard IDE, MFM, RLL,
EIDE, ESDI and SCSI controllers with floppy attachment.
.Pp
The standard names of a a floppy drive will take the form
.Nm /dev/fd{0,1,2,3}{,B,C,D,E,F,G,H}[abcdefghijklmnop] .
.Pp
The first component of this path is the unit number, permitting
a total of 4 floppy drives.
The next component is missing for the default geometry (it
would be A, but it is ommited for simplicity) and B-H for the
other 7 geometry types the floppy driver supports.
The last component of the path is the 16 partitions that a floppy
disk can support.
.Pp
The additional geometry types are as follows:
.Bl -tag -width xxxxxx -compact
.It `B' 1.44MB
.It `C' 1.2MB
.It `D' 360KB/AT (360KB disk in a 1.2 MB drive)
.It `E' 360KB/PC (360KB drive)
.It `F' 720KB
.It `G' 720KB/x (720KB in a 1.2 MB drive)
.It `H' 360KB/x (360KB in a 720KB drive)
.El
.Pp
The default geometry is the format specified in the BIOS, and
is typically the largest supported format.
.Pp
Some floppy controllers do not respond correctly to probes, and
the configuration file
.Cm flags
field can be used to specify a particular drive type, overriding the
probed type.
If the 0x10 bit is on, the low order three bits of the
.Cm flags
field encode the drive type, as follows:
.Bl -tag -width xxxxxx -compact
.It 1 2.88MB
.It 2 1.44MB
.It 3 1.2MB
.It 4 720K
.It 5 360K
.It 6 1.2 MB japanese format
.El
.Pp
If the 0x20 bit is on, the drive will be attached even
if it was not found by the probe routine.
.Sh BUGS
The
.Nm fdc 
driver can interfere with other controllers, namely some WD/SMC
network controllers fail to work when the probing mechanism
in the 
.Nm fdc 
driver probes for a missing second floppy drive.
In this case you should try recompiling the kernel
replacing the relevant line with
.Cd "fd0 at fdc? drive ?".
.Sh SEE ALSO
.Xr intro 4 ,
.Xr dmesg 8 .
