openbsd/src/share/man/man4/man4.i386/glxsb.4
.\"	$OpenBSD: glxsb.4,v 1.1 2006/10/26 08:37:14 tom Exp $
.\"
.\"Copyright (c) 2006 Tom Cosgrove <tom@openbsd.org>
.\"
.\"Permission to use, copy, modify, and distribute this software for any
.\"purpose with or without fee is hereby granted, provided that the above
.\"copyright notice and this permission notice appear in all copies.
.\"
.\"THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\"WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\"MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\"ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\"WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\"ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\"OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.\"
.Dd October 25, 2006
.Dt GLXSB 4 i386
.Os
.Sh NAME
.Nm glxsb
.Nd Geode LX Security Block device
.Sh SYNOPSIS
.Cd "glxsb* at pci?"
.Sh DESCRIPTION
The
.Nm
driver supports the security block of the Geode LX series processors.
.Pp
The Geode LX is a member of the AMD Geode family
of integrated x86 system chips.
.Pp
Driven by periodic checks for available data from the generator,
.Nm
supplies entropy to the
.Xr random 4
driver for common usage.
.Sh SEE ALSO
.Xr random 4
.Sh HISTORY
Support for the
.Nm
was added in
.Ox 4.1 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Tom Cosgrove .
.Sh BUGS
The
.Nm
driver does not yet use the AES acceleration provided by the security block;
it only uses the random number generator.
