openbsd/src/share/man/man4/man4.i386/intro.4
.\"	$OpenBSD: intro.4,v 1.4 1998/10/03 07:24:30 fgsch Exp $
.\"
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd
.Dt INTRO 4 i386
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
This section describes the special files, related driver functions,
and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the i386
(PC-clone) platform.
Software support for these devices comes in two forms.  A hardware
device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.  When the resultant system is booted, the
autoconfiguration facilities in the system probe for the device
and, if found, enable the software support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system must be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr autoconf 4 ,
.Xr config 8 .
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.  Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width speaker -offset indent -compact
.It aha
Adaptec 154x ISA SCSI adapter boards.
.It ahb
Adaptec 1742 EISA SCSI adapter boards.
.It aic
Adaptec AIC-6260, Adaptec AIC-6360, Adaptec 152x, and SoundBlaster SCSI boards.
.It apm
advanced power management device interface.
.It ast
multiplexing serial communications card first made by AST. 
.It bt
Buslogic BT-445, BT-74x, and BT-9xx SCSI boards.
.It com
NS8250-, NS16450-, and NS16550-based asynchronous serial
communications device interface.
.It cy
Cyclades Cyclom-4Y, -8Y, and -16Y asynchronous serial communications
device interface.
.It ec
3Com Etherlink II (3c503) Ethernet interface.
.It eg
3Com 3c505 Ethernet board.
.It el
3Com 3c501 Ethernet board.
.It ep
3Com Etherlink III (3c5x9) Ethernet interface.
.It ie
Ethernet driver for the AT&T StarLAN 10, EN100, StarLan Fiber, and 3Com 3c507.
.It le
Ethernet driver for BICC Isolan, Novell NE2100, and Digital DEPCA cards.
.It lms
Logitech-style bus mouse device interface.
.It lpt
Parallel port device interface.
.It mcd
Mitsumi CD-ROM drives.
.It mem
Main memory interface.
.It mms
Microsoft-style bus mouse device interface.
.It ncr
NCR PCI SCSI adapter boards.
.It ne
Novell NE1000 and 2000 Ethernet interface.
.It npx
Numeric Processing Extension coprocessor and emulator.
.It pms
PS/2 auxiliary port mouse device interface.
.It rtfps
another multiplexing serial communications card.
.It sb
Sound Blaster card.
.It sea
Seagate/Future Domain SCSI cards.  ST01/02, Future Domain TMC-885, and
Future Domain TMC-950.
.It speaker
console speaker device interface.
.It uha
Ultrastor ISA and EISA SCSI adapter cards.  Ultrastore 14f, Ultrastore 34f,
and Ultrastore 24f.
.It wd
Standard ISA Western Digital type hard drives.  MFM, RLL, ESDI, and IDE.
.It we
Western Digital/SMC WD 80x3, SMC Elite Ultra and SMC EtherEZ Ethernet cards.
.It wt
Wangtek and compatible tape drives.  QIC-02 and QIC-36.
.El
.Sh HISTORY
The
.Tn i386
.Nm intro
appeared in
.Nx 0.9a .
