openbsd/src/share/man/man4/man4.i386/intro.4
.\"	$OpenBSD: intro.4,v 1.36 2002/10/01 07:14:14 miod Exp $
.\"
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 16, 1999
.Dt INTRO 4 i386
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files,
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the i386
(PC-clone) platform.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system will have to be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.
Pseudo-devices are not listed.
Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width pcdisplay(4) -compact -offset indent
.It Xr aac 4
Adaptec "FSA" family (Adaptec AAC, Dell PERC, HP NetRaid) RAID controllers.
.It Xr addcom 4
Addonics FlexPort serial boards.
.It Xr adv 4
AdvanSys PCI narrow SCSI Host Adapters.
.It Xr adw 4
AdvanSys PCI wide SCSI Host Adapters.
.It Xr aha 4
Adaptec 154x ISA SCSI adapter boards.
.It Xr ahb 4
Adaptec 1742 EISA SCSI adapter boards.
.It Xr ahc 4
Adaptec 2xxx and 3xxx series PCI/VLB/EISA SCSI adapter boards.
.It Xr aic 4
Adaptec AIC-6260, Adaptec AIC-6360, Adaptec 152x, and SoundBlaster SCSI boards.
.It Xr amdpm 4
AMD768 Power Management.
.It Xr ami 4
American Megatrends Inc.  MegaRAID Controllers.
.It Xr an 4
Aironet Communications 4500/4800 IEEE 802.11DS wireless network adapter.
.It Xr apm 4
Advanced Power Management.
.It Xr aria 4
Sierra Semiconductor Aria 16 sound cards.
.It Xr ast 4
Multiplexing serial communications card first made by AST.
.It Xr aue 4
ADMtek AN986-based USB Ethernet adapters.
.It Xr auich 4
Intel 82801AA/AB/BA and 440MX PCI audio.
.It Xr auvia 4
VIA VT82C686A and VT8233 integrated AC'97 audio device.
.It Xr awi 4
BayStack 650 PCMCIA wireless network adapter.
.It Xr az 4
Aztech/PackardBell FM Radio card.
.It Xr bge 4
Broadcom BCM570x (Tigon3) Gigabit Ethernet boards.
.It Xr bha 4
Buslogic BT-445, BT-74x, and BT-9xx SCSI boards.
.It Xr bktr 4
Brooktree video capture.
.It Xr boca 4
BOCA serial cards.
.It Xr cac 4
Compaq Smart ARRAY RAID controllers.
.It Xr clcs 4
Cirrus Logic CS4280 audio.
.It Xr clct 4
Cirrus Logic CS4281 audio.
.It Xr cmpci 4
C-Media CMI8x38 audio.
.It Xr cnw 4
Xircom CreditCard Netwave wireless network adapter.
.It Xr cue 4
CATC USB-EL1201A based USB Ethernet adapters.
.It Xr cy 4
Cyclades Cyclom-4Y, -8Y, and -16Y asynchronous serial adapters.
.It Xr cz 4
Cyclades Cyclades-Z asynchronous serial adapters.
.It Xr dc 4
DEC tulip clone ethernet cards (Macronix, Lite-On, Davicom, ADMtek).
.It Xr de 4
DEC tulip-based ethernet cards.
.It Xr dpt 4
DPT SmartCache/SmartRAID III and IV SCSI controllers.
.It Xr eap 4
Ensoniq AudioPCI (ES137x) audio.
.It Xr ec 4
3Com Etherlink II Ethernet (3C503).
.It Xr ef 4
3Com Fast Etherlink ISA Ethernet (3C515).
.It Xr eg 4
3Com EtherLink Plus Ethernet (3C505).
.It Xr el 4
3Com EtherLink Ethernet (3C501).
.It Xr em 4
Intel i82542, i82543, and i82544 Pro/1000 Gigabit Ethernet.
.It Xr emu 4
Creative Labs SBLive! and PCI 512 audio.
.It Xr ep 4
3Com Etherlink III Ethernet (3C5x9, 3C59x).
.It Xr esa 4
ESS Alegro 1 and Maestro 3 audio.
.It Xr eso 4
ESS Technology Solo-1 PCI AudioDrive (ES1938/ES1946) audio.
.It Xr ess 4
ESS Technology AudioDrive (ESS 1788, 1888, 1887 and 888) audio.
.It Xr ex 4
Intel EtherExpress PRO/10 ethernet cards.
.It Xr fdc 4
Floppy disk controllers.
.It Xr fea 4
.Tn DEC
DEFEA PCI FDDI controller.
.It Xr fms 4
Forte Media FM801 audio.
.It Xr fpa 4
.Tn DEC
DEFPA PCI FDDI controller.
.It Xr fxp 4
.Tn Intel
EtherExpress PRO/100 Ethernet.
.It Xr gdt 4
ICP-Vortex GDT RAID controllers.
.It Xr gtp 4
Gemtek PCI FM radio adapter.
.It Xr gus 4
Gravis UltraSound and UltraSound/MAX audio.
.It Xr hifn 4
Hifn 7751 crypto accelerator.
.It Xr hsq 4
Hostess multiplexing serial communications boards.
.It Xr ie 4
.At StarLAN 10 ,
EN100, StarLan Fiber, and 3Com 3c507 Ethernet.
.It Xr iha 4
Initio INIC-940 and INIC-950 based SCSI interfaces.
.It Xr iop 4
I2O adapter.
.It Xr ises 4
Securealink PCC-ISES hardware crypto accelerator.
.It Xr isp 4
QLogic PCI SCSI controllers.
.It Xr iy 4
Ether-Express PRO/10.
.It Xr joy 4
Joystick.
.It Xr kue 4
Kawasaki LSI KL5KUSB101B-based USB Ethernet.
.It Xr lc 4
.Tn DEC
EtherWORKS III Ethernet.
.It Xr le 4
BICC Isolan, Novell NE2100, and Digital DEPCA Ethernet.
.It Xr lge 4
Level 1 LXT1001 NetCellerator PCI gigabit ethernet.
.It Xr lmc 4
Lan Media Corporation SS1/DS1/HSSI/DS3 PCI WAN adapters.
.It Xr lms 4
Logitech-style bus mouse.
.It Xr lofn 4
Hifn 6500 crypto accelerator.
.It Xr lpt 4
Parallel port.
.It Xr maestro 4
ESS Maestro 1, 2 and 2E audio.
.It Xr mcd 4
Mitsumi CD-ROM drives.
.It Xr mms 4
Microsoft-style bus mouse.
.It Xr ncr 4
NCR PCI SCSI adapter boards.
.It Xr ne 4
Novell NE1000 and 2000 Ethernet interface.
.It Xr neo 4
NeoMagic 256AV/ZX audio.
.It Xr nge 4
National Semiconductor PCI Gigabit Ethernet.
.It Xr nofn 4
Hifn 7814/7851/7854 HIPP1 crypto processor.
.It Xr npx 4
Numeric Processing Extension coprocessor and emulator.
.It Xr opl 4
Yamaha OPL2 and OPL3 FM synthesizer.
.It Xr pas 4
ProAudio spectrum audio.
.It Xr pccom 4
NS8250-, NS16450-, NS16550-, ST16550-, TI16750- and XR16850-based asynchronous
serial communications.
.It Xr pcdisplay 4
PC display adapter driver for MDA or CGA compatible adapters.
.It Xr pckbc 4
Traditional PC (ISA) keyboard.
.It Xr pctr 4
CPU performance counter registers.
.It Xr pms 4
PS/2 auxiliary port mouse, for generic mice.
.It Xr pmsi 4
PS/2 auxiliary port mouse, for wheel mice.
.It Xr pss 4
Personal Sound System audio.
.It Xr puc 4
PCI ``universal'' communications card driver.
.It Xr ray 4
Raytheon Raylink/WebGear Aviator wireless network adapter.
.It Xr rl 4
RealTek 8129/8139 Ethernet.
.It Xr rt 4
AIMS Lab Radiotrack FM radio adapter.
.It Xr rtfps 4
Another multiplexing serial communications card.
.It Xr sb 4
Sound Blaster card.
.It Xr sea 4
Seagate/Future Domain SCSI cards.
.It Xr sf 4
Adaptec AIC-6915 Starfire PCI Fast Ethernet.
.It Xr sf2r 4
SoundForte RadioLink SF16-FMR2 FM radio adapter.
.It Xr sf4r 4
SoundForte RadioLink SF64-PCR FM radio adapter.
.It Xr sfr 4
SoundForte RadioLink SF16-FMR FM radio adapter.
.It Xr siop 4
LSI/Symbios Logic/NCR 53c8xx SCSI adapter boards.
.It Xr sis 4
SiS 900, Sis 7016 and NS DP83815 Fast Ethernet.
.It Xr sk 4
SysKonnect 984x Gigabit Ethernet (9841/9842/9843/9844).
.It Xr sm 4
SMC91C9x Ethernet.
.It Xr speaker 4
Console speaker.
.It Xr ste 4
Sundance Technologies ST201 Fast Ethernet.
.It Xr stge 4
Sundance/Tamarack TC9021 Gigabit Ethernet.
.It Xr sv 4
S3 SonicVibes cards.
.It Xr tcic 4
Databook PCMCIA controllers.
.It Xr ti 4
Alteon Tigon I & II Gigabit ethernet (3COM 3C985, Netgear GA620, etc).
.It Xr tl 4
Texas Instruments ThunderLAN ethernet.
.It Xr tr 4
IBM TROPIC Token-Ring adapters.
.It Xr trm 4
TRM-S1040 based PCI SCSI Host Adapters.
.It Xr twe 4
3ware Escalade RAID controller.
.It Xr tx 4
SMC 9432 10/100 Mbps Ethernet cards.
.It Xr txp 4
3Com 3XP Typhoon/Sidewinder (3CR990) Ethernet.
.It Xr uaudio 4
USB audio devices.
.It Xr ubsec 4
Broadcom Bluesteelnet uBsec 5501, 5601, 5805, and 5820.
.It Xr udsbr 4
D-Link DSB-R100 USB radio adapter.
.It Xr uftdi 4
FTDI FT8U100AX-based USB serial adapters.
.It Xr uha 4
Ultrastor ISA and EISA SCSI adapter cards.
.It Xr ukbd 4
USB keyboard.
.It Xr ulpt 4
USB printers.
.It Xr umass 4
USB mass storage.
.It Xr umct 4
MCT USB-RS232 serial adapter.
.It Xr umodem 4
USB modems.
.It Xr umidi 4
USB midi devices.
.It Xr ums 4
USB mouse.
.It Xr upl 4
Prolific PL2301/PL2302-based host-to-host USB connectors.
.It Xr uplcom 4
I/O Data USB-RSAQ2 USB serial adapters.
.It Xr urio 4
Diamond Multimedia Rio MP3 device interface.
.It Xr url 4
Realtek RTL8150L USB ethernet adapter.
.It Xr uscanner 4
USB scanners.
.It Xr usscanner 4
SCSI-over-USB scanners.
.It Xr uvisor 4
Handspring Visor device interface.
.It Xr uyap 4
YAP phone firmware interface.
.It Xr vga 4
PC display adapter driver for VGA compatible adapters.
.It Xr vr 4
VIA Rhine Ethernet.
.It Xr wb 4
Winbond W89C840F fast ethernet.
.It Xr wdc 4
Standard ISA Western Digital type hard drive controllers.
MFM, RLL, ESDI, and IDE.
.It Xr wds 4
WD-7000 SCSI host adapters.
.It Xr wdt 4
Industrial Computer Source PCI-WDT50x watchdog timer cards.
.It Xr we 4
Western Digital/SMC WD 80x3, SMC Elite Ultra and SMC EtherEZ Ethernet cards.
.It Xr wi 4
WaveLAN/IEEE and PRISM-II 802.11DS wireless network adapters.
.It Xr wss 4
Windows Sound System audio.
.It Xr wt 4
Wangtek and compatible tape drives.
QIC-02 and QIC-36.
.It Xr xe 4
Xircom PCMCIA Ethernet.
.It Xr xl 4
3COM Etherlink XL and Fast Etherlink XL (3c9xx).
.It Xr yds 4
Yamaha DS-XG audio.
.It Xr ym 4
Yamaha OPL3-SAx audio.
.El
.Sh SEE ALSO
.Xr aac 4 ,
.Xr addcom 4 ,
.Xr adv 4 ,
.Xr adw 4 ,
.Xr aha 4 ,
.Xr ahb 4 ,
.Xr ahc 4 ,
.Xr aic 4 ,
.Xr amdpm 4 ,
.Xr ami 4 ,
.Xr an 4 ,
.Xr apm 4 ,
.Xr aria 4 ,
.Xr ast 4 ,
.Xr aue 4 ,
.Xr auich 4 ,
.Xr autoconf 4 ,
.Xr auvia 4 ,
.Xr awi 4 ,
.Xr az 4 ,
.Xr bge 4 ,
.Xr bha 4 ,
.Xr bktr 4 ,
.Xr boca 4 ,
.Xr cac 4 ,
.Xr clcs 4 ,
.Xr clct 4 ,
.Xr cmpci 4 ,
.Xr cnw 4 ,
.Xr cue 4 ,
.Xr cy 4 ,
.Xr cz 4 ,
.Xr dc 4 ,
.Xr de 4 ,
.Xr dpt 4 ,
.Xr eap 4 ,
.Xr ec 4 ,
.Xr ef 4 ,
.Xr eg 4 ,
.Xr el 4 ,
.Xr em 4 ,
.Xr emu 4 ,
.Xr ep 4 ,
.Xr esa 4 ,
.Xr eso 4 ,
.Xr ess 4 ,
.Xr ex 4 ,
.Xr fdc 4 ,
.Xr fea 4 ,
.Xr fms 4 ,
.Xr fpa 4 ,
.Xr fxp 4 ,
.Xr gdt 4 ,
.Xr gtp 4 ,
.Xr gus 4 ,
.Xr hifn 4 ,
.Xr hsq 4 ,
.Xr ie 4 ,
.Xr iha 4 ,
.Xr intro 4 ,
.Xr iop 4 ,
.Xr ises 4 ,
.Xr isp 4 ,
.Xr iy 4 ,
.Xr joy 4 ,
.Xr kue 4 ,
.Xr lc 4 ,
.Xr le 4 ,
.Xr lge 4 ,
.Xr lmc 4 ,
.Xr lms 4 ,
.Xr lofn 4 ,
.Xr lpt 4 ,
.Xr maestro 4 ,
.Xr mcd 4 ,
.Xr mms 4 ,
.Xr ncr 4 ,
.Xr ne 4 ,
.Xr neo 4 ,
.Xr nge 4 ,
.Xr nofn 4 ,
.Xr npx 4 ,
.Xr opl 4 ,
.Xr pas 4 ,
.Xr pccom 4 ,
.Xr pcdisplay 4 ,
.Xr pckbc 4 ,
.Xr pctr 4 ,
.Xr pms 4 ,
.Xr pmsi 4 ,
.Xr pss 4 ,
.Xr puc 4 ,
.Xr ray 4 ,
.Xr rl 4 ,
.Xr rt 4 ,
.Xr rtfps 4 ,
.Xr sb 4 ,
.Xr sea 4 ,
.Xr sf 4 ,
.Xr sf2r 4 ,
.Xr sf4r 4 ,
.Xr sfr 4 ,
.Xr siop 4 ,
.Xr sis 4 ,
.Xr sk 4 ,
.Xr sm 4 ,
.Xr speaker 4 ,
.Xr stge 4 ,
.Xr sv 4 ,
.Xr tcic 4 ,
.Xr ti 4 ,
.Xr tl 4 ,
.Xr tr 4 ,
.Xr trm 4 ,
.Xr twe 4 ,
.Xr tx 4 ,
.Xr txp 4 ,
.Xr uaudio 4 ,
.Xr ubsec 4 ,
.Xr udsbr 4 ,
.Xr uftdi 4 ,
.Xr uha 4 ,
.Xr ukbd 4 ,
.Xr ulpt 4 ,
.Xr umass 4 ,
.Xr umct 4 ,
.Xr umodem 4 ,
.Xr umidi 4 ,
.Xr ums 4 ,
.Xr upl 4 ,
.Xr uplcom 4 ,
.Xr urio 4 ,
.Xr url 4 ,
.Xr uscanner 4 ,
.Xr usscanner 4 ,
.Xr uvisor 4 ,
.Xr uyap 4 ,
.Xr vga 4 ,
.Xr vr 4 ,
.Xr wb 4 ,
.Xr wdc 4 ,
.Xr wds 4 ,
.Xr wdt 4 ,
.Xr we 4 ,
.Xr wi 4 ,
.Xr wss 4 ,
.Xr wt 4 ,
.Xr xe 4 ,
.Xr xl 4 ,
.Xr yds 4 ,
.Xr ym 4 ,
.Xr config 8
.Sh HISTORY
The
i386
.Nm intro
first appeared in
.Nx 1.0 .
