openbsd/src/share/man/man4/man4.i386/ioapic.4
.\"   $OpenBSD: ioapic.4,v 1.2 2007/02/27 21:15:09 david Exp $
.\"
.\" Copyright (c) 2006 Mark Kettenis
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd October 27, 2006
.Dt IOAPIC 4 i386
.Os
.Sh NAME
.Nm ioapic
.Nd I/O Advanced Programmable Interrupt Controller
.Sh SYNOPSIS
.Cd "ioapic0 at mainbus0"
.Sh DESCRIPTION
.Nm
is an I/O Advanced Programmable Interrupt Controller (APIC).
It provides interrupt management for systems with multiple I/O
subsystems and can distribute interrupts across multiple processors.
.Sh SEE ALSO
.Xr intro 4
.Sh STANDARDS
.Nm
is based on
Intel's 82093AA I/O Advanced Programmable Interrupt Controller (I/O APIC)
specification.
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.5 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Bill Sommerfield .
