openbsd/src/share/man/man4/man4.i386/joy.4
.\"
.\" Copyright (c) 1996 Matthieu Herrb
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"     $Id: joy.4,v 1.1 1996/01/16 08:24:49 deraadt Exp $
.\"
.Dd January 7, 1996
.Dt JOY 4 i386
.Os "NetBSD 1.1A"
.Sh NAME
.Nm joy
.Nd
Games adapter driver
.Sh SYNOPSIS
.Cd "joy0 at isa? port 0x201"
.Sh DESCRIPTION
This driver provides access to the games adapter. The lower bit in the
minor device number selects the joystick: 0 is the first joystick and
1 is the second.
.Pp
The game control adapter allows up to two joysticks to be attached to
the system. The adapter plus the driver convert the present resistive
value to a relative joystick position. On receipt of an output signal,
four timing circuits are started. By determining the time required for
the circuit to time-out (a function of the resistance), the paddle
position can be determined. The adapter could be used as a general
purpose I/O card with four analog (resistive) inputs plus four digital
input points. 
.Pp
Applications may call ioctl() on a game adapter driver file descriptor
to set and get the offets of the two potentiometers and the maximum
time-out value for the circuit. The
ioctl() commands are listed in
.Pa Aq machine/joystick.h
and currently are:
.Pp
.Bl -tag -width JOY_GET_X_OFFSET -compact
.It JOY_SETTIMEOUT
Sets the maximum time-out for the adapater.
.It JOY_GETTIMEOUT
Returns the current maximun time-out.
.It JOY_SET_X_OFFSET
Sets an offset on X value.
.It JOY_GET_X_OFFSET
Returns the current X offset.
.It JOY_SET_Y_OFFSET
Sets an offset on Y value.
.It JOY_GET_Y_OFFSET
Returns the current Y offset.
.El
.Pp
All this commands take an integer parameter.
.Pp
Read() on the file descriptor returns a 
.Fa joystick 
structure:
.Bd -literal -offset indent
struct joystick {
	int x;
	int y;
	int b1;
	int b2;
};
.Ed
.Pp
The fields have the following functions:
.Bl -tag -width b1
.It Fa x
The current X coordinate of the joystick (or position of paddle 1)
.It Fa y
The current Y coordinate of the joystick (or position of paddle 2)
.It Fa b1
The current state of button 1
.It Fa b2
The current state of button 2
.El
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/joy0
first joystick
.br
.It Pa /dev/joy1
second joystick
.El
.Sh AUTHORS
.Pp
Jean-Marc Zucconi wrote the FreeBSD driver. Matthieu Herrb ported it
to NetBSD and wrote this manual page.

