openbsd/src/share/man/man4/man4.i386/le.4
.\"	$OpenBSD: le.4,v 1.2 1998/07/12 09:44:51 downsj Exp $
.\"
.\" Copyright (c) 1994 James A. Jegers
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 12, 1998
.Dt LE 4 i386
.Os
.Sh NAME
.Nm le 
.Nd Ethernet driver for Lance based Ethernet boards
.Sh SYNOPSIS
.Cd "le0 at isa? port 0x320 irq 10 drq 7"
.Cd "le* at isapnp?"
.Sh DESCRIPTION
The
.Nm
interface provides access to a 10 Mb/s Ethernet network via the
Lance Ethernet chips.  The Ethernet cards supported by the
.Nm
interface are:
.Pp
.Bl -tag -width -offset indet -compact
.It BICC Isolan 
.It Novell NE2100
.It Digital DEPCA
.El
.Sh SEE ALSO
.Xr ifconfig 8 ,
.Xr intro 4 ,
.Xr ed 4 ,
.Xr eg 4 ,
.Xr ep 4 ,
.Xr ie 4
