openbsd/src/share/man/man4/man4.i386/lpt.4
.\"	$OpenBSD: lpt.4,v 1.7 2001/06/23 07:04:14 pjanzen Exp $
.\"
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 6, 1993
.Dt LPT 4 i386
.Os
.Sh NAME
.Nm lpt
.Nd
parallel port driver
.Sh SYNOPSIS
.\" XXX this is awful hackery to get it to work right... -- cgd
.Cd "lpt0 at isa? port" \&"IO_LPT1\&" irq 7
.Cd "lpt1 at isa? port" \&"IO_LPT2\&"
.Sh DESCRIPTION
This driver provides access to parallel ports.
.Pp
The highest bit in the minor (bit 7, or add 128) number selects
whether to do polling or wait for interrupts.
If no IRQ is specified in the kernel configuration, or the IRQ specified is
not available at attach time, only the polling device may be used.
.Pp
The next lower bit (bit 6, or add 64) indicates the driver should
avoid initializing the printer.
.P.
The next lower bit (bit 5, or add 32) requests that the driver do
automatic LF generation when printing CRs.
.Sh FILES
.Bl -tag -width /dev/lpt0 -compact
.It Pa /dev/lpt0
first interrupt-driven parallel port device
.It Pa /dev/lpa0
first polled parallel port device
.El
.Sh SEE ALSO
.Xr ulpt 4
