openbsd/src/share/man/man4/man4.i386/mms.4
.\"	$OpenBSD: mms.4,v 1.9 2007/05/31 19:19:55 jmc Exp $
.\" $NetBSD: mms.4,v 1.13 2000/07/05 16:13:49 msaitoh Exp $
.\"
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"          This product includes software developed for the
.\"          NetBSD Project.  See http://www.netbsd.org/ for
.\"          information about NetBSD.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" <<Id: LICENSE,v 1.2 2000/06/14 15:57:33 cgd Exp>>
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt MMS 4 i386
.Os
.Sh NAME
.Nm mms
.Nd Microsoft-style bus mouse driver
.Sh SYNOPSIS
.Cd "mms0 at isa? port 0x23c irq 5"
.Cd "mms1 at isa? port 0x238 irq 5"
.Cd "wsmouse* at mms? mux 0"
.Sh DESCRIPTION
This driver provides an interface to a Microsoft-style bus mouse.
Mouse related data are accessed by
.Xr wsmouse 4
devices.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr isa 4 ,
.Xr lms 4 ,
.Xr pms 4 ,
.Xr pmsi 4 ,
.Xr ums 4 ,
.Xr wsmouse 4
