openbsd/src/share/man/man4/man4.i386/nvram.4
.\"	$OpenBSD: nvram.4,v 1.1 2004/10/03 21:28:34 jcs Exp $
.\"
.\" Copyright 2004 Joshua Stein <jcs@openbsd.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 3, 2004
.Dt NVRAM 4 i386
.Os
.Sh NAME
.Nm nvram
.Nd driver for reading PC NVRAM contents
.Sh SYNOPSIS
.Cd "pseudo-device nvram 1"
.Sh DESCRIPTION
The
.Nm
device provides read-only access to the non-volatile memory contained in the
MC146818 real-time clock.
.Pp
This data is provided as a seekable character device,
.Pa /dev/nvram .
Checksums of the NVRAM contents are calculated over bytes 2 to 31 and stored
in byte 32.
A valid checksum is required for the driver to initialize.
.Pp
Only one process may have this device open at any given time;
.Xr open 2
and
.Xr close 2
are used to lock and relinquish it.
An attempt to
.Fn open
when another process has the device locked will return \-1 with an
.Er EBUSY
error indication.
.Sh FILES
.Bl -tag -width /dev/nvram
.It Pa /dev/nvram
.El
.Sh HISTORY
.Nm
support was originally included in
.Ox 3.7 .
