openbsd/src/share/man/man4/man4.i386/pccom.4
.\"	$OpenBSD: pccom.4,v 1.1 1997/05/28 21:44:52 deraadt Exp $
.\"	$OpenBSD: pccom.4,v 1.1 1997/05/28 21:44:52 deraadt Exp $
.\"	$NetBSD: com.4,v 1.5 1996/03/16 00:07:08 thorpej Exp $
.\"
.\" Copyright (c) 1990, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
.\" Science Department.
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)dca.4	5.2 (Berkeley) 3/27/91
.\"
.Dd May 20, 1997
.Dt PCCOM 4 i386
.Os
.Sh NAME
.Nm pccom
.Nd
enhanced serial communications interface
.Sh SYNOPSIS
.Cd "pccom0 at isa? port" 0x3f8 irq 4
.Cd "pccom1 at isa? port" 0x2f8 irq 3
.Cd "pccom2 at isa? port" 0x3e8 irq 5
.Cd "pccom3 at isa? port" 0x2e8 irq 9
.Sh DESCRIPTION
The
.Nm
driver provides support for NS8250-, NS16450-, and NS16550 compatible
.Tn EIA
.Tn RS-232C
.Pf ( Tn CCITT
.Tn V.28 )
communications interfaces.  The NS8250 and NS16450 have single character
buffers, and the NS16550 has a 16 character buffer.
.Pp
The
.Nm
driver is an enhanced version of the standard
.Xr isa/com 4
driver, and implements a large software buffer at the driver level
to back up the small hardware buffers implemented by the standard serial
interface devices.
This can provide a substantial reduction in the number of "silo overflow"
errors when using higher speed modems.  The
.Nm
driver also includes some support for
.Tn PCMCIA
serial interfaces, multi-port serial cards and serial consoles.
.Pp
Input and output for each line may set to one of following baud rates;
50, 75, 110, 134.5, 150, 300, 600, 1200, 1800, 2400, 4800, 9600,
19200, 38400, 57600, or 115200, or any other baud rate which is a factor
of 115200.
.Sh FILES
.Bl -tag -width Pa
.It Pa /dev/tty00
.It Pa /dev/tty01
.It Pa /dev/tty02
.It Pa /dev/tty03
.El
.Sh DIAGNOSTICS
.Bl -diag
.It pccom%d: %d silo overflows
The input
.Dq silo
has overflowed and incoming data has been lost.
.It pccom%d: weird interrupt: iir=%x
The device has generated an unexpected interrupt with the code listed.
.El
.Sh SEE ALSO
.Xr ast 4 ,
.Xr rtfps 4 ,
.Xr isa/com 4 ,
.Xr tty 4
.Sh HISTORY
The
.Nm
driver was derived from the original
.Xr isa/com 4
driver by Onno van der Linden.  That driver was
derived from the
.Nm HP9000/300
.Nm dca
driver.
.Sh NOTES
The interrupt assignments above for pccom3 and pccom4 often conflict the
defaults used for other devices such as network cards.  If you plan to
use these devices you must review your system configuration and the
interrupt options available to select non-conflicting inteterrupt assignments.
.Sh BUGS
Data loss is possible on busy systems with unbuffered UARTs at high speed.
.Pp
The name of this driver is a holdover from
.Nm DOS .
