openbsd/src/share/man/man4/man4.i386/sb.4
.\" Copyright (c) 1995 John T. Kohl
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR `AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"	
.\"	$Id: sb.4,v 1.1 1995/11/13 04:41:16 deraadt Exp $
.\"
.Dd November 4, 1995
.Dt SB 4 i386
.Os 
.Sh NAME
.Nm sb
.Nd
SoundBlaster family (and compatibles) audio device driver
.Sh SYNOPSIS
.Cd "sb0 at isa? port 0xPPP irq X drq Y"
.Sh DESCRIPTION
The
.Nm sb
driver provides support for the SoundBlaster, SoundBlaster Pro,
SoundBlaster 16, and hardware register-level compatible audio cards.
.Pp
The SoundBlaster series are half-duplex cards, capable of 8- and 16-bit
audio sample recording and playback at rates up to 44.1kHz (depending on
the particular model).
.Pp
The base I/O port address is usually jumper-selected to either 0x220 or
0x240 (newer cards may provide software configuration, but this driver
does not directly support them--you must configure the card for its I/O
addresses with other software).  The SoundBlaster takes 16 I/O ports.
For the SoundBlaster and SoundBlaster Pro, the IRQ and DRQ channels are
jumper-selected.  For the SoundBlaster 16, the IRQ and DRQ channels are
set by this driver to the values specified in the config file.  The IRQ
must be selected from the set {5,7,9,10}.
.Pp
.Sh BUGS
The driver has not been extensively tested on original SoundBlaster,
SoundBlaster 16, or newer cards.
.Pp
The FM synthesizer, joystick and MIDI port interfaces are not supported.
.Sh SEE ALSO
.Xr audio 4
