openbsd/src/share/man/man4/man4.i386/wdc.4
.\"	$OpenBSD: wdc.4,v 1.2 1998/07/12 09:55:35 downsj Exp $
.\"
.\" Copyright (c) 1994 James A. Jegers
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 12, 1998
.Dt WDC 4 i386
.Os 
.Sh NAME
.Nm wdc
.Nd WD100x compatible hard disk driver
.Sh SYNOPSIS
.Cd "wdc0 at isa? port 0x1f0 irq 14"
.Cd "wdc0 at isa? port 0x170 irq 15"
.Cd "wdc* at isapnp?"
.Cd "wd* at wdc? drive ?"
.Sh DESCRIPTION
The
.Nm wdc
driver supports hard disk controllers which emulate the Western
Digital WD100x.  This includes standard MFM, RLL, ESDI and IDE
controllers.
.\" .Pp
.\" Support for extended EIDE controllers is
.\" .Ud .
.Sh BUGS
A PnP device that actually works with this driver has yet to be found; the
Soundblaster IDE port does not.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr acd 4
