openbsd/src/usr.sbin/vmd/vm.conf.5
.\" $OpenBSD: vm.conf.5,v 1.29 2018/06/18 06:04:25 jmc Exp $
.\"
.\" Copyright (c) 2015 Mike Larkin <mlarkin@openbsd.org>
.\" Copyright (c) 2015 Reyk Floeter <reyk@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 18 2018 $
.Dt VM.CONF 5
.Os
.Sh NAME
.Nm vm.conf
.Nd virtual machine configuration
.Sh DESCRIPTION
.Nm
is the configuration file to configure the virtual machine monitor
(VMM) subsystem.
A VMM manages virtual machines (VMs) on a
.Ar host .
The VMM subsystem is responsible for creating, destroying, and
executing VMs.
.Pp
.Nm
is divided into the following main sections:
.Bl -tag -width xxxx
.It Sy Macros
User-defined variables may be defined and used later, simplifying the
configuration file.
.It Sy Global Configuration
Global settings for
.Xr vmd 8 .
.It Sy VM Configuration
Configuration for each individual virtual machine.
.It Sy Switch Configuration
Configuration for virtual switches.
.El
.Pp
Within the sections,
the
.Ar bytes
argument can be specified with a human-readable scale,
using the format described in
.Xr scan_scaled 3 .
.Pp
The current line can be extended over multiple lines using a backslash
.Pq Sq \e .
Comments can be put anywhere in the file using a hash mark
.Pq Sq # ,
and extend to the end of the current line.
Care should be taken when commenting out multi-line text:
the comment is effective until the end of the entire block.
.Pp
Argument names not beginning with a letter, digit, underscore, or slash
must be quoted.
.Pp
Additional configuration files can be included with the
.Ic include
keyword, for example:
.Bd -literal -offset indent
include "/etc/vm1.example.com.conf"
.Ed
.Sh MACROS
Macros can be defined that will later be expanded in context.
Macro names must start with a letter, digit, or underscore,
and may contain any of those characters.
Macro names may not be reserved words (for example,
.Ic vm ,
.Ic memory ,
or
.Ic disk ) .
Macros are not expanded inside quotes.
.Pp
For example:
.Bd -literal -offset indent
ramdisk="/bsd.rd"
vm "vm1.example.com" {
	memory 512M
	boot $ramdisk
}
.Ed
.Sh GLOBAL CONFIGURATION
The following setting can be configured globally:
.Bl -tag -width Ds
.It Ic local prefix Ar address Ns Li / Ns Ar prefix
Set the network prefix that is used to allocate subnets for
local interfaces, see
.Ic local interface
in the
.Sx VM CONFIGURATION
section below.
The default is
.Ar 100.64.0.0/10 .
.El
.Sh VM CONFIGURATION
Each
.Ic vm
section starts with a declaration of the virtual machine
.Ar name :
.Bl -tag -width Ds
.It Ic vm Ar name Brq ...
The name can be any alphanumeric string along with '.', '-', and '_' characters.
However, it cannot start with '.', '-', or '_'.
Typically the name is a hostname.
.El
.Pp
Followed by a block of parameters that is enclosed in curly brackets:
.Bl -tag -width Ds
.It Cm boot Ar path
Kernel or BIOS image to load when booting the VM.
If not specified, the default is to boot using the BIOS image in
.Pa /etc/firmware/vmm-bios .
.It Cm cdrom Ar path
ISO image file.
.It Cm enable
Automatically start the VM.
This is the default if neither
.Cm enable
nor
.Cm disable
is specified.
.It Cm disable
Do not start this VM.
.It Cm disk Ar path
Disk image file (may be specified multiple times to add multiple disk images).
.It Oo Cm local Oc Cm interface Oo name Oc Op Brq ...
Network interface to add to the VM.
The optional
.Ar name
can be either
.Sq tap
to select the next available
.Xr tap 4
interface on the VM host side (the default) or
.Ar tapN
to select a specific one.
.Pp
Valid options are:
.Bl -tag -width Ds
.It Cm group Ar group-name
Assign the interface to a specific interface
.Dq group .
For example, this can be used to write
.Xr pf.conf 5
rules for several VM interfaces in the same group.
The
.Ar group-name
must not end with a digit.
.It Oo Cm locked Oc Cm lladdr Op Ar etheraddr
Change the link layer address (MAC address) of the interface on the
VM guest side.
If not specified, a randomized address will be assigned by
.Xr vmd 8 .
If the
.Cm locked
keyword is specified,
.Xr vmd 8
will drop packets from the VM with altered source addresses.
.It Cm rdomain Ar rdomainid
Attach the interface to the routing domain with the specified
.Ar rdomainid .
If attaching to a switch that also has an
.Ar rdomainid
set, the
.Ar rdomainid
configured for the interface takes precedence.
.It Cm switch Ar name
Set the virtual switch
by
.Ar name .
See the
.Sx SWITCH CONFIGURATION
section about virtual switches.
This option is ignored if a switch with a matching name cannot be found.
.It Cm up
Start the interface forwarding packets.
This is the default.
.It Cm down
Stop the interface from forwarding packets.
.El
.Pp
A
.Cm local
interface will auto-generate an IPv4 subnet for the interface,
configure a gateway address on the VM host side,
and run a simple DHCP/BOOTP server for the VM.
This option can be used for layer 3 mode without configuring a switch.
.It Cm interfaces Ar count
Optional minimum number of network interfaces to add to the VM.
If the
.Ar count
is greater than the number of
.Ic interface
statements, additional default interfaces will be added.
.It Cm memory Ar bytes
Memory size of the VM, in bytes, rounded to megabytes.
The default is 512M.
.It Cm owner Ar user Ns Op : Ns Ar group
Set the owner of the VM to the specified user or group.
The owner will be allowed to start or stop the VM, pause or unpause the VM,
and open the VM's console.
.It Cm owner Pf : Ar group
Set the owner to the specified group.
.El
.Sh SWITCH CONFIGURATION
A virtual switch allows VMs to communicate with other network interfaces on the
host system via either
.Xr bridge 4
or
.Xr switch 4 .
The network interface for each virtual switch defined in
.Nm
is pre-configured using
.Xr hostname.if 5
or
.Xr ifconfig 8
(see the
.Sx BRIDGE
and
.Sx SWITCH
sections in
.Xr ifconfig 8
accordingly).
When a VM is started, virtual network interfaces which are assigned to a
virtual switch have their
.Xr tap 4
interface automatically added into the corresponding
.Xr bridge 4
or
.Xr switch 4
interface underlying the virtual switch.
.Pp
Virtual switches can be configured at any point in the configuration file.
Each
.Ic switch
section starts with a declaration of the virtual switch:
.Bl -tag -width Ds
.It Ic switch Ar name Brq ...
This name can be any string, and is typically a network name.
.El
.Pp
Followed by a block of parameters that is enclosed in curly brackets:
.Bl -tag -width Ds
.It Cm enable
Automatically configure the switch.
This is the default if neither
.Cm enable
nor
.Cm disable
is specified.
.It Cm locked lladdr
If this option is specified,
.Xr vmd 8
will drop packets with altered sources addresses that do not match the
link layer addresses (MAC addresses) of the VM interfaces in this switch.
.It Cm disable
Do not configure this switch.
.It Cm group Ar group-name
Assign each interface to a specific interface
.Dq group .
For example, this can be used to write
.Xr pf.conf 5
rules for several VM interfaces in the same group.
The
.Ar group-name
must not end with a digit.
.It Cm interface Ar name
Set the
.Xr switch 4
or
.Xr bridge 4
network interface of this switch.
If the type is changed to
.Ar switch0 ,
it will be used for each following switch.
.It Cm rdomain Ar rdomainid
Set the routing domain of the switch and all of its VM interfaces to
.Ar rdomainid .
.It Cm up
Start the switch forwarding packets.
This is the default.
.It Cm down
Stop the switch from forwarding packets.
.El
.Sh EXAMPLES
Create a new VM with 1GB memory, 1 network interface connected to
.Dq uplink ,
with one disk image
.Sq /home/joe/vm2-disk.img ,
owned by user
.Sq joe :
.Bd -literal -offset indent
vm "vm2.example.com" {
	memory 1G
	disk "/home/joe/vm2-disk.img"
	interface { switch "uplink" }
	owner joe
}
.Ed
.Pp
Create the switch "uplink" with an additional physical network interface:
.Bd -literal -offset indent
switch "uplink" {
	interface bridge0
}
.Ed
.Sh SEE ALSO
.Xr vmm 4 ,
.Xr vmctl 8 ,
.Xr vmd 8
.Sh HISTORY
The
.Nm
file format first appeared in
.Ox 5.9 .
.Sh AUTHORS
.An -nosplit
.An Mike Larkin Aq Mt mlarkin@openbsd.org
and
.An Reyk Floeter Aq Mt reyk@openbsd.org .
