openbsd/src/share/man/man8/man8.sparc/boot_sparc.8
.\"	$OpenBSD: boot_sparc.8,v 1.3 2001/10/04 23:36:41 miod Exp $
.\"	$NetBSD: boot_sparc.8,v 1.4 1995/04/25 11:37:25 pk Exp $
.\"
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)boot_sparc.8	8.2 (Berkeley) 4/19/94
.\"
.Dd April 19, 1994
.Dt BOOT_SPARC 8 sparc
.Os
.Sh NAME
.Nm boot
.Nd
.Tn sparc-specific
system bootstrapping procedures
.Sh DESCRIPTION
.Ss Power fail and crash recovery
Normally, the system will reboot itself at power-up or after crashes.
An automatic consistency check of the file systems will be performed
(as described in
.Xr fsck 8 ) ,
and unless this fails, the system will resume multi-user operations.
.Ss Cold starts
System boot blocks are installed near the start of the boot disk
using the procedure described in
.Xr installboot 8 .
The boot program attempts to load
.Pa bsd
from partition
.Dq a
of the boot device,
which must currently be an
.Dq sd
disk.
.Pp
The
.Fl s
flag to the bootloader will bring the system up in single-user mode.
The
.Fl a
flag instructs the system to prompt for the location of the root filesystem
and the primary swap partition.
Other flags are currently ignored.
.Pp
The SPARC boot ROM comes in two flavours: an
.Dq old-style
ROM is used in
sun4 machines, while a
.Dq new-style
ROM can be found on sun4c and sun4m models.
The
.Dq new-style
SPARC boot ROM is a full-featured Forth system with emacs
key bindings.
It can be put in
.Dq old-style
user-interface compatibility
mode (in which case it shows a simple
.Dq \&>
prompt), but this is essentially
useless.
However, by default the ROM runs in old-mode; to enter new-mode type
.Dq n .
The ROM then shows a Forth-style
.Dq ok
prompt.
It is recommended to have the ROM always start in its native
.Dq new-style
mode.
Utter the following
incantation in new-mode to force the ROM to always start in new-mode:
.Pp
.Em \	ok
setenv sunmon-compat? false
.Pp
The ROM will normally load the kernel from
.Dq sd(0,0,0)vmunix ,
except on the sun4 machines, where it will look for
.Dq sd(0,0,0)bsd .
The OpenBSD bootloader will look for a kernel named
.Dq bsd
by default, unless (on sun4c or sun4m only) the
.Dq boot-file
environment variable is set.
To reset this variable to its default, empty, value, type the following:
.Pp
.Em \	ok
set-default boot-file
.Pp
If the
.Xr sysctl 8
variable
.Ev ddb.console
is enabled, at any time you can break back to the ROM by pressing the
.Dq L1
and
.Dq a
keys at the same time (if the console is a serial port the same is
achieved by sending a
.Dq break ) .
If you do this accidentally you can continue whatever was in progress
by typing
.Dq go .
.Sh FILES
.Bl -tag -width /bsdxx -compact
.It Pa /bsd
system code
.It Pa /boot
system bootstrap
.El
.Sh SEE ALSO
.Xr crash 8 ,
.Xr disklabel 8 ,
.Xr fsck 8 ,
.Xr halt 8 ,
.Xr init 8 ,
.Xr installboot 8 ,
.Xr rc 8 ,
.Xr shutdown 8 ,
.Xr syslogd 8
