openbsd/src/share/man/man8/man8.mvme88k/MAKEDEV.8
.\" $OpenBSD: MAKEDEV.8,v 1.2 2004/02/16 19:05:06 miod Exp $
.\"
.\" THIS FILE AUTOMATICALLY GENERATED.  DO NOT EDIT.
.\" generated from:
.\"
.\"	OpenBSD: etc.mvme88k/MAKEDEV.md,v 1.13 2004/02/16 19:01:02 miod Exp 
.\"	OpenBSD: MAKEDEV.common,v 1.1 2004/02/16 18:58:54 miod Exp 
.\"	OpenBSD: MAKEDEV.man,v 1.1 2004/02/16 19:03:30 miod Exp 
.\"	OpenBSD: MAKEDEV.mansub,v 1.1 2004/02/16 19:03:30 miod Exp 
.\"
.\" Copyright (c) 2004, Miodrag Vallat
.\" Copyright (c) 2001-2004 Todd T. Fries <todd@OpenBSD.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd February 16, 2004
.Dt MAKEDEV 8 mvme88k
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Op Ar ...
.Sh DESCRIPTION
The shell script
.Nm ,
found in the
.Pa /dev
directory, is used to create various special files.
See
.Xr intro 4
for a more complete discussion of special files.
.Pp
.Nm
takes any number of device names as arguments, where the names are
the common abbreviation for the device or group of devices.
.Pp
Where a device name is followed by a star
.Sq * ,
the star must be replaced by a unit number.
If units are expected for a device but not provided,
.Nm
will supply the standard numbers in most cases.
.Pp
The mvme88k supports the following devices:
.Pp
.Pp
.Sy Special device names
.Bl -tag -width tenletters -compact
.It Ar all
Creates special files for all devices on mvme88k.
.It Ar ramdisk
Ramdisk kernel devices.
.It Ar std
Creates the
.Sq standard
devices (console, drum, klog, kmem, ksyms, mem, null,
stderr, stdin, stdout, tty, zero)
which are absolutely necessary for the system to function properly.
.It Ar local
Creates configuration-specific devices.
.El
.Pp
.Sy Disks
.Bl -tag -width tenletters -compact
.It Ar ccd*
Concatenated disk devices.
.It Ar cd*
SCSI cdrom drives.
.It Ar rd*
.Dq rd
pseudo-disks.
.It Ar sd*
SCSI disks.
.It Ar vnd*
.Dq file
pseudo-disk devices.
.El
.Pp
.Sy Tapes
.Bl -tag -width tenletters -compact
.It Ar ch*
SCSI media changers.
.It Ar st*
SCSI tape drives.
.El
.Pp
.Sy Terminal ports
.Bl -tag -width tenletters -compact
.It Ar tty0*
MVME1x7 CL-CD2400 serial ports.
.It Ar ttya-b
MVME188 serial ports.
.It Ar ttyv*
MVME332XT serial ports.
.El
.Pp
.Sy Pseudo terminals
.Bl -tag -width tenletters -compact
.It Ar ptm
pty master device.
.It Ar pty*
Set of 16 master pseudo terminals.
.It Ar tty*
Set of 16 slave pseudo terminals.
.El
.Pp
.Sy Special purpose devices
.Bl -tag -width tenletters -compact
.It Ar bpf*
Berkeley Packet Filter.
.It Ar fd
fd/* nodes for fdescfs.
.It Ar lkm
Loadable kernel modules interface.
.It Ar nvram0
On-board non-volatile memory.
.It Ar pf*
Packet Filter.
.It Ar *random
In-kernel random data source.
.It Ar sram0
On-board static memory.
.It Ar ss*
SCSI scanners.
.It Ar systrace*
System call tracing device.
.It Ar tun*
Network tunnel driver.
.It Ar vmel0
VMEbus D32 space.
.It Ar vmes0
VMEbus D16 space.
.It Ar uk*
SCSI unknown devices.
.It Ar xfs*
XFS filesystem node.
.Sh FILES
.Bl -tag -width /dev -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
