openbsd/src/usr.sbin/hoststatectl/hoststatectl.8
.\" $OpenBSD: hoststatectl.8,v 1.4 2006/12/18 19:48:04 jmc Exp $
.\"
.\" Copyright (c) 2006 Pierre-Yves Ritschard <pyr@spootnik.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd November 1, 2006
.Dt HOSTATECTL 8
.Os
.Sh NAME
.Nm hostatectl
.Nd control the host status daemon
.Sh SYNOPSIS
.Nm
.Ar command
.Op Ar arguments ...
.Sh DESCRIPTION
The
.Nm
program controls the
.Xr hostated 8
daemon.
.Pp
The following commands are available:
.Bl -tag -width Ds
.It Cm show Op Cm summary
Show status of services, tables, and hosts.
The keyword
.Cm summary
is optional.
.It Cm service disable Op Ar name | id
Disable a service.
If it has
.Xr pf 4
redirection rules installed, remove them.
Mark the service's main table and \(en
if applicable \(en backup table disabled as well.
.It Cm service enable Op Ar name | id
Enable a service.
Mark the service's main table and \(en if applicable \(en backup
table enabled as well.
.It Cm table disable Op Ar name | id
Disable a table.
Consider all hosts disabled.
If it is a main table of a service which has a non-empty backup table,
swap the contents of the
.Xr pf 4
table with those of the backup table.
.It Cm table enable Op Ar name | id
Enable a table.
Start doing checks for all hosts that aren't individually disabled
again.
.It Cm host disable Op Ar name | id
Disable a host.
Treat it as though it were always down.
.It Cm host enable Op Ar name | id
Enable the host.
Start checking its health again.
.El
.Sh FILES
.Bl -tag -width "/var/run/hostated.sockXX" -compact
.It /var/run/hostated.sock
Unix-domain socket used for communication with
.Xr hostated 8 .
.El
.Sh SEE ALSO
.Xr hostated 8
