openbsd/src/libexec/login_reject/login_reject.8
.\" $OpenBSD: login_reject.8,v 1.6 2007/05/31 19:19:40 jmc Exp $
.\"
.\" Copyright (c) 1995 Berkeley Software Design, Inc. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Berkeley Software Design,
.\"	Inc.
.\" 4. The name of Berkeley Software Design, Inc.  may not be used to endorse
.\"    or promote products derived from this software without specific prior
.\"    written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY BERKELEY SOFTWARE DESIGN, INC. ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL BERKELEY SOFTWARE DESIGN, INC. BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	BSDI	$From: login_reject.8,v 1.2 1996/08/01 21:02:26 prb Exp $
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt LOGIN_REJECT 8
.Os
.Sh NAME
.Nm login_reject
.Nd provide rejected authentication
.Sh SYNOPSIS
.Nm login_reject
.Op Fl s Ar service
.Ar user
.Op Ar class
.Sh DESCRIPTION
The
.Nm
utility provides the rejection authentication class.
The
.Ar user
name, while required, is ignored.
The
.Ar class
name, which is optional, is also ignored.
The
.Nm reject
authentication mechanism is intended to be used to disallow certain
types of logins.
For example, a class entry (see
.Xr login.conf 5 )
may contain:
.Bd -literal -offset indent
:auth=krb-or-pwd,kerberos,passwd:
:auth-ftp=reject:
.Ed
.Pp
which would allow authentication for this class in most situations
but would reject attempts to authenticate from
.Xr ftpd 8 .
.Sh SEE ALSO
.Xr login 1 ,
.Xr login.conf 5 ,
.Xr ftpd 8
