openbsd/src/share/man/man4/man4.sun3/cgfour.4
.\"	$OpenBSD: cgfour.4,v 1.6 2002/06/30 21:45:25 deraadt Exp $
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This software was developed by the Computer Systems Engineering group
.\" at Lawrence Berkeley Laboratory under DARPA contract BG 91-66 and
.\" contributed to Berkeley.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: Header: cgthree.4,v 1.3 94/02/03 20:49:52 leres Exp
.\"     from: @(#)cgthree.4	8.2 (Berkeley) 2/16/94
.\"	$NetBSD: cgfour.4,v 1.1.1.1 1995/08/08 20:18:53 gwr Exp $
.\"
.Dd February 16, 1994
.Dt CGFOUR 4 sun3
.Os
.Sh NAME
.Nm cgfour
.Nd 8-bit color frame buffer
.Sh SYNOPSIS
.Cd "cgfour0 at obmem0 addr ?"
.Sh DESCRIPTION
The
.Nm
is a memory based color frame buffer with overlay plane.
Its pixel memory and control planes can be mapped into a user
process address space by using the
.Xr mmap 2
system call.
The
.Nm
driver supports the minimal
.Xr ioctl 2 Ns s
needed to run
.Xr X 7 .
.Sh SEE ALSO
.Xr bwtwo 4 ,
.Xr cgtwo 4
