openbsd/src/share/man/man4/man4.sun3/intro.4
.\"     $OpenBSD: intro.4,v 1.1 2001/10/06 22:28:18 miod Exp $
.\"
.\" Copyright (c) 2001 The OpenBSD Project
.\" ALl Rights Reserved.
.\"
.Dd October 6, 2001
.Dt INTRO 4 sun3
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files, 
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the SPARC
platform.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system will have to be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.
Pseudo-devices are not listed.
Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width eeprom -compact -offset indent
.It bwtwo
Black and white frame buffer.
.It cgfour
8 bit on-board (or on the 3/60 P4 bus) color graphics frame buffer.
.It cgtwo
8 bit VMEbus color frame buffer.
.It eeprom
Sun non-volatile configuration RAM driver.
.It ie
Intel 82586 Ethernet controller.
.It kbd
Sun type 2, type 3, type 4, and type 5 keyboards (on zs).
.It le
AMD 7990 LANCE ethernet controller.
.It led
Diagnostic LED display.
.It ms
Sun mouse (on zs).
.It si
NCR5380 "SCSI-2" VMEbus or on-board SCSI controller.
.It xd
Xylogics 753/7053 VMEbus SMD disk controller.
.It xy
Xylogics 450/451 VMEbus SMD disk controller.
.It zs
Zilog 8530 serial controller.
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HISTORY
The
sun3
.Nm
first appeared in
.Ox 3.0 .
