openbsd/src/share/man/man8/man8.alpha/boot_alpha.8
.\"	$OpenBSD: boot_alpha.8,v 1.7 2003/02/01 16:38:39 jmc Exp $
.\"
.\" Copyright (c) 2002, Miodrag Vallat.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.Dd October 2nd, 2002
.Dt BOOT_ALPHA 8 alpha
.Os
.Sh NAME
.Nm boot
.Nd Alpha system bootstrapping procedures
.Sh DESCRIPTION
.Ss Cold starts
When powered on, the SRM firmware will proceed to its initialization, and
will boot an operating system if the
.Ev Em auto_action
variable is set to
.Dq boot
or
.Dq restart ,
or will wait for interactive commands if set to
.Dq halt .
.Ss Warm starts
After a panic, or if the system is rebooted via
.Xr reboot 8
or
.Xr shutdown 8 ,
the SRM console will only restart the system if the
.Ev Em auto_action
variable is set to
.Dq boot .
.Ss Boot process options
The SRM console will attempt to boot a kernel named from the
.Ev Em boot_file
environment variable, on the device listed in the
.Ev Em bootdef_dev
variable.
A list of the recognized SRM devices can be obtained with the command
.Ic show dev
at the SRM prompt.
If the
.Ev Em boot_file
variable is not set or empty,
.Pa /bsd
will be used by default.
.Pp
The kernel will be passed the options listed in the
.Ev Em boot_osflags
variable.
Option letters are case insensitive.
The following option letters are recognized:
.Bl -tag -width "XXX" -offset indent -compact
.Pp
.It Cm a
Boot the system multi-user.
.It Cm b
Enter the debugger,
.Xr ddb 4 ,
as soon as the kernel console has been initialized.
.It Cm c
Enter the
.Dq User Kernel Configuration
mode upon startup
.Pq Xr boot_config 8 .
.It Cm d
Create a kernel crash dump immediately after the devices have been configured.
This option is only available on kernels compiled with
.Qq option DEBUG .
.It Cm h
On the next system reboot, always halt the system, even if a reboot is
required.
.It Cm n
Prompt for the root filesystem device after the devices have been configured.
.It Cm s
Boot the system single-user.
This is the default behaviour of the kernel if no flags are specified.
.El
.Ss Abnormal system termination
In case of system crashes, the kernel will usually enter the kernel
debugger,
.Xr ddb 4 ,
unless it is not present in the kernel, or it is disabled via the
.Em ddb.panic
sysctl.
Upon leaving ddb, or if ddb was not entered, the kernel will halt the system
if it was still in device configuration phase, or attempt a dump to the
configured dump device, if possible.
The crash dump will then be recovered by
.Xr savecore 8
during the next multi-user boot cycle.
It is also possible to force other behaviours from ddb.
.Sh FILES
.Bl -tag -width /usr/mdec/netboot -compact
.It Pa /bsd
default system kernel
.It Pa /usr/mdec/bootxx
primary bootstrap for
.Dq ffs
file system
.It Pa /usr/mdec/boot
secondary bootstrap (usually also installed as
.Pa /boot )
.It Pa /usr/mdec/netboot
network bootstrap
.El
.Sh SEE ALSO
.Xr ddb 4 ,
.Xr boot_config 8 ,
.Xr halt 8 ,
.Xr init 8 ,
.Xr installboot 8 ,
.Xr reboot 8 ,
.Xr savecore 8 ,
.Xr setnetbootinfo 8 ,
.Xr shutdown 8
.Rs
.%T "Alpha Architecture Reference Manual Third Edition"
.%Q "Alpha Architecture Committee"
.%I "Digital Press"
.%D 1998
.Re
.Sh BUGS
The device names used by
.Ox
.Ns Tn /alpha
and the
.Tn SRM Console
often have no relation to each other.
