openbsd/src/share/man/man4/man4.arc/intro.4
.\"     $OpenBSD: intro.4,v 1.3 1999/07/09 13:35:45 aaron Exp $
.\"
.\" Copyright (c) 1998 The OpenBSD Project
.\" All Rights Reserved.
.\"
.Dd March 7, 1998
.Dt INTRO 4 arc
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
This section describes the special files, related driver functions,
and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the Alpha
platform.
Software support for these devices comes in two forms.  A hardware
device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.  When the resultant system is booted, the
autoconfiguration facilities in the system probe for the device
and, if found, enable the software support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system must be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh SEE ALSO
.X4 wd 4 ,
.Xr autoconf 4 ,
.Xr cd 4 ,
.Xr com 4 ,
.Xr ed 4 ,
.Xr ep 4 ,
.Xr joy 4 ,
.Xr le 4 ,
.Xr lpt 4 ,
.Xr pms 4 ,
.Xr sd 4 ,
.Xr ss 4 ,
.Xr st 4 ,
.Xr config 8
.Sh SUPPORTED SYSTEMS
The following MIPS based ARC BIOS systems are supported:
.Bl -tag -width speaker
.It Acer/PICA.
.It Deskstation Tyne.
.It Deskstation rPC44.
.It MIPS Magnum (aka Jazz)
.El
.Pp
None of the NEC machines are supported at this time.  The SMP machines
that were made are also not supported.
.Sh HISTORY
The
Arc
.Nm
first appeared with
.Ox 2.0 .
