openbsd/src/share/man/man4/man4.armv7/a1xintc.4
.\"	$OpenBSD: a1xintc.4,v 1.1 2014/09/22 14:02:38 rapha Exp $
.\"
.\" Copyright (c) 2014 Raphael Graf <rapha@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 22 2014 $
.Dt A1XINTC 4 armv7
.Os
.Sh NAME
.Nm a1xintc
.Nd A1X interrupt controller device
.Sh SYNOPSIS
.Cd "a1xintc* at sunxi?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the interrupt controller device integrated in
Allwinner Technology A1X SoCs.
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 5.5 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Dale Rahn Aq Mt drahn@dalerahn.com .
