openbsd/src/share/man/man4/man4.armv7/amdisplay.4
.\" Copyright (c) 2017 Ian Sutton <ian@ce.gl>$
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 14 2017 $
.Dt AMDISPLAY 4 armv7
.Os
.Sh NAME
.Nm amdisplay ,
.Nm nxphdmi
.Nd Texas Instruments AM335x LCD display driver
.Sh SYNOPSIS
.Nm "amdisplay* at simplebus0"
.Nm "nxphdmi* at iic*"
.Nm "wsdisplay* at amdisplay*"
.Sh DESCRIPTION
The
.Nm
driver supports the LCD controller integrated in Texas Instruments' line of
AM335x SoCs.
The LCDC reads a framebuffer from memory via DMA and scans it out
at the proper frequency to suit a display (along with the nessecary
hsync/vsync/etc signals) to a PHY transmitter.
The BeagleBone Black uses
NXP/Freescale's TDA19988 HDMI transmitter which is additionally supported by the
.Nm nxphdmi
driver.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr wsdisplay 4 ,
.Xr wsfb 4
.Sh HISTORY
The
.Nm
driver does not appear in
.Ox 6.1
currently.
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Ian Sutton Aq Mt ian@ce.gl .
The
.Nm nxphdmi
driver was written by
.An Oleksandr Tymoshenko Aq Mt gonzo@freebsd.org
and later ported to OpenBSD.
.Sh CAVEATS
On the BeagleBone Black, the LCDC and onboard eMMC NAND chip share the same set
of pads such that only one can be wired and used at a time.
If you wish to boot from or use the onboard storage, you must disable
.Nm
via
.Xr config 8
in your kernel.
.Pp
Display must be attached at boot time, otherwise
.Nm
will fail to configure.
Hotplugging is not supported.
.Pp
Only 16 bit color depth is supported due to a silicon bug.
