openbsd/src/share/man/man4/man4.armv7/imxtemp.4
.\"	$OpenBSD: imxtemp.4,v 1.1 2016/08/14 19:15:22 kettenis Exp $
.\"
.\" Copyright (c) 2016 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 14 2016 $
.Dt IMXTEMP 4
.Os
.Sh NAME
.Nm imxtemp
.Nd i.MX6 Temperature Monitor
.Sh SYNOPSIS
.Cd "imxtemp* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the temperature sensor found on the
Freescale i.MX6 SoC processors.
.Pp
Sensor values are made available through the
.Xr sysctl 8
interface.
.Sh SEE ALSO
.Xr imx 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Patrick Wildt Mt patrick@blueri.se 
and
.An Mark Kettenis Mt kettenis@openbsd.org .
