openbsd/src/share/man/man4/man4.armv7/psci.4
.\"	$OpenBSD: psci.4,v 1.1 2016/10/09 23:50:20 jsg Exp $
.\"
.\" Copyright (c) 2016 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 9 2016 $
.Dt PSCI 4 armv7
.Os
.Sh NAME
.Nm psci
.Nd Power State Coordination Interface
.Sh SYNOPSIS
.Cd "psci* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver handles system reset and power down for systems that conform
to the ARM Power State Coordination Interface specification.
.Sh SEE ALSO
.Rs
.%T Power State Coordination Interface (PSCI) specification
.%N ARM DEN 0022C
.Re
