openbsd/src/share/man/man4/man4.armv7/sitaracm.4
.\" $OpenBSD: sitaracm.4,v 1.3 2014/09/19 17:17:04 jmc Exp $
.\" Copyright (c) 2014 Raphael Graf <rapha@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 19 2014 $
.Dt SITARACM 4 armv7
.Os
.Sh NAME
.Nm sitaracm
.Nd Sitara ARM control module device
.Sh SYNOPSIS
.Cd "sitaracm* at omap?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Sitara ARM control module device integrated in
AM335X SoCs.
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 5.4 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Ben Gray Aq Mt ben.r.gray@gmail.com
and ported to
.Ox
by
.An Raphael Graf Aq Mt rapha@openbsd.org .
