openbsd/src/share/man/man4/man4.armv7/sximmc.4
.\"	$OpenBSD: sximmc.4,v 1.2 2016/08/20 20:23:29 jmc Exp $
.\"
.\" Copyright (c) 2016 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 20 2016 $
.Dt SXIMMC 4 armv7
.Os
.Sh NAME
.Nm sximmc
.Nd SD/MMC controller
.Sh SYNOPSIS
.Cd "sximmc* at fdt?"
.Cd "sdmmc* at sximmc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the MMC/SD/SDIO controller integrated on
Allwinner A1X/A20 SoCs.
.Pp
The
.Xr sdmmc 4
subsystem performs SD/MMC transactions to communicate with
MMC, SD, SDHC, or SDIO devices inserted into the SD slot.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sdmmc 4 ,
.Xr sunxi 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jared D. McNeill
for
.Nx
and ported to
.Ox
by
.An Mark Kettenis Mt kettenis@openbsd.org .
