openbsd/src/share/man/man4/man4.armv7/sxipio.4
.\"	$OpenBSD: sxipio.4,v 1.1 2014/09/22 14:02:38 rapha Exp $
.\"
.\" Copyright (c) 2014 Raphael Graf <r@undefined.ch>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 22 2014 $
.Dt SXIPIO 4 armv7
.Os
.Sh NAME
.Nm sxipio
.Nd A1X/A20 GPIO controller
.Sh SYNOPSIS
.Cd "sxipio* at sunxi?"
.Cd "gpio* at sxipio?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the GPIO controller integrated in Allwinner Technology
A1X/A20 SoCs.
The devices have several ports for multi-functional pins which can be configured
as either inputs or outputs, and accessed using
.Xr gpioctl 8 .
.\" Both values are made available through the
.\" .Xr sysctl 8
.\" interface.
.Sh SEE ALSO
.Xr gpio 4 ,
.Xr gpioctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.5 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Miodrag Vallat .
