openbsd/src/share/man/man4/man4.armv7/vexpress.4
.\"	$OpenBSD: vexpress.4,v 1.2 2016/08/06 00:34:24 jsg Exp $
.\"
.\" Copyright (c) 2014 Sylvestre Gallon <syl@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 6 2016 $
.Dt VEXPRESS 4 armv7
.Os
.Sh NAME
.Nm vexpress
.Nd ARM Versatile Express device bus
.Sh SYNOPSIS
.Cd "vexpress0 at mainbus?"
.Sh DESCRIPTION
The
.Nm
interface serves as an abstraction used by the autoconfiguration
system to help find and attach devices integrated on the
ARM Versatile Express development boards.
.Pp
.Nm
provides support for the following devices:
.Pp
.Bl -tag -width 12n -offset indent -compact
.It Xr plrtc 4
ARM PrimeCell PL031 Real-time clock
.It Xr pluart 4
ARM PrimeCell PL011 UART
.It Xr sysreg 4
ARM Motherboard Express microATX system registers
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr mainbus 4
.Rs
.%T ARM Motherboard Express microATX Technical Reference Manual
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.8 .
