openbsd/src/sbin/fsck_vnd/fsck_vnd.8
.\"	$OpenBSD: fsck_vnd.8,v 1.2 2007/05/27 04:17:17 grunk Exp $
.\"
.\" Copyright (c) 2007 Alexander von Gernler <grunk@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd April 13, 2007
.Dt FSCK_VND 8
.Os
.Sh NAME
.Nm fsck_vnd
.Nd vnd image consistency checker
.Sh SYNOPSIS
.Nm fsck_vnd
.Op Fl fnpy
.Ar image ...
.Sh DESCRIPTION
The
.Nm
utility pretends to verify image files to be configured using
.Xr mount_vnd 8 .
It is a bogus script that exists to please the
.Xr fstab 5
semantics for the
.Ar vnd
file system.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl f
This option is ignored by
.Nm fsck_vnd ,
and is present only for compatibility with programs that
check other file system types for consistency, such as
.Xr fsck_ffs 8 .
.It Fl n
Assume a
.Dq no
response to all questions asked by
.Nm fsck_vnd .
This option is provided for compatibility reasons.
.It Fl p
Preen the specified file systems.
This option is provided for compatibility reasons.
.It Fl y
Causes
.Nm
to assume
.Dq yes
as the answer to all operator questions.
This option is provided for compatibility reasons.
.El
.Sh SEE ALSO
.Xr fs 5 ,
.Xr fstab 5 ,
.Xr fsck 8 ,
.Xr fsck_ffs 8 ,
.Xr mount_vnd 8 ,
.Xr rc 8
.Sh HISTORY
The
.Nm
command first appeared in
.Ox 4.2 .
.Sh AUTHORS
.An Alexander von Gernler .
