openbsd/src/sbin/isakmpd/apps/keyconv/keyconv.8
.\" $OpenBSD: keyconv.8,v 1.1 2001/08/22 15:29:54 ho Exp $
.\"
.\" Copyright (c) 2001 Hakan Olsson.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" Manual page, using -mandoc macros
.\"
.Dd Aug 22, 2001
.Dt KEYCONV 8
.Os
.Sh NAME
.Nm keyconv
.Nd DNSSEC/OpenSSL private key converter
.Sh SYNOPSIS
.Nm keyconv
.Fl d 
infile outfile
.Nm keyconv
.Fl o 
infile outfile
.Sh DESCRIPTION
The
.Nm
utility converts between the key formats used by OpenSSL, as produced by
.Xr openssl 1 ,
and DNSSEC, as produced by
.Xr dnssec-keygen 8 .
The primary use of
.Nm
is to generate the DNS "KEY" resource records that, when signed, can
be used by
.Xr isakmpd 8
to authenticate an IKE negotiation.
.Pp
For proper operation, 
.Ar infile
is expected to contain the private key.
.Pp
The mode of operation is determined as follows:
.Bl -tag -width abcd
.It Fl d
Convert from DNSSEC to OpenSSL format.
.It Fl o
Convert from OpenSSL to DNSSEC format. In this mode, 
.Nm
outputs both the DNSSEC private key, plus a "outfile.pubkey"
file containing the public key in a format suitable for inclusion
in a DNS database file.
.El
.Pp
The
.Nm dnssec-keygen
command is supplied as part of BIND version 8 and 9.
.Sh SEE ALSO
.Xr isakmpd 8 ,
.Xr openssl 1 ,
.Xr dnssec-keygen 8
.Sh HISTORY
This command first appeared in
.Ox 
3.0.

