openbsd/src/usr.sbin/dvmrpd/dvmrpd.8
.\"	$OpenBSD: dvmrpd.8,v 1.3 2007/05/31 19:20:23 jmc Exp $
.\"
.\" Copyright (c) 2004, 2005, 2006 Esben Norby <norby@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt DVMRPD 8
.Os
.Sh NAME
.Nm dvmrpd
.Nd "Distance Vector Multicast Routing Protocol daemon"
.Sh SYNOPSIS
.Nm
.Op Fl dnv
.Op Fl f Ar file
.Sh DESCRIPTION
.Nm
is the Distance Vector Multicast Routing Protocol
.Pq DVMRP
daemon which manages multicast routing tables.
Its main purpose is keeping multicast routing tables in sync.
.Pp
A running
.Nm
can be controlled with the
.Xr dvmrpctl 8
utility.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d
Do not daemonize.
If this option is specified,
.Nm
will run in the foreground and log to
.Em stderr .
.It Fl f Ar file
Specify an alternative configuration file.
.It Fl n
Configtest mode.
Only check the configuration file for validity.
.It Fl v
Produce more verbose output.
.El
.Sh FILES
.Bl -tag -width "/var/run/dvmrpd.sockXX" -compact
.It /etc/dvmrpd.conf
Default
.Nm
configuration file.
.It /var/run/dvmrpd.sock
Unix-domain socket used for communication with
.Xr dvmrpctl 8 .
.El
.Sh SEE ALSO
.Xr dvmrpd.conf 5 ,
.Xr dvmrpctl 8
.Rs
.%R "draft-ietf-idmr-dvmrp-v3-11"
.%T "DVMRP Version 3"
.%D August 2000
.Re
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 4.0 .
