openbsd/src/share/man/man4/man4.pmax/dz.4
.\"
.\" Copyright (c) 1996 Jonathan Stone.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jonathan Stone.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$NetBSD: dc.4,v 1.3 1998/02/23 19:46:24 jonathan Exp $
.\"	$OpenBSD: dz.4,v 1.1 2000/09/01 08:49:57 maja Exp $
.\"
.Dd February 20, 1998
.Dt DZ 4 pmax
.Os
.Sh NAME
.Nm dz
.Nd
dc659, dc7085 DZ11-on-a-chip serial communications interface
.Sh SYNOPSIS
.Cd "dz0 at ioasic?"
.Cd "dz0 at mainbus"
.Cd "dz1 at mainbus"
.Cd "dz2 at mainbus"
.Sh DESCRIPTION
The
.Nm
driver provides support for Digital's dc7085 four-port serial
communications chip.
The
.Nm dz
driver supports dc7085 hardware on attached to the following
parent devices:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It mainbus
baseboard device on DECstation 2100, 3100, and 5100,
and optional expansion devices on the 5100.
.It ioasic
baseboard device on DECstation 5000/200.
.It vsbus
baseboard devices on the VAXstation 2000 and 3100.
.El
.Pp
The
.Nm
device is in essence a single-chip clone of the DZ-11.
The DZ-11 hardware design severely constrains performance.
One small input silo is shared across all input ports.
The
.Nm dz
hardware does not interrupt on modem transitions; instead,
they are detected via polling.
Only two lines on a baseboard
.Nm dz
device  have any modem control signals;
the other two lines are wired for a keyboard and mouse.

On some implementations (e.g., DECstation 3100), the hardware does not
bring out modem flow-control signals to the bulkhead. Only modem
carrier transition are provided. This is adequate for Unix dialin
and dialout detection, but without hardware flow control, the
.Nm
device is prone to overruns when used for serial-line protocols.

The DECstation 5000/200
.Nm
hardware provides full modem control on
both bulkhead RS-232 ports and is less prone to overrun.
.Sh BUGS
The 19200 speed on all
.Nm
devices is actually implemented as 19800,
presumably for bug-compatibility with the original DZ-11.
This is a hardware feature and cannot be corrected in software.
Many serial devices at 19200 fail to interoperate with the
.Nm
at its 19800 speed setting.
.Pp
The DECstation 5000/200 can set a bit in the system register
to allow the
.Nm
to run at 38400, but this applies to all four lines and disables
the 19200 speed on all four lines. This feature is not currently supported.
.Pp
The
.Nm
driver should be merged into a single driver supporting the original
DZ-11, DZ-32, and Qbus DZV-11 and DZQ-11 clones.
.Sh HISTORY
The
.Nm
driver
first appeared in
.Bx 4.4 /pmax. This manual page first appeared in
.Nx 1.2 .
Due to a name conflict the driver was renamed from
.Nm dc
to
.Nm dz
in
.Ox 2.7 .
