openbsd/src/share/man/man4/man4.pmax/lk201.4
.\"
.\" Copyright (c) 1996 Jonathan Stone.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jonathan Stone.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$NetBSD: lk201.4,v 1.2 1997/10/13 11:23:53 lukem Exp $
.\"	$OpenBSD: lk201.4,v 1.2 1998/03/09 15:37:23 millert Exp $
.\"
.Dd August 6, 1996
.Dt LK201 4 pmax
.Os
.Sh NAME
.Nm lk201
.Nd
LK-201 keyboard input driver
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn Digital
.Tn LK-201
keyboard and successors.   This support is automatically configured
into the kernel, to map input keypress events into ACSII codes.
There is no way to disable this support.
.Pp
The kernel also includes support for an in-kernel ring-buffer
structure for keypress events and pointer (mouse) events.  The
.Nm fb
driver redirects mouse and keyboard input into this in-kernel
structure, and updates the position of a framebuffer cursor sprite to
track the mouse.  This is for compatibility with the 
.Nm qv
QVSS-style software interface used by X11 on  DECstation and Vaxstation
framebuffers.   This design offers significantly better performance
on the Vaxstation-100 and Vaxstation-II, but makes it impossible
to use alternative pointer or keyboard devices.
.Sh BUGS
The
.Nm
support should be re-written as a real driver or as a pseudo-device driver.
The
.Nm
driver should use an in-kernel streams facility, if one existed.
