openbsd/src/usr.sbin/afs/src/nnpfs/bsd/bin/mount_nnpfs.8
.\" 	Copyright (c) 2001 Kungliga Tekniska Högskolan
.\"	$arla: mount_nnpfs.8,v 1.6 2002/09/07 10:45:46 lha Exp $
.Dd January 8, 2000
.Dt MOUNT_NNPFS 8
.Os "The Arla Project"
.Sh NAME
.Nm mount_nnpfs
.Nd mount a nnpfs filesystem
.Sh SYNOPSIS
.Nm
.Op Fl o Ar options
.Op Fl F Ar mount-flags
.Ar device path
.Sh DESCRIPTION
The
.Nm
command attaches the nnpfs filesystem on the
.Ar special
device on to the file system tree at point
.Ar path .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
.It Fl F
mount-flags is the same as
.Ar options
but expressed i decimal form.
.El
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8 ,
.Xr umount 8 ,
.Xr umount_nnpfs 8
