openbsd/src/kerberosIV/src/lib/krb/krb.conf.5
.\" $KTH: krb.conf.5,v 1.2 2000/12/07 15:23:41 assar Exp $
.\" Copyright 1989 by the Massachusetts Institute of Technology.
.\"
.\" For copying and distribution information,
.\" please see the file <mit-copyright.h>.
.\"
.Dd December 7, 2000
.Dt KRB.CONF 5
.Os KTH-KRB
.Sh NAME
/etc/krb.conf \- Kerberos configuration file
.Sh DESCRIPTION
.Pa krb.conf
contains configuration information describing the Kerberos realm(s) and the
Kerberos key distribution center (KDC) servers for known realms.
.PP
.Pa krb.conf
starts with a definition of the local realm on the first line, this is
followed by any number lines defining supplementary local realms.  The
rest of the file consists of lines indicating realm/host entries. The
first token is a realm name, and the second is a server specification
of a host running a KDC for that realm. The words "admin server"
following the hostname indicate that the host also provides an
administrative database server.

To be able to communicate with the KDC through a firewall it is
sometimes necessary to tunnel requests over HTTP or TCP. Tunnel
protocols and port numbers are specified in the server specification
using the syntax [(UDP|TCP|HTTP)/]hostname[:port].
.Sh EXAMPLES
.nf
.in +1i
SICS.SE
NADA.KTH.SE
SICS.SE     TCP/kerberos.sics.se:88 admin server
NADA.KTH.SE kerberos.nada.kth.se    admin server
NADA.KTH.SE kerberos-1.nada.kth.se
NADA.KTH.SE kerberos-2.nada.kth.se
NADA.KTH.SE HTTP/kerberos-3.nada.kth.se
KTH.SE      kerberos.kth.se         admin server
.in -1i
.Sh ENVIRONMENT
The environment variable
.Ev KRBCONFDIR
can be used to point out the directory where the
.Pa krb.conf
file resides.
.Sh SEE ALSO
.Xr krb.realms 5 ,
.Xr krb_get_krbhst 3 ,
.Xr krb_get_lrealm 3
