openbsd/src/kerberosIV/src/lib/krb/krb.extra.5
.\" $KTH: krb.extra.5,v 1.4 2001/08/26 01:47:33 assar Exp $
.\"
.Dd June 24, 1999
.Dt KRB.EXTRA 5
.Os KTH-KRB
.Sh NAME
.Nm krb.extra
.Nd Kerberos misc configuration file
.Sh DESCRIPTION
.Nm
contains a number of settings that are used by the kerberos library,
or directly by applications. Each line in the file consists of a
variable, an equal sign, and a value. Lines beginning with hash are
ignored.
.Pp
Currently defined variables are:
.Bl -tag -width foo
.It kdc_timeout
time in seconds to wait for an answer from the KDC (default is 4
seconds)
.It kdc_timesync
if this is enabled, the time differential between the client and the
KDC will be stored, and used later on when computing the correct time;
this is useful if the client's clock is drifting
.It firewall_address
the outside address of the firewall; this is used in some places to
compute a direction bit, and this might break if the server has a
different idea about which address to use then the client
.It krb4_proxy
address of a web-proxy to use when connecting to the KDC via HTTP
.It krb_default_tkt_root
the default prefix for ticket files. E.g, if your uid is 42 and the
prefix is /tmp/tkt then your default ticket file will be /tmp/tkt42
.It krb_default_keyfile
the default kefile, normally /etc/srvtab
.It nat_in_use
if a Network Address Translator (NAT) is being used.
.It egd_socket
if krb4 has been built with openssl, this specifies the egd socket.
.El
.Sh EXAMPLES
.Bd -literal
# this is a comment
krb_default_tkt_root = /tkt/tkt_
kdc_timesync = yes
firewall_address = 10.0.0.1
krb_default_keyfile = /etc/kerberosIV/srvtab
.Ed
.Sh SEE ALSO
.Xr RAND_egd 3 ,
.Xr krb.conf 5 ,
.Xr krb.equiv 5 ,
.Xr krb.realms 5
