openbsd/src/kerberosIV/kstash/kstash.8
.\"
.\" This software may now be redistributed outside the US.
.\"
.\"Copyright (C) 1989 by the Massachusetts Institute of Technology
.\"
.\"Export of this software from the United States of America is assumed
.\"to require a specific license from the United States Government.
.\"It is the responsibility of any person or organization contemplating
.\"export to obtain such a license before exporting.
.\"
.\"WITHIN THAT CONSTRAINT, permission to use, copy, modify, and
.\"distribute this software and its documentation for any purpose and
.\"without fee is hereby granted, provided that the above copyright
.\"notice appear in all copies and that both that copyright notice and
.\"this permission notice appear in supporting documentation, and that
.\"the name of M.I.T. not be used in advertising or publicity pertaining
.\"to distribution of the software without specific, written prior
.\"permission.  M.I.T. makes no representations about the suitability of
.\"this software for any purpose.  It is provided "as is" without express
.\"or implied warranty.
.\"
.\"	$OpenBSD: kstash.8,v 1.3 1998/02/18 11:54:09 art Exp $
.TH KSTASH 8 "Kerberos Version 4.0" "MIT Project Athena"
.SH NAME
kstash \- stash Kerberos key distribution center database master key
.SH SYNOPSIS
kstash
.SH DESCRIPTION
.I kstash
saves the Kerberos key distribution center (KDC) database master key in
the master key cache file.
.PP
The user is prompted to enter the key, to verify the authenticity of the
key and the authorization to store the key in the file.
.SH DIAGNOSTICS
.TP 20n
"verify_master_key: Invalid master key, does not match database."
The master key string entered was incorrect.
.TP
"kstash: Unable to open master key file"
The attempt to open the cache file for writing failed (probably due to a
system or access permission error).
.TP
"kstash: Write I/O error on master key file"
The 
.BR write (2)
system call returned an error while
.I kstash
was attempting to write the key to the file.
.SH FILES
.TP 20n
/etc/kerberosIV/principal.pag, /etc/kerberosIV/principal.dir
DBM files containing database
.TP
/etc/kerberosIV/master_key
Master key cache file.
