openbsd/src/usr.sbin/arp/arp.8
.\"	$OpenBSD: arp.8,v 1.14 2004/07/09 19:54:41 jaredy Exp $
.\"	$NetBSD: arp.8,v 1.7 1995/03/01 11:50:59 chopps Exp $
.\"
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)arp.8	8.1 (Berkeley) 6/6/93
.\"
.Dd July 14, 1999
.Dt ARP 8
.Os
.Sh NAME
.Nm arp
.Nd address resolution display and control
.Sh SYNOPSIS
.Nm arp
.Op Fl n
.Ar hostname
.Nm arp
.Op Fl n
.Fl a
.Nm arp
.Fl d Ar hostname
.Nm arp
.Fl d a
.Nm arp
.Fl s Ar hostname ether_addr
.Op Cm temp | permanent
.Op Cm pub
.Nm arp
.Fl f Ar filename
.Sh DESCRIPTION
The
.Nm
program displays and modifies the Internet-to-Ethernet address translation
tables used by the address resolution protocol
.Pq Xr arp 4 .
With no flags, the program displays the current
.Tn ARP
entry for
.Ar hostname .
The host may be specified by name or by number,
using Internet dot notation.
.Pp
Available options:
.Bl -tag -width Ds
.It Fl a
Display all of the current
.Tn ARP
entries.
See also the
.Fl d
option below.
.It Fl d
Delete an entry for the host called
.Ar hostname .
Alternatively, the
.Fl d
flag may be combined with the
.Fl a
flag to delete all entries, with hostname lookups automatically
disabled.
Only the superuser may delete entries.
.It Fl f Ar filename
Process entries from
.Ar filename
to be set in the
.Tn ARP
tables.
Entries in the file should be of the form:
.Pp
.Bd -filled -offset indent -compact
.Ar hostname ether_addr
.Op Cm temp | permanent
.Op Cm pub
.Ed
.Pp
The entry will be static, i.e., will not time out, unless the word
.Cm temp
is given in the command.
A static
.Tn ARP
entry can be overwritten by network traffic, unless the word
.Cm permanent
is given.
If the word
.Cm pub
is given, the entry will be
.Dq published ;
i.e., this system will
act as an
.Tn ARP
server,
responding to requests for
.Ar hostname
even though the host address is not its own.
This behavior has traditionally been called
.Em proxy ARP .
.It Fl n
Show network addresses as numbers (normally
.Nm
attempts to display addresses symbolically).
.It Fl s Ar hostname ether_addr
Create an
.Tn ARP
entry for the host called
.Ar hostname
with the Ethernet address
.Ar ether_addr .
The Ethernet address is given as six hexadecimal bytes separated by
colons.
.Pp
The
.Cm permanent , pub ,
or
.Cm temp
modifiers may be specified with meanings as given above.
.El
.Sh EXAMPLES
To view the current
.Xr arp 4
table:
.Pp
.Dl $ arp -a
.Pp
To create a
.Em permanent
entry (one that cannot be overwritten by other network traffic):
.Pp
.Dl # arp -s 10.0.0.2 00:90:27:bb:cc:dd permanent
.Pp
To create
.Em proxy ARP
entries on an interface, fxp0,
for the IP addresses 204.1.2.3 and 204.1.2.4:
.Pp
.Bd -unfilled -offset indent -compact
# arp -s 204.1.2.3 00:90:27:bb:cc:dd pub
# arp -s 204.1.2.4 00:90:27:bb:cc:dd pub
.Ed
.Pp
(where 00:90:27:bb:cc:dd is the MAC address of fxp0)
.Sh SEE ALSO
.Xr inet 3 ,
.Xr arp 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
