openbsd/src/sys/arch/amiga/stand/loadkmap/loadkmap.8
.\"	$OpenBSD: loadkmap.8,v 1.1 1999/03/25 21:54:55 espie Exp $
.\"
.\" Copyright (c) 1999
.\"   Marc Espie.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' BY ITS AUTHORS AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd March 2, 1999
.Dt LOADKMAP 8
.Os
.Sh NAME
.Nm loadkmap
.Nd load keyboard map
.Sh SYNOPSIS
.Nm 
.Op Ar file 
.Sh DESCRIPTION
.Nm
loads the specified keyboard map
.Ar file
into the console.
.Pp
If no argument is given
.Nm
retrieves the current keymap associated to the console, and dumps it to
standard output.
.Sh FILES
.Bl -tag -width sys/arch/amiga/stand/loadkmap -compact
.It Pa /usr/share/keymaps
repository of known amiga keymap files.
.It Pa sys/arch/amiga/stand/loadkmap
sources to those keymap files.
.El
.Sh SEE ALSO
.Xr ite 4
.Sh BUGS
The format of the keymap files is ill-specified, incomplete, and likely
to change in the future. 
.Nm
should be replaced by the more generic
.Xr kbd 1 ,
which does not exist on the amiga at the moment.
