openbsd/src/usr.sbin/rwhod/rwhod.8
.\"	$OpenBSD: rwhod.8,v 1.17 2007/05/31 19:20:29 jmc Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)rwhod.8	8.2 (Berkeley) 12/11/93
.\"     $OpenBSD: rwhod.8,v 1.17 2007/05/31 19:20:29 jmc Exp $
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt RWHOD 8
.Os
.Sh NAME
.Nm rwhod
.Nd system status server
.Sh SYNOPSIS
.Nm rwhod
.Op Fl d
.Sh DESCRIPTION
.Nm
is the server which maintains the database used by the
.Xr rwho 1
and
.Xr ruptime 1
programs.
Its operation is predicated on the ability to
.Em broadcast
messages on a network.
.Pp
.Nm
operates as both a producer and consumer of status information.
As a producer of information it periodically
queries the state of the system and constructs
status messages which are broadcast on a network.
As a consumer of information, it listens for other
.Nm
servers' status messages, validating them, then recording
them in a collection of files located in the directory
.Pa /var/rwho .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d
Turn on debug mode.
.El
.Pp
The server transmits and receives messages at the port indicated
in the ``who'' service specification; see
.Xr services 5 .
The messages sent and received, are of the form:
.Bd -literal -offset indent
struct	outmp {
	char	out_line[8];		/* tty name */
	char	out_name[8];		/* user id */
	int32_t	out_time;		/* time on */
};

struct	whod {
	char	wd_vers;
	char	wd_type;
	char	wd_fill[2];
	int32_t	wd_sendtime;
	int32_t	wd_recvtime;
	char	wd_hostname[32];
	int32_t	wd_loadav[3];
	int32_t	wd_boottime;
	struct	whoent {
		struct	outmp we_utmp;
		int32_t	we_idle;
	} wd_we[1024 / sizeof (struct whoent)];
};
.Ed
.Pp
All fields are converted to network byte order prior to
transmission.
The load averages are as calculated by the
.Xr w 1
program, and represent load averages over the 5, 10, and 15 minute
intervals prior to a server's transmission; they are multiplied by 100
for representation in an integer.
The host name included is that returned by
.Xr gethostname 3
with any trailing domain name omitted.
The array at the end of the message contains information about
the users logged in to the sending machine.
This information includes the contents of the
.Xr utmp 5
entry for each non-idle terminal line and a value indicating the
time in seconds since a character was last received on the terminal line.
.Pp
Messages received by the
.Xr rwho
server are discarded unless they originated at an
.Xr rwho
server's port.
In addition, if the host's name, as specified
in the message, contains any unprintable
.Tn ASCII
characters, the
message is discarded.
Valid messages received by
.Nm
are placed in files named
.Pa whod.hostname
in the directory
.Pa /var/rwho .
These files contain only the most recent message, in the
format described above.
.Pp
Status messages are generated approximately once every
3 minutes.
.Sh SEE ALSO
.Xr ruptime 1 ,
.Xr rwho 1
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
.Sh BUGS
There should be a way to relay status information between networks.
Status information should be sent only upon request rather than continuously.
People often interpret the server dying
or network communication failures
as a machine going down.
