openbsd/src/sbin/ifconfig/ifconfig.8
.\"	$OpenBSD: ifconfig.8,v 1.61 2002/12/12 13:41:25 mpech Exp $
.\"	$NetBSD: ifconfig.8,v 1.11 1996/01/04 21:27:29 pk Exp $
.\"     $FreeBSD: ifconfig.8,v 1.16 1998/02/01 07:03:29 steve Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)ifconfig.8	8.4 (Berkeley) 6/1/94
.\"
.Dd September 3, 1998
.Dt IFCONFIG 8
.Os
.Sh NAME
.Nm ifconfig
.Nd configure network interface parameters
.Sh SYNOPSIS
.Nm ifconfig
.Ar interface address_family
.Oo
.Ar address
.Op Ar dest_address
.Oc
.Op Ar parameters
.Nm ifconfig
.Ar tunnel-interface
.Cm tunnel
.Ar src_address dest_address
.Nm ifconfig
.Ar tunnel-interface
.Cm deletetunnel
.Nm ifconfig
.Ar vlan-interface
.Cm vlan
.Ar vlan-tag
.Cm vlandev
.Ar parent-interface
.Nm ifconfig
.Ar interface
.Op Ar address_family
.Nm ifconfig
.Fl m
.Ar interface
.Op Ar address_family
.Nm ifconfig
.Op Fl a | am
.Op Ar address_family
.Nm ifconfig
.Op Fl A | Am
.Op Ar address_family
.Sh DESCRIPTION
The
.Nm
utility is used to assign an address
to a network interface and/or configure
network interface parameters.
.Nm
must be used at boot-time to define the network address
of each interface present on a machine; it may also be used at
a later time to redefine an interface's address
or other operating parameters.
To configure a bridge interface, use the
.Xr brconfig 8
program instead.
.Pp
The operands are as follows:
.Bl -tag -width Ds
.It Ar address
For the
.Tn DARPA-Internet
family,
the address is either a host name present in the host name data
base,
.Xr hosts 5 ,
or a
.Tn DARPA
Internet address expressed in the Internet standard
.Dq dot notation .
For the Xerox Network Systems(tm) and Internetwork Packet Exchange families,
addresses are
.Ar net:a.b.c.d.e.f ,
where
.Ar net
is the assigned network number (in decimal),
and each of the six bytes of the host number,
.Ar a
through
.Ar f ,
are specified in hexadecimal.
The host number may be omitted on Ethernet interfaces,
which use the hardware physical address,
and on interfaces other than the first.
For the
.Tn ISO
family, addresses are specified as a long hexadecimal string,
as in the Xerox family.
However, two consecutive dots imply a zero
byte, and the dots are optional, if the user wishes to (carefully)
count out long strings of digits in network byte order.
.Tn AppleTalk
(LLAP) addresses are specified as nn.na (Network Number.Node Address).
Node addresses are divided into 2 classes: User Node IDs and Server
Node IDs. 1-127($01-$7F) are for User Node IDs while 128-254($80-$FE)
are used for Server Node IDs.
Node 0($00) is not allowed (unknown)
while Node 255($FF) is reserved for the AppleTalk broadcast Hardware
address (broadcast ID).
.It Ar address_family
Specifies the
.Ar address family
which affects interpretation of the remaining parameters.
Since an interface can receive transmissions in differing protocols
with different naming schemes, specifying the address family is recommended.
The address or protocol families currently
supported are
.Dq inet ,
.Dq inet6 ,
.Dq atalk ,
.Dq iso ,
.Dq ipx ,
and
.Dq ns .
.It Ar interface
The
.Ar interface
parameter is a string of the form
.Dq name unit ,
for example,
.Dq en0 .
.El
.Pp
The following parameters may be set with
.Nm ifconfig :
.Bl -tag -width dest_addressxx
.It Cm alias
Establish an additional network address for this interface.
This is sometimes useful when changing network numbers, and
one wishes to accept packets addressed to the old interface.
.It Fl alias
Remove the specified network address alias.
.It Cm arp
Enable the use of the Address Resolution Protocol in mapping
between network level addresses and link level addresses (default).
This is currently implemented for mapping between
.Tn DARPA
Internet
addresses and Ethernet addresses.
.It Fl arp
Disable the use of the Address Resolution Protocol.
.It Cm anycast
(inet6 only)
Set the IPv6 anycast address bit.
.It Fl anycast
(inet6 only)
Clear the IPv6 anycast address bit.
.It Cm broadcast Ar addr
(inet only)
Specify the address to use to represent broadcasts to the
network.
The default broadcast address is the address with a host part of all 1's.
.It Cm debug
Enable driver dependent debugging code; usually, this turns on
extra console error logging.
.It Fl debug
Disable driver dependent debugging code.
.It Cm delete
Remove the network address specified.
This would be used if you incorrectly specified an alias, or it
was no longer needed.
If you have incorrectly set an NS address having the side effect
of specifying the host portion, removing all NS addresses will
allow you to respecify the host portion.
.It Cm dest_address
Specify the address of the correspondent on the other end
of a point to point link.
.It Cm down
Mark an interface
.Dq down .
When an interface is marked
.Dq down ,
the system will not attempt to
transmit messages through that interface.
If possible, the interface will be reset to disable reception as well.
This action automatically disables routes using the interface.
.It Cm tunnel Ar src_address dest_address
Set the source and destination tunnel addresses on a tunnel interface,
including
.Xr gif 4 .
Packets routed to this interface will be encapsulated in
IPv4 or IPv6, depending on the source and destination address families.
Both addresses must be of the same family.
.It Cm deletetunnel
Removes the source and destination tunnel addresses,
configured onto a tunnel interface.
.It Cm ipdst
This is used to specify an Internet host who is willing to receive
ip packets encapsulating NS packets bound for a remote network.
An apparent point to point link is constructed, and
the address specified will be taken as the NS address and network
of the destination.
IP encapsulation of
.Tn CLNP
packets is done differently.
.It Cm link[0-2]
Enable special processing of the link level of the interface.
These three options are interface specific in actual effect; however,
they are in general used to select special modes of operation.
An example
of this is to enable SLIP compression, or to select the connector type
for some Ethernet cards.
Refer to the man page for the specific driver for more information.
.It Fl link[0-2]
Disable special processing at the link level with the specified interface.
.It Cm media Ar type
Set the media type of the interface to
.Ar type .
Some interfaces support the mutually exclusive use of one of several
different physical media connectors.
For example, a 10Mb/s Ethernet interface might support the use of either
.Tn AUI
or twisted pair connectors.
Setting the media type to
.Dq 10base5
or
.Dq AUI
would change the currently active connector to the AUI port.
Setting it to
.Dq 10baseT
or
.Dq UTP
would activate twisted pair.
Refer to the interfaces' driver
specific man page for a complete list of the available types,
or use
.Cm ifconfig -m interface
for a listing of choices.
.It Cm mediaopt Ar opts
Set the specified media options on the interface.
.Ar opts
is a comma delimited list of options to apply to the interface.
Refer to the interfaces' driver specific man page for a complete
list of available options,
or use
.Cm ifconfig -m interface
for a listing of choices.
.It Fl mediaopt Ar opts
Disable the specified media options on the interface.
.It Cm mtu Ar value
Set the MTU for this device to the given
.Ar value .
Cloned routes will inherit this value as a default.
.It Cm instance Ar minst
Set the media instance to
.Ar minst .
This is useful for devices which have multiple physical layer interfaces
(PHYs).
Setting the instance on such devices may not be strictly required
by the network interface driver as the driver may take care of this
automatically; see the driver's manual page for more information.
.It Cm vlan Ar vlan_tag
If the interface is a vlan pseudo interface, set the vlan tag value
to
.Ar vlan_tag .
This value is a 16-bit number which is used to create an 802.1Q
vlan header for packets sent from the vlan interface.
Note that
.Cm vlan
and
.Cm vlandev
must both be set at the same time.
.It Cm vlandev Ar iface
If the interface is a vlan pseudo device, associate physical interface
.Ar iface
with it. Packets transmitted through the vlan interface will be
diverted to the specified physical interface
.Ar iface
with 802.1Q vlan encapsulation.
Packets with 802.1Q encapsulation received
by the parent interface with the correct vlan tag will be diverted to
the associated vlan pseudo-interface.
The vlan interface is assigned a
copy of the parent interface's flags and the parent's ethernet address.
The
.Cm vlandev
and
.Cm vlan
must both be set at the same time.
If the vlan interface already has
a physical interface associated with it, this command will fail.
To change the association to another physical interface, the existing
association must be cleared first.
.Pp
Note: if the
.Ar link0
flag is set on the vlan interface, the vlan pseudo
interface's behavior changes: the
.Ar link0
tells the vlan interface that the
parent interface supports insertion and extraction of vlan tags on its
own (usually in firmware) and that it should pass packets to and from
the parent unaltered.
.It Fl vlandev
If the driver is a vlan pseudo device, disassociate the physical interface
from it.
This breaks the link between the vlan interface and its parent,
clears its vlan tag, flags and its link address and shuts the interface down.
.It Cm metric Ar n
Set the routing metric of the interface to
.Ar n ,
default 0.
The routing metric is used by the routing protocol
.Pq Xr routed 8 .
Higher metrics have the effect of making a route
less favorable; metrics are counted as addition hops
to the destination network or host.
.It Cm netmask Ar mask
(inet, inet6 and iso)
Specify how much of the address to reserve for subdividing
networks into sub-networks.
The mask includes the network part of the local address
and the subnet part, which is taken from the host field of the address.
The mask can be specified as a single hexadecimal number
with a leading 0x, with a dot-notation Internet address,
or with a pseudo-network name listed in the network table
.Xr networks 5 .
The mask contains 1's for the bit positions in the 32-bit address
which are to be used for the network and subnet parts,
and 0's for the host part.
The mask should contain at least the standard network portion,
and the subnet field should be contiguous with the network
portion.
.\" see
.\" Xr eon 5 .
.It Cm nsellength Ar n
.Pf ( Tn ISO
only)
This specifies a trailing number of bytes for a received
.Tn NSAP
used for local identification, the remaining leading part of which is
taken to be the
.Tn NET
(Network Entity Title).
The default value is 1, which is conformant to US
.Tn GOSIP .
When an ISO address is set in an ifconfig command,
it is really the
.Tn NSAP
which is being specified.
For example, in
.Tn US GOSIP ,
20 hex digits should be
specified in the
.Tn ISO NSAP
to be assigned to the interface.
There is some evidence that a number different from 1 may be useful
for
.Tn AFI
37 type addresses.
.It Cm nwid Ar id
(IEEE 802.11 devices only)
Configure network ID for IEEE 802.11-based wireless network interfaces.
The
.Ar id
can either be any text string up to 32 characters in length,
or a series of hexadecimal digits up to 64 digits.
The empty string allows the interface to connect to any available
access points.
.It Cm nwkey Ar key
(IEEE 802.11 devices only)
Enable WEP encryption for IEEE 802.11-based wireless network interfaces
using the specified
.Ar key .
The
.Ar key
can either be a string, a series of hexadecimal digits (preceded by
.So 0x Sc Ns ),
or a set of keys
of the form
.Ar n:k1,k2,k3,k4 ,
where
.Ar n
specifies which of the keys will be used for transmitted packets,
and the four keys,
.Ar k1
through
.Ar k4 ,
are configured as WEP keys.
If a set of keys is specified, a comma
.Po So , Sc Pc
within the key must be escaped with a backslash.
Note that if multiple keys are used, their order must be the same within
the network.
For IEEE 802.11 wireless networks, the length of each key is restricted to
40 bits, i.e. a 5-character string or 10 hexadecimal digits.
WaveLAN/IEEE Gold and newer Prism cards will also accept a 104 bit
(13 character) key.
.It Cm nwkey Cm persist
(IEEE 802.11 devices only)
Enable WEP encryption for IEEE 802.11-based wireless network interfaces
with the persistent key stored in the network card.
.It Cm nwkey Cm persist: Ns Ar key
(IEEE 802.11 devices only)
Write
.Ar key
to the persistent memory of the network card, and
enable WEP encryption for IEEE 802.11-based wireless network interfaces
using that
.Ar key .
.It Fl nwkey
(IEEE 802.11 devices only)
Disable WEP encryption for IEEE 802.11-based wireless network interfaces.
.It Cm phase
The argument following this specifies the version (phase) of the
AppleTalk network attached to the interface.
Values of 1 or 2 are permitted.
.It Cm pltime Ar n
(inet6 only)
Set preferred lifetime for the address.
.It Cm powersave
(IEEE 802.11 devices only)
Enable 802.11 power saving mode.
.It Fl powersave
(IEEE 802.11 devices only)
Disable 802.11 power saving mode.
.It Cm powersavesleep Ar duration
(IEEE 802.11 devices only)
Set the receiver sleep duration (in milliseconds) for 802.11 power saving mode.
.It Cm prefixlen Ar n
(inet and inet6 only)
Effect is similar to
.Cm netmask ,
but you can specify by prefix length by digits.
.It Cm range
Under AppleTalk, set the interface to respond to a
.Em netrange
of the form startnet-endnet.
AppleTalk uses this scheme instead of
netmasks though
.Ox
implements it internally as a set of netmasks.
.It Cm tentative
(inet6 only)
Set the IPv6 tentative address bit.
.It Fl tentative
(inet6 only)
Clear the IPv6 tentative address bit.
.It Cm eui64
(inet6 only)
Fill interface index
.Pq lowermost 64bit of an IPv6 address
automatically.
.It Cm trailers
Request the use of a
.Dq trailer
link level encapsulation when
sending (default).
If a network interface supports
.Cm trailers ,
the system will, when possible, encapsulate outgoing
messages in a manner which minimizes the number of
memory to memory copy operations performed by the receiver.
On networks that support the Address Resolution Protocol (see
.Xr arp 4 ;
currently, only Ethernet),
this flag indicates that the system should request that other
systems use trailers when sending to this host.
Similarly, trailer encapsulations will be sent to other
hosts that have made such requests.
Currently used by Internet protocols only.
.It Fl trailers
Disable the use of a
.Dq trailer
link level encapsulation.
.It Cm up
Mark an interface
.Dq up .
This may be used to enable an interface after an
.Dq ifconfig down .
It happens automatically when setting the first address on an interface.
If the interface was reset when previously marked down,
the hardware will be re-initialized.
.It Cm vltime Ar n
(inet6 only)
Set valid lifetime for the address.
.El
.Pp
.Pp
.Nm
displays the current configuration for a network interface
when no optional parameters are supplied.
If a protocol family is specified,
ifconfig will report only the details specific to that protocol family.
.Pp
Using
.Fl a
causes
.Nm
to print information on all interfaces.
The protocol family may be specified as well.
Additionally, if
.Fl am ,
is used, interface media information is printed.
.Pp
If
.Fl A
is used, it causes full interface alias information for each interface to
be displayed.
If
.Fl Am
is used, interface media information is printed for all interfaces
as well.
.Pp
If
.Fl m
followed by an interface name is specified, then the media information
for that interface will be printed.
.Pp
Only the superuser may modify the configuration of a network interface.
.Sh EXAMPLES
.Bl -tag -width ifconfig
.It Cm # ifconfig fxp0 inet 192.168.1.10 netmask 255.255.255.0
Assign the inet(4) address of 192.168.1.10 with a network mask of
255.255.255.0 to interface fxp0.
.Pp
.It Cm # ifconfig fxp0 ipx 12625920
Assign the ipx(3) address of 12625920 specified in decimal to interface fxp0.
.Pp
.It Cm # ifconfig fxp0 atalk 39108.128 range 39107-39109 phase 2
Assign the AppleTalk network 39108 and server node 128 with a network
range of 39107-39109 to interface fxp0 on a phase 2 AppleTalk network.
.Pp
.It Cm # ifconfig xl0 media 10baseT
Configure the xl0 interface to use 10baseT.
.Pp
.It Cm # ifconfig xl0 media 100baseTX mediaopt full-duplex
Configure the xl0 interface to use 100baseTX, full duplex.
.Pp
.It Cm # ifconfig vlan0 192.168.254.1 vlan 4 vlandev fxp0
Configure the vlan0 interface for IP address 192.168.254.1, vlan tag 4,
and vlan parent device fxp0.
.El
.Sh DIAGNOSTICS
Messages indicating the specified interface does not exist, the
requested address is unknown, or the user is not privileged and
tried to alter an interface's configuration.
.Sh SEE ALSO
.Xr netstat 1 ,
.Xr ifmedia 4 ,
.Xr netintro 4 ,
.Xr hostname.if 5 ,
.Xr brconfig 8 ,
.Xr rc 8 ,
.Xr routed 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
