openbsd/src/share/man/man8/man8.pegasos/boot_pegasos.8
.\"	$OpenBSD: boot_pegasos.8,v 1.1 2004/03/17 22:17:28 miod Exp $
.\"
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd March 17, 2004
.Dt BOOT_PEGASOS 8 pegasos
.Os
.Sh NAME
.Nm boot_pegasos
.Nd Pegasos system bootstrapping procedures
.Sh DESCRIPTION
.Ss System startup
When powered on, after a panic, or if the system is rebooted via
.Xr reboot 8
or
.Xr shutdown 8 ,
the
.Tn Open Firmware
will proceed to its initialization, and will boot an operating system
if the
.Em auto-boot?\&
variable is set to
.Dq true ,
or will wait for interactive commands otherwise.
.Ss Boot process description
The Pegasos OpenFirmware will normally load a secondary bootloader program
from the device and filename as instructed by the
.Em boot-device
and
.Em boot-file
variables.
To boot
.Ox ,
.Em boot-device
should be set to
.Dq ofwboot ,
while
.Em boot-device
should point to the
.Ox
partition, usually
.Dq hd:3
to refer to the last partition of the first hard drive.
.Ss Boot process options
The
.Ox
bootloader will look for a kernel named
.Pa bsd
by default.
A different kernel name, as well as kernel options, can be specified as
parameters to
.Pa ofwboot ,
when booting manually with the
.Em boot
command, such as in:
.Pp
\	boot hd:3 ofwboot obsd -s
.Pp
The following options are recognized:
.Bl -tag -width "-XXX" -offset indent -compact
.Pp
.It Fl a
Prompt for the root filesystem and swap devices after the devices have
been configured.
.It Fl c
Enter the
.Dq User Kernel Config
mode upon startup
.Pq see Xr boot_config 8 .
.It Fl d
Enter the debugger,
.Xr ddb 4 ,
as soon as the kernel console has been initialized.
.It Fl s
Boot the system single-user.
The system will be booted multi-user unless this option is specified.
.El
.Ss Abnormal system termination
In case of system crashes, the kernel will usually enter the kernel
debugger,
.Xr ddb 4 ,
unless it is not present in the kernel, or it is disabled via the
.Em ddb.panic
sysctl.
Upon leaving ddb, or if ddb was not entered, the kernel will halt the system
if it was still in device configuration phase, or attempt a dump to the
configured dump device, if possible.
The crash dump will then be recovered by
.Xr savecore 8
during the next multi-user boot cycle.
It is also possible to force other behaviours from ddb.
.Ss Accessing OpenFirmware
If the
.Em auto-boot?\&
variable is set to
.Dq true ,
the boot process can be aborted by pressing the escape key during the
first few seconds of the firmware initialization.
.Sh FILES
.Bl -tag -width /usr/mdec/ofwboot -compact
.It Pa /bsd
default system kernel
.It Pa /usr/mdec/ofwboot
.Ox
bootloader
.Po
usually installed as
.Pa /ofwboot
.Pc
.El
.Sh SEE ALSO
.Xr ddb 4 ,
.Xr boot_config 8 ,
.Xr halt 8 ,
.Xr init 8 ,
.Xr installboot 8 ,
.Xr reboot 8 ,
.Xr savecore 8 ,
.Xr shutdown 8
