openbsd/src/usr.bin/newsyslog/newsyslog.8
.\"	$OpenBSD: newsyslog.8,v 1.31 2003/01/25 05:09:36 millert Exp $
.\"
.\" Copyright (c) 1997, Jason Downs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jason Downs for the
.\"      OpenBSD system.
.\" 4. Neither the name(s) of the author(s) nor the name OpenBSD
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" This file contains changes from the Open Software Foundation.
.\"
.\"	from: @(#)newsyslog.8
.\"
.\" Copyright 1988, 1989 by the Massachusetts Institute of Technology
.\"
.\" Permission to use, copy, modify, and distribute this software
.\" and its documentation for any purpose and without fee is
.\" hereby granted, provided that the above copyright notice
.\" appear in all copies and that both that copyright notice and
.\" this permission notice appear in supporting documentation,
.\" and that the names of M.I.T. and the M.I.T. S.I.P.B. not be
.\" used in advertising or publicity pertaining to distribution
.\" of the software without specific, written prior permission.
.\" M.I.T. and the M.I.T. S.I.P.B. make no representations about
.\" the suitability of this software for any purpose.  It is
.\" provided "as is" without express or implied warranty.
.\"
.Dd January 24, 2003
.Dt NEWSYSLOG 8
.Os
.Sh NAME
.Nm newsyslog
.Nd maintain system log files to manageable sizes
.Sh SYNOPSIS
.Nm newsyslog
.Op Fl Fmnrv
.Op Fl a Ar directory
.Op Fl f Ar config_file
.Op Ar log ...
.Sh DESCRIPTION
.Nm
is a program that should be scheduled to run periodically by
.Xr cron 8 .
When it is executed it archives log files if necessary.
If a log file is determined to require archiving,
.Nm
rearranges the files so that
.Pa logfile
is empty,
.Pa logfile.0
has
the last period's logs in it,
.Pa logfile.1
has the next to last
period's logs in it, and so on, up to a user-specified number of
archived logs.
Optionally the archived logs can be compressed to save space.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl F
Force
.Nm
to trim logs regardless of the size and/or age requirements specified in
.Pa /etc/newsyslog.conf .
This option may be combined with the
.Fl n
or
.Fl v
flags to aid in debugging problems with
.Pa /etc/newsyslog.conf .
.It Fl m
Monitoring mode; only entries marked with an
.Sq M
in flags are processed.
For each log file being monitored, any log output since the last time 
.Nm
was run with the
.Fl m
flag is mailed to the user listed in the monitor notification section.
.It Fl n
Do not trim the logs, but instead print out what would be done if this option
were not specified.
.It Fl r
Removes the restriction that
.Nm
must be running as root.
Of course,
.Nm
will not be able to send a
.Dv SIGHUP
signal to
.Xr syslogd 8 ,
so this option should only be used in debugging.
.It Fl v
Be verbose.
In this mode it will print out each log and its
reasons for either trimming that log or skipping it.
.It Fl a Ar directory
Specify a
.Ar directory
into which archived log files will be written.
If
.Ar directory
is a relative path, it is it is appended to the parent directory
of each log and the archived log is stored in the result.
If an absolute path is given, all archived logs are stored in the given
.Ar directory .
If
.Ar directory
does not exist for a specified log, it is ignored for that entry and
the log is rotated as if the
.Fl a
option was not specified.
.It Fl f Ar config_file
Use
.Ar config_file
instead of
.Pa /etc/newsyslog.conf
for the configuration file.
.El
.Pp
If one or more
.Ar log
files are specified on the command line, only the specified logs will
be rotated.
Note that each
.Ar log
specified must have an entry in
.Pa /etc/newsyslog.conf .
.Pp
A log can be archived because of two reasons.
The log file can have
grown bigger than a preset size in kilobytes, or a preset number of
hours may have elapsed since the last log archive.
The granularity of
.Nm
is dependent on how often it is scheduled to run in
.Xr cron 8 .
Since the program is quite fast, it may be scheduled to run every hour
without any ill effects.
.Pp
When starting up,
.Nm
reads in a configuration file to determine which logs should be looked
at.
By default, this configuration file is
.Pa /etc/newsyslog.conf .
Each line of the file contains information about a particular log file
that should be handled by
.Nm newsyslog .
Each line has five mandatory fields and up to three optional fields, with a
whitespace separating each field.
Blank lines or lines beginning with a hash mark
.Pq Ql #
are ignored.
The fields of the configuration file are as
follows:
.Bl -tag -width XXXXXXXXXXXXXXXX
.It logfile name
The full pathname of the system log file to be archived.
.It owner.group of archives (optional)
Specify an ownership and group for the archive file.
The
.Ql \&.
is essential, even if the
.Ar owner
or
.Ar group
field is left blank.
The fields may be numeric, or a name which is looked up
in the system password and group databases.
.It mode of logfile & archives
Octal mode of created log files and archives.
.It number of archives
Specify the number of archives to be kept besides the log file itself.
.It size of archives
When the size of the log file (in kilobytes) reaches this point, the log
file is trimmed as described above.
If this field is replaced by a
.Ql * ,
then the size of
the log file is not taken into account when determining when to trim the
log file.
By default, files smaller than 512 bytes are not rotated unless the
.Sq B
(binary) flag is set.
This prevents
.Nm
from rotating files consisting solely of a message indicating
that the log file has been turned over.
.It archive interval
Specify the time separation between the trimming of the log file.
If this field is replaced by a
.Ql * ,
the number of hours since the last time the
log was trimmed will not be taken into consideration.
.It flags (optional)
The
.Ar flags
field specifies if the archives should have any special processing
done to the archived log files.
The
.Sq Z
flag will make the archive
files compressed to save space using
.Xr gzip 1
or
.Xr compress 1 ,
depending on compilation options.
The
.Sq B
flag means that the file is a
binary file, and so the ASCII message which
.Nm
inserts to indicate the fact that the logs have been turned over
should not be included.
The
.Sq M
flag marks this entry as a monitored
log file.
The
.Sq F
flag specifies that symbolic links should be followed.
.It monitor notification (only used with the `M' flag)
Specify the username (or email address) that should receive notification
messages if this is a monitored log file.
Notification messages are sent as email; the operator
deserves what they get if they mark the
.Xr sendmail 8
log file as monitored.
.It pid file (optional)
Specify a file containing the PID of a process to send a
.Dv SIGHUP
signal to instead of
.Pa /var/run/syslog.pid .
.It signal (optional)
Specify the signal to send to the process instead of
.Dv SIGHUP .
Signal names
must start with
.Dq SIG
and be the signal name, not the number, e.g.,
.Dv SIGUSR1 .
.It command (optional)
Specify a command to run instead of sending a signal to the process.
The command must be enclosed in double quotes
.Pq Ql \&" .
The empty string,
.Ql \&"\&" ,
can use used to prevent
.Nm
from sending a signal or running a command.
You cannot specify both a command and a PID file.
.Em NOTE:
If you specify a command to be run,
.Nm
will not send a
.Dv SIGHUP to
.Xr syslogd 8 .
.El
.Sh FILES
.Bl -tag -width /etc/newsyslog.conf
.It Pa /etc/newsyslog.conf
default configuration file
.El
.Sh SEE ALSO
.Xr compress 1 ,
.Xr gzip 1 ,
.Xr syslog 3 ,
.Xr syslogd 8
.Sh AUTHORS
.Bd -unfilled
Theodore Ts'o, MIT Project Athena
Copyright 1987, Massachusetts Institute of Technology
.Ed
