openbsd/src/usr.bin/cdio/cdio.1
.\" $OpenBSD: cdio.1,v 1.13 1998/09/23 04:32:36 aaron Exp $
.Dd July 3, 1995
.Dt CDIO 1
.Os OpenBSD 2.0
.Sh NAME
.Nm cdio
.Nd compact disc control utility
.Sh SYNOPSIS
.Nm cdio
.Op Fl s
.Op Fl v
.Op Fl f Ar device
.Op Ar command args ...
.Sh DESCRIPTION
The
.Nm cdio
program controls audio features of a CD drive. The
.Ar device
is a name such
as ``cd0'', ``acd0'', or ``mcd0''. 
.Pp
If a
.Ar device
is not specified, the environment variable 
.Ev DISC
will be used to find the CD device.
.Pp
If no command is given,
.Nm cdio
enters an interactive mode, reading commands from the standard input.
.Pp
The following options are available:
.Bl -tag -width flag
.It Fl s
Silent mode. Do not print table headers or human-readable comments.
.It Fl v
Verbose mode. Print as much information as possible.
.It Fl f Ar device
Specifies a device name such as
.Pa /dev/rcd0d
or
.Pa mcd0 .
Both absolute and relative paths to
.Pa /dev
filenames are possible.
The raw partition name is added if needed.
.El
.Pp
The available commands are listed below.  Only as many
characters as are required to uniquely identify a command
need be specified. The word
.Cm play
may be omitted.
.Bl -tag -width Cm
.It Cm play Ar first_track Op Ar last_track
Play from track 
.Nm first_track
to track
.Nm last_track. 
The first track has number 1 and may be omitted in all cases.
.It Cm play Ar start_m:start_s.start_f Op Ar end_m:end_s.end_f
Play from the absolute address
(MSF) defined by 
.Ar start_m
in minutes, 
.Ar start_s,
in seconds and 
.Ar start_f
(frame number) to the absolute address defined by
.Ar end_m
in minutes, 
.Ar end_s,
in seconds and 
.Ar end_f
(frame number). Minutes are in the range 0-99. Seconds are in the range 0-59.
Frame numbers are in the range 0-74.
.It Cm play Op Ar #start_block Op length
Play starting from the logical block
.Ar start_block
using
.Ar length
logical blocks.
.It Cm pause
Stop playing. Do not stop the disc.
.It Cm next
Play the next track. If we're at the last track, stop.
.It Cm previous
Play the previous track. If we're at the first track, restart.
.It Cm replay
Replay the current track again.
.It Cm resume
Resume playing. Used after the
.Nm pause
command.
.It Cm stop
Stop the disc.
.It Cm eject
Eject the disc.
.It Cm close
Inject the disc.
.It Cm volume Ar left_channel Ar right_channel
Set the volume of the left channel to 
.Ar left_channel
and the volume of the right channel to 
.Ar right_channel . 
Allowed values are in the range 0-255. 
.It Cm volume Ar mute
Turn the sound off.
.It Cm volume Ar mono
Set the mono mode.
.It Cm volume Ar stereo
Set the stereo mode.
.It Cm volume Ar left
Play the left subtrack on both left and right channels.
.It Cm volume Ar right
Play the right subtrack on both left and right channels.
.It Cm info
Print the table of contents.
.It Cm status
Print information about the disc:
the current playing status and position,
the current media catalog status,
the current values of the volume for left and right channels.
.It Cm help
Print the list of available commands.
.It Cm debug Ar on
Enable the debugging mode of the CD device driver.
.It Cm debug Ar off
Disable the driver debugging mode.
.It Cm device Ar devname
Make
.Ar devname
the current CD device.  This is the equivalent of quitting
.Nm
and restarting with a different device.
.It Cm reset
Perform the hardware reset of the device.
.It Cm set Ar msf
Set minute-second-frame ioctl mode (default).
.It Cm set Ar lba
Set LBA ioctl mode.
.It Cm quit
Quit the program.
.Sh FILES
.Bl -tag -width /dev/rmcd0c -compact
.It Pa /dev/rcd0c
.It Pa /dev/racd0c
.It Pa /dev/rmcd0c
.El
.Sh AUTHORS
Jean-Marc Zucconi,
Andrey A.\ Chernov,
Serge V.\ Vakulenko
.Sh HISTORY
The
.Nm cdio
command is based on
.Nm cdcontrol ,
which first appeared in FreeBSD 2.1.
