openbsd/src/sys/arch/aviion/stand/installboot/installboot.8
.\"	$OpenBSD: installboot.8,v 1.2 2013/09/29 21:30:49 jmc Exp $
.\"
.\" Copyright (c) 1994 Paul Kranenburg
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Paul Kranenburg.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: September 29 2013 $
.Dt INSTALLBOOT 8 aviion
.Os
.Sh NAME
.Nm installboot
.Nd install a bootstrap on a disk
.Sh SYNOPSIS
.Nm installboot
.Op Fl nv
.Ar boot
.Ar rawdev
.Sh DESCRIPTION
.Nm installboot
is used to install a boot program into the VDM boot area of a disk.
.Pp
The options are as follows:
.Bl -tag -width flag
.It Fl n
Do not actually write anything on the disk.
.It Fl v
Be verbose, printing out boot area and boot file information.
.El
.Pp
The arguments are:
.Bl -tag -width rawdev
.It Ar boot
The name of the boot program to be installed.
.It Ar rawdev
The name of the raw disk device in which the boot program is to be installed.
It may be abbreviated into a form recognizable by
.Xr opendev 3 .
.El
.Sh EXAMPLES
.Bd -literal
# /usr/mdec/installboot /usr/mdec/boot sd0
.Ed
.Sh SEE ALSO
.Xr disklabel 8 ,
.Xr init 8
