openbsd/src/share/man/man4/man4.pc532/lpt.4
.\"	$NetBSD: lpt.4,v 1.2 1995/11/28 08:03:29 jtc Exp $
.\"
.\" Copyright (c) 1994 Matthias Pfaller.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	 This product includes software developed by Matthias Pfaller.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$Id: lpt.4,v 1.3 1996/10/08 01:20:48 michaels Exp $
.\"
.Dd December 1, 1994
.Dt LPT 4 pc532
.Os
.Sh NAME
.Nm lpt
.Nd Parallel port driver
.Sh SYNOPSIS
.Cd "lpt0 at membus? addr ? irq ?"
.Cd "lpt1 at membus? addr ? irq ?"
.Sh DESCRIPTION
This driver provides access to centronics ports. Bit 6 in the minor number
selects wether to omit pulling /PRIME low on opens or not. If the minor has
bit 5 set, AUTOLINEFEED will be asserted when transfering data to the printer.
Addr and Irq default to 0xffc80030,7 for lpt0 and to 0xffc80034,6 for lpt1. 
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/lpt0
first parallel port device
.It Pa /dev/lpt1
second parallel port device
.El
.Sh DIAGNOSTICS
.Bl -diag
.It "lpt?: out of paper"
The printer asserted the
.Em Paper Empty
signal.
.It "lpt?: offline"
The printer did not assert the
.Em Select
signal.
.It "lpt?: output error"
The printer asserted the
.Em /Error
signal.
.It "lpt?: NACK low"
The printer didn't release the
.Em /Ack
signal.
.It "lpt?: NBUSY low"
The printer didn't release the
.Em Busy
signal.
.El
.Sh SEE ALSO
.Xr plip 4
.sp
Contact Matthias Pfaller (leo@dachau.marco.de) to get instructions on building
a centronics interface for your PC532.
