openbsd/src/share/man/man4/man4.pc532/plip.4
.\"	$NetBSD: plip.4,v 1.2 1995/06/27 18:11:07 phil Exp $
.\"
.\" Copyright (c) 1994 Matthias Pfaller.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	 This product includes software developed by Matthias Pfaller.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd December 1, 1994
.Dt PLIP 4 pc532
.Os NetBSD 1.0
.Sh NAME
.Nm plip
.Nd "Option for the lpt driver to allow IP over centronics ports"
.Sh SYNOPSIS
.Cd "options PLIP"
.Cd "options COMPAT_PLIP10"
.Sh DESCRIPTION
The
.Nm
interface provides a way to transport IP over centronics ports.
Protocols to communicate with Linux 1.0 and Linux 1.1 hosts are provided.
By default the 1.1 protocol is used. To choose the 1.0 protocol use
the link0 flag with
.Xr ifconfig 8
or in your /etc/hostname.plip? file. In order to use the 1.0 protocol
the kernel has to be compiled with COMPAT_PLIP10.
.Sh NOTES
To connect two computers a "Laplink parallel cabel" is used:
.sp
.TS
allbox tab(|);
c|c|c|c
l|n|n|l.
Signalname|Con A|Con B|Description
Data 0|2|15|Data out 0
Data 1|3|13|Data out 1
Data 2|4|12|Data out 2
Data 3|5|10|Data out 3/Wake out
Data 4|6|11|Data clock out
/Ack|10|5|Data in 3/Wake in
Busy|11|6|Data clock in
No Paper|12|4|Data in 2
Select|13|3|Data in 1
/Error|15|2|Data in 0
Gnd|18-25|18-25|Ground
.TE
.sp
In both protocol versions ethernet frames are used. The 1.0 protocol assings
an ethernet address of the form FD:FD:ww:xx:yy:zz to the interface. The 1.1
protocol uses FC instead of FD. ww, xx, yy and zz are taken from the internet
address ww.xx.yy.zz of the interface. Ethernet support has
to be configured into the kernel in order to use the
.Nm
interface.
.Sh SEE ALSO
.Xr lpt 4
.Xr ifconfig 8
.Sh DIAGNOSTICS
.Bl -diag
.It "plip?: tx hard error"
Packet transmission failed even after PLIPMXRETRY (20) retries.
.It "plip?: rx hard error"
PLIPMXERRS (20) packets caused receive errors in sequence.
.It "plip?: checksum error"
A packet with a bad checksum was received.
.It "plip?: packet > MTU"
A bogus packet longer then MTU was received.
.El
