openbsd/src/sbin/sysctl/sysctl.8
.\"	$OpenBSD: sysctl.8,v 1.77 2002/02/11 18:43:51 mpech Exp $
.\"	$NetBSD: sysctl.8,v 1.4 1995/09/30 07:12:49 thorpej Exp $
.\"
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)sysctl.8	8.2 (Berkeley) 5/9/95
.\"
.Dd May 9, 1995
.Dt SYSCTL 8
.Os
.Sh NAME
.Nm sysctl
.Nd get or set kernel state
.Sh SYNOPSIS
.Nm sysctl
.Op Fl n
.Ar name ...
.Nm sysctl
.Op Fl n
.Fl w
.Ar name=value ...
.Nm sysctl
.Op Fl n
.Fl aA
.Sh DESCRIPTION
The
.Nm
utility retrieves kernel state and allows processes with
appropriate privilege to set kernel state.
The state to be retrieved or set is described using a
``Management Information Base'' (``MIB'') style name,
described as a dotted set of components.
.Pp
The options are as follows:
.Bl -tag -width xxx
.It Fl a
list all the currently available string or integer values.
.It Fl A
list all the known MIB names including tables.
Those with string or integer values will be printed as with the
.Fl a
flag; for the table values, the name of the utility to retrieve them is given.
.It Fl n
suppress printing of the field name, only output the field value.
Useful for setting shell variables.
For example:
.Bd -literal -offset indent -compact
# set psize=`sysctl -n hw.pagesize`
.Ed
.Pp
If just a MIB style name is given,
the corresponding value is retrieved.
.It Fl w
required to set a variable.
The MIB name should be followed by an equal sign and the new value.
.El
.Pp
The information available from
.Nm
consists of integers, strings, and tables.
The tabular information can only be retrieved by special
purpose programs such as
.Nm ps ,
.Nm systat ,
and
.Nm netstat .
The string and integer information is summarized below.
For a detailed description of these variable see
.Xr sysctl 3 .
The changeable column indicates whether a process with appropriate
privilege can change the value.
.Bl -column net.inet.ip.ipsec-expire-acquirexxxx integerxxx
.It Sy Name	Type	Changeable
.It kern.ostype	string	no
.It kern.osrelease	string	no
.It kern.osrevision	integer	no
.It kern.osversion	string	no
.It kern.version	string	no
.It kern.maxvnodes	integer	yes
.It kern.maxproc	integer	yes
.It kern.maxfiles	integer	yes
.It kern.maxpartitions	integer	no
.It kern.rawpartition	integer	no
.It kern.argmax	integer	no
.It kern.securelevel	integer	raise only
.It kern.hostname	string	yes
.It kern.domainname	string	yes
.It kern.hostid	u_int	yes
.It kern.clockrate	struct	no
.It kern.posix1version	integer	no
.It kern.ngroups	integer	no
.It kern.job_control	integer	no
.It kern.saved_ids	integer	no
.It kern.boottime	struct	no
.It kern.ntptime	struct	no
.It kern.cp_time	struct	no
.It kern.nchstats	struct	no
.It kern.forkstat	struct	no
.It kern.somaxconn	integer	yes
.It kern.sominconn	integer	yes
.It kern.usermount	integer	yes
.It kern.random	struct	no
.It kern.nosuidcoredump	integer	yes
.It kern.fsync	integer	no
.It kern.sysvmsg	integer	no
.It kern.sysvsem	integer	no
.It kern.sysvshm	integer	no
.It kern.arandom	u_int	no
.It kern.msgbufsize	integer	no
.It kern.nselcoll	integer	no
.It kern.malloc.buckets	string	no
.It kern.malloc.bucket.<sz>	string	no
.It kern.malloc.kmemnames	string	no
.It kern.malloc.kmemstat.<name>	string	no
.It kern.tty.tk_nin	int64_t	no
.It kern.tty.tk_nout	int64_t	no
.It kern.tty.tk_rawcc	int64_t	no
.It kern.tty.tk_cancc	int64_t	no
.It kern.fscale	int	no
.It kern.ccpu	u_int	no
.It kern.nprocs	int	no
.It kern.stackgap_random	int	yes
.It vm.loadavg	struct	no
.It vm.psstrings	struct	no
.It vm.swapencrypt.enable	integer	yes
.It vm.swapencrypt.keyscreated	integer	no
.It vm.swapencrypt.keysdeleted	integer	no
.It vm.uvmexp	struct	no
.It vm.vmmeter	struct	no
.It fs.posix.setuid	integer	yes
.It net.inet.ip.forwarding	integer	yes
.It net.inet.ip.redirect	integer	yes
.It net.inet.ip.ttl	integer	yes
.\" .It net.inet.ip.mtu	integer	yes
.It net.inet.ip.sourceroute	integer	yes
.It net.inet.ip.directed-broadcast	integer	yes
.It net.inet.ip.portfirst	integer	yes
.It net.inet.ip.portlast	integer	yes
.It net.inet.ip.porthifirst	integer	yes
.It net.inet.ip.porthilast	integer	yes
.It net.inet.ip.maxqueue	integer	yes
.It net.inet.ip.encdebug	integer	yes
.It net.inet.ip.ipsec-pfs	integer	yes
.It net.inet.ip.ipsec-soft-allocs	integer	yes
.It net.inet.ip.ipsec-allocs	integer	yes
.It net.inet.ip.ipsec-soft-bytes	integer	yes
.It net.inet.ip.ipsec-bytes	integer	yes
.It net.inet.ip.ipsec-timeout	integer	yes
.It net.inet.ip.ipsec-soft-timeout	integer	yes
.It net.inet.ip.ipsec-soft-firstuse	integer	yes
.It net.inet.ip.ipsec-firstuse	integer	yes
.It net.inet.ip.ipsec-enc-alg	string	yes
.It net.inet.ip.ipsec-auth-alg	string	yes
.It net.inet.ip.ipsec-comp-alg	string	yes
.It net.inet.ip.ipsec-expire-acquire	integer	yes
.It net.inet.ip.ipsec-invalid-life	integer	yes
.It net.inet.ip.mtudisc	integer	yes
.It net.inet.ip.mtudisctimeout	integer	yes
.It net.inet.icmp.maskrepl	integer	yes
.It net.inet.icmp.bmcastecho	integer	yes
.It net.inet.icmp.errppslimit	integer	yes
.It net.inet.icmp.rediraccept	integer	yes
.It net.inet.icmp.redirtimeout	integer	yes
.It net.inet.ipip.allow	integer	yes
.It net.inet.etherip.allow	integer	yes
.It net.inet.tcp.rfc1323	integer	yes
.It net.inet.tcp.keepinittime	integer	yes
.It net.inet.tcp.keepidle	integer	yes
.It net.inet.tcp.keepintvl	integer	yes
.It net.inet.tcp.slowhz	integer	no
.It net.inet.tcp.baddynamic	array	yes
.It net.inet.tcp.recvspace	integer	yes
.It net.inet.tcp.sendspace	integer	yes
.It net.inet.tcp.sack	integer	yes
.It net.inet.tcp.mssdflt	integer	yes
.It net.inet.tcp.rstppslimit	integer	yes
.It net.inet.udp.checksum	integer	yes
.It net.inet.udp.baddynamic	array	yes
.It net.inet.udp.recvspace	integer	yes
.It net.inet.udp.sendspace	integer	yes
.It net.inet.esp.enable	integer	yes
.It net.inet.ah.enable	integer	yes
.It net.inet.ipcomp.enable integer yes
.It net.inet.gre.allow	integer	yes
.It net.inet.mobileip.allow	integer	yes
.It net.inet6.ip6.forwarding	integer	yes
.It net.inet6.ip6.redirect	integer	yes
.It net.inet6.ip6.hlim	integer	yes
.It net.inet6.ip6.maxfragpackets	integer	yes
.It net.inet6.ip6.accept_rtadv	integer	yes
.It net.inet6.ip6.keepfaith	integer	yes
.It net.inet6.ip6.log_interval	integer	yes
.It net.inet6.ip6.hdrnestlimit	integer	yes
.It net.inet6.ip6.dad_count	integer	yes
.It net.inet6.ip6.auto_flowlabel	integer	yes
.It net.inet6.ip6.defmcasthlim	integer	yes
.It net.inet6.ip6.kame_version	string	no
.It net.inet6.ip6.use_deprecated	integer	yes
.It net.inet6.ip6.rr_prune	integer	yes
.It net.inet6.icmp6.rediraccept	integer	yes
.It net.inet6.icmp6.redirtimeout	integer	yes
.It net.inet6.icmp6.nd6_prune	integer	yes
.It net.inet6.icmp6.nd6_delay	integer	yes
.It net.inet6.icmp6.nd6_umaxtries	integer	yes
.It net.inet6.icmp6.nd6_mmaxtries	integer	yes
.It net.inet6.icmp6.nd6_useloopback	integer	yes
.It net.inet6.icmp6.nodeinfo	integer	yes
.It net.inet6.icmp6.errppslimit	integer	yes
.It net.inet6.icmp6.nd6_maxnudhint	integer	yes
.It net.inet6.icmp6.mtudisc_hiwat	integer	yes
.It net.inet6.icmp6.mtudisc_lowat	integer	yes
.It net.inet6.icmp6.nd6_debug	integer	yes
.It net.ipx.ipx.checksum	integer	yes
.It net.ipx.ipx.forwarding	integer	yes
.It net.ipx.ipx.netbios	integer	yes
.It net.ipx.ipx.recvspace	integer	yes
.It net.ipx.ipx.sendspace	integer	yes
.It debug.syncprt	integer	yes
.It debug.busyprt	integer	yes
.It debug.doclusterread	integer	yes
.It debug.doclusterwrite	integer	yes
.It debug.doreallocblks	integer	yes
.It debug.doasyncfree	integer	yes
.It debug.prtrealloc	integer	yes
.It hw.machine	string	no
.It hw.model	string	no
.It hw.ncpu	integer	no
.It hw.byteorder	integer	no
.It hw.physmem	integer	no
.It hw.usermem	integer	no
.It hw.pagesize	integer	no
.It hw.diskstats	struct	no
.It hw.disknames	string	no
.It hw.diskcount	integer	no
.It machdep.console_device	dev_t	no
.It machdep.unaligned_print	integer	yes (alpha only)
.It machdep.unaligned_fix	integer	yes (alpha only)
.It machdep.unaligned_sigbus	integer	yes (alpha only)
.It machdep.apmwarn	integer	yes (i386 only)
.It machdep.apmhalt	integer	yes (i386 only)
.It machdep.kbdreset	integer	yes (i386 only)
.It machdep.allowaperture	integer	yes (i386 only, XFree86)
.It machdep.led_blink	integer	yes (sparc/sparc64)
.It machdep.vsyncblank	integer	yes (sparc only)
.It user.cs_path	string	no
.It user.bc_base_max	integer	no
.It user.bc_dim_max	integer	no
.It user.bc_scale_max	integer	no
.It user.bc_string_max	integer	no
.It user.coll_weights_max	integer	no
.It user.expr_nest_max	integer	no
.It user.line_max	integer	no
.It user.re_dup_max	integer	no
.It user.posix2_version	integer	no
.It user.posix2_c_bind	integer	no
.It user.posix2_c_dev	integer	no
.It user.posix2_char_term	integer	no
.It user.posix2_fort_dev	integer	no
.It user.posix2_fort_run	integer	no
.It user.posix2_localedef	integer	no
.It user.posix2_sw_dev	integer	no
.It user.posix2_upe	integer	no
.It user.stream_max	integer	no
.It user.tzname_max	integer	no
.It ddb.radix	integer	yes
.It ddb.max_width	integer	yes
.It ddb.max_line	integer	yes
.It ddb.tab_stop_width	integer	yes
.It ddb.panic	integer	yes
.It ddb.console	integer	yes
.It vfs.mounts.*	struct	no
.It vfs.ffs.doasyncfree	integer	yes
.It vfs.ffs.doclusterread	integer	yes
.It vfs.ffs.doclusterwrite	integer	yes
.It vfs.ffs.doreallocblks	integer	yes
.It vfs.nfs.iothreads	integer	yes
.El
.Pp
The
.Nm
program can get or set debugging variables
that have been identified for its display.
This information can be obtained by using the command:
.Bd -literal -offset indent
sysctl debug
.Ed
In addition,
.Nm
can extract information about the filesystems that have been compiled
into the running system.
This information can be obtained by using the command:
.Bd -literal -offset indent
sysctl vfs.mounts
.Ed
By default, only filesystems that are actively being used are listed.
Use of the
.Fl A
flag lists all the filesystems compiled into the running kernel.
.Sh EXAMPLES
For example, to retrieve the maximum number of processes allowed
in the system, one would use the follow request:
.Bd -literal -offset indent -compact
$ sysctl kern.maxproc
.Ed
.Pp
To set the maximum number of processes allowed
in the system to 1000, one would use the follow request:
.Bd -literal -offset indent -compact
# sysctl -w kern.maxproc=1000
.Ed
.Pp
Information about the system clock rate may be obtained with:
.Bd -literal -offset indent -compact
$ sysctl kern.clockrate
.Ed
.Pp
Information about the load average history may be obtained with
.Bd -literal -offset indent -compact
$ sysctl vm.loadavg
.Ed
.Pp
To make the
.Xr chown 2
system call use traditional BSD semantics (don't clear setuid/setgid bits),
one would do the following:
.Bd -literal -offset indent -compact
# sysctl -w fs.posix.setuid=0
.Ed
.Pp
Set the list of reserved TCP ports that should not be allocated
by the kernel dynamically.
This can be used to keep daemons
from stealing a specific port that another program needs to function.
List elements may be separated by commas and/or whitespace.
.Bd -literal -offset indent -compact
# sysctl -w net.inet.tcp.baddynamic=749,750,751,760,761,871
.Ed
.Pp
It is also possible to add or remove ports from the current list.
.Bd -literal -offset indent -compact
# sysctl -w net.inet.tcp.baddynamic=+748
# sysctl -w net.inet.tcp.baddynamic=-871
.Ed
.Pp
To adjust the number of kernel
.Nm nfsio
threads used to service asynchronous
I/O requests on an NFS client machine use
.Bd -literal -offset indent -compact
# sysctl -w vfs.nfs.iothreads=4
.Ed
.Pp
The number of 4 is the default, where the 20 is the maximum.
See
.Xr nfssvc 2
and
.Xr nfsd 8
for futher discussion.
.Sh FILES
.Bl -tag -width <ufs/ffs/ffs_extern.h> -compact
.It Pa <sys/sysctl.h>
definitions for top level identifiers, second level kernel and hardware
identifiers, and user level identifiers
.It Pa <dev/rndvar.h>
definitions for
.Xr random 4
device's statistics structure
.It Pa <sys/socket.h>
definitions for second level network identifiers
.It Pa <sys/gmon.h>
definitions for third level profiling identifiers
.It Pa <uvm/uvm_param.h>
definitions for second level virtual memory identifiers
.It Pa <uvm/uvm_swap_encrypt.h>
definitions for third level virtual memory identifiers
.It Pa <netinet/in.h>
definitions for third level IPv4/v6 identifiers and
fourth level IPv4/v6 identifiers
.It Pa <netinet/icmp_var.h>
definitions for fourth level ICMP identifiers
.It Pa <netinet6/icmp6.h>
definitions for fourth level ICMPv6 identifiers
.It Pa <netinet/tcp_var.h>
definitions for fourth level TCP identifiers
.It Pa <netinet/udp_var.h>
definitions for fourth level UDP identifiers
.It Pa <netipx/ipx_var.h>
definitions for third level IPX identifiers and
fourth level IPX identifiers
.It Pa <ddb/db_var.h>
definitions for second level ddb identifiers
.It Pa <sys/mount.h>
definitions for second level vfs identifiers
.It Pa <nfs/nfs.h>
definitions for third level NFS identifiers
.It Pa <ufs/ffs/ffs_extern.h>
definitions for third level FFS identifiers
.El
.Sh SEE ALSO
.Xr sysctl 3 ,
.Xr sysctl.conf 5
.Sh HISTORY
.Nm sysctl
first appeared in
.Bx 4.4 .
