openbsd/src/usr.sbin/traceroute6/traceroute6.8
.\"	$OpenBSD: traceroute6.8,v 1.14 2012/02/10 22:50:48 sthen Exp $
.\"	$KAME: traceroute6.8,v 1.9 2002/08/30 03:56:20 onoe Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: February 10 2012 $
.Dt TRACEROUTE6 8
.Os
.\"
.Sh NAME
.Nm traceroute6
.Nd print the route IPv6 packets take to network host
.\"
.Sh SYNOPSIS
.Nm traceroute6
.Op Fl AdIlnrv
.Op Fl f Ar firsthop
.Op Fl g Ar gateway
.Op Fl m Ar hoplimit
.Op Fl p Ar port
.Op Fl q Ar probes
.Op Fl s Ar src
.Op Fl w Ar waittime
.Ar host
.Op Ar datalen
.\"
.Sh DESCRIPTION
The
.Nm
utility details the route IPv6 packets take to reach a network host.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl A
Look up the AS number for each hop address.
Uses the DNS service described at
http://www.team-cymru.org/Services/ip-to-asn.html.
.It Fl d
Debug mode.
.It Fl f Ar firsthop
Specify how many hops to skip.
.It Fl g Ar gateway
Specify an intermediate gateway
.Po
.Nm
uses a routing header
.Pc .
.It Fl I
Use ICMP6 ECHO instead of UDP datagrams.
.It Fl l
Print both host hostnames and numeric addresses.
Normally
.Nm
prints only hostnames if
.Fl n
is not specified, and only numeric addresses if
.Fl n
is specified.
.It Fl m Ar hoplimit
Specify a maximum hoplimit.
.It Fl n
Do not resolve numeric addresses.
.It Fl p Ar port
Set UDP port number to
.Ar port .
.It Fl q Ar probes
Set the number of probes per hop count to
.Ar probes .
.It Fl r
Bypass the normal routing tables and send directly to a host on an attached
network.
If the host is not on a directly attached network,
an error is returned.
This option corresponds to the
.Dv SO_DONTROUTE
socket option;
it can be used to ping a local host through an interface
that has no route through it
(e.g. after the interface was dropped by a routing daemon).
.It Fl s Ar src
Specify the source IPv6 address to be used.
.It Fl v
Be verbose.
.It Fl w Ar waittime
Specify the time delay between probes.
.El
.Sh EXIT STATUS
.Ex -std traceroute6
.\"
.Sh SEE ALSO
.Xr netstat 1 ,
.Xr ping 8 ,
.Xr ping6 8 ,
.Xr traceroute 8
.\"
.Sh HISTORY
The
.Nm
command first appeared in the WIDE Hydrangea IPv6 protocol stack kit.
