openbsd/src/usr.sbin/traceroute6/traceroute6.8
.\"	$OpenBSD: traceroute6.8,v 1.23 2014/04/18 16:48:19 florian Exp $
.\"	$KAME: traceroute6.8,v 1.9 2002/08/30 03:56:20 onoe Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: April 18 2014 $
.Dt TRACEROUTE6 8
.Os
.\"
.Sh NAME
.Nm traceroute6
.Nd print the route IPv6 packets take to network host
.\"
.Sh SYNOPSIS
.Nm traceroute6
.Op Fl AcDdIlnSv
.Op Fl f Ar firsthop
.Op Fl m Ar hoplimit
.Op Fl p Ar port
.Op Fl q Ar probes
.Op Fl s Ar src
.Op Fl V Ar rtable
.Op Fl w Ar waittime
.Ar host
.Op Ar datalen
.\"
.Sh DESCRIPTION
The
.Nm
utility details the route IPv6 packets take to reach a network host.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl A
Look up the AS number for each hop address.
Uses the DNS service described at
.Lk http://www.team-cymru.org/Services/ip-to-asn.html .
.It Fl c
Do not increment the destination port number in successive UDP packets.
Rather, all UDP packets will have the same destination port, as set via the
.Fl p
flag (or 33434 if none is specified).
.It Fl D
Dump the packet data to standard error before transmitting it.
.It Fl d
Debug mode.
.It Fl f Ar firsthop
Specify how many hops to skip.
.It Fl I
Use ICMP6 ECHO instead of UDP datagrams.
.It Fl l
Display the hop limit value of the returned packet.
This is useful for checking for asymmetric routing.
.It Fl m Ar hoplimit
Specify a maximum hoplimit.
.It Fl n
Do not resolve numeric addresses.
.It Fl p Ar port
Set UDP port number to
.Ar port .
.It Fl q Ar probes
Set the number of probes per hop count to
.Ar probes .
.It Fl S
Print how many probes were not answered for each hop.
.It Fl s Ar src
Specify the source IPv6 address to be used.
.It Fl v
Be verbose.
.It Fl V Ar rtable
Set the routing table to be used.
.It Fl w Ar waittime
Specify the time delay between probes.
.El
.Sh EXIT STATUS
.Ex -std traceroute6
.\"
.Sh SEE ALSO
.Xr netstat 1 ,
.Xr ping 8 ,
.Xr ping6 8 ,
.Xr traceroute 8
.\"
.Sh HISTORY
The
.Nm
command first appeared in the WIDE Hydrangea IPv6 protocol stack kit.
