openbsd/src/libexec/login_token/login_token.8
.\"	$OpenBSD: login_token.8,v 1.7 2002/07/16 12:38:40 jufi Exp $
.\"
.\" Copyright (c) 1995 Migration Associates Corporation. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Berkeley Software Design,
.\"	Inc.
.\" 4. The name of Berkeley Software Design, Inc.  may not be used to endorse
.\"    or promote products derived from this software without specific prior
.\"    written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY BERKELEY SOFTWARE DESIGN, INC. ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL BERKELEY SOFTWARE DESIGN, INC. BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd September 26, 1995
.Dt LOGIN_TOKEN 8
.Os
.Sh NAME
.Nm login_activ , login_crypto , login_snk
.Nd provide ActivCard, CRYPTOCard and SNK-004 authentication
.Sh SYNOPSIS
.Nm login_token
.Op Fl s Ar service
.Op Fl v Ar name=value
.Ar user
.Op Ar class
.Sh DESCRIPTION
The
.Nm login_token
program implements a X9.9 token card challenge response authentication
mechanism (see
.Xr login.conf 5 ) .
It must be invoked by one of the names:
.Nm login_activ , login_crypto ,
or
.Nm login_snk .
.Pp
Available options are:
.Bl -tag -width indent
.It Fl s
Specify the service.
Currently only
.Li challenge ,
.Li login ,
and
.Li response
are supported.
.It Fl v
This option and its value are ignored.
.El
.Pp
.Nm login_token
will look up
.Ar user
in the the appropriate database file, depending on what name it was called as:
.Pa /etc/activ.db ,
.Pa /etc/crypto.db ,
or
.Pa /etc/snk.db .
It then will issue a challenge, and if the user
is able to correctly respond (by using the appropriate token)
the user will be authenticated.
The
.Ar class
argument is unused.
.Sh DIAGNOSTICS
Diagnostic messages are logged via syslog(3) with the LOG_AUTH facility.
.Sh FILES
.Bl -tag -width xetcxcrypto.db
.It Pa /etc/activ.db
data base of information for the ActivCard tokens.
.It Pa /etc/crypto.db
data base of information for the CRYPTOCard tokens.
.It Pa /etc/snk.db
data base of information for the SNK-004 tokens.
.El
.Sh SEE ALSO
.Xr syslog 3 ,
.Xr login.conf 5 ,
.Xr tokenadm 8 ,
.Xr tokeninit 8
.Sh AUTHORS
Jack Flory <jpf@mig.com>
