openbsd/src/share/man/man4/man4.sparc/audioamd.4
.\"     $OpenBSD: audioamd.4,v 1.6 2004/09/30 19:59:27 mickey Exp $
.\"
.\" Copyright (c) 1998 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 12, 1998
.Dt AUDIOAMD 4 sparc
.Os
.Sh NAME
.Nm audioamd
.Nd SPARC telephone quality audio device
.Sh SYNOPSIS
.Cd "audioamd0 at mainbus0 " Pq "sun4c"
.Cd "audioamd0 at obio0    " Pq "sun4m"
.Cd "audioamd0 at sbus0    " Pq "sun4m"
.Cd "audio*  at audioamd?"
.Sh DESCRIPTION
The
.Nm
device uses the
.Tn AMD
AM79C30A
Digital Subscriber Controller
chip to implement the audio device interface described in
.Xr audio 4 .
This device is found onboard on several sun4c and sun4m models.
.Pp
Simultaneous playback and capture are supported by the
.Nm
device.
The
.Nm
has a maximum precision of 8 bits and is monaural on both input and output.
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr audio 4 ,
.Xr intro 4 ,
.Xr sbus 4
