openbsd/src/share/man/man4/man4.sparc/be.4
.\"     $OpenBSD: be.4,v 1.3 1998/09/01 02:45:48 jason Exp $
.\"
.\" Copyright (c) 1998 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jason L. Wright
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, 
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 23, 1998
.Dt BE 4 sparc
.Os
.Sh NAME
.Nm be
.Nd SPARC Fast Ethernet interface
.Sh SYNOPSIS
.Cd "qec* at sbus? slot ? offset ?                 " Pq "sun4c/sun4m"
.Cd "be* at qec?                                   " Pq "sun4c/sun4m"
.Sh DESCRIPTION
The 
.Nm
interface provides access to the 10Mb/s and 100Mb/s (half duplex only)
Ethernet networks.
The 
.Nm 
is found on the Sun 10/100 Mbit Ethernet boards
(Sun part number SUNW,270-2450).
.Pp
Each of the host's network addresses
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm
interface employs the address resolution protocol described in
.Xr arp 4
to dynamically map between Internet and Ethernet addresses on the local
network.
.Pp
When the interface is reset, it begins an autonegotiation procedure.  The
procedure ends when the
.Nm
obtains a link signal from the wire.
.Sh SEE ALSO
.Xr qec 4 ,
.Xr ie 4 ,
.Xr le 4 ,
.Xr intro 4 ,
.Xr inet 4 ,
.Xr arp 4
.Sh HISTORY
.Ox
support for the
.Nm
first appeared in
.Ox 2.4 .
