openbsd/src/share/man/man4/man4.sparc/bwtwo.4
.\"	$OpenBSD: bwtwo.4,v 1.24 2004/09/30 19:59:27 mickey Exp $
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This software was developed by the Computer Systems Engineering group
.\" at Lawrence Berkeley Laboratory under DARPA contract BG 91-66 and
.\" contributed to Berkeley.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: Header: bwtwo.4,v 1.3 94/02/03 20:42:13 leres Exp
.\"     from: @(#)bwtwo.4	8.2 (Berkeley) 2/16/94
.\"
.Dd February 16, 1994
.Dt BWTWO 4 sparc
.Os
.Sh NAME
.Nm bwtwo
.Nd monochromatic frame buffer
.Sh SYNOPSIS
.Cd "bwtwo0 at sbus0                        " Pq "sun4c on-board"
.Cd "bwtwo* at sbus?                        " Pq "sun4c and sun4m"
.Cd "bwtwo0 at obio0 addr 0xfd000000 level 4" Pq sun4/200
.Cd "bwtwo0 at obio0 addr 0xfb300000 level 4" Pq "sun4/300 in P4 slot"
.Cd "bwtwo0 at obio0 addr 0x0b300000 level 4" Pq "sun4/100 in P4 slot"
.Cd "wsdisplay* at bwtwo?"
.Sh DESCRIPTION
The
.Nm
is a black and white frame buffer commonly encountered
as the on-board frame buffer on sun4 and some sun4c class workstations.
It is also available as an SBus card for sun4c and sun4m, or as a P4 bus
card for sun4 workstations.
.Pp
The
.Nm
driver interfaces the frame buffer with the
.Xr wscons 4
console framework.
It does not provide direct device driver entry points
but makes its functions available via the internal
.Xr wsdisplay 4
interface.
.Sh SEE ALSO
.Xr agten 4 ,
.Xr cgeight 4 ,
.Xr cgfour 4 ,
.Xr cgfourteen 4 ,
.Xr cgsix 4 ,
.Xr cgthree 4 ,
.Xr cgtwelve 4 ,
.Xr cgtwo 4 ,
.Xr intro 4 ,
.Xr mgx 4 ,
.Xr pninek 4 ,
.Xr pnozz 4 ,
.Xr rfx 4 ,
.Xr sbus 4 ,
.Xr tcx 4 ,
.Xr tvtwo 4 ,
.Xr vigra 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4 ,
.Xr zx 4
