openbsd/src/share/man/man4/man4.sparc/bwtwo.4
.\"	$OpenBSD: bwtwo.4,v 1.11 2002/07/22 07:01:03 miod Exp $
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This software was developed by the Computer Systems Engineering group
.\" at Lawrence Berkeley Laboratory under DARPA contract BG 91-66 and
.\" contributed to Berkeley.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: Header: bwtwo.4,v 1.3 94/02/03 20:42:13 leres Exp
.\"     from: @(#)bwtwo.4	8.2 (Berkeley) 2/16/94
.\"
.Dd February 16, 1994
.Dt BWTWO 4 sparc
.Os
.Sh NAME
.Nm bwtwo
.Nd monochromatic frame buffer
.Sh SYNOPSIS
.Cd "bwtwo* at sbus? slot ? offset ?" Pq "sun4c and sun4m"
.Cd "bwtwo0 at obio0 addr 0xfd000000 level 4" Pq sun4/200
.Cd "bwtwo0 at obio0 addr 0xfb300000 level 4" Pq "sun4/300 in P4 slot"
.Cd "bwtwo0 at obio0 addr 0x0b300000 level 4" Pq "sun4/100 in P4 slot"
.Sh DESCRIPTION
The
.Nm
is a memory based black and white frame buffer.
It supports the minimal
.Xr ioctl 2 Ns s
needed to run
.Xr X 7 .
.Sh SEE ALSO
.Xr cgeight 4 ,
.Xr cgfour 4 ,
.Xr cgfourteen 4 ,
.Xr cgsix 4 ,
.Xr cgthree 4 ,
.Xr cgtwo 4 ,
.Xr pnozz 4 ,
.Xr sbus 4 ,
.Xr tcx 4
