openbsd/src/share/man/man4/man4.sparc/cgfourteen.4
.\"	$OpenBSD: cgfourteen.4,v 1.17 2003/01/05 02:18:30 miod Exp $
.\"	$NetBSD: cgfourteen.4,v 1.3 1998/06/11 08:32:20 fair Exp $
.\"
.\" Copyright (c) 1996 The President and Fellows of Harvard College.
.\" All rights reserved.
.\" Copyright (c) 1996 The NetBSD Foundation, Inc. All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Paul Kranenburg.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the Harvard
.\"        University and its contributors.
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" Based on tcx.4,
.\"	NetBSD: tcx.4,v 1.2 1996/06/21 22:35:06 pk Exp
.\"
.Dd January 5, 2003
.Dt CGFOURTEEN 4 sparc
.Os
.Sh NAME
.Nm cgfourteen
.Nd accelerated 8/24-bit color frame buffer
.Sh SYNOPSIS
.Cd "cgfourteen0 at obio0 addr 0x9c000000 flags 0x0000" Pq "SS10SX and SS20"
.Cd "cgfourteen1 at obio0 addr 0x90000000 flags 0x0000" Pq "SS10SX and SS20"
.Cd "wsdisplay* at cgfourteen?"
.Sh DESCRIPTION
The
.Nm
is a memory based color frame buffer, with graphics acceleration and
overlay capabilities, for the
.Xr wscons 4
console framework.
It does not provide direct device driver entry points
but makes its functions available via the internal
.Xr wsdisplay 4
interface.
.Pp
By default, the frame buffer will be initialized in 32 bit mode, if the
display resolution allows it.
By setting
.Ar flags
to
.Ar 0x0001
(via
.Xr config 8
or
.Xr boot_config 8 )
it can be force to 8 bit mode, resulting in a faster console.
.Sh DISPLAY RESOLUTION
If the
.Nm
frame buffer is used as the console display, a different resolution than the
default 1152x900 can be selected by changing the OpenPROM environment.
To change the default resolution, type the following:
.Pp
.Em \   ok
setenv
.Ev Em output-device
screen:r1280x1024x76
.Pp
to change to a 76Hz 1280x1024 resolution.
.Pp
If the
.Nm
frame buffer is a secondary display, or a serial console is used, the
display resolution can not be changed without using an
.Ev Em nvramrc
OpenPROM script.
Refer to the
.Em Sun Frame Buffer FAQ
for details.
.Pp
The
.Nm
frame buffer accepts the following resolutions:
.Ss Supported Video Modes
.Pp
.Bl -tag -width screen:r1280x1024x76m -compact
.It screen:r1152x900x66
Standard 1152x900, with a refresh rate of 66Hz.
.It screen:r1152x900x76
Standard 1152x900, with a refresh rate of 76Hz.
This is the default setting.
.It screen:r1280x1024x66
High res 1280x1024, with a refresh rate of 66Hz.
.El
.Pp
.Ss Unsupported Video Modes
The following video modes are supported by the hardware, but not by
.Tn Sun .
.Pp
.Bl -tag -width screen:r1280x1024x76m -compact
.It screen:r1024x768x60
Super VGA 1024x768, with a refresh rate of 60Hz.
.It screen:r1024x768x66
Super VGA 1024x768, with a refresh rate of 60Hz.
.It screen:r1024x768x70
Super VGA 1024x768, with a refresh rate of 70Hz.
.It screen:r1024x800x84
1024x800, with refresh rate of 84Hz.
.It screen:r1280x1024x76m
High res 1280x1024, with a refresh rate of 76Hz.
There is no typo, the
.Sq m
suffix is required.
.It screen:r1600x1280x66
High res 1600x1280, with a refresh rate of 66Hz.
.It screen:r1920x1080x72
1920x1080, with a refresh rate of 72Hz.
.El
.Pp
Resolutions of 1280x1024, 1600x1280 and 1920x1080 are 8-bit only
with 4MB VSIMM.
.Sh SEE ALSO
.Xr bwtwo 4 ,
.Xr cgeight 4 ,
.Xr cgfour 4 ,
.Xr cgsix 4 ,
.Xr cgthree 4 ,
.Xr cgtwelve 4 ,
.Xr cgtwo 4 ,
.Xr intro 4 ,
.Xr pnozz 4 ,
.Xr tcx 4 ,
.Xr vigra 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Xr boot_config 8 ,
.Xr config 8
.Rs
.%T Sun Frame Buffer FAQ
.%O http://www.sunhelp.org/faq/FrameBuffer.html
.Re
