openbsd/src/share/man/man4/man4.sparc/cgsix.4
.\"	$OpenBSD: cgsix.4,v 1.17 2003/01/05 02:18:30 miod Exp $
.\"	$NetBSD: cgsix.4,v 1.4 1998/06/11 08:32:20 fair Exp $
.\"
.\" Copyright 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This software was developed by the Computer Systems Engineering group
.\" at Lawrence Berkeley Laboratory under DARPA contract BG 91-66 and
.\" contributed to Berkeley.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)cgsix.4	8.1 (Berkeley) 2/16/94
.\"
.Dd January 5, 2003
.Dt CGSIX 4 sparc
.Os
.Sh NAME
.Nm cgsix
.Nd accelerated 8-bit color frame buffer
.Sh SYNOPSIS
.Cd "cgsix* at sbus? slot ? offset ?" Pq "sun4c and sun4m"
.Cd "cgsix0 at obio0 addr 0xfb000000 level 4" Pq sun4/300 P4
.Cd "cgsix0 at obio0 addr 0x0b000000 level 4" Pq sun4/100 P4
.Cd "wsdisplay* at cgsix?"
.Sh DESCRIPTION
The
.Nm
is a memory based color frame buffer for the
.Xr wscons 4
console framework.
It does not provide direct device driver entry points
but makes its functions available via the internal
.Xr wsdisplay 4
interface.
.Pp
Different models exist, with various memory sizes and capabilities.
The
.Nm
driver supports the four flavours:
.Pp
.Bl -item -offset indent -compact
.It
GX
.It
GX+
.It
Turbo GX (or TGX)
.It
Turbo GX+ (or TGX+)
.El
.Sh DISPLAY RESOLUTION
If the
.Nm
frame buffer is used as the console display, a different resolution than the
default 1152x900 can be selected by changing the OpenPROM environment.
To change the default resolution, type the following:
.Pp
.Em \   ok
setenv
.Ev Em output-device
screen:r1280x1024x76
.Pp
to change to a 76Hz 1280x1024 resolution.
.Pp
If the
.Nm
frame buffer is a secondary display, or a serial console is used, the
display resolution can not be changed without using an
.Ev Em nvramrc
OpenPROM script.
Refer to the
.Em Sun Frame Buffer FAQ
for details.
.Pp
The
.Nm
frame buffer accepts the following resolutions:
.Bl -tag -width screen:r1280x1024x76 -compact
.It screen:r1022x1000x76
1022x1000, with a refresh rate of 76Hz.
Only available on the SPARCstation IPX on-board frame buffer.
.It screen:r1024x768x60
Super VGA 1024x768, with a refresh rate of 60Hz.
Only available on TGX and TGX+.
.It screen:r1024x768x70
Super VGA 1024x768, with a refresh rate of 70Hz.
Only available on TGX and TGX+.
.It screen:r1024x768x76
Super VGA 1024x768, with a refresh rate of 76Hz.
Only available on TGX and TGX+.
.It screen:r1024x768x77
Super VGA 1024x768, with a refresh rate of 77Hz.
Only available on the SPARCstation LX on-board frame buffer.
.It screen:r1024x800x74
1024x800, with a refresh rate of 74Hz.
Only available on TGX and TGX+.
.It screen:r1024x800x85
1024x800, with a refresh rate of 85Hz.
Only available on the SPARCstation IPX on-board frame buffer,
as well as on GX+, TGX and TGX+.
.It screen:r1152x900x66
Standard 1152x900, with a refresh rate of 66Hz.
This is the default setting on the dual-slot GX models (501-1481 and 501-1645).
.It screen:r1152x900x76
Standard 1152x900, with a refresh rate of 76Hz.
This is the default setting on the on-board or single-slot GX models,
as well on TGX.
.It screen:r1280x1024x67
High res 1280x1024, with a refresh rate of 67Hz.
Only available on the SPARCstation LX with the VSIMM installed,
as well as on GX+ and TGX+.
This is the default on GX+.
.It screen:r1280x1024x76
High res 1280x1024, with a refresh rate of 76Hz.
Only available on TGX+, where this is the default setting.
.It screen:r1600x1280x76
High res 1600x1280, with a refresh rate of 76Hz.
Only available on the SPARCstation LX with the VSIMM installed,
as well as on GX+ and TGX+.
.El
.Pp
The 1600x1280 resolution is not officially supported by
.Tn Sun
on the GX+.
.Sh SEE ALSO
.Xr bwtwo 4 ,
.Xr cgeight 4 ,
.Xr cgfour 4 ,
.Xr cgfourteen 4 ,
.Xr cgthree 4 ,
.Xr cgtwelve 4 ,
.Xr cgtwo 4 ,
.Xr intro 4 ,
.Xr pnozz 4 ,
.Xr sbus 4 ,
.Xr tcx 4 ,
.Xr vigra 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Rs
.%T Sun Frame Buffer FAQ
.%O http://www.sunhelp.org/faq/FrameBuffer.html
.Re
.Sh BUGS
Several firmware revisions of the
.Nm cgsix ,
in particular those found in the SparcStation 5, have a
bug that occurs when the screen control sequences for inserting blank lines
(e.g., the control sequences produced by the
.So al Sc and So AL Sc
capabilities found in the
.Xr termcap 5
database) are used near the bottom end of the screen.
This bug is most likely to be encountered during the
use of a full-screen editor such as
.Xr vi 1
on the workstation's console.
.Pp
To work around this bug, the
.Ev TERM
environment variable should be set to
.Sq sun-ss5 ,
which is the same as the
.Sq sun
entry except without the
.Sq al
and
.Sq AL
capabilities.
