openbsd/src/share/man/man4/man4.sparc/cgsix.4
.\"	$OpenBSD: cgsix.4,v 1.10 2001/10/04 10:28:20 wilfried Exp $
.\"	$NetBSD: cgsix.4,v 1.4 1998/06/11 08:32:20 fair Exp $
.\"
.\" Copyright 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This software was developed by the Computer Systems Engineering group
.\" at Lawrence Berkeley Laboratory under DARPA contract BG 91-66 and
.\" contributed to Berkeley.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)cgsix.4	8.1 (Berkeley) 2/16/94
.\"	$Id: cgsix.4,v 1.10 2001/10/04 10:28:20 wilfried Exp $
.\"
.Dd February 16, 1994
.Dt CGSIX 4 sparc
.Os
.Sh NAME
.Nm cgsix
.Nd accelerated 8-bit color frame buffer
.Sh SYNOPSIS
.Cd "cgsix* at sbus? slot ? offset ?" Pq "sun4c and sun4m"
.Cd "cgsix0 at obio0 addr 0xfb000000 level 4" Pq sun4/300 P4
.Cd "cgsix0 at obio0 addr 0x0b000000 level 4" Pq sun4/100 P4
.Sh DESCRIPTION
The
.Nm cgsix
is a memory based color frame buffer.
It supports the minimal
.Xr ioctl 2 Ns s
needed to run
.Xr X 1 .
.Sh SEE ALSO
.Xr bwtwo 4 ,
.Xr cgeight 4 ,
.Xr cgfour 4 ,
.Xr cgfourteen 4 ,
.Xr cgthree 4 ,
.Xr cgtwo 4 ,
.Xr p9100 4 ,
.Xr tcx 4
.Sh BUGS
Several firmware revisions of the
.Nm cgsix ,
in particular those found in the SparcStation 5, have a
bug that occurs when the screen control sequences for inserting blank lines
(e.g., the control sequences produced by the
.So al Sc and So AL Sc
capabilities found in the
.Xr termcap 5
database) are used near the bottom end of the screen.
This bug is most likely to be encountered during the
use of a full-screen editor such as
.Xr vi 1
on the workstation's console.
.Pp
To work around this bug, the
.Ev TERM
environment variable should be set to
.Sq sun-ss5 ,
which is the same as the
.Sq sun
entry except without the
.Sq al
and
.Sq AL
capabilities.
