openbsd/src/share/man/man4/man4.sparc/cgthree.4
.\"	$OpenBSD: cgthree.4,v 1.30 2008/03/31 07:44:30 jmc Exp $
.\"	$NetBSD: cgthree.4,v 1.4 1998/06/11 08:32:20 fair Exp $
.\"
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This software was developed by the Computer Systems Engineering group
.\" at Lawrence Berkeley Laboratory under DARPA contract BG 91-66 and
.\" contributed to Berkeley.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: Header: cgthree.4,v 1.3 94/02/03 20:49:52 leres Exp
.\"     from: @(#)cgthree.4	8.2 (Berkeley) 2/16/94
.\"
.Dd $Mdocdate: March 31 2008 $
.Dt CGTHREE 4 sparc
.Os
.Sh NAME
.Nm cgthree
.Nd 8-bit color frame buffer
.Sh SYNOPSIS
.Cd "cgthree* at sbus?"
.Cd "cgthree* at obio0" Pq some sun4m models
.Cd "wsdisplay* at cgthree?"
.Sh DESCRIPTION
The
.Nm
is a color frame buffer, available as an SBus card or on-board on some sun4c
and sun4m workstations.
A small number of frame buffer SBus cards, not manufactured by
.Tn Sun ,
are cgthree-compatible and will also be recognized by the
.Nm
driver.
.Pp
The
.Nm
driver interfaces the frame buffer with the
.Xr wscons 4
console framework.
It does not provide direct device driver entry points
but makes its functions available via the internal
.Xr wsdisplay 4
interface.
.Sh DISPLAY RESOLUTION
.Ss Sun frame buffers
If the
.Nm
frame buffer is used as the console display, it is possible, for some models,
to select a different resolution than the default 1152x900 or 1024x768
by changing the OpenPROM environment.
To change the default resolution, type the following:
.Pp
.Em \   ok
setenv
.Em output-device
screen:r1152x900x66
.Pp
to change to a 66Hz 1152x900 resolution.
.Pp
If the
.Nm
frame buffer is a secondary display, or a serial console is used, the
display resolution can not be changed without using an
.Em nvramrc
OpenPROM script.
Refer to the
.Em Sun Frame Buffer FAQ
for details.
.Pp
The
.Nm
frame buffer accepts the following resolutions:
.Pp
.Bl -tag -width screen:r1280x1024x76 -compact
.It screen:r1024x768x77
Super VGA 1024x768, with a refresh rate of 77Hz.
This is the default setting on model 501-2691.
.It screen:r1152x900x66
Standard 1152x900, with a refresh rate of 66Hz.
This is the default setting on older models (501-1415 and 501-8044).
.It screen:r1152x900x76
Standard 1152x900, with a refresh rate of 76Hz.
This is the default setting on more recent models (501-1718 and 501-1909).
.El
.Pp
Note that not all models support settings other than their default setting.
.Ss Tritec GVC-1, Integrix SFB200
These frame buffers are cgthree-compatible cards with a VGA-compatible video
connector.
There are only two resolutions supported, selected by jumper JP2 on the card:
.Bl -column "short" "Resolution"
.It Li JP2 Ta Resolution
.It " "
.It Li "open" Ta "1024x768, 60Hz"
.It Li "short" Ta "1152x900, 66Hz"
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sbus 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Rs
.%T Sun Frame Buffer FAQ
.%O http://www.sunhelp.org/faq/FrameBuffer.html
.Re
