openbsd/src/share/man/man4/man4.sparc/cgtwelve.4
.\"	$OpenBSD: cgtwelve.4,v 1.16 2007/05/31 19:19:56 jmc Exp $
.\" Copyright (c) 2002 Miodrag Vallat.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt CGTWELVE 4 sparc
.Os
.Sh NAME
.Nm cgtwelve
.Nd accelerated 24-bit color frame buffer
.Sh SYNOPSIS
.Cd "cgtwelve* at sbus?"
.Cd "wsdisplay* at cgtwelve?"
.Sh DESCRIPTION
The
.Nm
is a triple-slot SBus color frame buffer, with graphics acceleration
and overlay capabilities.
.Pp
The
.Nm
driver interfaces the frame buffer with the
.Xr wscons 4
console framework.
It does not provide direct device driver entry points
but makes its functions available via the internal
.Xr wsdisplay 4
interface.
.Sh SEE ALSO
.Xr agten 4 ,
.Xr bwtwo 4 ,
.Xr cgeight 4 ,
.Xr cgfour 4 ,
.Xr cgfourteen 4 ,
.Xr cgsix 4 ,
.Xr cgthree 4 ,
.Xr cgtwo 4 ,
.Xr intro 4 ,
.Xr mgx 4 ,
.Xr pninek 4 ,
.Xr pnozz 4 ,
.Xr rfx 4 ,
.Xr sbus 4 ,
.Xr tcx 4 ,
.Xr tvtwo 4 ,
.Xr vigra 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4 ,
.Xr zx 4
.Sh CAVEATS
This driver does not support any acceleration features.
