openbsd/src/share/man/man4/man4.sparc/intro.4
.\"     $OpenBSD: intro.4,v 1.57 2015/03/30 20:34:47 miod Exp $
.\"	$NetBSD: intro.4,v 1.5 1998/02/06 06:07:00 perry Exp $
.\"
.\" Copyright (c) 1996 Jonathan Stone.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jonathan Stone.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" Copyright (c) 1983, 1986, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 30 2015 $
.Dt INTRO 4 sparc
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files,
related driver functions, and networking support
available in the system.
In this part of the manual, the SYNOPSIS section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The DIAGNOSTICS section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the SPARC
platform.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system will have to be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.
Pseudo-devices are not listed.
Devices are sorted by their type and driver name;
not all supported devices are listed.
.Ss Audio interfaces
.Bl -tag -width 12n -compact -offset ind
.It Xr audioamd 4
SPARC telephone quality audio device
.It Xr audiocs 4
SPARC CS4231 audio device
.El
.Ss Frame buffers
.Bl -tag -width 14n -compact -offset ind
.It Xr agten 4
Fujitsu AG-10e accelerated 24-bit color frame buffer
.It Xr bwtwo 4
monochromatic frame buffer
.It Xr cgeight 4
24-bit color frame buffer
.It Xr cgfour 4
8-bit color frame buffer
.It Xr cgfourteen 4
accelerated 8/24-bit color frame buffer
.It Xr cgsix 4
accelerated 8-bit color frame buffer
.It Xr cgthree 4
8-bit color frame buffer
.It Xr cgtwelve 4
accelerated 24-bit color frame buffer
.It Xr cgtwo 4
8-bit color frame buffer
.It Xr mgx 4
SMS MGX and MGXPlus accelerated 8/24-bit color frame buffers
.It Xr rfx 4
Vitec/Connectware/AP&D RasterFlex framebuffer series
.It Xr tcx 4
accelerated 8/24-bit color frame buffer
.It Xr tvtwo 4
accelerated 24-bit color frame buffer
.It Xr vigra 4
8-bit SBus color frame buffer with VGA-compatible modes
.It Xr zx 4
accelerated 24-bit color frame buffer
.El
.Ss Network interfaces
.Bl -tag -width 12n -compact -offset ind
.It Xr be 4
SPARC 10/100 Ethernet device
.It Xr ep 4
3Com EtherLink III and Fast EtherLink III 10/100 Ethernet device
.It Xr hme 4
Sun Happy Meal 10/100 Ethernet device
.It Xr ie 4
Intel i82586 Ethernet device
.It Xo Xr le 4 ,
.Xr lebuffer 4 ,
.Xr ledma 4
.Xc
AMD LANCE Ethernet device
.It Xr ne 4
NE2000 and compatible 10/100 Ethernet device
.It Xr qe 4
SPARC 10/100 Ethernet device
.It Xr qec 4
SPARC Quad Ethernet Controller
.It Xr wi 4
WaveLAN/IEEE, PRISM 2-3, and Spectrum24 IEEE 802.11b wireless network device
.El
.Ss PCMCIA bridges
.Bl -tag -width 12n -compact -offset ind
.It Xr stp 4
SBus PCMCIA bridge
.El
.Ss SCSI adapters
.Bl -tag -width 12n -compact -offset ind
.It Xr esp 4
ESP NCR 53c94 on-board or SBus SCSI interface
.It Xr qlw 4
QLogic ISP1000/1020/1x40/1x80/1x160 SCSI controller
.It Xr si 4
NCR 5380 Sun SCSI 3 VME SCSI controller
.It Xr sw 4
NCR 5380 SCSI Weird Sun 4/100 on-board SCSI controller
.El
.Ss Serial and parallel interfaces
.Bl -tag -width 12n -compact -offset ind
.It Xr magma 4
Magma Sp Serial/Parallel board device driver
.It Xr spif 4
SBus (spiffy) Serial/Parallel Interface
.It Xo Xr zs 4 ,
.Xr zstty 4 ,
.Xr zskbd 4
.Xc
Zilog 8530 (ZSCC) serial communications driver
.El
.Ss SMD controllers
.Bl -tag -width 12n -compact -offset ind
.It Xr xd 4
Xylogics 753 or 7053 VME SMD disk controller driver
.It Xr xy 4
Xylogics 450 or 451 VME SMD disk controller driver
.El
.Ss Force CPU-5 specific devices
.Bl -tag -width 12n -compact -offset ind
.It Xr daadio 4
MATRIX MD-DAADIO digital/analog, analog/digital, parallel I/O board
.It Xr fga 4
SPARC Force FGA5000 VME/SBus bridge driver
.It Xr scf 4
SPARC Force sysconfig driver
.El
.Ss Tadpole SPARCbook specific devices
.Bl -tag -width 12n -compact -offset ind
.It Xr com 4
serial communications interface
.It Xr pninek 4
Weitek Power9000 accelerated frame buffer
.It Xr pnozz 4
Weitek Power9100 accelerated frame buffer
.It Xr tctrl 4
Tadpole Microcontroller Interface
.It Xr tslot 4
Tadpole PCMCIA Controller
.El
.Ss Miscellaneous devices
.Bl -tag -width 12n -compact -offset ind
.It Xr clock 4
SPARC clock driver
.It Xr fdc 4
NEC765 compatible floppy disk driver
.It Xr led 4
SPARC LED driver
.It Xr openprom 4
OPENPROM and EEPROM interface
.It Xr presto 4
Prestoserve battery-backed memory
.It Xr timer 4
SPARC Timer
.It Xr xbox 4
SPARC SBus Expansion Subsystem
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HISTORY
The
sparc
.Nm
first appeared in
.Nx 1.3
and
.Ox 2.3 .
