openbsd/src/share/man/man4/man4.sparc/led.4
.\"     $OpenBSD: led.4,v 1.3 2003/04/30 12:06:19 jmc Exp $
.\"
.\" Copyright (c) 2001 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jason L. Wright
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 31, 2001
.Dt LED 4 sparc
.Os
.Sh NAME
.Nm led
.Nd SPARC LED driver
.Sh SYNOPSIS
.Cd "led0 at mainbus0                              " Pq "sun4"
.Cd "led0 at obio0                                 " Pq "sun4m: 4/600"
.Sh DESCRIPTION
The
.Nm
driver provides an indicator of load average based on blinking of the
LEDs on some systems.
The pattern takes one second per whole number of load average to repeat.
The LED must be explicitly enabled with the
.Xr sysctl 3
variable
.Nm machdep.led_blink .
.Sh SEE ALSO
.Xr sysctl 3 ,
.Xr intro 4 ,
.Xr sysctl 8
.Sh HISTORY
.Ox
support for the
.Nm
first appeared in
.Ox 2.3 .
