openbsd/src/share/man/man4/man4.sparc/memreg.4
.\"	$OpenBSD: memreg.4,v 1.1 2014/11/22 22:58:09 miod Exp $
.\"
.\" Copyright (c) 2014, Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 22 2014 $
.Dt MEMREG 4 sparc
.Os
.Sh NAME
.Nm memreg
.Nd parity memory error register
.Sh SYNOPSIS
.Cd "memreg0 at mainbus0                               " Pq "sun4c and sun4e"
.Cd "memreg0 at obio0                                  " Pq "sun4m"
.Cd "memreg0 at obio0 addr 0xf4000000                  " Pq "sun4"
.Sh DESCRIPTION
The
.Nm
driver provides support for the parity error register found on sparc systems
without ECC memory controllers.
It will report detailed information about synchronous and asynchronous memory
errors.
.Sh SEE ALSO
.Xr eccmemctl 4 ,
.Xr intro 4 ,
.Xr mainbus 4
