openbsd/src/share/man/man4/man4.sparc/mgx.4
.\"	$OpenBSD: mgx.4,v 1.3 2003/06/18 17:40:31 miod Exp $
.\" Copyright (c) 2003 Miodrag Vallat.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 14, 2003
.Dt MGX 4 sparc
.Os
.Sh NAME
.Nm mgx
.Nd SMS MGX and MGXPlus accelerated 24-bit color frame buffers
.Sh SYNOPSIS
.Cd "mgx* at sbus? slot ? offset ?"
.Cd "wsdisplay* at mgx?"
.Sh DESCRIPTION
The
.Tn Southland Media Systems
.Pq now Tn "Quantum 3D"
MGX and MGXPlus are SBus color frame buffers, with graphics acceleration
capabilities.
.Pp
The
.Nm
driver interfaces the frame buffer with the
.Xr wscons 4
console framework.
It does not provide direct device driver entry points
but makes its functions available via the internal
.Xr wsdisplay 4
interface.
.Sh SEE ALSO
.Xr agten 4 ,
.Xr bwtwo 4 ,
.Xr cgeight 4 ,
.Xr cgfour 4 ,
.Xr cgfourteen 4 ,
.Xr cgsix 4 ,
.Xr cgthree 4 ,
.Xr cgtwelve 4 ,
.Xr cgtwo 4 ,
.Xr intro 4 ,
.Xr pninek 4 ,
.Xr pnozz 4 ,
.Xr sbus 4 ,
.Xr tcx 4 ,
.Xr tvtwo 4 ,
.Xr vigra 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4 ,
.Xr zx 4
.Sh CAVEATS
This driver does not support any acceleration features at the moment, and
drives the card in PROM-compatible, 8 bit, mode only.
