openbsd/src/share/man/man4/man4.sparc/ms.4
.\"	$OpenBSD: ms.4,v 1.7 2001/10/05 14:45:54 mpech Exp $
.\"	$NetBSD: ms.4,v 1.2 1997/10/08 22:00:12 jtc Exp $
.\"
.\" Copyright (c) 1996 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Paul Kranenburg.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 22, 1996
.Dt MS 4 sparc
.Os
.Sh NAME
.Nm ms
.Nd workstation mouse
.Sh SYNOPSIS
.Cd "pseudo-device mouse"
.Sh DESCRIPTION
The
.Nm
driver provides an interface to the workstation console mouse.
This
.Tn Mouse Systems
three-button device produces five-byte blobs of the form:
.Pp
.Bd -literal -offset indent
b dx dy dx dy
.Ed
.Pp
where
.Dq b
is the button state, encoded as
.Li 0x80|(~buttons)
-- there are three buttons (4=left, 2=middle, 1=right) --
and
.Dq \&dx
and
.Dq \&dy
are X and Y delta values, none of which are in the range
.Bq Li 0x80..0x87 .
.Pp
The device special file
.Pa /dev/mouse
is used to get direct access to the mouse input stream.
The following
.Xr ioctl 2 Ns s
are supported (mostly just enough to keep the X11 server going):
.Bl -tag -width VUIDSFORMAT
.It VUIDSFORMAT
Set translation mode.
The argument is of type
.Fa "int *" ,
the only value supported is
.Dv VUID_FIRM_EVENT .
.It VUIDGFORMAT
Get translation mode.
The argument is of type
.Fa "int *" .
.Dv VUID_FIRM_EVENT
is always returned.
.El
.Sh SEE ALSO
.Xr kbd 4 ,
.Xr zs 4
.Sh BUGS
.Nm
is hardwired to the built-in
.Em zs1
serial port.
