openbsd/src/share/man/man4/man4.sparc/pninek.4
.\"	$OpenBSD: pninek.4,v 1.3 2004/02/29 21:44:07 miod Exp $
.\"
.\" Copyright (c) 2003, Miodrag Vallat.
.\" Copyright (c) 1999 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 16, 2003
.Dt PNINEK 4 sparc
.Os
.Sh NAME
.Nm pninek
.Nd Weitek Power9000 accelerated frame buffer
.Sh SYNOPSIS
.Cd "btcham0 at obio?"
.Cd "pninek0 at sbus? slot ? offset ?"
.Cd "wsdisplay* at pninek?"
.Sh DESCRIPTION
The
.Nm
is a color frame buffer with graphics acceleration, embedded in the
.Tn "Tadpole SPARCbook"
3 laptop.
It is based on the
.Tn "Weitek Power9000"
video processor and a
.Tn Brooktree
Bt445
.Sq Chameleon
RAMDAC.
.Pp
Due to specifics of the video hardware on the
.Tn Tadpole SPARCbook
3, the complete driver is split in two parts:
.Pp
.Bl -tag -width Ds -compact
.It Nm btcham
RAMDAC interface
.It Nm pninek
Video controller interface
.El
.Pp
The combination of both
.Nm btcham
and
.Nm
drivers interfaces the frame buffer with the
.Xr wscons 4
console framework.
They do not provide direct device driver entry points
but make their function available via the internal
.Xr wsdisplay 4
interface.
.Pp
If the
.Xr tctrl 4
device is also configured, the
.Nm
will be powered down when the lid of the laptop
is closed or the screen is blanked.
.Sh SEE ALSO
.Xr agten 4 ,
.Xr bwtwo 4 ,
.Xr cgeight 4 ,
.Xr cgfour 4 ,
.Xr cgfourteen 4 ,
.Xr cgsix 4 ,
.Xr cgthree 4 ,
.Xr cgtwelve 4 ,
.Xr cgtwo 4 ,
.Xr intro 4 ,
.Xr mgx 4 ,
.Xr pnozz 4 ,
.Xr rfx 4 ,
.Xr sbus 4 ,
.Xr tctrl 4 ,
.Xr tcx 4 ,
.Xr tvtwo 4 ,
.Xr vigra 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4 ,
.Xr zx 4
.Sh BUGS
There is currently no way to switch back and forth from
the onboard display to the external connector.
It is not possible to change resolutions.
