openbsd/src/share/man/man4/man4.sparc/pnozz.4
.\"     $OpenBSD: pnozz.4,v 1.30 2011/05/31 17:40:19 miod Exp $
.\"
.\" Copyright (c) 1999 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2011 $
.Dt PNOZZ 4 sparc
.Os
.Sh NAME
.Nm pnozz
.Nd Weitek Power9100 accelerated frame buffer
.Sh SYNOPSIS
.Cd "pnozz0 at sbus?"
.Cd "wsdisplay* at pnozz?"
.Sh DESCRIPTION
The
.Nm
is a color frame buffer with graphics acceleration, embedded in the
.Tn Tadpole SPARCbook
3GS, 3GX, 3TX and 3XP
laptops.
It is based on the
.Tn Weitek Power9100
video processor and an
.Tn IBM RGB525
RAMDAC.
.Pp
The
.Nm
driver interfaces the frame buffer with the
.Xr wscons 4
console framework.
It does not provide direct device driver entry points
but makes its functions available via the internal
.Xr wsdisplay 4
interface.
.Pp
If the
.Xr tctrl 4
device is also configured, the
.Nm
will be powered down when the lid of the laptop
is closed or the screen is blanked.
.Pp
The
.Nm
driver supports hardware acceleration to erase the screen and scroll text.
.Sh EXTERNAL VIDEO
If the
.Xr tctrl 4
device is also configured, the external video output will be enabled when
an external display is connected, even if the laptop lid is closed.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sbus 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh BUGS
It is not possible yet to change display resolution or color depth.
.\" Actually, it is... but not yet hooked to wsconsctl
