openbsd/src/share/man/man4/man4.sparc/qec.4
.\"     $OpenBSD: qec.4,v 1.10 2002/02/20 17:18:33 jason Exp $
.\"
.\" Copyright (c) 1998 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jason L. Wright
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 12, 1998
.Dt QEC 4 sparc
.Os
.Sh NAME
.Nm qec
.Nd SPARC Quad Ethernet Controller
.Sh SYNOPSIS
.Cd "qec* at sbus? slot ? offset ?                 " Pq "sun4c/sun4m"
.Sh DESCRIPTION
The
.Nm
driver is an sbus controller that can contain either one
.Xr be 4
Ethernet controller (Sun part number SUNW,501-2655)
or four
.Xr qe 4
ethernet controllers (Sun part number SUNW,595-3198).
This driver, like other busses, is not directly available to users.
In essence it is a buffering DMA controller.
.Sh SEE ALSO
.Xr be 4 ,
.Xr intro 4 ,
.Xr qe 4 ,
.Xr sbus 4
.Sh HISTORY
.Ox
support for the
.Nm
first appeared in
.Ox 2.4 .
