openbsd/src/share/man/man4/man4.sparc/tslot.4
.\"	$OpenBSD: tslot.4,v 1.2 2004/09/30 19:59:27 mickey Exp $
.\"
.\" Copyright (c) 2003, Miodrag Vallat.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 22, 2003
.Dt TSLOT 4 sparc
.Os
.Sh NAME
.Nm tslot
.Nd Tadpole PCMCIA Controller
.Sh SYNOPSIS
.Cd "tslot0 at sbus?"
.Cd "pcmcia* at tslot?"
.Sh DESCRIPTION
The
.Nm
driver manages the
.Xr pcmcia 4
controller part of the
.Xr tctrl 4
.Tn Tadpole
TS102 controller found on the
.Tn Tadpole SPARCbook
3 series laptops.
It provides two PCMCIA slots and can receive up to two PCMCIA type 1
or type 2 cards, or one PCMCIA type 3 card.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pcmcia 4 ,
.Xr sbus 4 ,
.Xr tctrl 4
.Sh CAVEATS
Due to hardware limitations, it is not possible to run a 3.3V card and a 5V
card at the same time.
.Sh BUGS
Unlike other PCMCIA adapters which are little-endian, this bridge
provides a big-endian
.Xr pcmcia 4
bus.
Therefore, 16 bit drivers need to be made aware of this before they will
work.
