openbsd/src/share/man/man4/man4.sparc/vigra.4
.\"	$OpenBSD: vigra.4,v 1.10 2003/05/25 21:43:08 miod Exp $
.\" Copyright (c) 2002 Miodrag Vallat.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 31, 2002
.Dt VIGRA 4 sparc
.Os
.Sh NAME
.Nm vigra
.Nd 8-bit SBus color frame buffer with VGA-compatible modes
.Sh SYNOPSIS
.Cd "vigra* at sbus? slot ? offset ?"
.Cd "wsdisplay* at vigra?"
.Sh DESCRIPTION
The
.Tn "Vigra VS10, VS11 and VS12"
are 8 bit color frame buffers with user-selectable video modes, and a
VGA-compatible connector.
.Pp
The
.Nm
driver interfaces the frame buffer with the
.Xr wscons 4
console framework.
It does not provide direct device driver entry points
but makes its functions available via the internal
.Xr wsdisplay 4
interface.
.Pp
The video resolution and signal synchronization modes are
selected with four dip switches on the back of the card.
.Ss VS10 and VS12 Switch Settings:
.Bl -column "Switches" "Resolution" "Refresh"
.It Li Switches Ta Resolution Ta Refresh Ta Description
.It Li "1 2 3 4" Ta "" Ta "Rate"
.It " "
.It Li "D D D D" Ta 640x480 Ta 60Hz Ta "Standard VGA, negative separate sync"
.It Li "U D D D" Ta 800x600 Ta 56Hz Ta "Super VGA, negative separate sync"
.It Li "D U D D" Ta 800x600 Ta 56Hz Ta "Super VGA, positive separate sync"
.It Li "U U D D" Ta 1024x768 Ta 60Hz Ta "Super VGA, negative separate sync"
.It Li "D D U D" Ta 1024x768 Ta 60Hz Ta "Super VGA, composite sync"
.It Li "U D U D" Ta 1024x768 Ta 60Hz Ta "Super VGA, sync-on-green"
.It Li "D U U D" Ta 1024x768 Ta 66Hz Ta "Sun 386i, composite sync"
.It Li "U U U D" Ta 1152x900 Ta 76Hz Ta "Sun SPARCstation, composite sync"
.It Li "D D D U" Ta 1152x900 Ta 61.5Hz Ta "NEC 4D, composite sync"
.It Li "U D D U" Ta 1152x900 Ta 66Hz Ta "Sun SPARCstation, composite sync"
.It Li "D U D U" Ta 800x600 Ta 60Hz Ta "VESA, negative separate sync"
.It Li "U U D U" Ta 800x600 Ta 72Hz Ta "VESA, negative separate sync"
.El
.Pp
The VS12 supports all of these modes, as well as a few high resolution settings.
.Ss VS12-only Switch Settings:
.Bl -column "Switches" "Resolution" "Refresh"
.It Li Switches Ta Resolution Ta Refresh Ta Description
.It Li "1 2 3 4" Ta "" Ta "Rate"
.It " "
.It Li "D D U U" Ta 1280x1024 Ta 60Hz Ta "NEC xD, negative separate sync"
.It Li "U D U U" Ta 1280x1024 Ta 60Hz Ta "NEC xD, composite sync"
.It Li "D U U U" Ta 1280x1024 Ta 60Hz Ta "NEC xD, sync-on-green"
.It Li "U U U U" Ta 1280x1024 Ta 67Hz Ta "Sun SPARCstation, composite sync"
.El
.Pp
The VS11 supports a similar set of modes as the VS12, but with higher refresh
rates.
.Ss VS11 Switch Settings:
.Bl -column "Switches" "Resolution" "Refresh"
.It Li Switches Ta Resolution Ta Refresh Ta Description
.It Li "1 2 3 4" Ta "" Ta "Rate"
.It " "
.It Li "D D D D" Ta 640x480 Ta 60Hz Ta "Standard VGA, negative separate sync"
.It Li "U D D D" Ta 800x600 Ta 72Hz Ta "VESA, negative separate sync"
.It Li "D U D D" Ta 1024x768 Ta 60Hz Ta "VESA, negative separate sync"
.It Li "U U D D" Ta 1024x768 Ta 60Hz Ta "VESA, composite sync"
.It Li "D D U D" Ta 1024x768 Ta 60Hz Ta "VESA, sync-on-green"
.It Li "U D U D" Ta 1024x768 Ta 66Hz Ta "Sun 386i, composite sync"
.It Li "D U U D" Ta 1152x900 Ta 66Hz Ta "Sun SPARCstation, composite sync"
.It Li "U U U D" Ta 1152x900 Ta 76Hz Ta "Sun SPARCstation, composite sync"
.It Li "D D D U" Ta 1280x1024 Ta 67Hz Ta "Sun SPARCstation, composite sync"
.It Li "U D D U" Ta 1280x1024 Ta 60Hz Ta "NEC xFG, negative separate sync"
.It Li "D U D U" Ta 1280x1024 Ta 60Hz Ta "NEC xFG, composite sync"
.It Li "U U D U" Ta 1280x1024 Ta 60Hz Ta "NEC xFG, sync-on-green"
.It Li "D D U U" Ta 1280x1024 Ta 74Hz Ta "NEC xFG, composite sync"
.It Li "U D U U" Ta 1280x1024 Ta 74Hz Ta "NEC xFG, sync-on-green"
.It Li "D U U U" Ta 1280x1024 Ta 72Hz Ta "HP A1097, composite sync"
.It Li "U U U U" Ta 1280x1024 Ta 72Hz Ta "Special, composite sync"
.El
.Sh SEE ALSO
.Xr agten 4 ,
.Xr bwtwo 4 ,
.Xr cgeight 4 ,
.Xr cgfour 4 ,
.Xr cgfourteen 4 ,
.Xr cgsix 4 ,
.Xr cgthree 4 ,
.Xr cgtwelve 4 ,
.Xr cgtwo 4 ,
.Xr intro 4 ,
.Xr mgx 4 ,
.Xr pnozz 4 ,
.Xr sbus 4 ,
.Xr tcx 4 ,
.Xr tvtwo 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4 ,
.Xr zx 4
