openbsd/src/share/man/man4/man4.sparc/xd.4
.\"	$OpenBSD: xd.4,v 1.6 2002/10/01 21:02:19 miod Exp $
.\"
.\" Copyright (c) 1998 The OpenBSD Project
.\" All rights reserved.
.\"
.\"
.Dd March 4, 1998
.Dt XD 4 sparc
.Os
.Sh NAME
.Nm xd
.Nd Xylogics 753 or 7053 VME SMD disk controller driver
.Sh SYNOPSIS
.Cd "xdc0    at vmel0 addr 0xffffee80 level 3 vect 0x44" Pq sun4
.Cd "xdc1    at vmel0 addr 0xffffee90 level 3 vect 0x45" Pq sun4
.Cd "xdc2    at vmel0 addr 0xffffeea0 level 3 vect 0x46" Pq sun4
.Cd "xdc3    at vmel0 addr 0xffffeeb0 level 3 vect 0x47" Pq sun4
.Cd "xd*     at xdc? drive ?                           " Pq sun4
.Sh DESCRIPTION
The
.Nm
is a Xylogics 753 or 7053 SMD disk controller found on sun4 systems with
the VME bus.
The Xylogics 753 and 7053 are programmed the same way, but are different sizes.
The 753 is a 6U VME card, while the 7053 is a 9U VME card.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr xy 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx
and was written by
.br
Charles D. Cranor.
