openbsd/src/share/man/man8/man8.mac68k/MAKEDEV.8
.\" $OpenBSD: MAKEDEV.8,v 1.9 2004/03/12 04:54:33 deraadt Exp $
.\"
.\" THIS FILE AUTOMATICALLY GENERATED.  DO NOT EDIT.
.\" generated from:
.\"
.\"	OpenBSD: etc.mac68k/MAKEDEV.md,v 1.16 2004/02/20 19:13:08 miod Exp 
.\"	OpenBSD: MAKEDEV.common,v 1.4 2004/03/12 04:54:04 deraadt Exp 
.\"	OpenBSD: MAKEDEV.man,v 1.2 2004/02/20 19:13:01 miod Exp 
.\"	OpenBSD: MAKEDEV.mansub,v 1.2 2004/02/20 19:13:01 miod Exp 
.\"
.\" Copyright (c) 2004, Miodrag Vallat
.\" Copyright (c) 2001-2004 Todd T. Fries <todd@OpenBSD.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd March 11, 2004
.Dt MAKEDEV 8 mac68k
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Op Ar ...
.Sh DESCRIPTION
The shell script
.Nm ,
found in the
.Pa /dev
directory, is used to create various special files.
See
.Xr intro 4
for a more complete discussion of special files.
.Pp
.Nm
takes any number of device names as arguments, where the names are
the common abbreviation for the device or group of devices.
.Pp
Where a device name is followed by a star
.Sq * ,
the star must be replaced by a unit number.
If units are expected for a device but not provided,
.Nm
will supply the standard numbers in most cases.
.Pp
The mac68k supports the following devices:
.Pp
.Sy Special device names
.Bl -tag -width tenletters -compact
.It Ar all
Creates special files for all devices on mac68k.
.It Ar ramdisk
Ramdisk kernel devices.
.It Ar std
Creates the
.Sq standard
devices (console, drum, klog, kmem, ksyms, mem, null,
stderr, stdin, stdout, tty, zero)
which are absolutely necessary for the system to function properly.
.It Ar local
Creates configuration-specific devices, by invoking the shell file
.Pa MAKEDEV.local .
.El
.Pp
.Sy Disks
.Bl -tag -width tenletters -compact
.It Ar ccd*
Concatenated disk devices, see
.Xr ccd 4 .
.It Ar cd*
ATAPI and SCSI CD-ROM drives, see
.Xr cd 4 .
.It Ar rd*
.Dq rd
pseudo-disks, see
.Xr rd 4 .
.It Ar sd*
SCSI disks, including flopticals, see
.Xr sd 4 .
.It Ar vnd*
.Dq file
pseudo-disk devices, see
.Xr vnd 4 .
.El
.Pp
.Sy Tapes
.Bl -tag -width tenletters -compact
.It Ar ch*
SCSI media changers, see
.Xr ch 4 .
.It Ar st*
SCSI tape drives, see
.Xr st 4 .
.El
.Pp
.Sy Terminal ports
.Bl -tag -width tenletters -compact
.It Ar tty00
Standard serial port, see
.Xr zsc 4 .
.It Ar ttye*
ITE bitmapped consoles, see
.Xr ite 4 .
.El
.Pp
.Sy Pseudo terminals
.Bl -tag -width tenletters -compact
.It Ar ptm
pty master device, see
.Xr ptm 4 .
.It Ar pty*
Set of 16 master pseudo terminals, see
.Xr pty 4 .
.It Ar tty*
Set of 16 slave pseudo terminals, see
.Xr tty 4 .
.El
.Pp
.Sy Console ports
.Bl -tag -width tenletters -compact
.It Ar adb
Apple Desktop bus event interface, see
.Xr adb 4 .
.It Ar grf*
Raw interface to the mac68k graphics devices, see
.Xr grf 4 .
.El
.Pp
.Sy Special purpose devices
.Bl -tag -width tenletters -compact
.It Ar asc*
ASC Audio device, see
.Xr asc 4 .
.It Ar bpf*
Berkeley Packet Filter, see
.Xr bpf 4 .
.It Ar fd
fd/* nodes for fdescfs, see
.Xr mount_fdesc 8 .
.It Ar lkm
Loadable kernel modules interface, see
.Xr lkm 4 .
.It Ar pf*
Packet Filter, see
.Xr pf 4 .
.It Ar *random
In-kernel random data source, see
.Xr random 4 .
.It Ar ss*
SCSI scanners, see
.Xr ss 4 .
.It Ar systrace*
System call tracing device, see
.Xr systrace 4 .
.It Ar tun*
Network tunnel driver, see
.Xr tun 4 .
.It Ar uk*
SCSI unknown devices, see
.Xr uk 4 .
.It Ar xfs*
XFS filesystem node, see
.Xr mount_xfs 8 .
.Sh FILES
.Bl -tag -width /dev -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
