openbsd/src/usr.sbin/pcidump/pcidump.8
.\"	$OpenBSD: pcidump.8,v 1.6 2008/03/02 17:59:10 kettenis Exp $
.\"
.\" Copyright (c) 2007 Paul de Weerd <weerd@weirdnet.nl>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" TORTIOUS ACTION, ARISING OUT OF
.\" PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 2 2008 $
.Dt PCIDUMP 8
.Os
.Sh NAME
.Nm pcidump
.Nd show PCI device data
.Sh SYNOPSIS
.Nm pcidump
.Op Fl v | x | xx
.Op Fl d Ar pcidev
.Sm off
.Op Ar bus : dev : func
.Sm on
.Sh DESCRIPTION
The
.Nm
utility displays the device address, vendor, and product name
of PCI devices.
When no arguments are given,
information on all PCI devices in the system is shown;
otherwise a single device may be specified by bus, device, and function:
.Sm off
.Ar bus : dev : func .
.Sm on
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d Ar pcidev
Specify another file to use for PCI lookups.
.It Fl v
Shows detailed information about PCI devices.
.It Fl x
Shows a hexadecimal dump of the first 64 bytes of PCI config space.
.It Fl xx
Shows a hexadecimal dump of the full PCI config space.
.El
.Sh FILES
.Bl -tag -width /dev/pci -compact
.It Pa /dev/pci
Default file for PCI lookups.
.El
.Sh SEE ALSO
.Xr pci 4
.Sh HISTORY
The
.Nm
utility first appeared in
.Ox 4.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
utility was written by
.An David Gwynne
.Aq dlg@openbsd.org .
