openbsd/src/usr.sbin/dhcp/dhclient/dhclient.8
.\" $OpenBSD: dhclient.8,v 1.8 2000/03/19 17:57:03 aaron Exp $
.\"
.\" Copyright (c) 1997 The Internet Software Consortium.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of The Internet Software Consortium nor the names
.\"    of its contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE INTERNET SOFTWARE CONSORTIUM AND
.\" CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE INTERNET SOFTWARE CONSORTIUM OR
.\" CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\" ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" This software has been written for the Internet Software Consortium
.\" by Ted Lemon <mellon@fugue.com> in cooperation with Vixie
.\" Enterprises.  To learn more about the Internet Software Consortium,
.\" see ``http://www.isc.org/isc''.  To learn more about Vixie
.\" Enterprises, see ``http://www.vix.com''.
.Dd October 1, 1999
.Dt DHCLIENT 8
.Os
.Sh NAME
.Nm dhclient
.Nd Dynamic Host Configuration Protocol (DHCP) Client
.Sh SYNOPSIS
.Nm
.Op Fl 1d
.Op Fl p Ar port
.Op Ar interface ...
.Sh DESCRIPTION
The
.Nm
utility provides a means for configuring network interfaces using DHCP, BOOTP,
or if these protocols fail, by statically assigning an address.
.Pp
The names of the network interfaces that
.Nm
should attempt to
configure may be specified on the command line.
If no interface names are given,
.Nm
will identify all network
interfaces, eliminating non-broadcast interfaces if possible, and
attempt to configure each one.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl 1
Forces
.Nm
to exit if it failed to configure an interface.
.It Fl d
Forces
.Nm
to always run as a foreground process.
By default,
.Nm
runs in the foreground until it has configured an interface, and then
will revert to running in the background.
.It Fl p Ar port
Specifies the UDP
.Ar port
.Nm
should listen on, instead of the default (68).
.El
.Pp
The DHCP protocol allows a host to contact a central server which
maintains a list of IP addresses which may be assigned on one or more
subnets.
A DHCP client may request an address from this pool, and
then use it on a temporary basis for communication on the network.
The DHCP protocol also provides a mechanism whereby a client can learn
important details about the network to which it is attached, such as
the location of a default router, the location of a name server, and
so on.
.Pp
On startup,
.Nm
reads
.Pa /etc/dhclient.conf
for configuration instructions.
It then gets a list of all the
network interfaces that are configured in the current system.
It then attempts to configure each interface with DHCP.
.Pp
In order to keep track of leases across system reboots and server
restarts,
.Nm
keeps a list of leases it has been assigned in the
.Pa /var/db/dhclient.leases
file.
On startup, after reading the
.Pa dhclient.conf
file,
.Nm
reads the leases file to refresh its memory about what leases it has been
assigned.
.Pp
When a new lease is acquired, it is appended to the end of
.Pa /var/db/dhclient.leases .
In order to prevent the file from becoming arbitrarily large, from time to time
.Nm
creates a new
.Pa dhclient.leases
file from its in-core lease database.
The old version of is retained under the name
.Pa /var/db/dhcpd.leases~
until the next time
.Nm
rewrites the database.
.Pp
Old leases are kept around in case the DHCP server is unavailable when
.Nm
is first invoked (generally during the initial system boot
process).
In that event, old leases from the
.Pa dhclient.leases
file which have not yet expired are tested, and if they are determined to
be valid, they are used until either they expire or the DHCP server
becomes available.
.Pp
A mobile host which may sometimes need to access a network on which no
DHCP server exists may be preloaded with a lease for a fixed
address on that network.
When all attempts to contact a DHCP server have failed,
.Nm
will try to validate the static lease, and if it
succeeds, it will use that lease until it is restarted.
.Pp
A mobile host may also travel to some networks on which DHCP is not
available but BOOTP is.
In that case, it may be advantageous to
arrange with the network administrator for an entry on the BOOTP
database, so that the host can boot quickly on that network rather
than cycling through the list of old leases.
.Sh NOTES
You must have the Berkeley Packet Filter (BPF) configured in your kernel
.Nm
requires at least one
.Pa /dev/bpf*
file for each broadcast network interface that is attached to your system.
See
.Xr bpf 4
for more information.
.Sh FILES
.Bl -tag -width /var/db/dhclient.leases~ -compact
.It Pa /etc/dhclient.conf
DHCP client configuration file
.It Pa /var/db/dhclient.leases
database of acquired leases
.It Pa /var/db/dhclient.leases~
backup of dhclient.leases
.It Pa /var/run/dhclient.pid
process ID of
.Nm
.El
.Sh SEE ALSO
.Xr dhclient.conf 5 ,
.Xr dhclient.leases 5 ,
.Xr dhclient-script 8 ,
.Xr dhcp 8 ,
.Xr dhcpd 8 ,
.Xr dhcrelay 8
.Sh AUTHOR
.Nm
has been written for the Internet Software Consortium
by Ted Lemon <mellon@fugue.com> in cooperation with Vixie
Enterprises.
To learn more about the Internet Software Consortium, see
.Pp
.Dl http://www.vix.com/isc.
.Pp
To learn more about Vixie Enterprises, see
.Pp
.Dl http://www.vix.com.
.Pp
This client was substantially modified and enhanced by Elliot Poger
for use on Linux while he was working on the MosquitoNet project at
Stanford.
.Pp
The current version owes much to Elliot's Linux enhancements, but
was substantially reorganized and partially rewritten by Ted Lemon
so as to use the same networking framework that the Internet Software
Consortium DHCP server uses.
Much system-specific configuration code
was moved into a shell script so that as support for more operating
systems is added, it will not be necessary to port and maintain
system-specific configuration code to these operating systems - instead,
the shell script can invoke the native tools to accomplish the same
purpose.
