openbsd/src/share/man/man4/man4.powerpc/adb.4
.\" $OpenBSD: adb.4,v 1.1 2001/08/21 19:58:03 drahn Exp $
.\"
.\" Copyright (c) 2001 Peter Philipp
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 30, 2001
.Dt ADB 4 powerpc
.Os 

.Sh NAME
.Nm adb
.Nd Apple Desktop Bus driver
.Sh SYNOPSIS
.Cd "adb at macobio?"
.Sh DESCRIPTION
The Apple Desktop Bus driver handles I/O devices such as ADB Keyboard, pointing
devices such as trackball or mouse, and special function buttons.
.Sh SEE ALSO
.Xr abtn 4,
.Xr aed 4,
.Xr ams 4
.Sh AUTHORS
The direct ADB routines were written by
.Sy John P. Wittkoski.
The autoconf and attach routines seem to be written by 
.Sy Bradley A. Grantham.
