openbsd/src/share/man/man4/man4.powerpc/ams.4
.\" $OpenBSD: ams.4,v 1.1 2001/08/21 19:58:03 drahn Exp $
.\"
.\" Copyright (c) 2001 Peter Philipp
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 30, 2001
.Dt AMS 4 powerpc
.Os 

.Sh NAME
.Nm ams
.Nd Apple Mouse Support
.Sh SYNOPSIS
.Cd "ams* at adb?"
.Sh DESCRIPTION
The 
.Nm 
driver supports a series of 
.Xr adb 4
mice, trackballs, trackpads and tablets.
.Pp
.Bl -bullet -compact
.It
Extended Mouse Protocol
.It
Mouse Systems A^3 Mouse
.It
MicroSpeed Mouse Deluxe
.It
Contour mouse
.It
Kensington Turbo Mouse
.It
Logitech non-EMP Mouseman
.It
TrackMan trackball
.El
.Sh SEE ALSO
.Xr adb 4
.Sh AUTHORS
The 
.Nm
driver was written by
.Sy Colin Wood.
