openbsd/src/usr.sbin/pcmciad/pcmciad.8
.\" Copyright (c) 1995 John T. Kohl
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR `AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$Id: pcmciad.8,v 1.3 1998/12/15 01:20:48 aaron Exp $
.\"
.Dd October 29, 1995
.Dt PCMCIAD 8
.Os OpenBSD
.Sh NAME
.Nm pcmciad
.Nd PC-CARD slot monitor daemon
.Sh SYNOPSIS
.Nm pcmciad
.Op Fl d
.Op Fl q
.Op Fl c Ar conf-file
.Sh DESCRIPTION
.Nm
monitors a set of PCMCIA slots for card change events, and acts on those
events.
It reads the configuration file specified with the
.Fl c
flag, or, if no file is specified, the default configuration file
.Pa /etc/pcmciad.conf .
.Pp
Each line of the configuration file contains a list of PCMCIA slot
device files to monitor and a command name for that slot.
Whenever a card event occurs on a monitored slot,
.Nm
attempts to
configure (upon insertion) or unconfigure (upon removal) the card.  If
the action succeeds, the slot's command is run, passed the slot number,
event type (insert or delete), and device type name.
.Pp
.Nm
announces card insertion/configuration/removal events on the speaker
(using the
.Pa /dev/speaker
device).  A short high note announces a card insertion.  A low note
followed by a high note indicates successful card configuration; a
single low note indicates an unknown card or configuration failure.  A
high note followed by a low note indicates a card removal.
.Pp
When the
.Fl q
flag is specified, the card insertion/removal events are not announced
on the speaker.
.Sh SEE ALSO
.Xr speaker 4 ,
.Xr config_slot 8 ,
.Xr pcmcia_cntrl 8
.Sh HISTORY
The
.Nm pcmciad
command appeared in
.Ox 1.2 .
