openbsd/src/games/ppt/ppt.6
.\"	$OpenBSD: ppt.6,v 1.2 2014/11/18 02:25:12 schwarze Exp $
.\"
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)bcd.6	8.1 (Berkeley) 5/31/93
.\"
.Dd $Mdocdate: November 18 2014 $
.Dt PPT 6
.Os
.Sh NAME
.Nm ppt
.Nd reformat input as paper tape
.Sh SYNOPSIS
.Nm
.Op Ar string ...
.Nm
.Fl d
.Op Fl b
.Sh DESCRIPTION
The
.Nm ppt
command reads the given input and reformats it in the form of paper tape.
Acceptable input are command line arguments or the standard input.
.Pp
The options are as follows:
.Bl -tag -width 7n
.It Fl d Op Fl b
Decode paper tape on the standard input back to ASCII.
Unprintable characters are visually encoded with
.Xr vis 3
unless the
.Fl b
option (binary) is also specified.
A lowercase
.Sq x
is printed for undecipherable input lines.
.El
.Sh SEE ALSO
.Xr bcd 6
.Sh STANDARDS
.Rs
.%I ECMA-10
.%R "ECMA Standard for Data Interchange on Punched Tape"
.Re
.Sh HISTORY
The
.Nm
command first appeared in
.Bx 4.3 Tahoe .
The options
.Fl d
and
.Fl b
first appeared in
.Ox 3.3 .
.Sh AUTHORS
.An Keith Bostic
.An Paul Janzen Aq Mt pjanzen@foatdi.net
.An Michael Shalayeff Aq Mt mickey@lucifier.net
