openbsd/src/usr.sbin/tftpd/tftpd.8
.\"   $OpenBSD: tftpd.8,v 1.3 2012/03/04 05:30:47 dlg Exp $
.\"
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)tftpd.8	6.7 (Berkeley) 5/13/91
.\"
.Dd $Mdocdate: March 4 2012 $
.Dt TFTPD 8
.Os
.Sh NAME
.Nm tftpd
.Nd DARPA Trivial File Transfer Protocol daemon
.Sh SYNOPSIS
.Nm tftpd
.Op Fl 46cdv
.Op Fl l Ar address
.Op Fl p Ar port
.Op Fl r Ar socket
.Ar directory
.Sh DESCRIPTION
.Nm
is a server which implements the
.Tn DARPA
Trivial File Transfer Protocol.
.Pp
The use of
.Xr tftp 1
does not require an account or password on the remote system.
Due to the lack of authentication information,
.Nm
will allow only publicly readable files to be accessed.
Files may be written only if they already exist and are publicly writable,
unless the
.Fl c
flag is specified
.Pq see below .
Note that this extends the concept of
.Dq public
to include
all users on all hosts that can be reached through the network;
this may not be appropriate on all systems, and its implications
should be considered before enabling TFTP service.
.Pp
The server must be started as root, but will chroot to the
.Ar directory
specified on the command line and drop privileges to the _tftpd user.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl 4
Forces
.Nm
to use IPv4 addresses only.
.It Fl 6
Forces
.Nm
to use IPv6 addresses only.
.It Fl c
Allow new files to be created;
otherwise uploaded files must already exist.
Files are created with default permissions
allowing anyone to read or write to them.
.It Fl d
Do not daemonize.
If this option is specified,
.Nm
will run in the foreground and log
the client IP, type of request, and filename to stderr.
.It Fl l Ar address
Listen on the specified address.
By default
.Nm
listens on wildcard addresses.
.It Fl p Ar port
Listen on the specified port.
By default
.Nm
listens on the port indicated in the
.Ql tftp
service description; see
.Xr services 5 .
.It Fl r Ar socket
Issue filename rewrite requests to the specified UNIX domain socket.
By default
.Nm
does not use filename rewriting.
If the rewrite socket is used,
.Nm
will write lines in the format "IP OP filename", terminated by a newline,
where IP is the client's IP address, and OP is one of "read" or "write".
.Nm
expects replies in the format "filename" terminated by a newline.
All rewrite requests from the daemon must be answered
(even if it is with the original filename)
before the TFTP request will continue.
.It Fl v
Log the client IP, type of request, and filename.
.It Ar directory
.Xr chroot 2
to
.Ar directory
on startup;
the remote host is not expected to pass the directory
as part of the file name to transfer.
.El
.Sh SEE ALSO
.Xr tftp 1 ,
.Xr pxeboot 8 ,
.Xr syslogd 8 ,
.Xr tftp-proxy 8
.Sh HISTORY
The
.Nm
command was originally a process run via
.Xr inetd 8
and appeared in
.Bx 4.2 .
It was rewritten for
.Ox 5.2
as a persistent non-blocking daemon.
.Sh BUGS
Many TFTP clients will not transfer files over 16744448 octets
.Pq 32767 blocks .
