openbsd/src/usr.bin/script/script.1
.\"	$OpenBSD: script.1,v 1.16 2018/07/13 16:59:46 cheloha Exp $
.\"	$NetBSD: script.1,v 1.3 1994/12/21 08:55:41 jtc Exp $
.\"
.\" Copyright (c) 1980, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)script.1	8.1 (Berkeley) 6/6/93
.\"
.Dd $Mdocdate: July 13 2018 $
.Dt SCRIPT 1
.Os
.Sh NAME
.Nm script
.Nd make typescript of terminal session
.Sh SYNOPSIS
.Nm script
.Op Fl a
.Op Fl c Ar command
.Op Ar file
.Sh DESCRIPTION
.Nm
makes a typescript of everything printed on your terminal.
It is useful for students who need a hardcopy record of an interactive
session as proof of an assignment, as the typescript file
can be printed out later with
.Xr lpr 1 .
.Pp
If the argument
.Ar file
is given,
.Nm
saves all dialogue in
.Ar file .
If no file name is given, the typescript is saved in the file
.Pa typescript .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl a
Append the output to
.Ar file
or
.Pa typescript ,
retaining the prior contents.
.It Fl c Ar command
Run
.Ar command
instead of an interactive shell.
To run a command with arguments, enclose both in quotes.
.El
.Pp
The script ends when the forked program exits (a control-D
.Pq Ql ^D
to exit
the Bourne shell
.Pf ( Xr sh 1 ) ,
and
.Ic exit ,
.Ic logout ,
or control-D
(if
.Va ignoreeof
is not set) for the
C-shell,
.Xr csh 1 ) .
.Nm
will exit with the status of 0 unless any of its child
processes fail.
In which case,
.Nm
will return 1.
.Pp
Certain interactive commands, such as
.Xr vi 1 ,
create garbage in the typescript file.
.Nm
works best with commands that do not manipulate the
screen; the results are meant to emulate a hardcopy terminal.
.Sh ENVIRONMENT
.Bl -tag -width SHELL
.It Ev SHELL
Name of the shell to be forked by
.Nm script .
If not set, the Bourne shell is assumed.
(Most shells set this variable automatically.)
.El
.Sh EXAMPLES
Start a virtual machine and log all console output to a file:
.Bd -literal -offset indent
$ script -c "vmctl start myvm -c" myvm.typescript
.Ed
.Sh HISTORY
A predecessor called
.Nm dribble
appeared in
.Bx 2 .
The
.Nm
command first appeared in
.Bx 3 .
.Sh AUTHORS
.An Mary Ann Horton .
.Sh BUGS
.Nm
places
.Em everything
in the log file, including linefeeds and backspaces.
This is not what the naive user expects.
