openbsd/src/share/man/man4/aac.4
.\"	$OpenBSD: aac.4,v 1.7 2001/03/08 00:27:44 brad Exp $
.\"
.Dd November 7, 2000
.Dt AAC 4
.Os
.Sh NAME
.Nm aac
.Nd Adaptec RAID driver
.Sh SYNOPSIS
.Cd "aac* at pci? dev ? function ?"
.Cd "scsibus* at aac?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Adaptec's "FSA" family of raid controllers,
including the
.Tn AAC2622 ,
.Tn AAC364 ,
.Tn AAC3642 ,
.Tn Dell PERC 2/Si ,
.Tn Dell PERC 3/Di ,
.Tn Dell PERC 3/Si ,
.Tn Dell PERC 2/QC ,
.Tn Dell PERC 3/QC and
.Tn HP NetRaid-4M
models.
.Pp
All the RAID set volume management is done via the card BIOS.
.Pp
This driver makes drives and/or RAID sets appear as
.Xr sd 4 .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr sd 4
.Sh AUTHORS
The
.Nm
driver was written by
.An Niklas Hallqvist Aq niklas@openbsd.org ,
inspired by the
.Fx
driver by
.An Mike Smith Aq msmith@freebsd.org .
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 2.9 .
.Sh BUGS
.Pp
The card provides a mechanism to do online RAID set management,
unfortunately the protocol is not public.
.Pp
Only Dell PERC 3/Si was tested, but others should work.
