openbsd/src/share/man/man4/aac.4
.\"	$OpenBSD: aac.4,v 1.14 2004/05/28 19:49:01 marco Exp $
.\"
.\" Copyright (c) 2000 Michael Smith
.\" Copyright (c) 2000 BSDi
.\" Copyright (c) 2000 Niklas Hallqvist
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 7, 2000
.Dt AAC 4
.Os
.Sh NAME
.Nm aac
.Nd Adaptec RAID driver
.Sh SYNOPSIS
.Cd "aac* at pci? dev ? function ?"
.Cd "scsibus* at aac?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Adaptec's "FSA" family of RAID controllers,
including:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Adaptec AAC-2622, AAC-364, AAC-3642
.It Adaptec 1210SA, 2410SA, 2610SA, 2810SA, 21610SA
.It Dell CERC-SATA, PERC 320/DC
.It Dell PERC 2/QC, PERC 2/Si, PERC 3/Si, PERC 3/Di
.It HP NetRaid-4M
.El
.Pp
All the RAID set volume management is done via the card BIOS.
.Pp
This driver makes drives and/or RAID sets appear as
.Xr sd 4 .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr sd 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 2.9 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Niklas Hallqvist Aq niklas@openbsd.org ,
inspired by the
.Fx
driver by
.An Mike Smith Aq msmith@freebsd.org .
.Sh BUGS
The card provides a mechanism to do online RAID set management,
unfortunately the protocol is not public.
