openbsd/src/share/man/man4/abl.4
.\"	$OpenBSD: abl.4,v 1.2 2020/09/15 21:06:20 jmc Exp $
.\"
.\" Copyright (c) 2020 Marcus Glocker <mglocker@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.\"
.Dd $Mdocdate: September 15 2020 $
.Dt ABL 4
.Os
.Sh NAME
.Nm abl
.Nd Apple backlight support
.Sh SYNOPSIS
.Cd "abl* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver enables access to the backlight found in Intel based Apple computers.
It provides brightness control using the
.Xr wsconsctl 8
variable
.Va display.brightness .
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr intro 4 ,
.Xr wsconsctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Marcus Glocker Aq Mt mglocker@openbsd.org .
