openbsd/src/share/man/man4/ac97.4
.\"	$OpenBSD: ac97.4,v 1.1 1999/10/06 18:57:45 csapuntz Exp $
.Dd October 7, 1999
.Dt AC97 4
.Os
.Sh NAME
.Nm ac97
.Nd
generic AC-97 codec driver
.Sh DESCRIPTION
AC-97 codecs contain the analog-to-digital (A/D), digital-to-analog
(D/A), and mixing circuitry of many modern sound cards. AC-97 codecs,
for the most part, do not talk to host busses like the PCI bus
directly. Instead, they communicate through an interface chip, called
the host controller. The Ensoniq AudioPCI 97 (see
.Xr eap 4 
) is an example of such a host controller.
.Pp
Unlike many drivers, the
.Nm
driver does not appear in the configuration file. Instead, the driver 
is automatically attached by the drivers that require it.
.Sh SEE ALSO
.Xr eap 4 .
.Sh BUGS
The
.Nm
driver does not keep track of the current user settings and instead
relies on the hardware to do this.
.Pp
The
.Nm
driver could do more to detect mixer channels that don't work and cull
them from the list.
.Pp
