openbsd/src/share/man/man4/acpi.4
.\"	$OpenBSD: acpi.4,v 1.1 2006/01/07 10:25:42 grange Exp $
.\"
.\" Copyright (c) 2006 Alexander Yurchenko <grange@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd January 7, 2006
.Dt ACPI 4
.Os
.Sh NAME
.Nm acpi
.Nd Advanced Configuration and Power Interface
.Sh SYNOPSIS
.Cd "acpi0 at mainbus?"
.Pp
.Cd "option ACPIVERBOSE"
.Cd "option ACPI_ENABLE"
.Sh DESCRIPTION
The
.Nm
driver provides basic support for the ACPI including loading ACPI tables from
the firmware, parsing and interpreting AML code, events handling,
suspending and powering off, attaching device drivers.
.Pp
If configuration option
.Dq Dv ACPIVERBOSE
is set the information about all found ACPI devices will be displayed on boot.
.Pp
If configuration option
.Dq Dv ACPI_ENABLE
is set the
.Nm
driver will take over the ACPI control.
WARNING: this may cause an overheating on some machines since the
.Nm
doesn't provide any thermal and cooling control.
.Sh SUPPORTED DEVICES
.Bl -tag -width 12n -offset ind -compact
.It Xr acpitimer 4
ACPI power management timer
.El
.Sh SEE ALSO
.Xr acpitimer 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Thorsten Lockert Aq tholo@sigmasoft.com .
