openbsd/src/share/man/man4/acpihid.4
.\"	$OpenBSD: acpihid.4,v 1.1 2020/06/02 16:24:24 jcs Exp $
.\"
.\" Copyright (c) 2020 joshua stein <jcs@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 2 2020 $
.Dt ACPIHID 4
.Os
.Sh NAME
.Nm acpihid
.Nd ACPI HID event and 5-button array
.Sh SYNOPSIS
.Cd "acpihid* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver supports ACPI HID events and 5-button array devices found on some
tablet devices.
.Sh SEE ALSO
.Xr acpi 4 ,
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An joshua stein Aq Mt jcs@jcs.org .
