openbsd/src/share/man/man4/acpi.4
.\"	$OpenBSD: acpi.4,v 1.53 2017/03/30 16:06:55 jcs Exp $
.\"
.\" Copyright (c) 2006 Alexander Yurchenko <grange@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 30 2017 $
.Dt ACPI 4
.Os
.Sh NAME
.Nm acpi
.Nd Advanced Configuration and Power Interface
.Sh SYNOPSIS
.Cd "acpi0 at bios?"
.Sh DESCRIPTION
The
.Nm
driver provides basic support for ACPI including loading ACPI tables from
the firmware, parsing and interpreting AML code, event handling,
suspending and powering off, and attaching device drivers.
Userland may access
.Nm
by using the
.Xr apm 4
device.
.Pp
The following devices can attach to
.Nm :
.Pp
.Bl -tag -width "acpithinkpad(4)XXX" -offset indent -compact
.It Xr acpiac 4
ACPI AC adapter
.It Xr acpials 4
ACPI ambient light sensor
.It Xr acpiasus 4
ASUS ACPI hotkeys
.It Xr acpibat 4
ACPI control method battery
.It Xr acpibtn 4
ACPI button
.It Xr acpicbkbd 4
Chromebook keyboard backlight
.It Xr acpicpu 4
ACPI processor power and performance state
.It Xr acpidock 4
ACPI docking station
.It Xr acpiec 4
ACPI embedded controller
.It Xr acpihpet 4
ACPI high precision event timer
.It Xr acpihve 4
Hyper-V entropy
.It Xr acpimadt 4
ACPI APIC configuration
.It Xr acpimcfg 4
ACPI PCI Express configuration space
.It Xr acpiprt 4
ACPI PCI routing table configuration
.It Xr acpipwrres 4
ACPI power resources
.It Xr acpisbs 4
ACPI Smart Battery subsystem
.It Xr acpisony 4
Sony ACPI control
.It Xr acpithinkpad 4
IBM/Lenovo ThinkPad ACPI support
.It Xr acpitimer 4
ACPI power management timer
.It Xr acpitoshiba 4
Toshiba ACPI support
.It Xr acpitz 4
ACPI thermal zone
.It Xr acpivideo 4
ACPI video
.It Xr acpivout 4
ACPI video output
.It Xr aibs 4
ASUSTeK AI Booster ACPI ATK0110 temperature, voltage, and fan sensor
.It Xr bytgpio 4
Intel Bay Trail GPIO controller
.It Xr chvgpio 4
Intel Cherry View GPIO controller
.It Xr dwiic 4
Synopsys DesignWare I2C controller
.It Xr tpm 4
Trusted Platform Module device
.El
.Sh FILES
.Bl -tag -width "/dev/apmctlXXX"
.It /dev/apm
Power management data device.
May only be opened read-only.
May be opened by multiple concurrent users.
.It /dev/apmctl
Power management control device.
May be opened read-write or write-only.
May only be opened by one user at a time.
An attempt to open the file when in use will fail, returning
.Er EBUSY .
.El
.Sh SEE ALSO
.Xr apm 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Thorsten Lockert Aq Mt tholo@sigmasoft.com
and
.An Jordan Hargrave Aq Mt jordan@openbsd.org .
