openbsd/src/share/man/man4/acpi.4
.\"	$OpenBSD: acpi.4,v 1.8 2006/10/02 19:39:54 mk Exp $
.\"
.\" Copyright (c) 2006 Alexander Yurchenko <grange@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd January 7, 2006
.Dt ACPI 4
.Os
.Sh NAME
.Nm acpi ,
.Nm acpibat ,
.Nm acpihpet ,
.Nm acpitimer
.Nd Advanced Configuration and Power Interface
.Sh SYNOPSIS
.Cd "acpi0 at mainbus?"
.Cd "acpibat* at acpi?"
.Cd "acpihpet* at acpi?"
.Cd "acpitimer* at acpi?"
.Pp
.Cd "option ACPIVERBOSE"
.Cd "option ACPI_ENABLE"
.Sh DESCRIPTION
The
.Nm
driver provides basic support for ACPI including loading ACPI tables from
the firmware, parsing and interpreting AML code, event handling,
suspending and powering off, and attaching device drivers.
.Pp
The
.Nm acpibat
driver supports the ACPI Control Method Battery interface between the
battery and the host.
Information about the battery, such as capacity, recharge rate, voltage,
and serial number, is available through this driver.
Battery status is updated every 10 seconds.
.Pp
The
.Nm acpihpet
driver provides support for the high precision event timer to be used
as a timecounter for the
.Xr tc_init 9
framework.
.Pp
The
.Nm acpitimer
driver allows access to a power management timer through the ACPI.
The timer is used as a timecounter for the
.Xr tc_init 9
framework.
.Pp
If the configuration option
.Dq Dv ACPIVERBOSE
is set, information about all detected ACPI devices will be displayed
on boot.
.Pp
If the configuration option
.Dq Dv ACPI_ENABLE
is set, the
.Nm
driver will take control of ACPI from the firmware (BIOS).
WARNING: this may cause an overheating on some machines since
.Nm
doesn't provide any thermal or cooling control.
.Pp
Some devices, such as
.Nm acpibat ,
provide hardware information via sensors
that can be monitored using
.Xr sysctl 8
or
.Xr sensorsd 8 .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8 ,
.Xr tc_init 9
.Sh HISTORY
The
.Nm acpi ,
.Nm acpibat ,
.Nm acpihpet ,
and
.Nm acpitimer
drivers first appeared in
.Ox 3.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm acpi ,
.Nm acpihpet ,
and
.Nm acpitimer
drivers were written by
.An Thorsten Lockert Aq tholo@sigmasoft.com .
The
.Nm acpibat
driver was written by
.An Marco Peereboom Aq marco@openbsd.org .
.Sh BUGS
Some systems do not propagate battery insertion up to the driver.
.Pp
Smart Battery Specification-based batteries are not supported.
