openbsd/src/share/man/man4/acpiprt.4
.\"	$OpenBSD: acpiprt.4,v 1.1 2007/01/11 21:31:48 mk Exp $
.\"
.\" Copyright (c) 2007 Michael Knudsen <mk@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd January 10, 2007
.Dt ACPIPRT 4
.Os
.Sh NAME
.Nm acpiprt
.Nd ACPI PCI Routing Table configuration
.Sh SYNOPSIS
.Cd "acpiprt* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver provides interrupt mapping information for PCI devices based on
information from ACPI PCI Routing Table objects.
Typically there is one PCI Routing Table object for every PCI bus in
the system, each handled by a seperate
.Nm
device.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr intro 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
