openbsd/src/share/man/man4/acpi.4
.\"	$OpenBSD: acpi.4,v 1.25 2007/11/28 12:58:30 tedu Exp $
.\"
.\" Copyright (c) 2006 Alexander Yurchenko <grange@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 28 2007 $
.Dt ACPI 4
.Os
.Sh NAME
.Nm acpi
.Nd Advanced Configuration and Power Interface
.Sh SYNOPSIS
.Cd "acpi0 at mainbus?"
.Pp
.Cd "option ACPIVERBOSE"
.Sh DESCRIPTION
The
.Nm
driver provides basic support for ACPI including loading ACPI tables from
the firmware, parsing and interpreting AML code, event handling,
suspending and powering off, and attaching device drivers.
.Pp
If the configuration option
.Dq Dv ACPIVERBOSE
is set, information about all detected ACPI devices will be displayed
on boot.
Userland may access
.Nm
by using the
.Xr apm 4
device.
.Pp
The following devices can attach to
.Nm :
.Pp
.Bl -tag -width "acpitimer(4)XXX" -offset indent -compact
.It Xr acpiac 4
ACPI AC adapter
.It Xr acpibat 4
ACPI control method battery
.It Xr acpibtn 4
ACPI button
.It Xr acpicpu 4
ACPI processor power and performance state
.It Xr acpidock 4
ACPI docking station
.It Xr acpiec 4
ACPI embedded controller
.It Xr acpihpet 4
ACPI high precision event timer
.It Xr acpimadt 4
ACPI APIC configuration
.It Xr acpiprt 4
ACPI PCI routing table configuration
.It Xr acpitimer 4
ACPI power management timer
.It Xr acpitz 4
ACPI thermal zone
.El
.Sh SEE ALSO
.Xr apm 4
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Thorsten Lockert Aq tholo@sigmasoft.com
and
.An Jordan Hargrave Aq jordan@openbsd.org .
