openbsd/src/share/man/man4/acpimadt.4
.\"	$OpenBSD: acpimadt.4,v 1.2 2007/01/12 19:59:51 jmc Exp $
.\"
.\" Copyright (c) 2006 Michael Knudsen <mk@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd January 10, 2007
.Dt ACPIMADT 4
.Os
.Sh NAME
.Nm acpimadt
.Nd ACPI APIC configuration
.Sh SYNOPSIS
.Cd "acpimadt* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver configures system processors and IO APICs based on information
extracted from the ACPI APIC table.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr cpu 4 ,
.Xr intro 4 ,
.Xr ioapic 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
