openbsd/src/share/man/man4/acpitoshiba.4
.\"	$OpenBSD: acpitoshiba.4,v 1.2 2011/06/17 11:52:31 jmc Exp $
.\"
.\" Copyright (c) 2011 Paul Irofti <pirofti@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.\"
.Dd $Mdocdate: June 17 2011 $
.Dt ACPITOSHIBA 4
.Os
.Sh NAME
.Nm acpitoshiba
.Nd Toshiba ACPI support
.Sh SYNOPSIS
.Cd "acpitoshiba* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver provides ACPI support for Toshiba laptops.
It supports output switching and brightness adjustment.
Brightness can be adjusted either using a brightness hotkey or the
.Xr wsconsctl 8
variable
.Va display.brightness ,
while output switching is achieved only through the hotkey.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Hiroyuki Aizu <aizu@navi.org>
