openbsd/src/share/man/man4/admtemp.4
.\"	$OpenBSD: admtemp.4,v 1.2 2005/12/24 22:14:15 deraadt Exp $
.\"
.\" Copyright (c) 2005 Theo de Raadt <deraadt@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd May 16, 2004
.Dt ADMTEMP 4
.Os
.Sh NAME
.Nm admtemp
.Nd Analog Devices ADM1021 temperature sensor
.Sh SYNOPSIS
.Cd "admtemp* at maciic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Analog Devices ADM1021
temperature sensor.
The device possesses internal and external temperature sensors.
These values are made available through the
.Xr sysctl 8
interface.
.Pp
On i386 machines, this driver also supports the Xeon embedded
i2c temperature probes.
In this case, however, only one temperature value is provided.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Theo de Raadt Aq deraadt@openbsd.org .
