openbsd/src/share/man/man4/adt.4
.\"	$OpenBSD: adt.4,v 1.14 2012/07/12 20:12:02 jasper Exp $
.\"
.\" Copyright (c) 2005 Theo de Raadt <deraadt@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 12 2012 $
.Dt ADT 4
.Os
.Sh NAME
.Nm adt
.Nd Analog Devices ADT7460 temperature, voltage, and fan sensor
.Sh SYNOPSIS
.Cd "adt* at iic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Analog Devices ADT7460,
Analog Devices ADT7465, Analog Devices ADT7475,
Analog Devices ADT7476, Analog Devices ADT7477,
Analog Devices ADM1027, National Semiconductor LM85,
National Semiconductor LM96000, SMSC EMC6D10x,
SMSC SCH5017 and SMC SCH5027 temperature sensors.
The sensor possesses a collection of sensor values which are
made available through the
.Xr sysctl 8
interface.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.9 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Theo de Raadt Aq deraadt@openbsd.org .
