openbsd/src/share/man/man4/adv.4
.\"	$OpenBSD: adv.4,v 1.19 2004/09/30 19:59:23 mickey Exp $
.\"
.\" Copyright (c) 1998, Jason Downs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd September 28, 1998
.Dt ADVANSYS 4
.Os
.Sh NAME
.Nm advansys
.Nd AdvanSys PCI SCSI Host Adapters
.Sh SYNOPSIS
.Cd "adv* at pci?"
.Cd "scsibus* at adv?"
.Cd "adw* at pci?"
.Cd "scsibus* at adw?"
.Sh DESCRIPTION
The
.Nm
drivers support most AdvanSys PCI SCSI host adapters, as shown in this
table:
.Bl -column "ABP940UWxxxxx" "ASB3940U2W-00" -offset indent
.It Nm adv	adw
.It ABP-920	ABP-940UW
.It ABP-930 (1)	ABP-940UWD
.It ABP-930U	ABP-970UW
.It ABP-930UA	ASB-3940UW-00
.It ABP-940	ASB-3940U2W-00
.It ABP-940U	ASB-3950U160
.It ABP-940UA
.It ABP-950
.It ABP-960 (2)
.It ABP-960U (2)
.It ABP-970
.It ABP-970U
.It ABP-980
.It ABP-980U
.El
.Pp
.Bl -enum -compact
.It
This board has been sold by SIIG as the Fast SCSI Pro PCI.
.It
This board has been sold by Iomega as a Jaz Jet PCI adapter.
.El
.Pp
The
.Nm adw
driver will log some host adapter errors with general messages such as
.Bd -literal -offset indent
adw0:0:0: host adapter error 0x12. See adw(4).
adw0:0:0: host adapter error 0x12, resetting bus. See adw(4).
.Ed
.Pp
Some further information on the meaning of such errors can be obtained
from the following table derived from the source code provided by
ConnectCom.
.Bl -column "Error" "QHSTA_M_SCSI_BUS_RESET_UNSOL"
.It Em Error	Define Name	Comment
.Pp
.It 0x12	QHSTA_M_SXFR_XFR_OFLW	SXFR_STATUS Transfer Overflow
.It 0x13	QHSTA_M_UNEXPECTED_BUS_FREE
.It 0x15	QHSTA_M_QUEUE_ABORTED
.It 0x16	QHSTA_M_SXFR_SDMA_ERR	SXFR_STATUS SCSI DMA Error
.It 0x17	QHSTA_M_SXFR_SXFR_PERR	SXFR_STATUS SCSI Bus Parity Error
.It 0x18	QHSTA_M_RDMA_PERR	RISC PCI DMA parity error
.It 0x19	QHSTA_M_SXFR_OFF_UFLW	SXFR_STATUS Offset Underflow
.It 0x20	QHSTA_M_SXFR_OFF_OFLW	SXFR_STATUS Offset Overflow
.It 0x21	QHSTA_M_SXFR_WD_TMO	SXFR_STATUS Watchdog Timeout
.It 0x22	QHSTA_M_SXFR_DESELECTED	SXFR_STATUS Deselected
.It 0x24	QHSTA_M_SXFR_XFR_PH_ERR	SXFR_STATUS Transfer Phase Error
.It 0x25	QHSTA_M_SXFR_UNKNOWN_ERROR	SXFR_STATUS Unknown Error
.It 0x30	QHSTA_M_SCSI_BUS_RESET	Request aborted from SBR
.It 0x31	QHSTA_M_SCSI_BUS_RESET_UNSOL	Request aborted from unsolicited SBR
.It 0x32	QHSTA_M_BUS_DEVICE_RESET	Request aborted from BDR
.It 0x35	QHSTA_M_DIRECTION_ERR	Data Phase mismatch
.It 0x36	QHSTA_M_DIRECTION_ERR_HUNG	Data Phase mismatch and bus hang
.It 0x41	QHSTA_M_WTM_TIMEOUT
.It 0x42	QHSTA_M_BAD_CMPL_STATUS_IN
.It 0x43	QHSTA_M_NO_AUTO_REQ_SENSE
.It 0x44	QHSTA_M_AUTO_REQ_SENSE_FAIL
.It 0x45	QHSTA_M_INVALID_DEVICE	Bad target ID
.It 0x46	QHSTA_M_FROZEN_TIDQ	TID Queue frozen
.It 0x47	QHSTA_M_SGBACKUP_ERROR	Scatter-Gather backup error
.El
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr ss 4 ,
.Xr st 4 ,
.Xr uk 4
.Pp
.Pa http://www.connectcom.net/
.Sh AUTHORS
The
.Nm
drivers were originally written by Baldassare Dante Profeta for
.Nx ,
based on Linux drivers written by Advanced System Products,
Inc., which is now ConnectCom Solutions, Inc.
