openbsd/src/share/man/man4/adv.4
.\"	$OpenBSD: adv.4,v 1.1 1998/09/28 08:02:52 downsj Exp $
.\"
.\" Copyright (c) 1998, Jason Downs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd September 28, 1998
.Dt ADV 4
.Os
.Sh NAME
.Nm adv
.Nd AdvanSys PCI narrow SCSI Host Adapters
.Sh SYNOPSIS
.Cd "adv* at pci? dev? function?"
.Cd scsibus* at adv?
.Sh DESCRIPTION
The
.Nm
driver supports narrow channel AdvanSys PCI SCSI host adapters.  These include
the ABP-940/970[UA], SIIG Fast SCSI Pro PCI, and Iomega Jaz Jet PCI adapters.
The ABP-1200 series should also work, but have not been tested.
.Pp
.Sh BUGS
Probably.
.Pp
.Sh SEE ALSO
.Xr intro 4 ,
.Xr cd 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr st 4
.Sh AUTHOR
The
.Nm
driver was written by Baldassare Dante Profeta and Advanced System Products,
Inc.
