openbsd/src/share/man/man4/amdpm.4
.\" $OpenBSD: amdpm.4,v 1.8 2006/04/21 06:18:51 gwk Exp $
.\"
.\" Copyright (c) 2002 Michael Shalayeff
.\" All rights reserved
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF MIND, USE, DATA, OR PROFITS; OR
.\" BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
.\" ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 6, 2002
.Dt AMDPM 4
.Os
.Sh NAME
.Nm amdpm
.Nd AMD-756/766/768/8111 Power Management controller
.Sh SYNOPSIS
.Cd "amdpm* at pci?"
.Cd "iic* at amdpm?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
AMD-756/766/768/8111 Power Management controller.
.Pp
The RNG function of the AMD-768/8111 Power Management controller
is supported.
Data generated by the RNG get fed into the pool of the
.Xr random 4
device.
.Pp
The SMBus host interface of the AMD-756/766/768/8111 Power Management controller
and NVIDIA nForce 1 chipset are also supported.
The SMBus host interface can be used with the
.Xr iic 4
framework.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr pci 4 ,
.Xr random 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 3.2 .
SMBus host interface support was added in
.Ox 3.9 .
