openbsd/src/share/man/man4/ami.4
.\"	$OpenBSD: ami.4,v 1.15 2004/02/28 02:14:24 mickey Exp $
.\"
.\" Michael Shalayeff, 2001. Public Domain.
.\"
.Dd February 27, 2004
.Dt AMI 4
.Os
.Sh NAME
.Nm ami
.Nd American Megatrends Inc. MegaRAID Controllers
.Sh SYNOPSIS
.Cd "ami* at pci? dev ? function ?"
.Cd "scsibus* at ami?"
.Sh DESCRIPTION
The
.Nm
driver provides support for MegaRAID family of RAID controllers, including:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It AMI MegaRAID
.It Dell PERC 3Si and 4Di
.It Hewlett-Packard 438, 466 and T[567]
.It LSI/Symbios 523 SATA
.El
.Pp
These controllers support RAID 0, RAID 1, RAID 5, JBOD
and superpositions of those configurations.
.Pp
Some cards support both I2O and so called `Mass Storage' mode
of operation.
This driver only supports the `Mass Storage' mode, I2O mode is supported
by the
.Xr iop 4
driver.
.Pp
Although the controllers are actual RAID controllers the driver makes them
look just like SCSI controllers.
All RAID configuration is done through the controllers' BIOSes.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr iop 4 ,
.Xr pci 4 ,
.Xr scsi 4 ,
.Xr sd 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 2.9 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Michael Shalayeff Aq mickey@openbsd.org .
.Sh BUGS
The
.Tn IDE
versions of these controllers were not tested.
