openbsd/src/share/man/man4/ami.4
.\"	$OpenBSD: ami.4,v 1.6 2001/07/18 18:58:26 mickey Exp $
.\"
.\" Copyright (c) 2001 Michael Shalayeff.  All rights reserved.
.\"
.\"
.Dd March 9, 2001
.Dt AMI 4
.Os
.Sh NAME
.Nm ami
.Nd American Megatrends Inc. MegaRAID Controllers
.Sh SYNOPSIS
.Cd "ami* at pci? dev ? function ?"
.Cd "scsibus* at ami?"
.Sh DESCRIPTION
The
.Nm
driver provides support for MegaRAID family of raid controllers.
.Pp
These controllers support RAID 0, RAID 1, RAID 5, JBOD
and superpositions of those configurations.
.Pp
Some cards support both I2O and so called `Mass Storage' mode
of operation. This driver only supports the later one, I2O
mode is supported by
.Pp
Although the controllers are actual RAID controllers the driver makes them
look just like SCSI controllers.  All RAID configuration is done through
the controllers' BIOSes.
.Xr iop 4
driver.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr iop 4 ,
.Xr scsi 4 ,
.Xr sd 4
.Sh AUTHORS
The
.Nm
driver was written by
.An Michael Shalayeff Aq mickey@openbsd.org .
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 2.9 .
