openbsd/src/share/man/man4/art.4
.\"	$OpenBSD: art.4,v 1.8 2013/06/02 20:23:33 tedu Exp $
.\"
.\" Copyright (c) 2005  Internet Business Solutions AG, Zurich, Switzerland
.\" Written by: Claudio Jeker <jeker@accoom.net>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.\"
.Dd $Mdocdate: June 2 2013 $
.Dt ART 4
.Os
.Sh NAME
.Nm art ,
.Nm musycc
.Nd Accoom Networks Artery T1/E1 network device
.Sh SYNOPSIS
.Cd "musycc* at pci?"
.Cd "art* at musycc?"
.Sh DESCRIPTION
The
.Nm
device driver supports the Accoom Networks Artery Series Network
cards.
This includes the following models:
.Pp
.Bl -item -offset indent -compact
.It
Accoom Artery Single T1/E1 PCI
.It
Accoom Artery Dual T1/E1 PCI
.El
.Pp
The following media types (as given to
.Xr ifconfig 8 )
are supported:
.Pp
.Bl -tag -width "media E1-G.704-CRC4" -offset 3n -compact
.It Cm media No T1
Set T1, B8ZS ESF operation.
.It Cm media No T1-AMI
Set T1, AMI SF operation.
.It Cm media No E1
Set E1, HDB3, G.703 clearchannel operation.
.It Cm media No E1-G.704
Set E1, HDB3, G.704 structured operation without CRC4 checksum.
.It Cm media No E1-G.704-CRC4
Set E1, HDB3, G.704 structured operation with CRC4 checksum.
.El
.Pp
If no media type is set, the
.Nm
driver places the card into E1-G.704-CRC4 mode.
.Pp
The
.Nm
driver supports the following media options for all available media types:
.Pp
.Bl -tag -width "mediaopt ppp" -offset 3n -compact
.It Cm mediaopt No ppp
Use PPP line protocol.
.El
.Pp
If no media options are set,
the card defaults to cHDLC (Cisco High-Level Data Link Control) with 32-bit
HDLC CRC checksum.
.Pp
It is possible to change the timeslot range for the following media types:
.Pp
.Bl -item -offset indent -compact
.It
T1
.It
T1-AMI
.It
E1-G.704
.It
E1-G.704-CRC4
.El
.Pp
If no timeslots are configured, the
.Nm
driver configures the card to use all possible channels.
Use
.Xr ifconfig 8
to change the timeslot range.
For example:
.Pp
Enable all possible channels for this card:
.Dl # ifconfig art0 timeslot all
.Pp
Enable channels 1-31 for this card:
.Dl # ifconfig art0 timeslot 1-31
.Pp
Enable channels 1-15, 16-31 for this card:
.Dl # ifconfig art0 timeslot 1-15,16-31
.Pp
It is possible to change the clock mode of the interface with
.Xr ifconfig 8 .
To use the internal clock as clock source for the line, use
.Em master
mode.
For example:
.Pp
.Dl # ifconfig art0 media E1-G.704 mode master
.Pp
The default mode recovers the clock from the incoming line signal.
This can be explicitly set by using the
.Em autoselect
mode.
For example:
.Pp
.Dl # ifconfig art0 media E1-G.704 mode autoselect
.Sh DIAGNOSTICS
.Bl -diag
.It "art0: device timeout"
The device has stopped responding to the network
.It "art0: internal FIFO underflow"
The internal FIFO got empty while transmitting a packet.
This may indicate a PCI bus congestion.
.It "art0: internal FIFO overflow"
The internal FIFO overflowed while receiving a packet.
This may indicate a PCI bus congestion.
.It "art0: Failed to malloc memory"
There are not enough mbufs available for allocation.
.El
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr pci 4 ,
.Xr sppp 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 3.8 .
.Sh AUTHORS
The
.Nm
device driver was written by Claudio Jeker and Andre Oppermann.
This manual page was written by Claudio Jeker.
