openbsd/src/share/man/man4/atu.4
.\" $OpenBSD: atu.4,v 1.19 2005/03/08 12:59:39 dlg Exp $
.\"
.\" Copyright (c) 1997, 1998, 1999
.\" Bill Paul <wpaul@ctr.columbia.edu>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\" This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 23, 2004
.Dt ATU 4
.Os
.Sh NAME
.Nm atu
.Nd Atmel AT76C50x IEEE 802.11b wireless network driver
.Sh SYNOPSIS
.Cd "# all architectures"
.Cd "atu* at uhub? port ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for wireless network adapters based around
the Atmel AT76C503, AT76C503A, AT76C505, and AT76C505A USB chipsets and four
companion radio chipsets.
.Pp
The
.Nm
driver encapsulates all IP and ARP traffic as 802.11 frames,
though it can receive either 802.11 or 802.3 frames.
.Pp
These are the modes the
.Nm
driver can operate in:
.Bl -tag -width "IBSS-masterXX"
.It BSS mode
Also known as
.Em infrastructure
mode, this is used when associating with an access point, through
which all traffic passes.
This mode is the default.
.It IBSS mode
Also known as
.Em IEEE ad-hoc
mode or
.Em peer-to-peer
mode.
This is the standardized method of operating without an access point.
Stations associate with a service set.
However, actual connections between stations are peer-to-peer.
.El
.Pp
.Nm
supports hardware WEP.
Wired Equivalent Privacy (WEP) is the de facto encryption standard
for wireless networks.
It can be typically configured in one of three modes:
no encryption; 40-bit encryption; or 104-bit encryption.
Unfortunately, due to serious weaknesses in WEP protocol
it is strongly recommended that it not be used as the
sole mechanism to secure wireless communication.
WEP is not enabled by default.
.Sh CONFIGURATION
The
.Nm
driver can be configured at runtime with
.Xr ifconfig 8
or on boot with
.Xr hostname.if 5
using the following parameters:
.Bl -tag -width Ds
.It Cm bssid Ar bssid
Set the desired BSSID.
.It Fl bssid
Unset the desired BSSID.
The interface will automatically select a BSSID in this mode, which is
the default.
.It Cm chan Ar n
Set the channel (radio frequency) to be used by the driver based on
the given channel ID
.Ar n .
.It Fl chan
Unset the desired channel to be used by the driver.
The driver will automatically select a channel in this mode, which is
the default.
.It Cm media Ar media
The
.Nm
driver supports the following
.Ar media
types:
.Pp
.Bl -tag -width autoselect -compact
.It Cm autoselect
Enable autoselection of the media type and options.
.It Cm DS1
Set 802.11b DS 1Mbps operation.
.It Cm DS2
Set 802.11b DS 2Mbps operation.
.It Cm DS5
Set 802.11b DS 5.5Mbps operation.
.It Cm DS11
Set 802.11b DS 11Mbps operation.
.El
.It Cm mediaopt Ar opts
The
.Nm
driver supports the following media options:
.Bl -tag -width ibss
.It Cm ibss
Select Independent Basic Service Set (IBSS) operation.
.El
.It Fl mediaopt Ar opts
Disable the specified media options on the driver and returns it to the
default mode of operation (BSS).
.It Cm nwid Ar id
Set the network ID.
The
.Ar id
can either be any text string up to 32 characters in length,
or a series of hexadecimal digits up to 64 digits.
An empty
.Ar id
string allows the interface to connect to any available access points.
By default the
.Nm
driver uses an empty string.
.It Cm nwkey Ar key
Enable WEP encryption using the specified
.Ar key .
The
.Ar key
can either be a string, a series of hexadecimal digits (preceded by
.Sq 0x ) ,
or a set of keys of the form
.Dq n:k1,k2,k3,k4 ,
where
.Sq n
specifies which of the keys will be used for transmitted packets,
and the four keys,
.Dq k1
through
.Dq k4 ,
are configured as WEP keys.
If a set of keys is specified, a comma
.Pq Sq \&,
within the key must be escaped with a backslash.
Note that if multiple keys are used, their order must be the same within
the network.
.Nm
is capable of using both 40-bit (5 characters or 10 hexadecimal digits)
or 104-bit (13 characters or 26 hexadecimal digits) keys.
.It Fl nwkey
Disable WEP encryption.
This is the default mode of operation.
.El
.Sh HARDWARE
The following devices are known to be supported by the
.Nm
driver:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Tn 3Com 3CRSHEW696
.It Tn AboCom BWU613
.It Tn Accton 2664W
.It Tn Acer Peripherals AWL300
.It Tn Acer Peripherals AWL400
.It Tn Actiontec 802UAT1
.It Tn Addtron AWU120
.It Tn Aincomm AWU2000B
.It Tn Askey Computer Voyager 1010
.It Tn Askey Computer WLL013 (Intersil Radio)
.It Tn Askey Computer WLL013 (RFMD Radio)
.It Tn Atmel AT76C503 (Intersil Radio)
.It Tn Atmel AT76C503 (RFMD Radio)
.It Tn Atmel AT76C505 (RFMD Radio)
.It Tn Atmel AT76C505 (RFMD 2958 Radio)
.It Tn Atmel AT76C505A (RFMD 2958 Radio)
.It Tn Atmel AT76C505AS (RFMD 2958 Radio)
.It Tn Atmel W-Buddie WN210
.It Tn Belkin F5D6050
.It Tn Conceptronic C11U
.It Tn Conceptronic WL210
.It Tn Compaq iPAQ h54xx/h55xx Internal WLAN
.It Tn Corega WLAN USB Stick 11
.It Tn Dick Smith Electronics CHUSB 611G
.It Tn Dick Smith Electronics WL200U
.It Tn Dick Smith Electronics WL240U
.It Tn Dick Smith Electronics XH1153 802.11b
.It Tn D-Link DWL-120 rev E
.It Tn Gigabyte GN-WLBM101
.It Tn Gigaset WLAN
.It Tn Hewlett-Packard HN210W
.It Tn Intel AP310 AnyPoint II
.It Tn I/O DATA USB WN-B11
.It Tn Lexar 2662W-AR
.It Tn Linksys WUSB11 802.11b
.It Tn Linksys WUSB11 802.11b v2.8
.It Tn MSI WLAN
.It Tn Netgear MA101
.It Tn Netgear MA101 rev B
.It Tn OQO model 01 WiFi
.It Tn Planex Communications GW-US11S
.It Tn Samsung SWL2100W
.It Tn Siemens WLL013
.It Tn SMC Ez Connect 11Mbps
.It Tn SMC Ez Connect 11Mbps v2
.It Tn Tekram U-300C
.It Tn Z-Com M4Y-750
.El
.Sh FILES
The adapter needs some firmware files, which are loaded on demand by the
driver when the device is attached:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Pa /etc/firmware/atu-intersil-int
.It Pa /etc/firmware/atu-intersil-ext
.It Pa /etc/firmware/atu-rfmd-int
.It Pa /etc/firmware/atu-rfmd-ext
.It Pa /etc/firmware/atu-rfmd2958-int
.It Pa /etc/firmware/atu-rfmd2958-ext
.It Pa /etc/firmware/atu-rfmd2958smc-int
.It Pa /etc/firmware/atu-rfmd2958smc-ext
.El
.Sh EXAMPLES
The following
.Xr hostname.if 5
example configures atu0 to join whatever network is available on boot,
using WEP key
.Dq 0x1deadbeef1 ,
channel 11, obtaining an IP address using DHCP:
.Bd -literal -offset indent
dhcp NONE NONE NONE nwkey 0x1deadbeef1 chan 11
.Ed
.Pp
Configure atu0 for WEP, using hex key
.Dq 0x1deadbeef1 :
.Bd -literal -offset indent
# ifconfig atu0 nwkey 0x1deadbeef1
.Ed
.Pp
Return atu0 to its default settings:
.Bd -literal -offset indent
# ifconfig atu0 -bssid -chan media autoselect -mediaopt \e
	nwid "" -nwkey
.Ed
.Pp
Join an existing BSS network,
.Dq my_net :
.Bd -literal -offset indent
# ifconfig atu0 192.168.0.2 netmask 0xffffff00 nwid my_net
.Ed
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr usb 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh AUTHORS
The
.Nm
driver was written by
.An Daan Vreeken
and ported to
.Ox
by
.An Theo de Raadt and David Gwynne .
.Sh CAVEATS
The
.Nm
driver does not support a lot of the functionality available in the hardware.
More work is required to properly support the IBSS, power management,
and selectable transmission rate features.
