openbsd/src/share/man/man4/auich.4
.\" $OpenBSD: auich.4,v 1.16 2005/04/05 01:44:41 mickey Exp $
.\"
.\" Copyright (c) 2000-2001 Michael Shalayeff
.\" All rights reserved
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF MIND, USE, DATA, OR PROFITS; OR
.\" BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
.\" ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 30, 2000
.Dt AUICH 4
.Os
.Sh NAME
.Nm auich
.Nd Intel 82801AA/AB/BA/CA/DB/EB/FB, 82440MX, and compatibles PCI audio driver
.Sh SYNOPSIS
.Cd "auich* at pci? flags 0x0000"
.Cd "audio* at auich?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the AC97-based audio present on the Intel
82801AA/AB/BA/CA/DB/EB/FB I/O controller hub
(ICH, ICH0, ICH2, ICH3, ICH4, ICH5, ICH6),
82440MX chipset, SiS 7012, AMD 768, AMD 8111, NVIDIA nForce and nForce2 chips.
The
.Nm
DMA engine supports full-duplex operation and has separate channels
for line input and microphone.
Unfortunately, simultaneous recording from both line and microphone inputs
is not supported due to the current
.Xr ac97 4
design.
Setting
.Ar flags
to 0x0001 will compensate for machines that have reversed stereo.
.Sh SEE ALSO
.Xr ac97 4 ,
.Xr audio 4 ,
.Xr intro 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 2.8 .
.Sh CAVEATS
Some hardware implementations only support 48kHz sampling rates.
