openbsd/src/share/man/man4/awi.4
.\"	$OpenBSD: awi.4,v 1.18 2004/11/08 20:16:02 jmc Exp $
.\"     $NetBSD: awi.4,v 1.1 1999/11/04 19:36:01 sommerfeld Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Bill Sommerfeld
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 20, 2004
.Dt AWI 4
.Os
.Sh NAME
.Nm awi
.Nd BayStack 650 IEEE 802.11FH PCMCIA wireless network driver
.Sh SYNOPSIS
.Cd "awi* at pcmcia?"
.Sh DESCRIPTION
The
.Nm
driver provides support for wireless adapters based upon the AMD 802.11
PCnet Mobile firmware.
This includes the following adapters:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Bay Networks BayStack 650
.It Bay Networks BayStack 660
.It Bay Network AirSurfer Pro
.It AMD Am79C930
.It Icom SL-200
.It Nokia C020
.It Farallon Communications SkyLINE Wireless
.It Zoom Air-4000
.El
.Pp
The PCnet Mobile design is based on an AMD 79c930 controller, which provides
access to 32kb of memory shared between the controller and the host.
All host/device interaction is via this shared memory, which can be
accessed either via PCMCIA memory space or I/O space.
The
.Nm
driver encapsulates all IP and ARP traffic as 802.11 frames.
Transmit speed is fixed at 1Mbps.
.Pp
The driver currently only works in infrastructure mode, communicating
with an Access Point which serves as a link-layer bridge between an
Ethernet and the wireless network.
.Pp
This card seems to take between 5 and 20 seconds after it has been brought up
to synchronize with an AP.
When using
.Xr dhclient 8
to automatically configure an address on this card, it may be
advisable to delay the invocation of dhclient for about 10 seconds
after the card is brought up using
.Xr ifconfig 8 .
.Sh DIAGNOSTICS
.Bl -diag
.It "awi0: unable to allocate memory space; using i/o only"
Indicates that the driver was not able to allocate 32kb of PCMCIA bus
address space into which to map the device; the driver will use the
(slightly slower) i/o-space only access methods to read and write to
the shared memory.
This message is in some sense to be expected and
should not be a cause for alarm.
See
.Xr pcmcia 4
for information on how to increase the memory available to the PCMCIA
controller.
.It "awi0: selftest failed (code %x)"
The device failed to pass its internal selftest.
.It "awi0: device failed to complete selftest (code %x)"
The device failed to complete its self test within 5 seconds.
.It "awi0: device timeout"
.It "awi0: timeout waiting for command completion"
The device failed to generate an interrupt to acknowledge a command.
.It "awi0: transmit timeout"
The device failed to generate an interrupt to acknowledge a
transmitted packet.
.It "awi0: large frame truncated"
The system handed the driver a packet which was too large to transmit
in one piece.
.It "awi0: device enable failed"
The system was unable to power on the card.
.It "awi0: associated with %s, SSID: %s"
The device has successfully synchronized with the identified Access
Point and is ready to relay traffic.
.It "awi0: no recent beacon from %s; rescanning"
The device has not heard a beacon from its currently associated Access
Point recently, and is looking for a new Access Point.
.It "awi0: received deauth"
The Access Point the card was most recently associated with has
forgotten about us.
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pcmcia 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Rs
.%T Am79C930 PCnet Mobile Single-Chip Wireless LAN Media Access Controller
.%O http://www.amd.com
.Re
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 2.7 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Bill Sommerfeld Aq sommerfeld@netbsd.org
and ported to
.Ox
by
.An Angelos D. Keromytis Aq angelos@dsl.cis.upenn.edu
.Sh BUGS
Doesn't support ad-hoc mode or WEP.
Round trip times seem higher than what one might expect.
