openbsd/src/share/man/man4/axppmic.4
.\"	$OpenBSD: axppmic.4,v 1.1 2018/03/31 08:07:42 jsg Exp $
.\"
.\" Copyright (c) 2018 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 31 2018 $
.Dt AXPPMIC 4
.Os
.Sh NAME
.Nm axppmic
.Nd X-Powers AXP Power Management IC
.Sh SYNOPSIS
.Cd "axppmic* at rsb?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the X-Powers AXP Power Management ICs.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sxirsb 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 6.3 .
