openbsd/src/share/man/man4/bio.4
.\"	$OpenBSD: bio.4,v 1.8 2005/06/29 20:04:30 mickey Exp $
.\"
.\" Copyright (c) 2002 Niklas Hallqvist
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 8, 2002
.Dt BIO 4
.Os
.Sh NAME
.Nm bio
.Nd ioctl tunnel pseudo-device
.Sh SYNOPSIS
.Cd "pseudo-device bio" Op Ar count
.Sh DESCRIPTION
The
.Nm
driver provides userland applications ioctl access to devices otherwise not
found as
.Pa /dev
nodes.
The
.Pa /dev/bio
device node operates by delegating
.Xr ioctl 2
calls to a requested device driver.
Only drivers which have registered with the
.Nm
device can be accessed via this interface.
.Pp
If
.Ar count
is given in the specification, and is greater than 0, a maximum of one
.Nm bio
device is created.
.Pp
The following
.Xr ioctl 2
calls apply to the
.Nm bio
device:
.Bl -tag -width BIOCCAPABILITIES
.It Dv BIOCLOCATE
Locate a named device and give back a cookie to the application
for subsequent ioctl calls.
The cookie is used to tunnel further ioctls to the right device.
.It Dv BIOCPING
Check upon the device to see it's alive.
Increments a counter to signify the OK condition.
.It Dv BIOCCAPABILITIES
Return information about ioctl commands, raid levels and other
features supported.
.It Dv BIOCALARM
Control the alarm beeper on the device.
.It Dv BIOCSCSICMD
Tunnel a SCSI command into one of the busses on the device.
May not be supported shall the device not employ SCSI.
.It Dv BIOCSTARTSTOP
Start or Stop one of the component drives.
.It Dv BIOCSTATUS
Retrieve device status including physical drives, logical drives
and battery module.
.It Dv BIOCBLINK
Blink a led on one of the drives (to be replaced).
.El
.Sh FILES
.Bl -tag -width /dev/bio -compact
.It Pa /dev/bio
ioctl tunnel device
.El
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr ami 4 ,
.Xr gdt 4 ,
.Xr bioctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.2 .
