openbsd/src/share/man/man4/bktr.4
.\"
.\" Copyright (c) 1998 Amancio Hasty and Roger Hardiman
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Amancio Hasty and
.\"	Roger Hardiman.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $OpenBSD: bktr.4,v 1.13 2004/03/15 16:35:27 mickey Exp $
.\" $FreeBSD: /c/ncvs/src/share/man/man4/bktr.4,v 1.9.2.5 2001/03/06 19:08:09 ru Exp $
.\"
.Dd January 28, 1998
.Dt BKTR 4
.Os
.Sh NAME
.Nm bktr
.Nd video capture driver
.Sh SYNOPSIS
.Cd "bktr* at pci? dev ? function ?"
.Cd "radio* at bktr?"
.Pp
.Cd "option BKTR_ALLOC_PAGES=nnn"
.Cd "option BKTR_SYSTEM_DEFAULT=XXX"
.Cd "option BKTR_OVERRIDE_CARD=nnn"
.Cd "option BKTR_OVERRIDE_MSP=n"
.Cd "option BKTR_OVERRIDE_TUNER=nnn"
.Sh DESCRIPTION
The
.Nm
driver provides support for PCI video capture and VBI capture on low cost,
high performance boards.
This should support most video cards based on the
Brooktree Bt848/849/878/879 Video Capture Chip.
The driver also supports FM Radio if the Tuner supports it.
.Pp
Specifically, the following cards are known to work:
.Bd -unfilled -offset indent
Animation Technologies FlyVideo
Askey/Dynalink Magic TView
AverMedia cards
Hauppauge Wincast TV and WinTV/PCI
IMS TV Turbo
Intel Smart Video Recorder III
I/O DATA GV-BCTV2/PCI
KISS TV/FM PCI
Leadtek Winfast TV 2000
Miro PC TV
MMAC Osprey
NEC PK-UG-X017
STB TV PCI Television Tuner
Terratec TerraTVplus
Video Highway XTreme
VideoLogic Captivator PCI
Zoltrix TV
.Ed
.Pp
The driver currently supports the following features:
.Bd -unfilled -offset indent
PCI to PCI DMA transfer
clipping
yuv
rgb16
rgb24
rgb32
.Ed
.Pp
On these cards, tuners and other components are interconnected with an I2C bus.
The Brooktree848 chips act as a master device on the bus to control them.
.Pp
The following kernel configuration options are available:
.Bl -tag -width xxxxxxxx
.It Cd option BKTR_ALLOC_PAGES=nnn
Specifies the number of contiguous pages to allocate when successfully
probed.
The default number of pages allocated by the kernel is 216.
This means that there are (216*4096) bytes available for use.
.It Cd option BKTR_SYSTEM_DEFAULT="(BROOKTREE_PAL | BROOKTREE_NTSC)"
One of these options can be used to set the default video format for the driver.
This fixed random hangs and lockups with the VideoLogic Captivator PCI card.
.It Cd option BKTR_OVERRIDE_CARD=nnn
Select a specific card (overrides autodetection).
`nnn' is set to one of he names listed and explained below.
.Pp
.Bl -tag -compact -width 28n
.It ASKEY_DYNALINK_MAGIC_TVIEW
Askey/Dynalink Magic TView
.It AVER_MEDIA
AverMedia
.It FLYVIDEO
Animation Technologies FlyVideo
.It HAUPPAUGE
Hauppauge Wincast TV and WinTV
.It IMS_TURBO
IMS TV Turbo
.It INTEL
Intel Smart Video Recorder III
.It IO_GV
I/O DATA GV-BCTV2/PCI
.It KISS
KISS TV/FM PCI
.It LEADTEK
Leadtek Winfast TV 2000
.It MIRO
Miro PC TV
.It OSPREY
MMAC Osprey
.It NEC_PK
NEC PK-UG-X017
.It STB
STB TV PCI Television Tuner
.It TERRATVPLUS
Terratec TerraTVplus
.It VIDEO_HIGHWAY_XTREME
Video Highway XTreme
.It ZOLTRIX
Zoltrix TV
.El
.It Cd option BKTR_OVERRIDE_MSP=n
Specifies whether the MSP3400C chip is present (overrides autodetection).
.It Cd option BKTR_OVERRIDE_TUNER=nnn
Select a specific tuner (overrides autodetection).
`nnn' is set to an integer from 1 to 13 take from the following table:
.Pp
.Bl -tag -compact -width 22n
.It TEMIC_NTSC
Temic 4032FY5
.It TEMIC_PAL
Temic 4002FH5
.It TEMIC_SECAM
Temic 4002FN5
.It PHILIPS_NTSC
Philips FI1236
.It PHILIPS_PAL
Philips FM1216
.It PHILIPS_SECAM
Philips FI1216MF
.It TEMIC_PALI
Temic 4062FY5
.It PHILIPS_PALI
Philips FI1246
.It PHILIPS_FR1236_NTSC
Philips FR1236 MK2
.It PHILIPS_FR1216_PAL
Philips FM1216
.It PHILIPS_FR1236_SECAM
Philips FM1216MF
.It ALPS_TSCH5
Apls TSCH5 NTSC
.It ALPS_TSBH1
Apls TSBH1 NTSC
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr radio 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 2.2 .
.Sh AUTHORS
The
.Nm
driver is based on the work of
.An Jim Lowe Aq james@miller.cs.uwm.edu ,
.An Mark Tinguely Aq tinguely@plains.nodak.edu ,
.An Amancio Hasty Aq hasty@star\-gate.com ,
.An Roger Hardiman Aq roger@FreeBSD.org
and a bunch of other people.
.Sh CAVEATS
On big-endian architectures it is not possible to program the
card to perform proper byte swapping in 24 bit modes,
therefore only 16 and 32 bit modes are supported.
