openbsd/src/share/man/man4/bnxt.4
.\" $OpenBSD: bnxt.4,v 1.5 2026/03/12 23:15:47 jmatthew Exp $
.\"
.\" Copyright (c) 2018 Jonathan Matthew <jmatthew@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 12 2026 $
.Dt BNXT 4
.Os
.Sh NAME
.Nm bnxt
.Nd Broadcom NetXtreme-C/E 10Gb/25Gb/40Gb/50/100Gb Ethernet device
.Sh SYNOPSIS
.Cd "bnxt* at pci?"
.Sh DESCRIPTION
The
.Nm
driver supports the Broadcom NetXtreme-C/E PCI Express Ethernet
adapters based on the Broadcom BCM573xx, BCM574xx and BCM575xx chipsets,
including the following:
.Pp
.Bl -bullet -offset indent -compact
.It
Broadcom P150c Adapter (10/25/40/50Gb QSFP28)
.It
Broadcom P150p Adapter (10/25/40/50Gb QSFP28)
.It
Broadcom P210c Adapter (10Gb SFP+)
.It
Broadcom P210p Adapter (10Gb SFP+)
.It
Broadcom P210tp Adapter (10GBASE-T)
.It
Broadcom P225c Adapter (10/25Gb QSFP28)
.It
Broadcom P225p Adapter (10/25Gb SFP28)
.It
Broadcom P425p Adapter (10/25Gb SFP28)
.It
Broadcom P1200G Adapter (10/25/40/50/100Gb QSFP56)
.It
Broadcom P2100G Adapter (10/25/40/50/100Gb QSFP56)
.El
.Pp
Adapters based on these chipsets are also available as LOM/Mezzanine
options for Dell, Lenovo, HPE and Supermicro servers.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.4 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jonathan Matthew Aq Mt jmatthew@openbsd.org .
