openbsd/src/share/man/man4/cardbus.4
.\" $OpenBSD: cardbus.4,v 1.35 2006/06/27 14:21:26 jmc Exp $
.\" $NetBSD: cardbus.4,v 1.4 2000/02/02 19:57:17 augustss Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 22, 2004
.Dt CARDBUS 4
.Os
.Sh NAME
.Nm cardbus ,
.Nm cbb
.Nd introduction to CardBus support
.Sh SYNOPSIS
.Cd "cbb*      at pci?"
.Cd "cardslot* at cbb?"
.Cd "cardbus*  at cardslot?"
.Cd "pcmcia*   at cardslot?"
.Sh DESCRIPTION
.Ox
provides machine-independent bus support and drivers for CardBus devices.
.Pp
It includes the following machine-independent CardBus
drivers, sorted by function and driver name:
.Ss Network interfaces
.Bl -tag -width 12n -offset ind -compact
.It Xr ath 4
Atheros IEEE 802.11a/b/g wireless network adapters.
.It Xr atw 4
ADMtek ADM8211 IEEE 802.11b wireless network adapters.
.It Xr dc 4
Intel 21143 and Xircom X3201-based Ethernet interfaces.
.It Xr fxp 4
Intel PRO/100 CardBus II Ethernet interfaces.
.It Xr ral 4
Ralink Technology IEEE 802.11a/b/g wireless network adapters.
.It Xr re 4
RealTek 8139C+/8169/816xS/811xS/8101E Ethernet adapter driver.
.It Xr rl 4
Realtek 8129/8139-based Ethernet interfaces.
.It Xr rtw 4
Realtek RTL8180L IEEE 802.11b wireless network adapters.
.It Xr xl 4
3Com 3c575 and 3c656-based Ethernet interfaces.
.El
.Ss Miscellaneous devices
.Bl -tag -width 12n -offset ind -compact
.It Xr com 4 , Xr pccom 4
NS8250, NS16450, NS16550, ST16550, and TI16750 serial driver.
The
.Xr pccom 4
driver is used on the i386; all the rest use
.Xr com 4 .
.It Xr ehci 4
USB EHCI host controller.
.It Xr ohci 4
USB OHCI host controller.
.It Xr uhci 4
USB UHCI host controller.
.El
.Sh SEE ALSO
.Xr ath 4 ,
.Xr atw 4 ,
.Xr com 4 ,
.Xr dc 4 ,
.Xr ehci 4 ,
.Xr fxp 4 ,
.Xr intro 4 ,
.Xr ohci 4 ,
.Xr pccom 4 ,
.Xr pci 4 ,
.Xr pcibios 4 ,
.Xr pcmcia 4 ,
.Xr ral 4 ,
.Xr re 4 ,
.Xr rl 4 ,
.Xr rtw 4 ,
.Xr uhci 4 ,
.Xr xl 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.5 .
.Ox
support was added in
.Ox 2.7 .
