openbsd/src/share/man/man4/cardbus.4
.\"	$OpenBSD: cardbus.4,v 1.8 2000/10/26 22:37:04 aaron Exp $
.\" $NetBSD: cardbus.4,v 1.4 2000/02/02 19:57:17 augustss Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 14, 1999
.Dt CARDBUS 4
.Os
.Sh NAME
.Nm cardbus ,
.Nm cbb
.Nd introduction to CardBus support
.Sh SYNOPSIS
.Cd "cbb*      at pci? dev? function ?"
.Cd "cardslot* at cbb? flags 0x0000"
.Cd "cardbus*  at cardslot?"
.Cd "pcmcia*   at cardslot?"
.Pp
.Sh DESCRIPTION
.Ox
provides machine-independent bus support and drivers for CardBus devices.
.Pp
The flags are used with cardslot definition.
The lowest order (rightmost)
bit of defines the PC Card attach sequence at
boot-time.
When the bit is set, a PC Card in the slot is probed and
attached immediately.
However, the PC Card is probed after kernel thread wakes up.
If a PC Card is used as a boot device (e.g., CF
card or network card), you should set this bit to 1.
.Sh SUPPORTED DEVICES
.Ox
includes the following machine-independent CardBus
drivers, sorted by function and driver name:
.Pp
.Ss Network interfaces
.Bl -tag -width speaker -offset ind -compact
.It Xr dc 4
ADMtek AN985 Centaur-C CardBus Ethernet interfaces.
.It Xr dc 4
Xircom X3201-based CardBus Ethernet interfaces.
.It Xr fxp 4
Intel PRO/100 CardBus II Ethernet interfaces.
.It Xr xl 4
3Com 3c575 and 3c656-based Ethernet interfaces.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr isa 4 ,
.Xr isapnp 4 ,
.Xr pci 4 ,
.Xr pcibios 4 ,
.Xr pcmcia 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.5 .
.Ox
support was added in
.Ox 2.7 .
