openbsd/src/share/man/man4/ccd.4
.\"	$OpenBSD: ccd.4,v 1.13 2000/03/29 01:28:56 deraadt Exp $
.\"	$NetBSD: ccd.4,v 1.5 1995/10/09 06:09:09 thorpej Exp $
.\"
.\" Copyright (c) 1994 Jason Downs.
.\" Copyright (c) 1994, 1995 Jason R. Thorpe.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by Jason Downs and Jason R. Thorpe.
.\" 4. Neither the name of the author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 9, 1995
.Dt CCD 4
.Os
.Sh NAME
.Nm ccd
.Nd Concatenated Disk Driver
.Sh SYNOPSIS
.Cd "pseudo-device ccd 4"
.Sh DESCRIPTION
The
.Nm
driver provides the capability of combining one or more disks/partitions
into one virtual disk.
.Pp
This document assumes that you're familiar with how to generate kernels,
how to properly configure disks and pseudo-devices in a kernel
configuration file, and how to partition disks.
.Pp
Note that the
.Sq raw
partitions of the disks
.Pa should not
be combined.  Each component partition should be offset at least one
cylinder from the beginning of the component disk.  This avoids potential
conflicts between the component disk's disklabel and the
.Nm ccd Ns 's
disklabel.  The kernel wants to only allow component partitions of type FS_CCD,
but due to disklabel restrictions on some architectures will also accept
component partitions of FS_BSDFFS.
.Pp
In order to compile in support for the ccd, you must add a line similar
to the following to your kernel configuration file:
.Bd -unfilled -offset indent
pseudo-device	ccd	4	# concatenated disk devices
.Ed
.Pp
The count argument is how many
.Nm ccds
memory is allocated for at boot time.  In this example, no more than 4
.Nm ccds
may be configured.
.Pp
A
.Nm
may be either serially concatenated or interleaved.
To serially concatenate partitions specify an interleave factor of 0.
.Pp
If a
.Nm
is interleaved correctly, a
.Dq striping
effect is achieved, which can increase performance.  Finding the optimum
interleave factor is a hard problem.  Some things to think about are the
number of disks in the ccd, the typical readahead opportunities, the
filesystem blocksize and if it's possible to use the optimized ccd I/O
protocol.  The optimized protocol allows smaller interleave factors for a
comparably cheap price but requires that the factor be a multiple of the
software page size (CLBYTES), and that mirroring is not requested.  So far the
best policy is to test with different interleaves and benchmark typical uses.
A rule of thumb might be to use the software pagesize with the optimized
I/O protocol (the default, unless the requirements mentioned above are not
fulfilled) or MAXBSIZE / #components with the unoptimized protocol.
Since the interleave factor is expressed in units of DEV_BSIZE, one must
account for sector sizes other than DEV_BSIZE in order to calculate the
correct interleave.  The kernel will not allow an interleave factor less than
the size of the largest component sector divided by DEV_BSIZE.
.Pp
Note that best performance is achieved if all component disks have the same
geometry and size.  Optimum striping cannot occur with different disk types.
.Pp
There is a run-time utility that is used for configuring
.Nm ccds .
See
.Xr ccdconfig 8
for more information.
.Sh WARNINGS
If just one (or more) of the disks in a
.Nm
fails, the entire
file system will be lost.
.Sh FILES
/dev/{,r}ccd* - ccd device special files.
.Sh HISTORY
The concatenated disk driver was originally written at the University of
Utah.
.Sh SEE ALSO
.Xr MAKEDEV 8 ,
.Xr ccdconfig 8 ,
.Xr config 8 ,
.Xr fsck 8 ,
.Xr mount 8 ,
.Xr newfs 8 .
