openbsd/src/share/man/man4/ccd.4
.\"	$OpenBSD: ccd.4,v 1.22 2005/02/02 14:29:52 mickey Exp $
.\"	$NetBSD: ccd.4,v 1.5 1995/10/09 06:09:09 thorpej Exp $
.\"
.\" Copyright (c) 1994 Jason Downs.
.\" Copyright (c) 1994, 1995 Jason R. Thorpe.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by Jason Downs and Jason R. Thorpe.
.\" 4. Neither the name of the author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 9, 1995
.Dt CCD 4
.Os
.Sh NAME
.Nm ccd
.Nd concatenated disk driver
.Sh SYNOPSIS
.Cd "pseudo-device ccd" Op Ar count
.Sh DESCRIPTION
The
.Nm
driver provides the capability of combining one or more disks/partitions
into one virtual disk.
.Pp
Note that the
.Sq raw
partitions of the disks
.Em should not
be combined.
Each component partition should be offset at least one
cylinder from the beginning of the component disk.
This avoids potential conflicts between the component disk's
.Xr disklabel 8
and the concatenated disk's disklabel.
The kernel wants to only allow component partitions of type
.Dv FS_CCD ,
but due to disklabel restrictions on some architectures will also accept
component partitions of
.Dv FS_BSDFFS .
.Pp
In order to compile in support for
.Nm ,
make sure your kernel configuration file contains a line
similar to the following (GENERIC does by default):
.Bd -literal -offset indent
pseudo-device	ccd	4	# concatenated disk devices
.Ed
.Pp
The optional
.Ar count
argument specifies how many
concatenated disk devices are allocated for at boot time.
In this example, no more than 4
may be configured.
.Pp
A
.Nm
may be either serially concatenated, interleaved, or mirrored.
To serially concatenate partitions, specify an interleave factor of 0.
Mirroring configurations require an even number of components.
.Pp
If a
.Nm
is interleaved correctly, a
.Dq striping
effect is achieved, which can increase performance.
Finding the optimum interleave factor is a hard problem.
Some things to think about are the number of disks in the
.Nm ,
the typical read-ahead opportunities, the filesystem blocksize, and if
it's possible to use the optimized
.Nm
I/O protocol.
The optimized protocol allows smaller interleave factors for a
comparably cheap price but requires that the factor be a multiple of the
software page size
.Pf ( Dv CLBYTES ) ,
and that mirroring is not requested.
So far the best policy is to test with different interleaves and
benchmark typical uses.
A rule of thumb might be to use the software pagesize with the optimized
I/O protocol (the default, unless the requirements mentioned above are not
fulfilled) or
.Dv MAXBSIZE /
#components with the unoptimized protocol.
Since the interleave factor is expressed in units of
.Dv DEV_BSIZE ,
one must account for sector sizes other than
.Dv DEV_BSIZE
in order to calculate the correct interleave.
The kernel will not allow an interleave factor less than the size
of the largest component sector divided by
.Dv DEV_BSIZE .
.Pp
Note that best performance is achieved if all component disks have the same
geometry and size.
Optimum striping cannot occur with different disk types.
.Pp
There is a run-time utility that is used for configuring concatenated disks.
See
.Xr ccdconfig 8
for more information.
.Sh FILES
.Bl -tag -width tenletters+five -compact
.It Pa /dev/{,r}ccd*
ccd device special files
.El
.Sh SEE ALSO
.Xr MAKEDEV 8 ,
.Xr ccdconfig 8 ,
.Xr disklabel 8 ,
.Xr fsck 8 ,
.Xr growfs 8 ,
.Xr mount 8 ,
.Xr newfs 8
.Sh HISTORY
The concatenated disk driver was originally written at the University of
Utah.
.Sh CAVEATS
If just one (or more) of the disks in a
non-redundant
.Nm
configuration fails, the entire file system will be lost.
