openbsd/src/share/man/man4/cfxga.4
.\"	$OpenBSD: cfxga.4,v 1.1 2006/04/16 20:44:58 miod Exp $
.\"
.\" Copyright (c) 2005, Miodrag Vallat.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 17, 2005
.Dt CFXGA 4
.Os
.Sh NAME
.Nm cfxga
.Nd Colorgraphic VoyagerVGA video card driver
.Sh SYNOPSIS
.Cd "cfxga* at pcmcia?"
.Cd "wsdisplay* at cfxga?"
.Sh DESCRIPTION
The Colorgraphic VoyagerVGA card is a CompactFlash removable video card.
The
.Nm
driver allows its use under
.Ox
within the
.Xr wscons 4
console framework.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pcmcia 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh BUGS
The
.Nm
driver forces the card into a 16bpp, 640x480, 72Hz mode on the VGA output
connector.
It is not possible yet to select a different video mode, or use the S-Video
output.
