openbsd/src/share/man/man4/ch.4
.\"	$OpenBSD: ch.4,v 1.9 2004/09/30 19:59:24 mickey Exp $
.\"
.\" Copyright (c) 1996
.\"	Julian Elischer <julian@freebsd.org>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd March 28, 1997
.Dt CH 4
.Os
.Sh NAME
.Nm ch
.Nd scsi media-changer (juke box) driver
.Sh SYNOPSIS
.Cd "ch? at scsibus?"
.Sh DESCRIPTION
The
.Nm
driver provides support for SCSI juke boxes.
It allows many slots of media to be multiplexed between a number of drives.
.Pp
A SCSI adapter and a logical scsibus must also be separately configured
into the system before a SCSI changer can be configured.
.Pp
As the SCSI adapter is probed during boot, the SCSI bus is scanned for devices.
Any devices found which answer as
.Qq Changer
type devices will be
.Dq attached
to the
.Nm
driver.
The first device found will be attached as
.Em ch0
and the next
.Em ch1 ,
etc.
It is also possible to specify what
.Nm
unit a device should come on-line as; refer to
.Xr scsi 4
for details on kernel configuration.
.Sh KERNEL CONFIGURATION
In configuring, if an optional
.Ar count
is given in the specification, that number of SCSI media changers
are configured.
Most storage for them is allocated only when found
so a large number of configured devices is cheap (once the first
has included the driver).
.Sh IOCTLS
The following
.Xr ioctl 2
call applies to the changer.
It is defined in the header file
.Aq Pa sys/chio.h .
.Bl -tag -width DIOCSDINFO
.It Dv CHIOOP
This appears to be a
.Dq do-everything
call.
.El
.Sh FILES
.Bl -tag -width /dev/ch[0-9] -compact
.It Pa /dev/ch[0-9]
device entries
.El
.Sh SEE ALSO
.Xr cd 4 ,
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr st 4
.Sh DISCLAIMER
These manpages were derived from the
.Fx
documentation of the generic SCSI drivers.
Since naming and calling conventions may have diverged or suffered port
specific changes, please review the appropriate header files and configuration
file for your port.
.Sh HISTORY
The
.Nm
driver appeared in 386BSD 0.1.
