openbsd/src/share/man/man4/ciphy.4
.\"	$OpenBSD: ciphy.4,v 1.5 2008/05/29 06:22:19 brad Exp $
.\"
.\" Copyright (c) 2004 Peter Valchev <pvalchev@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 29 2008 $
.Dt CIPHY 4
.Os
.Sh NAME
.Nm ciphy
.Nd Cicada CS8201/CS8204 10/100/1000 Ethernet PHY
.Sh SYNOPSIS
.Cd "ciphy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver supports the Cicada CS8201/CS8204 10/100/1000 copper PHY.
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr mii 4 ,
.Xr vge 4 ,
.Xr ifconfig 8
