openbsd/src/share/man/man4/ciss.4
.\"	$OpenBSD: ciss.4,v 1.10 2008/06/11 20:24:46 jsg Exp $
.\"
.\" Michael Shalayeff, 2005. Public Domain.
.\"
.Dd $Mdocdate: June 11 2008 $
.Dt CISS 4
.Os
.Sh NAME
.Nm ciss
.Nd Compaq Smart ARRAY 5/6 SAS/SATA/SCSI RAID controller
.Sh SYNOPSIS
.Cd "ciss* at pci?"
.Cd "scsibus* at ciss?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Compaq Smart ARRAY 5th and 6th
family of RAID controllers, including:
.Pp
.Bl -bullet -width Ds -offset indent -compact
.It
Compaq 532, 5300, 5312, 5i
.It
Compaq 641, 642, 6400, 6400EM, 6422
.It
Hewlett-Packard 6i, E200, E200i, E500, P212, P400, P400i, P410, P410i,
P411, P600, P800, P812, V100
.El
.Pp
These controllers support RAID 0, RAID 1, RAID 5, JBOD,
and superpositions of those configurations.
.Pp
Although the controllers are actual RAID controllers,
the driver makes them look just like SCSI controllers.
All RAID configuration is done through the controllers' BIOSes.
.Pp
Monitoring status for the volume and drives in it is done through the
.Xr bioctl 8
utility;
the current status is provided by the
.Xr sysctl 8
variable
.Va hw.sensors .
.Sh SEE ALSO
.Xr bio 4 ,
.Xr intro 4 ,
.Xr pci 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr bioctl 8 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.8 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Michael Shalayeff Aq mickey@openbsd.org .
.Sh CAVEATS
For purposes of status monitoring,
the current code only supports one logical
volume per controller.
