openbsd/src/share/man/man4/ciss.4
.\"	$OpenBSD: ciss.4,v 1.1 2005/08/03 14:50:18 mickey Exp $
.\"
.\" Michael Shalayeff, 2005. Public Domain.
.\"
.Dd August 2, 2005
.Dt CISS 4
.Os
.Sh NAME
.Nm ciss
.Nd Compaq Smartarray 5 Controllers
.Sh SYNOPSIS
.Cd "ciss* at pci?"
.Cd "scsibus* at ciss?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Compaq Smartarray 5th and 6th
family of RAID controllers, including:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Compaq 532, 5300, 5312, 5i
.It Compaq 641, 642, 6400, 6400EM, 6422
.It Hewlett-Packard V100, P800, P600, E400
.El
.Pp
These controllers support RAID 0, RAID 1, RAID 5, JBOD,
and superpositions of those configurations.
.Pp
Although the controllers are actual RAID controllers,
the driver makes them look just like SCSI controllers.
All RAID configuration is done through the controllers' BIOSes.
.Pp
The management interface is provided through the
.Xr bio 4
device or one of the daughter
.Xr sd 4
devices as implemented in the
.Xr bioctl 8
utility.
.Sh SEE ALSO
.Xr bio 4 ,
.Xr intro 4 ,
.Xr pci 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr bioctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.8 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Michael Shalayeff Aq mickey@openbsd.org .
