openbsd/src/share/man/man4/cmpci.4
.\" $OpenBSD: cmpci.4,v 1.10 2007/05/31 19:19:49 jmc Exp $
.\"
.\" Copyright (c) 2000 Takuya SHIOZAKI
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt CMPCI 4
.Os
.Sh NAME
.Nm cmpci
.Nd C-Media CMI8x38 PCI audio device
.Sh SYNOPSIS
.Cd "cmpci* at pci?"
.Cd "audio* at cmpci?"
.Sh DESCRIPTION
The
.Nm
driver supports the C-Media CMI8338A, CMI8338B, CMI8738 and CMI8738B
sound chips present in some PCI sound cards and some integrated
PC motherboard chipsets (such as the SiS 530).
.Sh SEE ALSO
.Xr audio 4 ,
.Xr intro 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 2.7 .
.Sh BUGS
The Joystick port is not supported.
