openbsd/src/share/man/man4/cmpci.4
.\" $OpenBSD: cmpci.4,v 1.13 2008/04/04 03:42:47 brad Exp $
.\"
.\" Copyright (c) 2000 Takuya SHIOZAKI
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: April 4 2008 $
.Dt CMPCI 4
.Os
.Sh NAME
.Nm cmpci
.Nd C-Media CMI8338, CMI8738, CMI8768 PCI audio device
.Sh SYNOPSIS
.Cd "cmpci* at pci?"
.Cd "audio* at cmpci?"
.Cd "opl* at cmpci?"
.Sh DESCRIPTION
The
.Nm
driver supports the C-Media CMI8338A, CMI8338B, CMI8738, CMI8738B
and CMI8768 sound chips present in some PCI sound cards and some
integrated PC motherboard chipsets (such as the SiS 530).
.Pp
Hardware features:
.Bl -bullet -offset indent
.It
Supports 8 common sample rates from 5512 Hz to 48000 Hz
.It
Hardware full-duplex support enables simultaneous record and playback
.It
Some CMI8738 versions support 4 and 6 channel playback
.It
CMI8768 chips support 4, 6, and 8 channel playback
.It
CMI8768 chips can only record sample rates of 44100 Hz or 48000 Hz
.It
Hardware copying of front to rear for playing stereo input on 4 speakers
.It
S/PDIF input and output
.El
.Sh SEE ALSO
.Xr audio 4 ,
.Xr intro 4 ,
.Xr opl 4,
.Xr pci 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 2.7 .
.Sh BUGS
The Joystick port is not supported.
