openbsd/src/share/man/man4/cnw.4
.\"	$OpenBSD: cnw.4,v 1.8 2006/08/04 10:48:39 deraadt Exp $
.\"
.\" Copyright (c) 1999 Federico G. Schwindt.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL
.\" THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
.\" EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
.\" PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
.\" OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
.\" ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 13, 1999
.Dt CNW 4
.Os
.Sh NAME
.Nm cnw
.Nd Xircom CreditCard Netwave device driver
.Sh SYNOPSIS
.Cd "cnw* at pcmcia?"
.Sh DESCRIPTION
The
.Nm
device driver provides support for Xircom CreditCard Netwave (also
known as Netwave Airsurfer) PCMCIA wireless network adapters.
.Pp
The wireless domain number and scrambling key can be specified by the
following kernel configuration options:
.Bl -tag -width indent
.It Cd CNW_DOMAIN=value
Selects what access point(s) to talk to, by their domain number.
Values from
.Li 0
to
.Li 0x1ff
are valid;
.Li 0x100
is the default if this option is not defined.
.It Cd CNW_SCRAMBLEKEY=value
Selects the scramble key for domains that are scrambled.
Values from
.Li 0
to
.Li 0x1ff
are valid;
.Li 0
(no scrambling)
is the default if this option is not defined.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pcmcia 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 2.6 .
.Sh BUGS
Multicasting or receiver promiscuity is not supported yet.
