openbsd/src/share/man/man4/dwctwo.4
.\"	$OpenBSD: dwctwo.4,v 1.3 2016/02/02 17:38:20 jmc Exp $
.\"
.\" Copyright (c) 2016 Visa Hankala
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 2 2016 $
.Dt DWCTWO 4
.Os
.Sh NAME
.Nm dwctwo
.Nd DesignWare HS USB 2.0 OTG controller
.Sh SYNOPSIS
.Cd "dwctwo0 at iobus? irq 56        " Pq "octeon"
.Cd "usb*    at dwctwo?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the DesignWare High-Speed USB 2.0 On-the-Go
controller, which provides an interface to
.Xr usb 4
devices.
.Sh SEE ALSO
.Xr ehci 4 ,
.Xr ohci 4 ,
.Xr usb 4 ,
.Xr xhci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.8 .
