openbsd/src/share/man/man4/dwge.4
.\"	$OpenBSD: dwge.4,v 1.2 2016/08/13 23:35:00 jmc Exp $
.\"
.\" Copyright (c) 2016 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 13 2016 $
.Dt DWGE 4
.Os
.Sh NAME
.Nm dwge
.Nd Designware GMAC 10/100/Gigabit Ethernet device
.Sh SYNOPSIS
.Cd "dwge* at fdt?"
.Cd "rgephy*" at mii?
.Sh DESCRIPTION
The
.Nm
driver provides support for various Ethernet controllers based on the
Synopsis Designware GMAC core.
These controllers are typically found on SoCs, such as the various ARM
SoCs from Allwinner, starting with the Allwinner A20.
.Pp
The
.Nm
driver supports several media types, which are selected via the
.Xr ifconfig 8
command.
The supported media types are:
.Bl -tag -width "media" -offset indent
.It media autoselect
Attempt to autoselect the media type (default)
.It media 1000baseT mediaopt full-duplex
Use 1000baseT on copper, full duplex
.It media 1000baseT Op mediaopt half-duplex
Use 1000baseT on copper, half duplex
.It media 100baseTX  mediaopt full-duplex
Use 100baseTX, full duplex
.It media 100baseTX Op mediaopt half-duplex
Use 100baseTX, half duplex
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr inet 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr rgephy 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
.Ox
support for
.Nm
first appeared in
.Ox 6.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Matt Thomas
and
.An Martin Husemann
for
.Nx
and ported to
.Ox
by
.An Patrick Wildt Aq Mt patrick@openbsd.org
and
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
