openbsd/src/share/man/man4/dwgpio.4
.\"	$OpenBSD: dwgpio.4,v 1.1 2020/12/06 20:48:12 kettenis Exp $
.\"
.\" Copyright (c) 2020 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: December 6 2020 $
.Dt DWGPIO 4
.Os
.Sh NAME
.Nm dwgpio
.Nd Synopsys DesignWare GPIO controller
.Sh SYNOPSIS
.Cd "dwgpio* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Synopsys DesignWare GPIO controller
found on, for example, the Ampere eMAG SoC.
It does not provide direct device driver entry points but makes its
functions available to
.Xr acpi 4 .
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 6.9 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .

