openbsd/src/share/man/man4/eap.4
.\" $OpenBSD: eap.4,v 1.5 2000/07/20 08:48:17 deraadt Exp $
.\" $NetBSD: eap.4,v 1.2 1998/05/06 19:14:06 augustss Exp $
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 26, 1998
.Dt EAP 4
.Os
.Sh NAME
.Nm eap
.Nd Ensoniq AudioPCI device driver
.Sh SYNOPSIS
.Cd "eap* at pci? dev ? function ?"
.Cd "audio* at eap?"
.Sh DESCRIPTION
The
.Nm
driver supports the older Ensoniq AudioPCI and other ES1370 based
sound cards, as well as the Creative Labs SoundBlaster 128PCI. The
driver also supports many revisions of the more modern Ensoniq
AudioPCI 97 (ES1371).
.Sh BUGS
The "FM" DAC and MIDI port are not supported.
.Sh SEE ALSO
.Xr audio 4 ,
.XR ac97 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 2.6 .

