openbsd/src/share/man/man4/ef.4
.\"	$OpenBSD: ef.4,v 1.6 2000/10/18 02:38:22 aaron Exp $
.\"
.\" Copyright (c) 1998 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jason L. Wright
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 3, 1999
.Dt EF 4
.Os
.Sh NAME
.Nm ef
.Nd 3Com Fast EtherLink ISA (3c515) driver
.Sh SYNOPSIS
.Cd "ef* at isapnp?"
.Sh DESCRIPTION
The
.Nm ef
device driver supports the 3Com Fast EtherLink ISA family
of Ethernet cards, and embedded controllers based on the 3Com
.Dq corkscrew
EtherLink chips.
This includes the 3C515 adapter(s) with National Semiconduction
.Tn DP83840
PHYs, see
.Xr nsphy 4 .
Other models of 3Com network cards are supported by the
.Xr ec 4 ,
.Xr eg 4 ,
.Xr el 4 ,
.Xr ep 4 ,
.Xr ie 4
and
.Xr xl 4
drivers.
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh DIAGNOSTICS
.Bl -diag
.It "ef%d: adapter failure (%x)"
A fatal error during receive or transmit has occurred.
.It "ef%d: eeprom failed to come ready"
When reading/writing the EEPROM, the busy bit failed to clear.
This may indicate a hardware problem.
.It "ef%d: device timeout"
The device has stopped responding to the network, or there is a problem with
the network connection (cable).
.El
.Sh SEE ALSO
.Xr ec 4 ,
.Xr eg 4 ,
.Xr el 4 ,
.Xr ep 4 ,
.Xr ie 4 ,
.Xr ifmedia 4 ,
.Xr nsphy 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 2.6 .
.Sh AUTHOR
The
.Nm
driver was written by
.An Jason L. Wright Aq jason@thought.net .
