openbsd/src/share/man/man4/el.4
.\"	$OpenBSD: el.4,v 1.9 2008/09/07 06:55:34 jmc Exp $
.\"     $NetBSD: ec.4,v 1.4 1998/08/09 00:39:02 thorpej Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe of the Numerical Aerospace Simulation Facility,
.\" NASA Ames Research Center.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: September 7 2008 $
.Dt EL 4
.Os
.Sh NAME
.Nm el
.Nd 3Com EtherLink (3C501) Ethernet device
.Sh SYNOPSIS
.Cd "el0 at isa? port 0x300 irq 9"
.Sh DESCRIPTION
The
.Nm
device driver supports 3Com EtherLink (3C501) Ethernet cards.
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
To view a list of media types and options supported by your card try
.Dq ifconfig <device> media .
For example,
.Dq ifconfig el0 media .
.Sh DIAGNOSTICS
.Bl -diag
.It "el%d: device timeout"
The device has stopped responding to the network, or there is a problem with
the network connection (cable).
.It "el%d: invalid packet size %d; dropping"
A packet of an invalid length (less than size of Ethernet header or greater
than maximum size of Ethernet frame) was received and dropped.
.El
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr isa 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
