openbsd/src/share/man/man4/em.4
.\" $OpenBSD: em.4,v 1.17 2005/06/01 01:59:40 brad Exp $
.\" Copyright (c) 2002 Intel Corporation
.\" All rights reserved.
.\" Redistribution and use in source and binary forms of the Software, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code of the Software may retain the above
.\" copyright notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form of the Software may reproduce the
.\" above copyright notice, this list of conditions and the following
.\" disclaimer in the documentation and/or other materials provided with the
.\" distribution.
.\" 3. Neither the name of the Intel Corporation nor the names of its contributors
.\" shall be used to endorse or promote products derived from this Software
.\" without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
.\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE INTEL OR ITS CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE
.\" USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" * Other names and brands may be claimed as the property of others.
.\"
.\" $FreeBSD: em.4,v 1.18 2005/01/30 12:29:06 yar Exp $
.Dd February 13, 2005
.Dt EM 4
.Os
.Sh NAME
.Nm em
.Nd "Intel(R) PRO/1000 Gigabit Ethernet driver"
.Sh SYNOPSIS
.Cd "em* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for PCI Gigabit Ethernet adapters based on the
Intel 82540EM, 82540EP, 82541EI, 82541ER, 82541GI, 82542, 82543GC, 82544EI,
82544GC, 82545EM, 82545GC, 82546EB, 82546GB, 82457EI and 82547GI Ethernet
controller chips.
The driver supports transmit/receive TCP/UDP checksum offload on all but
82542-based adapters and Jumbo frames.
This includes the following models:
.Pp
.Bl -item -offset indent -compact
.It
Intel PRO/1000 Gigabit Server Adapter (SX Fiber) (PWLA8490)
.It
Intel PRO/1000F Gigabit Server Adapter (SX Fiber) (PWLA8490SX)
.It
Intel PRO/1000T Server Adapter (PWLA8490T)
.It
Intel PRO/1000XT Server Adapter (PWLA8490XT)
.It
Intel PRO/1000XS Server Adapter (SX Fiber) (PWLA8490XF)
.It
Intel PRO/1000T Desktop Adapter (PWLA8390T)
.It
Intel PRO/1000XTL Lo Profile PCI Server (PWLA8490XTL)
.It
Intel PRO/1000MT Desktop Adapter (PWLA8390MT)
.It
Intel PRO/1000MT Server Adapter (PWLA8490MT)
.It
Intel PRO/1000MT Dual Port Server Adapter (PWLA8492MT)
.It
Intel PRO/1000MF Server Adapter (SX Fiber) (PWLA8490MF)
.It
Intel PRO/1000MF Dual Port Server Adapter (SX Fiber) (PWLA8492MF)
.It
Intel PRO/1000MF Server Adapter (LX Fiber) (PWLA8490LX)
.It
Intel PRO/1000MT Quad PCI-X Adapter (PWLA8494MT)
.El
.Pp
The
.Nm
driver supports the following media types:
.Bl -tag -width autoselect -offset indent
.It autoselect
Enables auto-negotiation for speed and duplex.
.It 10baseT Cm mediaopt No full-duplex
Sets 10Mbps operation.
.It 100baseTX Cm mediaopt No full-duplex
Sets 100Mbps operation.
.It 1000baseSX
Sets 1000Mbps operation.
Only full-duplex mode is supported at this speed.
.It 1000baseT
Sets 1000Mbps operation.
Only full-duplex mode is supported at this speed.
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh DIAGNOSTICS
.Bl -diag
.It "em%d: Unable to allocate bus resource: memory"
A fatal initialization error has occurred.
.It "em%d: Unable to allocate bus resource: interrupt"
A fatal initialization error has occurred.
.It "em%d: watchdog timeout -- resetting"
The device has stopped responding to the network, or there is a problem with
the network connection (cable).
.El
.Sh SUPPORT
For general information and support, go to the Intel support website at:
.Pa http://support.intel.com .
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr vlan 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 3.2 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Intel Corporation Aq freebsdnic@mailbox.intel.com .
.Sh BUGS
There are known performance issues with this driver when running UDP traffic
with Jumbo frames.
.Pp
There is a known compatibility issue where time to link is slow or link is not
established between 82541/82547 controllers and some switches.
Known switches include:
.Bl -item -offset indent -compact
.It
Planex FXG-08TE
.It
I-O Data ETG-SH8
.El
