openbsd/src/share/man/man4/emc.4
.\"	$OpenBSD: emc.4,v 1.1 2011/04/06 11:54:56 dlg Exp $
.\"
.\" Copyright (c) 2011 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 6 2011 $
.Dt EMC 4
.Os
.Sh NAME
.Nm emc
.Nd EMC CLARiiON AX/CX-series SCSI devices
.Sh SYNOPSIS
.Cd "emc* at scsibus?"
.Sh DESCRIPTION
The
.Nm
driver attaches to EMC CLARiiON AX/CX-series SCSI logical units.
Each path to an active service processor attached to by
.Nm
is presented to
.Xr mpath 4
which uses it as a backend to the logical unit attached to its own
.Xr scsibus 4 .
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr intro 4 ,
.Xr mpath 4 ,
.Xr scsi 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.0 .
.Sh AUTHORS
.An David Gwynne Aq dlg@openbsd.org .
