openbsd/src/share/man/man4/envy.4
.\" $OpenBSD: envy.4,v 1.3 2008/02/21 01:44:59 ratchov Exp $
.\"
.\" Copyright (c) 2007 Alexandre Ratchov <alex@caoua.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 21 2008 $
.Dt ENVY 4
.Os
.Sh NAME
.Nm envy
.Nd VIA Envy24 audio device
.Sh SYNOPSIS
.Cd "envy* at pci?"
.Cd "audio* at envy?"
.Sh DESCRIPTION
The
.Nm
driver supports sound cards based on VIA Envy24 PCI chips,
such as the M-Audio Delta-1010LT PCI card.
The Envy24 chip, formerly known as the ICE1712, is a versatile digital
PCI chip that can be attached to
up to 4x2 external analog converters and 2x2 S/PDIF transmitter/receivers.
Currently only Asahi Kasei AK4524 codecs are supported.
.Ss Mixer device
The chip features a digital mixer that routes and mixes the
streams below as follows:
.Bl -tag -width playback
.It Dv inputs
There are 10 streams corresponding to data received by the
device from the codecs.
They are labelled
.Va line0
\(en
.Va line9
in the
.Xr mixer 4
interface.
Streams
.Va line0
to
.Va line7
correspond to analog inputs and
.Va line8
to
.Va line9
correspond to
digital inputs.
.It Dv outputs
There are 10 streams corresponding to data sent by the device to the codecs.
They are labelled
.Va line0
\(en
.Va line9 .
Streams
.Va line0
to
.Va line7
correspond to analog outputs and
.Va line8
to
.Va line9
correspond to digital outputs.
Each of them can be individually configured to use any of
the external inputs or its corresponding playback stream as source.
Additionally, outputs
.Va line0 , line1 , line8 ,
and
.Va line9
can be configured to use
.Va mon0
or
.Va mon1
as sources.
.It Dv monitor
There are 2 streams that can be configured to contain any linear
superposition of any of the 10 playback and 10 external input streams.
They are labelled
.Va mon0
and
.Va mon1 .
From the mixer's point of view they are input streams,
so they can be used as sources of output streams.
.It Dv playback
There are 10 streams corresponding to samples transferred
from the host to the device.
They are labelled
.Va play0
\(en
.Va play10 .
From the mixer's point of view they are input streams,
so they are usable as sources of output streams.
.It Dv record
There are 12 streams corresponding to samples transferred
from the device to the host.
They are not controllable by the mixer.
Streams 0 to 9 are hardwired to external inputs
.Va line0
\(en
.Va line9
and streams 10 and 11 are hardwired to
.Va mon0
and
.Va mon1 .
.El
.Ss Playback and record data formats
Both playback and record use linear encoding.
Samples are represented by 32-bit signed numbers in little endian order.
Only the first 24 most significant bits are used.
Playback uses 10 channels and record uses 12 channels.
.Sh SEE ALSO
.Xr audio 4 ,
.Xr intro 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.3 .
.Sh BUGS
MIDI and S/PDIF transmitter/receivers are not yet supported.
.Pp
The current
.Xr audio 4
driver doesn't allow playback and record blocks to have the same duration,
making the device hardly usable for block based I/O in full-duplex.
Playback and capture cannot be started atomically.
Ring buffer sizes are limited to 64kB,
which can be limiting at high sample rates.
