openbsd/src/share/man/man4/ep.4
.\"	$OpenBSD: ep.4,v 1.2 1998/09/26 22:42:52 fgsch Exp $
.\"
.\" Copyright (c) 1994 Herb Peyerl
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Herb Peyerl
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 12, 1998
.Dt EP 4 i386
.Os
.Sh NAME
.Nm ep
.Nd Ethernet driver for 3Com Etherlink III (3c5x9)
.Sh SYNOPSIS
.Cd "ep? at eisa? slot ?"
.Cd "ep? at isa? port ? irq ?"
.Cd "ep? at pci? dev ? function ?"
.Cd "ep? at pcmcia? port 0x300 size 0x10 irq 10 slot ?"
.Cd "ep* at isapnp?"
.Sh DESCRIPTION
The
.Nm ep
device driver supports the 3Com Etherlink III family of ethernet cards.
This includes, among others,
the 3c509 (ISA), 3c579 (EISA), 3c589 (PCMCIA), and 3c590, 3c595,
3c900, and 3c905 (all PCI).
Various models of these cards come with a different assortment of
connectors:
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It AUI/DIX
Standard 15 pin connector
.It 10Base2
BNC, also known as thin-net
.It 10BaseT
10 Mbps UTP, also known as twisted pair
.It MII
UTP, switchable between 10 and 100 Mbps
.El
.Pp
Various models of the
.Nm
support different media types or connectors.
The supported media types are:
.Bl -tag -width xxxxxxxxxxxxxx -offset indent
.It media autoselect
Attempt to autoselect the media type
.It media 100baseTX mediaopt full-duplex
Use 100baseTX, full duplex
.It media 100baseTX Op mediaopt half-duplex
Use 100baseTX, half duplex
.It media 10baseT mediaopt full-duplex
Use 10baseT, full duplex
.It media 10baseT Op mediaopt half-duplex
Use 10baseT (UTP), half duplex
.It media 10base5 Op mediaopt half-duplex
Use 10base5 (Thin-net), half duplex
.It media 10base2 Op mediaopt half-duplex
Use 10base2 (Thick-net), half duplex
.El
The default media type varies based on the model of card.
.Pp
If there are multiple cards in the computer, they are searched for
in the following order:
The PCI cards are found first based on PCI function# order.
The EISA cards are found next based on EISA slot# order.
Next, the 3c509 ISA cards are found based on in increasing ethernet
address order.
Finally, the 3c509 ISA cards in Plug-and-Play mode will be probed
for and matched in Plug-and-Play order.
This is an example of how these will probe:
.Pp
ep0 at isa0 port 0x300-0x30f irq 3: 3Com 3C509 Ethernet: address 00:a0:24:29:a3:6b, utp (default utp)
.Pp
ep0 at pci0 dev 12 function 0 "3Com 3c905 100Base-TX" rev 0x00: address 00:60:97:dd:fc:eb, mii default mii/autoselect isa irq 9
.Pp
You may specify the port and irq numbers that the cards are expected
to be found at, but it is not necessary.
The cards are sufficiently intelligent to tell us where they
actually live on the ISA bus.
.Pp
.Sh NOTES
The 3c509 card has no jumpers to set the address.
3Com supplies software to set the address of the card in software.
To find the card on the ISA bus, the kernel performs a complex
scan operation at IO address 0x100.
Beware!
Avoid placing other cards at that address!
.Pp
Some models of 3c5x9 have all three connectors on them.
In the case of these cards; you must configure the transceiver type
with the 3Com supplied DOS configuration disk before the link0/link1
flags will operate correctly.
.Pp
Plug and Play mode must currently be disabled on these cards.
.Pp
Do not specify link flags for the 3c905.
If you can not get this card to work, try running the 3Com supplied DOS
configuration program (available from their web site) and tell it to
autoselect the connector type.
.Pp
.Sh DIAGNOSTICS
ep0: reset (status: %x)
.in +4
the driver has encountered a FIFO underrun or overrun. The driver will reset
the card and the packet will be lost. This is not fatal.
.in -4
ep0: eeprom failed to come ready
.in +4
The eeprom failed to come ready.  This probably means the card is wedged.
.in -4
ep0: 3c509 in test mode. Erase pencil mark!
.in +4
This means that someone has scribbled with pencil in the test area on the
card.  Erase the pencil mark and reboot.  (This is not a joke).
.in -4
.Sh SEE ALSO
.Xr ifconfig 8 ,
.Xr intro 4 ,
.Xr ne 4 ,
.Xr eg 4 ,
.Xr el 4 ,
.Xr ie 4 ,
.Xr le 4
