openbsd/src/share/man/man4/escodec.4
.\"	$OpenBSD: escodec.4,v 1.1 2020/06/11 00:26:01 patrick Exp $
.\"
.\" Copyright (c) 2020 Patrick Wildt <patrick@blueri.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 11 2020 $
.Dt ESCODEC 4
.Os
.Sh NAME
.Nm escodec
.Nd Everest Semiconductor ES8316 audo codec
.Sh SYNOPSIS
.Cd "escodec* at iic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Everest Semiconductor ES8316 audio codec.
.Sh SEE ALSO
.Xr iic 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jared McNeill Aq Mt jmcneill@invisible.ca
for
.Nx
and ported to
.Ox
by
.An Patrick Wildt Aq Mt patrick@blueri.se .
