openbsd/src/share/man/man4/eso.4
.\"	$OpenBSD: eso.4,v 1.9 2008/04/04 03:41:20 brad Exp $
.\"	$NetBSD: eso.4,v 1.2 1999/08/02 17:43:52 augustss Exp $
.\"
.\" Copyright (c) 1999 Klaus J. Klein
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: April 4 2008 $
.Dt ESO 4
.Os
.Sh NAME
.Nm eso
.Nd ESS Technology Solo-1 PCI AudioDrive audio device
.Sh SYNOPSIS
.Cd "eso* at pci?"
.Cd "audio* at eso?"
.\" .Cd "mpu* at eso?"
.Cd "opl* at eso?"
.Sh DESCRIPTION
The
.Nm
device driver supports sound cards based on ESS Technology Solo-1
PCI AudioDrive chips (ES1938 and ES1946),
e.g. the TerraTec 128i PCI card.
.Sh DIAGNOSTICS
.Bl -diag
.It "eso0: can't map Audio 1 DMA into I/O space"
PCI autoconfiguration did not map the first audio channel DMA controller into
I/O space at a suitable address, and the driver was not able map it by itself.
In that case only playback functionality will be available.
.It "eso0: reset timeout"
The device failed to acknowledge being reset.
.It "eso0: RDR timeout"
The driver timed out reading data from a controller register.
.It "eso0: WDR timeout"
The driver timed out waiting to send a command or writing to a controller
register.
.El
.Sh SEE ALSO
.Xr audio 4 ,
.Xr intro 4 ,
.\" .Xr mpu 4 ,
.Xr opl 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 2.5 .
.Sh BUGS
The game port and MIDI port are not supported.
