openbsd/src/share/man/man4/etphy.4
.\"	$OpenBSD: etphy.4,v 1.3 2013/07/16 16:05:48 schwarze Exp $
.\"
.\" Copyright (c) 2007 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt ETPHY 4
.Os
.Sh NAME
.Nm etphy
.Nd Agere/LSI ET1011 TruePHY Gigabit Ethernet PHY
.Sh SYNOPSIS
.Cd "etphy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver supports the Agere/LSI ET1011 TruePHY 10/100/1000 Ethernet PHYs
including the integrated TruePHY in ET1310 based adapters.
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr mii 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 4.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Sepherosa Ziehau
for DragonFlyBSD
and ported to
.Ox
by
.An Jonathan Gray Aq Mt jsg@openbsd.org .
