openbsd/src/share/man/man4/fintek.4
.\"	$OpenBSD: fintek.4,v 1.1 2006/06/27 04:01:48 deraadt Exp $
.\"
.\" Copyright (c) 2005 Theo de Raadt <deraadt@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd June 26, 2006
.Dt FINTEK 4
.Os
.Sh NAME
.Nm fintek
.Nd Fintek F75375 temperature sensor
.Sh SYNOPSIS
.Cd "fintek* at iic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Fintek F75375 temperature sensor
and fan controller.
The sensor possesses a collection of sensor values which are
made available through the
.Xr sysctl 8
interface:
.Bd -literal -offset indent
hw.sensors.0=fintek0, VCC, 1.72 V DC
hw.sensors.1=fintek0, Volt 1, 1.34 V DC
hw.sensors.2=fintek0, Volt 2, 1.73 V DC
hw.sensors.3=fintek0, Volt 3, 0.90 V DC
hw.sensors.4=fintek0, Temp 1, 31.00 degC
hw.sensors.5=fintek0, Temp 2, 29.00 degC
hw.sensors.6=fintek0, FAN1, 0 RPM
hw.sensors.7=fintek0, FAN1, 0 RPM
.Ed
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Dale Rahn Aq drahn@openbsd.org

