openbsd/src/share/man/man4/fms.4
.\"	$OpenBSD: fms.4,v 1.5 2002/05/09 14:52:28 mickey Exp $
.\"	$NetBSD: fms.4,v 1.2 1999/12/15 22:07:32 abs Exp $
.\"
.\" Copyright (c) 1999 Klaus J. Klein
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 1, 1999
.Dt FMS 4
.Os
.Sh NAME
.Nm fms
.Nd Forte Media FM801 audio device driver
.Sh SYNOPSIS
.Cd "fms*   at pci? dev ? function ?"
.Cd "audio* at fms?"
.Cd "mpu*   at fms?"
.Cd "opl*   at fms?"
.Cd "radio* at fms?"
.Sh DESCRIPTION
The
.Nm
device driver supports the Forte Media FM801 sound card and various FM tuners
attached to the sound card.
.Sh RADIO
Right now the
.Nm
driver supports MediaForte's
.Tn SoundForte RadioLink SF64-PCR FM
tuner and tuners on MediaForte's
.Tn SoundForte Quad X-treme SF256-PCP-R
and
.Tn SoundForte Theatre X-treme 5.1 SF256-PCS
sound cards.
.Sh SEE ALSO
.Xr audio 4 ,
.Xr pci 4 ,
.Xr radio 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 2.8 .
