openbsd/src/share/man/man4/fpa.4
.\"	$OpenBSD: fpa.4,v 1.16 2003/05/10 21:17:21 jmc Exp $
.\"	$NetBSD: fpa.4,v 1.2 1997/02/18 01:07:46 jonathan Exp $
.\"
.\" Copyright (c) 1995, Matt Thomas
.\" All rights reserved.
.\"
.Dd March 13, 1995
.Dt FPA 4
.Os
.Sh NAME
.Nm fpa ,
.Nm fea
.Nd DEC FDDI controller device driver
.Sh SYNOPSIS
.Cd "fpa* at pci? dev ? function ?"
.Cd "fea* at eisa?"
.Sh DESCRIPTION
The
.Nm
and
.Nm fea
device driver provides support for the DEC DEFPA PCI FDDI Controller and
the DEC DEFEA EISA FDDI Controller, respectively.
All variants of either controller are supported including the DAS and
SAS configurations.
.Sh DIAGNOSTICS
.Bl -diag
.It "fea%d: error: desired IRQ of %d does not match device's actual IRQ (%d)"
The device probe detected that the DEFEA board is configured for a different
interrupt than the one specified in the kernel configuration file.
.It "fea%d: error: memory not enabled! ECU reconfiguration required"
The device probe found that no device memory had been configured on the
DEFEA.
The DEFEA can be configured with no device memory, this driver
requires a minimum of 1K device memory be set up.
The ECU (EISA Configuration Utility) will need to be run to change
the settings.
.El
.Sh CAVEATS
Normally, the device driver will not enable the reception of SMT frames.
However if the IFF_LINK1 flag is set, the device driver will enable the
reception of SMT frames and pass them up to the Berkeley Packet Filter for
processing.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr eisa 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr ifconfig 8
.Sh AUTHORS
The
.Nm
and
.Nm fea
device driver and manual page was written by Matt Thomas.
