openbsd/src/share/man/man4/fuse.4
.\" $OpenBSD: fuse.4,v 1.4 2013/06/03 19:16:44 tedu Exp $
.\"
.\" Copyright (c) 2013 Sylvestre Gallon <ccna.syl@gmail.com>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 3 2013 $
.Dt FUSE 4
.Os
.Sh NAME
.Nm fuse
.Nd FileSystem in Userland
.Sh SYNOPSIS
.Cd "option FUSE"
.Cd "pseudo-device fuse" Op Ar count
.Sh DESCRIPTION
The
.Nm
device provides a FUSE interface for implementing FileSystem in Userland.
Each fuse mount will take a
.Nm
device so there are
.Fa count
.Nm
mountpoints possible.
.Pp
This device does not supports partial reads and writes.
.Sh FILES
.Bl -tag -width /dev/fuse* -compact
.It Pa /dev/fuse*
.Nm
device special files
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr fuse 3 ,
.Xr fusebuf 9
.Sh HISTORY
The
.Nm
driver
first appeared in
.Ox 5.4 .
