openbsd/src/share/man/man4/fxp.4
.\"	$OpenBSD: fxp.4,v 1.36 2005/10/31 14:50:02 brad Exp $
.\"
.\" Copyright (c) 1997 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 28, 1998
.Dt FXP 4
.Os
.Sh NAME
.Nm fxp
.Nd Intel EtherExpress PRO/100 Ethernet driver
.Sh SYNOPSIS
.Cd "fxp* at pci?"
.Cd "fxp* at cardbus?"
.Cd "icsphy* at mii?"
.Cd "inphy* at mii?"
.Cd "nsphy* at mii?"
.Sh DESCRIPTION
The
.Nm
device driver supports the Intel EtherExpress 100 family of Ethernet cards
based on various revisions of the i82557, i82558, i82559, i82559S,
i82550, i82551, and i82562 chipsets.
These come in several different varieties, including dual-port cards, and
as built-in Ethernet solutions on certain motherboards.
This includes, among others, the following models:
.Pp
.Bl -item -offset indent -compact
.It
Intel EtherExpress PRO/100 PCI
.It
Intel EtherExpress PRO/100B PCI
.It
Intel EtherExpress PRO/100+ PCI
.It
Intel EtherExpress PRO/100 Dual-Port PCI
.It
Intel PRO/100 CardBus II PC Card
.It
Intel PRO/100 VE
.It
Intel PRO/100 VM
.It
Intel PRO/100 M
.El
.Pp
This list is not exhaustive.
In particular, the
.Nm
driver should support any card by any manufacturer which is based on one of the
aforementioned chipsets.
.Pp
The following media types and options (as given to
.Xr ifconfig 8 )
are supported:
.Bl -tag -width xxx -offset indent
.It Cm media No autoselect
Enable autoselection of the media type and options (default).
.It Cm media No 100baseTX Cm mediaopt No full-duplex
Set 100Mbps (Fast Ethernet) operation and force full-duplex mode.
.It Cm media No 100baseTX Cm mediaopt No half-duplex
Set 100Mbps (Fast Ethernet) operation and force half-duplex mode.
.It Cm media No 10baseT Cm mediaopt No full-duplex
Set 10Mbps operation and force full-duplex.
.It Cm media No 10baseT Cm mediaopt No half-duplex
Set 10Mbps operation and force half-duplex.
.El
.Pp
If no media options are present, the
.Nm
driver places the card into autoselect mode.
.Pp
These cards also come with a variety of PHYs.
Models exist with PHYs supported by both the
.Xr inphy 4
and
.Xr nsphy 4
drivers.
.Sh FILES
Some devices are able to do interrupt coalescing but it requires firmware
updating.
The following firmware files are potentially loaded on demand when an
interface is brought up:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Pa /etc/firmware/fxp-d101a
.It Pa /etc/firmware/fxp-d101b0
.It Pa /etc/firmware/fxp-d101ma
.It Pa /etc/firmware/fxp-d101s
.It Pa /etc/firmware/fxp-d102
.It Pa /etc/firmware/fxp-d102c
.It Pa /etc/firmware/fxp-d102e
.El
.Pp
If a file is missing, the driver attempts to operate anyway.
.Sh DIAGNOSTICS
.Bl -diag
.It "fxp%d: couldn't map memory"
A fatal initialization error has occurred.
.It "fxp%d: couldn't map interrupt"
A fatal initialization error has occurred.
.It "fxp%d: Failed to malloc memory"
There are not enough mbufs available for allocation.
.It "fxp%d: device timeout"
The device has stopped responding to the network, or there is a problem with
the network connection (cable).
.It "fxp%d: failed loadfirmware of file %s: errno %d"
The device is able to do interrupt coalescing but required firmware file
is missing.
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr cardbus 4 ,
.Xr icsphy 4 ,
.Xr ifmedia 4 ,
.Xr inphy 4 ,
.Xr intro 4 ,
.Xr iophy 4 ,
.Xr netintro 4 ,
.Xr nsphy 4 ,
.Xr pci 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 2.2 .
.Sh AUTHORS
The
.Nm
device driver was written by David Greenman.
This manual page was written by David E. O'Brien.
