openbsd/src/share/man/man4/fxp.4
.\"	$OpenBSD: fxp.4,v 1.5 1998/09/22 18:58:05 deraadt Exp $
.\"
.\" Copyright (c) 1997 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 28, 1998
.Dt FXP 4
.Os OpenBSD
.Sh NAME
.Nm fxp
.Nd
Intel EtherExpress Pro/100B ethernet device driver
.Sh SYNOPSIS
.Cd "fxp* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the EtherExpress Pro/10 and Pro/100B PCI Fast Ethernet
adapters based on the Intel i82557 and i82558 ethernet chip.
The
.Nm
driver supports the following media types:
.Pp
.Bl -tag -width xxxxxxxx
.It media autoselect
Enable autoselection of the media type and options
.It media 10baseT [mediaopt half-duplex]
Set 10Mbps operation, half-duplex
.It media 10baseT [mediaopt full-duplex]
Set 10Mbps operation, full-duplex
.It media 100baseTX [mediaopt half-duplex]
Set 100Mbps operation, half duplex
.It media 100baseTX [mediaopt full-duplex]
Set 100Mbps operation, full duplex
.El
.Pp
Note that 100baseTX media type is only available on the Pro/100B and i82558
cards.
.Pp
.Sh DIAGNOSTICS
.Bl -diag
.It "fxp%d: couldn't map memory"
A fatal initialization error has occurred.
.It "fxp%d: couldn't map interrupt"
A fatal initialization error has occurred.
.It "fxp%d: Failed to malloc memory"
There are not enough mbuf's available for allocation.
.It "fxp%d: device timeout"
The device has stopped responding to the network, or there is a problem with
the network connection (cable).
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr netintro 4 , 
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 2.2 .
.Sh AUTHORS
The
.Nm
device driver was written by David Greenman.
This manual page was written by David E. O'Brien.
