openbsd/src/share/man/man4/gdt.4
.\"	$OpenBSD: gdt.4,v 1.7 2000/07/04 23:25:20 niklas Exp $
.\"
.\" Copyright (c) 2000 Niklas Hallqvist.  All rights reserved.
.\"
.\"
.Dd February 17, 2000
.Dt GDT 4
.Os
.Sh NAME
.Nm gdt
.Nd
.Tn ICP-Vortex GDT RAID driver
.Sh SYNOPSIS
.Cd "gdt* at pci? dev ? function ?"
.Cd "scsibus* at gdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the following adapters:
.Pp
.Bl -tag -width -offset indent -compact
.Tn GDT60x0 ,
.Tn GDT6000B ,
.Tn GDT6x10 ,
.Tn GDT6x20 ,
.Tn GDT6530 ,
.Tn GDT6550 ,
.Tn GDT6x17 ,
.Tn GDT6x27 ,
.Tn GDT6537 ,
.Tn GDT6557 ,
.Tn GDT6x15 ,
.Tn GDT6x25 ,
.Tn GDT6535 ,
.Tn GDT6555 ,
.Tn GDT6x17RP ,
.Tn GDT6x27RP ,
.Tn GDT6537RP ,
.Tn GDT6557RP ,
.Tn GDT6x11RP ,
.Tn GDT6x21RP ,
.Tn GDT6x17RD ,
.Tn GDT6x27RD ,
.Tn GDT6537RD ,
.Tn GDT6557RD ,
.Tn GDT6x11RD ,
.Tn GDT6x21RD ,
.Tn GDT6x18RD ,
.Tn GDT6x28RD ,
.Tn GDT6x38RD ,
.Tn GDT6x58RD ,
.Tn GDT7x18RN ,
.Tn GDT7x28RN ,
.Tn GDT7x38RN ,
.Tn GDT7x58RN ,
.Tn GDT6x19RD ,
.Tn GDT6x29RD ,
.Tn GDT7x19RN ,
.Tn GDT7x29RN .
.Pp
However, only the
.Tn GDT6x27RP
has been tested as that was the adapter that was available to the author.
.Pp
Although the controllers are actual RAID controllers the driver makes them
look just like SCSI controllers.  All RAID configuration is done through
the controllers' BIOSes.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr sd 4
.Sh AUTHOR
The
.Nm
driver was written by
.An Niklas Hallqvist Aq niklas@openbsd.org ,
inspired by the Linux driver by
.An Achim Luebner Aq achim@vortex.de .
.Sh HISTORY
The
.Nm gdt
driver first appeared in
.Ox 2.7 .
.Sh BUGS
An ISA & EISA front-end is needed.
.Pp
The driver does not yet support transparent raw SCSI mode.
.Pp
It would be nice to configure the RAID units after boot
but the information on how to do that is not public.
