openbsd/src/share/man/man4/gem.4
.\"	$OpenBSD: gem.4,v 1.6 2003/06/02 16:16:26 miod Exp $
.\"
.\" Copyright (c) 2001 Miodrag Vallat.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistribution of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd October 5, 2001
.Dt GEM 4
.Os
.Sh NAME
.Nm gem
.Nd GEM gigabit ethernet interface
.Sh SYNOPSIS
.Cd "gem* at pci? dev ? function ?"
.Cd "bmtphy* at mii? phy ?"
.Cd "brgphy* at mii? phy ?"
.Cd "lxtphy* at mii? phy ?"
.\" .Cd "nsphy* at mii? phy ?"
.\" .Cd "qsphy* at mii? phy ?"
.Sh DESCRIPTION
The
.Nm
interface provides access to the 10Mb/s, 100Mb/s and 1Gb/s Ethernet networks.
The
.Nm
is found on the
.Tn Sun
GEM and ERI 10/100 boards, as well as the
.Tn Apple
internal GMAC ethernet.
.Pp
Each of the host's network addresses
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm
interface employs the address resolution protocol described in
.Xr arp 4
to dynamically map between Internet and Ethernet addresses on the local
network.
.Pp
When a
.Nm
interface is brought up, by default, it will attempt to auto-negotiate the
link speed and duplex.
The speeds are tried in descending order; first in full duplex mode, then
half duplex.
.Pp
The
.Nm
supports several media types, which are selected via the
.Xr ifconfig 8
command.
The supported media types are:
.Bl -tag -width "media" -offset indent
.It media autoselect
Attempt to autoselect the media type (default)
.\" Check and correct the gigabit modes. Are both copper and fiber supported?
.\" And in both duplex modes as well?
.It media 1000baseT  mediaopt full-duplex
Use 1000baseT on copper, full duplex
.It media 1000baseT Op mediaopt half-duplex
Use 1000baseT on copper, half duplex
.It media 1000baseSX  mediaopt full-duplex
Use 1000baseSX on fiber, full duplex
.It media 1000baseSX Op mediaopt half-duplex
Use 1000baseSX on fiber, half duplex
.It media 100baseTX  mediaopt full-duplex
Use 100baseTX, full duplex
.It media 100baseTX Op mediaopt half-duplex
Use 100baseTX, half duplex
.It media 10baseT mediaopt full-duplex
Use 10baseT, full duplex
.It media 10baseT Op mediaopt half-duplex
Use 10baseT, half duplex
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr bmtphy 4 ,
.xr brgphy 4 ,
.Xr ifmedia 4 ,
.Xr inet 4 ,
.Xr intro 4 ,
.Xr lxtphy 4 ,
.Xr netintro 4 ,
.\" .Xr nsphy 4
.\" .Xr qsphy 4
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
.Ox
support for the
.Nm
first appeared in
.Ox 3.0 .
