openbsd/src/share/man/man4/glenv.4
.\"	$OpenBSD: glenv.4,v 1.1 2006/01/28 10:44:23 kettenis Exp $
.\"
.\" Copyright (c) 2006 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd January 28, 2006
.Dt GLENV 4
.Os
.Sh NAME
.Nm glenv
.Nd Genesys Logic GL518SM hardware monitor
.Sh SYNOPSIS
.Cd "glenv* at iic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn Genesys Logic
GL518SM hardware monitor to be used with
the
.Xr sysctl 8
interface.
.Pp
The GL518SM possesses a voltage sensor, a temperature sensor and two
fan speed sensors.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
