openbsd/src/share/man/man4/gpr.4
.\"	$OpenBSD: gpr.4,v 1.8 2007/05/31 19:19:50 jmc Exp $
.\"
.\" Copyright (c) 2002, Federico G. Schwindt
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions are
.\" met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
.\" A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
.\" OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
.\" OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt GPR 4
.Os
.Sh NAME
.Nm gpr
.Nd GemPlus GPR400 PCMCIA smartcard reader
.Sh SYNOPSIS
.Cd "gpr* at pcmcia?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the GemPlus GPR400 PCMCIA smartcard reader.
.Pp
The
.Nm
driver provides a number of ioctl functions to send and receive information
from the smartcard reader and/or the smartcard (see
.Pa /usr/include/dev/pcmcia/gprio.h ) .
.Sh FILES
.Bl -tag -width /usr/include/dev/pcmcia/gprio.h -compact
.It Pa /dev/gpr*
.It Pa /usr/include/dev/pcmcia/gprio.h
.El
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr intro 4 ,
.Xr pcmcia 4
.Sh BUGS
Just a very small set of operations are currently implemented.
