openbsd/src/share/man/man4/gx.4
.\" $OpenBSD: gx.4,v 1.6 2002/09/26 07:55:40 miod Exp $
.\" Copyright (c) 2001
.\"	Jonathan Lemon <jlemon@FreeBSD.org>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd October 17, 2001
.Dt GX 4
.Os
.Sh NAME
.Nm gx
.Nd "Intel Pro/1000 gigabit ethernet driver"
.Sh SYNOPSIS
.Cd "gx* at pci? device ? function ?"
.Cd "eephy* at mii? phy ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for NICs based on the Intel 82542, 82543 and
82544 gigabit ethernet controller chips.
Both fiber and copper variants of
the cards are supported.
The following cards are supported:
.Pp
.Bl -bullet -compact
.It
Intel i82542 1000BASE-X Ethernet
.It
Intel i82543 1000BASE-X Ethernet
.It
Intel i82543-SC 1000BASE-X Ethernet
.It
Intel i82543 1000BASE-T Ethernet
.It
Intel i82544 1000BASE-T Ethernet
.It
Intel i82544 1000BASE-X Ethernet
.It
Intel i82544GC 1000BASE-T Ethernet (32- and 64-bit)
.El
.Pp
The 82542 supports TBI (ten bit interface), while the 82543 and 82544
support the GMII transceivers, which means they can be used with either
copper or 1000baseX fiber applications.
.\" Both boards support VLAN tagging/insertion and the 82543 and 82544
.\" additionally support TCP/IP checksum offload.
.Pp
The 82543 and 82544 copper cards use the Marvell 10/100/1000 copper
gigabit transceiver chip, which supports autonegotiation of 10, 100
and 1000mbps modes in full or half duplex, however half duplex
1000mbps is not supported.
.Pp
The
.Nm
driver supports the following media types:
.Bl -tag -width "1000baseTX"
.It Cm autoselect
Enable autoselection of the media type and options.
User can manually override
the autoselected mode by adding media options to the appropriate
.Xr hostname.if 5
file.
.It Cm 10baseT
Set 10Mbps operation.
The
.Xr ifconfig 8 Ns 's
.Cm mediaopt
option can also be used to select either
.Cm full-duplex
or
.Cm half-duplex
modes.
.It Cm 100baseTX
Set 100Mbps (fast ethernet) operation.
The
.Xr ifconfig 8 Ns 's
.Cm mediaopt
option can also be used to select either
.Cm full-duplex
or
.Cm half-duplex
modes.
.It Cm 1000baseTX
Set 1000baseTX operation over twisted pair.
Only
.Cm full-duplex
mode is supported.
.El
.Pp
The
.Nm
driver supports the following media options:
.Bl -tag -width ".Cm full-duplex"
.It Cm full-duplex
Force full duplex operation.
.It Cm half-duplex
Force half duplex operation.
.El
.Pp
The
.Nm
driver also supports one special link option for 1000baseTX cards:
.Bl -tag -width ".Cm link0"
.It Cm link0
With 1000baseTX cards, establishing a link between two ports requires
that one port be configured as a master and the other a slave.
With autonegotiation,
the master/slave settings should be chosen automatically.
Setting the
.Cm link0
flag with
.Xr ifconfig 8
will force the link up instead.
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh DIAGNOSTICS
.Bl -diag
.It "gx%d: couldn't map memory"
A fatal initialization error has occurred.
.It "gx%d: couldn't map interrupt"
A fatal initialization error has occurred.
.It "gx%d: couldn't setup irq"
A fatal initialization error has occurred.
.It "gx%d: failed to read station address"
A fatal initialization error has occurred.
.It "gx%d: no memory for list buffers!"
The driver failed to allocate memory for per-device instance information
during initialization.
.It "gx%d: failed to enable memory mapping!"
The driver failed to initialize PCI shared memory mapping.
This might happen if the card is not in a bus-master slot.
.It "gx%d: GMII/MII, PHY not detected"
The MII probe routines failed to detect the PHY.
This might happen if miibus is not configured.
.It "gx%d: watchdog timeout"
The device has stopped responding to the network, or there is a problem with
the network connection (cable).
.It "gx%d: mbuf allocation failed -- packet dropped"
The driver could not allocate a mbuf for the receive ring.
.It "gx%d: cluster allocation failed -- packet dropped"
The driver could not allocate a mbuf cluster for the receive ring.
.It "gx%d: link down"
The link status changed from up to down.
.It "gx%d: link up"
The link status changed from down to up.
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr em 4 ,
.Xr eephy 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr vlan 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 3.1 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Jonathan Lemon Aq jlemon@FreeBSD.org .
.Pp
Support for the newer 82544 based chips (Cordova) was added by
.An Nathan Binkert Aq nate@OpenBSD.org
who also did the port to
.Ox .
