openbsd/src/share/man/man4/hil.4
.\"	$OpenBSD: hil.4,v 1.2 2003/02/11 23:24:58 mickey Exp $
.\"
.\" Copyright (c) 2003 Miodrag Vallat.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistribution of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd February 11, 2003
.Dt HIL 4
.Os
.Sh NAME
.Nm hil
.Nd HP-HIL driver
.Sh SYNOPSIS
.Cd "hil* at gsc? irq 1"
.Cd "hilkbd* at hil?"
.\" .Cd "hilms* at hil?"
.\" .Cd "hilid* at hil?"
.Sh DESCRIPTION
The
.Nm
interface provides access to the
.Dq Human Interface Loop
controller found on many
.Tn HP
workstations.
.Pp
It provides generic HIL management and interfaces for child devices,
such as keyboards, button boxes, mice, graphics tablet, and ID modules.
.Sh SEE ALSO
.Xr gsc 4 ,
.\" .Xr hilid 4 ,
.Xr hilkbd 4 ,
.\" .Xr hilms 4 ,
.Xr intro 4
