openbsd/src/share/man/man4/ietp.4
.\"	$OpenBSD: ietp.4,v 1.1 2023/07/08 02:43:02 jcs Exp $
.\"
.\" Copyright (c) 2016 joshua stein <jcs@openbsd.org>
.\" Copyright (c) 2023 vladimir serbinenko <phcoder@gmail.com>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 8 2023 $
.Dt IETP 4
.Os
.Sh NAME
.Nm ietp
.Nd Elantech touchpad
.Sh SYNOPSIS
.Cd "ietp* at iic?"
.Cd "wsmouse* at ietp? mux 0"
.Sh DESCRIPTION
The
.Nm
driver provides support for Elantech touchpad
devices connected over Inter-Integrated Circuit (I2C) buses.
Access to these devices is through the
.Xr wscons 4
driver.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr wsmouse 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 7.4 .
.Sh AUTHORS
The
.Nm
driver was written by
.An vladimir serbineko Aq Mt phcoder@gmail.com .
