openbsd/src/share/man/man4/isagpio.4
.\"	$OpenBSD: isagpio.4,v 1.4 2007/05/31 19:19:50 jmc Exp $
.\"
.\" Copyright (c) 2006 Oleg Safiullin <form@pdp-11.org.ru>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice unmodified, this list of conditions, and the following
.\"    disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt ISAGPIO 4
.Os
.Sh NAME
.Nm isagpio
.Nd ISA I/O mapped as GPIO
.Sh SYNOPSIS
.Cd "isagpio0 at isa? port 0x78"
.Cd "isagpio1 at isa? port 0x80"
.Cd "gpio* at isagpio?"
.Sh DESCRIPTION
The
.Nm
driver allows access to the 8-bit ISA I/O space through the
.Xr gpio 4
framework, thus making use of the simple GPIO devices connected directly
to the ISA bus.
.Sh SEE ALSO
.Xr gpio 4 ,
.Xr intro 4 ,
.Xr isa 4 ,
.Xr gpioctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Oleg Safiullin Aq form@pdp-11.org.ru .
