openbsd/src/share/man/man4/isapnp.4
.\"	$OpenBSD: isapnp.4,v 1.13 1999/08/04 17:18:45 deraadt Exp $
.\"	$NetBSD: isapnp.4,v 1.8 1998/06/07 09:08:46 enami Exp $
.\"
.\" Copyright (c) 1997 Jonathan Stone
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgements:
.\"      This product includes software developed by Jonathan Stone
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 12, 1998
.Dt ISAPNP 4
.Os
.Sh NAME
.Nm isapnp
.Nd introduction to ISA Plug-and-Play support
.Sh SYNOPSIS
.Cd "isapnp0 at isa?"
.Pp
An
.Nm isapnp
bus can be configured for each supported ISA bus.
.Sh DESCRIPTION
.Ox
provides machine-independent bus support and drivers for ISA
Plug-and-Play (isapnp) autoconfiguration of PnP-compatible
devices on an ISA bus.
.Sh SUPPORTED DEVICES
.Ox
includes machine-independent ISAPNP drivers, sorted by function
and driver name:
.Pp
.Ss Disk controllers
.Bl -tag -width speaker -offset indent -compact
.It aic
Adaptec AHA-1520B SCSI controller card.
.It aha
Adaptec AHA-154x SCSI controller card.
.It wdc
IDE controllers (typically found on sound cards)
.El
.Pp
.Ss Serial and parallel interfaces
.Bl -tag -width speaker -offset indent -compact
.It com & pccom
8250/16450/16550/16650/16850-compatible ISA PnP serial cards and internal
modems (i386 only).
Win-modems are not supported.
.El
.Pp
.Ss Network interfaces
.Bl -tag -width speaker -offset indent -compact
.It ep
3Com 3C509B Etherlink-III Ethernet interface.
.It le
Ethernet driver for Lance based Ethernet interfaces.
.It ne
NE2000-compatible Ethernet interfaces.
.It we
SMC EtherEZ ethernet cards
.El
.Ss Sound
.Bl -tag -width speaker -offset indent -compact
.It sb
SoundBlaster series sound cards (SB16 PnP through AWE64).
.It gus
Gravis Ultrasound PnP sound cards.
.It ym
Yamaha OPL3-SA3 sound cards.
.It wss
Windows Sound System cards.
.It mpu
MIDI interfaces.
.El
.Ss Misc devices
.Bl -tag -width speaker -offset indent -compact
.It joy
Joystick driver.
.El
.Sh CAVEATS
From time to time an
.Nm
device will be found which the kernel does not recognize.
The kernel matches
.Nm
devices to device drivers based on identifiers which each device
provides.  For example, this device:
.Pp
joy0 at isapnp0 <Creative SB16 PnP, CTL7001, PNPB02F, Game> port 0x200/8
.Pp
This joystick calls itself by the two names
.Dq CTL7001
and
.Dq PNPB02F .
The latter is a standard name (which the kernel automatically recognises),
but
.Dq CTL7001
is a vendor-specific name which needs to be added to a table.  Unfortunately,
some devices advertise only their vendor-specific name; for instance:
.Pp
isapnp0: <PnP Sound Chip, @P@1001, , > port 0x200/8 not configured
.Pp
Testing will show that this device is actually a joystick.  To resolve
the issue, the actual name
.Dq @P@1001
has to be entered into the database found in
.Pa /sys/dev/isa/pnpdevs
and a new kernel must be built.
Then the device will probe like this:
.Pp
joy0 at isapnp0 <PnP Sound Chip, @P@1001, , > port 0x200/8
.Pp
.Sh SEE ALSO
.Xr aha 4 ,
.Xr aic 4 ,
.Xr ep 4 ,
.Xr intro 4 ,
.Xr joy 4 ,
.Xr le 4 ,
.Xr ne 4 ,
.Xr pccom 4 ,
.Xr sb 4 ,
.Xr wss 4 ,
.Xr ym 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 1.3 .
