openbsd/src/share/man/man4/ises.4
.\"	$OpenBSD: ises.4,v 1.8 2007/05/31 19:19:50 jmc Exp $
.\"
.\" Copyright (c) 2000 Håkan Olsson (ho@crt.se)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt ISES 4
.Os
.Sh NAME
.Nm ises
.Nd Securealink PCC-ISES hardware crypto accelerator
.Sh SYNOPSIS
.Cd "ises* at pci?"
.Sh DESCRIPTION
The
.Nm
driver supports cards containing the Securealink PCC-ISES chipset.
.Pp
The
.Nm
driver at the moment only provides strong random data to the
.Xr random 4
subsystem.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr random 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 2.9 .
.Sh BUGS
The cryptographic functions are not yet supported.
Also not yet supported are the chip's two LNAUs (Large Number Arithmetic
Units), which would be useful in OpenSSL applications.
