openbsd/src/share/man/man4/isp.4
.\"	$OpenBSD: isp.4,v 1.29 2014/02/13 08:55:40 tedu Exp $
.\"
.\" Copyright (c) 1998, 1999
.\" 	Matthew Jacob, for NASA/Ames Research Center
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd $Mdocdate: February 13 2014 $
.Dt ISP 4
.Os
.Sh NAME
.Nm isp
.Nd QLogic based SCSI or Fibre Channel SCSI interface
.Sh SYNOPSIS
.Cd "#option ISP_NOFIRMWARE"
.Cd "isp* at pci?     " Pq PCI
.Cd "#option ISP_FIRMWARE_1000"
.Cd "isp* at sbus?    " Pq SBus
.Cd "#option ISP_FIRMWARE_1040"
.Cd "#option ISP_FIRMWARE_1080"
.Cd "#option ISP_FIRMWARE_12160"
.Cd "#option ISP_FIRMWARE_2100"
.Cd "#option ISP_FIRMWARE_2200"
.Cd "#option ISP_FIRMWARE_2300"
.Sh DESCRIPTION
This driver provides access to a
.Tn SCSI
bus or a Fibre Channel
connected to
.Tn QLogic
ISP1000 (SBus), ISP1020 (PCI), ISP1040 (PCI), ISP1080 (PCI), ISP12160 (PCI)
.Tn SCSI
host adapters or ISP2100 (PCI/SBus), ISP2200 (PCI/SBus) Fibre Channel
or ISP2300 (PCI/SBus) 2-Gigabit Fibre Channel host adapters.
.Pp
Features include support for UltraSCSI and wide mode transactions for
.Tn SCSI ,
and Ultra2 LVD (for the ISP1080) and Ultra3 LVD (for the ISP12160)
and the FCP SCSI (private loop, public loop or fabric) for Fibre Channel.
Command tagging is supported for all (in fact, Fibre Channel requires tagging).
.Sh CONFIGURATION
Unless the
.Tn option ISP_NOFIRMWARE
is added to the kernel configuration file, known good firmware
will be downloaded to the driver at attach time.
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr pci 4 ,
.Xr sbus 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr ses 4 ,
.Xr st 4 ,
.Xr uk 4
.Sh AUTHORS
The
.Nm
driver was written by Matthew Jacob for NASA/Ames Research Center.
