openbsd/src/share/man/man4/isp.4
.\"	$OpenBSD: isp.4,v 1.2 1999/03/26 00:53:56 mjacob Exp $
.\"
.\" Copyright (c) 1998, 1999
.\" 	Matthew Jacob, for NASA/Ames Research Center
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd March 25, 1999
.\".Dt AHC 4
.Dt ISP 4
.Os
.Sh NAME
.Nm isp
.Nd Qlogic based SCSI or FibreChannel SCSI Host Adapters
.Sh SYNOPSIS
.Cd "isp* at pci? dev? function?" Pq PCI
.Cd "isp* at sbus? slot ? offset ?" Pq SBus
.Cd scsibus* at isp?
.Sh DESCRIPTION
This driver provides access to a
.Tn SCSI
bus or a
.Tn FibreChannel
connected to
.Tn Qlogic
ISP1000 (SBus), ISP1020 (PCI), ISP1040(PCI), ISP1080(PCI),
.Tn SCSI
host adapters or ISP2100(PCI)
.Tn FibreChannel
host adapters.
.Pp
Features include support for UltraSCSI and wide mode transactions for
.Tn SCSI ,
and LVD (for the ISP1080),
and the FCP SCSI profile for
.Tn FibreChannel .
Command tagging is supported for all (in fact,
.Tn FibreChannel
requires tagging).
.Sh CONFIGURATION
An optional
.Tn flags 0x80
appended to the above
.Tn isp*
declarations will disable the download of driver f/w, which means you
use whatever F/W is running on the card. If no firmware is running on the card,
you will lose.
.Sh BUGS
The driver currently ignores some NVRAM settings.
.Pp
The driver currently doesn't do error recovery for timed out commands
very gracefully.
.Pp
Fabric Support (for FibreChannel) is not supported yet.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr cd 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr st 4
.Sh AUTHOR
The
.Nm
driver was written by Matthew Jacob for NASA/Ames Research Center.
