openbsd/src/share/man/man4/isp.4
.\"	$OpenBSD: isp.4,v 1.16 2004/03/21 19:50:44 miod Exp $
.\"
.\" Copyright (c) 1998, 1999
.\" 	Matthew Jacob, for NASA/Ames Research Center
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd May 16, 2002
.Dt ISP 4
.Os
.Sh NAME
.Nm isp
.Nd Qlogic based SCSI or FibreChannel SCSI Host Adapters
.Sh SYNOPSIS
.Cd "isp* at pci? dev ? function ?" Pq PCI
.Cd "isp* at sbus? slot ? offset ?" Pq SBus
.Cd "scsibus* at isp?"
.Cd "option ISP_COMPILE_FW"
.Sh DESCRIPTION
This driver provides access to a
.Tn SCSI
bus or a
.Tn FibreChannel
connected to
.Tn Qlogic
ISP1000 (SBus), ISP1020 (PCI), ISP1040(PCI), ISP1080(PCI), ISP12160(PCI)
.Tn SCSI
host adapters or ISP2100(PCI), ISP2200(PCI)
.Tn FibreChannel
or ISP2300(PCI) 2-Gigabit
.Tn FibreChannel
host adapters.
.Pp
Features include support for UltraSCSI and wide mode transactions for
.Tn SCSI ,
and Ultra2 LVD (for the ISP1080) and Ultra3 LVD (for the ISP12160)
and the FCP SCSI (private loop, public loop or fabric) for
.Tn FibreChannel .
Command tagging is supported for all (in fact,
.Tn FibreChannel
requires tagging).
.Sh CONFIGURATION
Adding
.Tn option ISP_COMPILE_FW=1
to the kernel configuration file ensures that known good firmware
will be downloaded to the driver at attach time.
This is the default setting on sparc and sparc64 platforms,
and is also recommended on platforms where the card's bios may not be
initialized upon power-up.
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr pci 4 ,
.Xr sbus 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr ses 4 ,
.Xr ss 4 ,
.Xr st 4 ,
.Xr uk 4
.Sh AUTHORS
The
.Nm
driver was written by Matthew Jacob for NASA/Ames Research Center.
