openbsd/src/share/man/man4/jmb.4
.\"	$OpenBSD: jmb.4,v 1.3 2007/07/02 14:17:43 dlg Exp $
.\"
.\" Copyright (c) 2007 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" TORTIOUS ACTION, ARISING OUT OF
.\" PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 2 2007 $
.Dt JMB 4
.Os
.Sh NAME
.Nm jmb
.Nd JMicron JMB36x SATA II and PATA Host Controller
.Sh SYNOPSIS
.Cd "jmb* at pci?"
.Cd "ahci* at jmb?"
.Cd "pciide* at jmb?"
.Sh DESCRIPTION
JMicron JMB36x hardware can provide support for SATA devices using the Advanced
Host Controller Interface for Serial ATA, and for PATA devices using PCI IDE
controller specification.
Since support for both SATA and PATA devices can be enabled on the same PCI
device but only one driver per PCI device can be attached, the
.Nm
driver acts as a nexus to other drivers that support the SATA and PATA
functionality.
.Xr ahci 4
supports the SATA functionality, and
.Xr pciide 4
support the PATA functionality on these controllers.
.Sh SEE ALSO
.Xr ahci 4 ,
.Xr intro 4 ,
.Xr pci 4 ,
.Xr pciide 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.2 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An David Gwynne Aq dlg@openbsd.org .
