openbsd/src/share/man/man4/jme.4
.\"	$OpenBSD: jme.4,v 1.6 2013/11/05 03:51:43 brad Exp $
.\"
.\" Copyright (c) 2008 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 5 2013 $
.Dt JME 4
.Os
.Sh NAME
.Nm jme
.Nd JMicron JMC25x/JMC26x 10/100/Gigabit Ethernet device
.Sh SYNOPSIS
.Cd "jme* at pci?"
.Cd "jmphy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver supports PCI Express Ethernet adapters based on the JMicron
JMC260 10/100 and JMC250 10/100/Gigabit Ethernet chips.
The Ethernet portion of the JMC261 10/100 and
JMC251 10/100/Gigabit chips,
which incorporate a card reader,
is also supported.
.Pp
The
.Nm
driver supports IPv4 receive/transmit IP/TCP/UDP checksum offload, IPv6
receive TCP/UDP checksum offload and VLAN tag insertion and
stripping.
.Pp
The following
.Ar media
types are supported:
.Pp
.Bl -tag -width autoselect -compact
.It Cm autoselect
Enable autoselection of the media type and options.
.It Cm 10baseT
Set 10Mbps operation.
.It Cm 100baseTX
Set 100Mbps (Fast Ethernet) operation.
.It Cm 1000baseT
Set 1000Mbps (Gigabit Ethernet) operation (some models only).
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr jmphy 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 4.5 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Pyun YongHyeon
for
.Fx
and ported to
.Ox
by
.An Jonathan Gray Aq Mt jsg@openbsd.org .
