openbsd/src/share/man/man4/km.4
.\"	$OpenBSD: km.4,v 1.1 2008/04/29 05:33:24 cnst Exp $
.\"
.\" Copyright (c) 2008 Constantine A. Murenin <cnst+openbsd@bugmail.mojo.ru>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 29 2008 $
.Dt KM 4
.Os
.Sh NAME
.Nm km
.Nd AMD K10 temperature sensor
.Sh SYNOPSIS
.Cd "km* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the temperature sensors available in the
AMD Family 10h processors.
.Pp
Each chip reports one temperature sensor.
Multiprocessor systems would have one instance of
.Nm
per each chip.
.Pp
Sensor values are made available through the
.Xr sysctl 8
interface.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Rs
.%T "BIOS and Kernel Developer's Guide for AMD Family 10h Processors"
.%D March 26, 2008
.%R Publication # 31116
.%P pp. 236--237 and pp. 243--244
.\" .%O http://www.amd.com/us-en/assets/content_type/white_papers_and_tech_docs/31116.PDF
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Constantine A. Murenin Aq cnst@openbsd.org ,
University of Waterloo.
