openbsd/src/share/man/man4/kstat.4
.\"	$OpenBSD: kstat.4,v 1.2 2022/01/10 07:01:50 dlg Exp $
.\"
.\" Copyright (c) 2022 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 10 2022 $
.Dt KSTAT 4
.Os
.Sh NAME
.Nm kstat
.Nd kernel statistics
.Sh SYNOPSIS
.Cd "pseudo-device kstat"
.Sh DESCRIPTION
The
.Pa /dev/kstat
device exposes kernel statistics to userland.
.Sh IOCTLS
See
.In sys/kstat.h .
.Bl -tag -width Ds
.It Dv KSTATIOC_VERSION Fa "unsigned int"
.It Dv KSTATIOC_FIND_ID Fa "struct kstat_req"
.It Dv KSTATIOC_NFIND_ID Fa "struct kstat_req"
.It Dv KSTATIOC_FIND_PROVIDER Fa "struct kstat_req"
.It Dv KSTATIOC_NFIND_PROVIDER Fa "struct kstat_req"
.It Dv KSTATIOC_FIND_NAME Fa "struct kstat_req"
.It Dv KSTATIOC_NFIND_NAME Fa "struct kstat_req"
.El
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/kstat
.El
.Sh SEE ALSO
.\".Xr kstat 1 ,
.Xr kstat_create 9 ,
.Xr kstat_kv_init 9
.Sh HISTORY
The
.Nm
device appeared in
.Ox 6.8 .
