openbsd/src/share/man/man4/lmc.4
.\"
.\" Copyright (c) 1999 Chris Cappuccio
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 1, 1999
.Dt LMC 4
.Os
.Sh NAME
.Nm lmc
.Nd
Lan Media Corporation SSI/HSSI/DS3 card device driver
.Sh SYNOPSIS
.Cd "lmc* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Lan Media Corporation SSI, HSSI, and DS3 PCI
WAN adapters based on the DEC 21140 ethernet chip (with supporting
chips to handle the HDLC framing, and synchronous serial interface.)  The intent
is to provide a synchronous serial link with HDLC framing at speeds
of up to 10Mbps (for the SSI card), 52Mbps (for the HSSI card) and DSX jacks
for 45Mbps operation without a CSU/DSU (DS3 card).
.Pp
The card will automatically use HDLC framing and defaults to external clock source.  It should be configured as any point-to-point link.
.Pp
.Sh DIAGNOSTICS
.Bl -diag
.It "lmc%d: couldn't map interrupt"
A fatal initialization error has occurred.
.It "lmc%d: couldn't establish interrupt"
A fatal initialization error has occurred.
.It "lmc%d: enabling keepalive"
Cisco HDLC keepalive packets will be transmitted
.It "lmc%d: disabling keepalive"
Cisco HDLC keepalive packets will not be transmitted
.It "lmc%d: clock internal"
The card is using internal clocking for the line
.It "lmc%d: clock external"
The card is using external clocking for the line
.It "lmc%d: asserting DTR and RTS"
The card is sending DTR and RTS signals on the line
.It "lmc%d: deasserting DTR and RTS"
The card is not sending DTR and RTS signals on the line
.It "lmc%d: Abormal interrupt"
The card received an incomplete request
.It "lmc%d: tx_intr: failed to dequeue mbuf?!?"
Only available if compiled with LMC_DEBUG
.It "lmc%d: txput: tx not running"
Problem from tulip
Only available if compiled with LMC_DEBUG
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr netintro 4 , 
.Xr sppp 4 ,
.Xr ifconfig 8
Lan Media Corporation has a web site with data, descriptions, and pictures
of their cards at www.lanmedia.com.
.Sh HISTORY
The
.Nm
device driver was first released from LMC to support their cards,
and was later included in NetBSD 1.4. 
.Sh AUTHORS
The
.Nm
device driver was written by Michael Graff.  It was initially
derived from Matt Thomas'
.Xr de 4
driver.
The OpenBSD port and manual page are from Chris Cappuccio.
