openbsd/src/share/man/man4/lmc.4
.\" $OpenBSD: lmc.4,v 1.27 2015/01/15 20:37:36 schwarze Exp $
.\"
.\" Copyright (c) 1999 Chris Cappuccio
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: January 15 2015 $
.Dt LMC 4
.Os
.Sh NAME
.Nm lmc
.Nd Lan Media Corporation SSI/T1/DS1/HSSI/DS3 card device
.Sh SYNOPSIS
.Cd "lmc* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Lan Media Corporation SSI, T1/DS1, HSSI, and DS3
PCI WAN adapters based on the DEC 21140 Ethernet chip.
The adapters use a DEC 21140 Ethernet chip for the PCI bus interface.
Leaving the bus interface chip, the data path goes through a field programmable
gate array, where HDLC processing is accomplished.
Leaving the FPGA, there are FIFO buffers and the DS1, DS3, and V.35 drive
circuitry.
.Pp
The intent is to provide a synchronous serial link with HDLC framing at speeds
of up to 10Mbps (for the SSI card), 52Mbps (for the HSSI card), BNC connectors
for 45Mbps operation without a CSU/DSU (DS3 card), and an RJ45 jack for
T1/E1 operation without a CSU/DSU (T1/DS1 card).
.Pp
The card will automatically use HDLC framing and defaults to external clock
source.
For the DS1 and DS3 cards with built-in CSU/DSU functionality,
the clock source is always external (from CSU/DSU).
The ability to set cable length is not currently implemented.
.Pp
Using the
.Xr sppp 4
driver, you can also use the ppp protocol.
In either case, the
.Nm
interface should be configured as a point-to-point
link.
.Sh DIAGNOSTICS
.Bl -diag
.It "lmc0: couldn't map interrupt"
A fatal initialization error has occurred.
.It "lmc0: couldn't establish interrupt"
A fatal initialization error has occurred.
.It "lmc0: enabling keepalive"
Cisco HDLC keepalive packets will be transmitted.
.It "lmc0: disabling keepalive"
Cisco HDLC keepalive packets will not be transmitted.
.It "lmc0: clock internal"
The card is using internal clocking for the line.
.It "lmc0: clock external"
The card is using external clocking for the line.
.It "lmc0: asserting DTR and RTS"
The card is sending DTR and RTS signals on the line.
.It "lmc0: deasserting DTR and RTS"
The card is not sending DTR and RTS signals on the line.
.It "lmc0: Abnormal interrupt"
The card received an incomplete request.
This may be a sign of a hardware fault.
.It "lmc0: tx_intr: failed to dequeue mbuf?!?"
Only available if compiled with LMC_DEBUG.
.It "lmc0: txput: tx not running"
Problem from tulip.
Only available if compiled with LMC_DEBUG.
.El
.Sh SEE ALSO
.Xr netintro 4 ,
.Xr sppp 4 ,
.Xr ifconfig 8 ,
.Xr lmccontrol 8
.Sh AUTHORS
.An -nosplit
The
.Nm
device driver was written by
.An Michael Graff ,
and was derived in part from
.An Matt Thomas Ns '
.Xr de 4
driver.
The
.Ox
port and manual page are from
.An Chris Cappuccio .
Later enhancements to support the LMC1200 card are based on LMC's
Linux driver.
