openbsd/src/share/man/man4/lmenv.4
.\"	$OpenBSD: lmenv.4,v 1.6 2006/01/06 03:42:38 deraadt Exp $
.\"
.\" Copyright (c) 2005 Theo de Raadt <deraadt@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd May 16, 2004
.Dt LMENV 4
.Os
.Sh NAME
.Nm lmenv
.Nd National Semiconductor LM87 temperature sensor
.Sh SYNOPSIS
.Cd "lmenv* at iic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the National Semiconductor LM87,
National Semiconductor LM81, Analog Devices ADM2940, and
Dallas Semiconductor 1780 temperature sensors.
The sensor possesses a collection of sensor values which are
made available through the
.Xr sysctl 8
interface:
.Bd -literal -offset indent
hw.sensors.0=lmenv0, +2.5Vin, volts_dc, 2.62 V
hw.sensors.1=lmenv0, Vccp1, volts_dc, 1.49 V
hw.sensors.2=lmenv0, +Vcc, volts_dc, 3.28 V
hw.sensors.3=lmenv0, +5Vin/Vcc, volts_dc, 5.03 V
hw.sensors.4=lmenv0, +12Vin, volts_dc, 12.00 V
hw.sensors.5=lmenv0, Vccp2, volts_dc, 1.20 V
hw.sensors.6=lmenv0, Ext. Temp., temp, -128.00 degC / -198.40 degF
hw.sensors.7=lmenv0, Int. Temp., temp, 29.00 degC / 84.20 degF
hw.sensors.8=lmenv0, FAN1, fanrpm, 3220 RPM
.Ed
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
