openbsd/src/share/man/man4/lmtemp.4
.\"	$OpenBSD: lmtemp.4,v 1.5 2005/12/29 10:05:52 jmc Exp $
.\"
.\" Copyright (c) 2004 Alexander Yurchenko <grange@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd May 16, 2004
.Dt LMTEMP 4
.Os
.Sh NAME
.Nm lmtemp
.Nd National Semiconductor LM75/LM77 temperature sensor
.Sh SYNOPSIS
.Cd "# i386"
.Cd "lmtemp0 at iic? addr 0x48"
.Pp
.Cd "# macppc"
.Cd "lmtemp* at maciic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the National Semiconductor LM75 and LM77
temperature sensors.
The sensor possesses single temperature value that can be accessed
through the
.Xr sysctl 8
interface.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 2.0 .
.Ox
support was added in
.Ox 3.6 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jason R. Thorpe Aq thorpej@netbsd.org
for
.Nx .
.An Alexander Yurchenko Aq grange@openbsd.org
ported it to
.Ox
and added support for the LM77 chip.
