openbsd/src/share/man/man4/lmtemp.4
.\"	$OpenBSD: lmtemp.4,v 1.10 2006/08/19 15:56:25 deraadt Exp $
.\"
.\" Copyright (c) 2004 Alexander Yurchenko <grange@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd August 19, 2006
.Dt LMTEMP 4
.Os
.Sh NAME
.Nm lmtemp
.Nd National Semiconductor LM75/LM77 temperature sensor
.Sh SYNOPSIS
.Cd "lmtemp* at iic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the National Semiconductor LM75,
National Semiconductor LM77, Dallas Semiconductor 1775, and
Philips Semiconductor LM75A temperature sensors.
The sensor possesses a single temperature value that can be accessed
through the
.Xr sysctl 8
interface.
.Pp
The sensors can report temperatures between -55C and +125C in
increments of 0.5C.
.Sh NOTES
The extra 0.25C and 0.125C precision of the LM75A is ignored.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.6 .
