openbsd/src/share/man/man4/mii.4
.\"	$OpenBSD: mii.4,v 1.17 2004/09/30 19:59:25 mickey Exp $
.\"	$NetBSD: mii.4,v 1.1 1998/11/04 05:21:50 thorpej Exp $
.\"
.\" Copyright (c) 1998 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe of the Numerical Aerospace Simulation Facility,
.\" NASA Ames Research Center.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 3, 1998
.Dt MII 4
.Os
.Sh NAME
.Nm mii
.Nd IEEE 802.3 Media Independent Interface
.Sh SYNOPSIS
.Cd "acphy* at mii?"
.Cd "amphy* at mii? phy ?"
.Cd "bmtphy* at mii? phy ?"
.Cd "brgphy* at mii? phy ?"
.Cd "dcphy* at mii? phy ?"
.Cd "eephy* at mii? phy ?"
.Cd "exphy* at mii? phy ?"
.Cd "icsphy* at mii? phy ?"
.Cd "inphy* at mii? phy ?"
.Cd "iophy* at mii? phy ?"
.Cd "lxtphy* at mii? phy ?"
.Cd "mtdphy* at mii? phy ?"
.Cd "nsgphy* at mii? phy ?"
.Cd "nsphy* at mii? phy ?"
.Cd "nsphyter* at mii? phy ?"
.Cd "qsphy* at mii? phy ?"
.Cd "rgephy* at mii? phy ?"
.Cd "rlphy* at mii? phy ?"
.Cd "sqphy* at mii? phy ?"
.Cd "tlphy* at mii? phy ?"
.Cd "tqphy* at mii? phy ?"
.Cd "txphy* at mii? phy ?"
.Cd "ukphy* at mii? phy ?"
.Cd "urlphy* at mii? phy ?"
.Cd "xmphy* at mii? phy ?"
.Sh DESCRIPTION
Media Independent Interface is an IEEE standard serial bus for
connecting MACs (network controllers) to PHYs (physical media
interfaces).
The
.Nm
layer allows network device drivers to share support code for
various PHY models, and allows unused support for PHYs which
are not present in a system to be removed from the kernel.
.Pp
Network device drivers which use the
.Nm
layer carry the
.Dq mii
autoconfiguration attribute.
This allows kernel configuration files to simply specify PHYs as
described above in
.Sx SYNOPSIS .
.Pp
The following is an example of the messages displayed when a network
interface with an attached PHY is detected by the kernel:
.Bd -literal -offset indent
hme0 at sbus0 slot 1 offset 0x8c00000 pri 7: address 08:00:20:22:86:b8 rev 34
nsphy0 at hme0 phy 1: DP83840 10/100 media interface, rev. 1
.Ed
.Pp
.Xr ifconfig 8
can be used to display the media types supported by the PHY.
These media types are valid media keywords for use with the
.Xr ifconfig 8
program.
.Sh SEE ALSO
.Xr acphy 4 ,
.Xr amphy 4 ,
.Xr bmtphy 4 ,
.Xr brgphy 4 ,
.Xr dcphy 4 ,
.Xr eephy 4 ,
.Xr exphy 4 ,
.Xr icsphy 4 ,
.Xr ifmedia 4 ,
.Xr inphy 4 ,
.Xr intro 4 ,
.Xr iophy 4 ,
.Xr lxtphy 4 ,
.Xr mtdphy 4 ,
.Xr netintro 4 ,
.Xr nsgphy 4 ,
.Xr nsphy 4 ,
.Xr nsphyter 4 ,
.Xr qsphy 4 ,
.Xr rgephy 4 ,
.Xr rlphy 4 ,
.Xr sqphy 4 ,
.Xr tlphy 4 ,
.Xr tqphy 4 ,
.Xr txphy 4 ,
.Xr ukphy 4 ,
.Xr urlphy 4 ,
.Xr xmphy 4 ,
.Xr ifconfig 8
