openbsd/src/share/man/man4/mpath.4
.\"	$OpenBSD: mpath.4,v 1.1 2009/08/09 12:52:51 dlg Exp $
.\"
.\" Copyright (c) 2009 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 9 2009 $
.Dt MPATH 4
.Os
.Sh NAME
.Nm mpath
.Nd SCSI Multipathing
.Sh SYNOPSIS
.Cd "mpath0 at root"
.Cd "scsibus* at mpath?"
.Sh DESCRIPTION
The
.Nm
intercepts the attachement of devices on physical SCSI buses that could be available via several paths.
These devices are then presented via the
.Xr scsibus 4
attached to
.Nm .
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr intro 4 ,
.Xr scsi 4 ,
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.7 .
.Sh AUTHORS
.An David Gwynne Aq dlg@openbsd.org .
