openbsd/src/share/man/man4/mpi.4
.\"	$OpenBSD: mpi.4,v 1.4 2006/06/12 15:19:12 dlg Exp $
.\"
.\" Copyright (c) 2006 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" TORTIOUS ACTION, ARISING OUT OF
.\" PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd May 28, 2006
.Dt MPI 4
.Os
.Sh NAME
.Nm mpi
.Nd LSI Logic Fusion-MPT Message Passing Interface
.Sh SYNOPSIS
.Cd "mpi* at pci?"
.Cd "scsibus* at mpi?"
.Sh DESCRIPTION
The
.Nm
driver provides support
for the LSI Logic Fusion-MPT family of storage controllers:
.Pp
.Bl -dash -offset indent -compact
.It
Hewlett-Packard 8 Internal Port SAS Host Bus Adapter with RAID
.It
LSI Logic 53c1020,
53c1030,
FC909,
FC909A,
FC919,
FC929,
SAS3041X-R,
SAS3442X,
SAS3442X-R,
SAS3800X
.El
.Pp
Some models of these controllers have varying degrees of support for RAID 0,
RAID 1, and RAID 10.
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr pci 4 ,
.Xr safte 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr ses 4 ,
.Xr ss 4 ,
.Xr st 4 ,
.Xr uk 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An David Gwynne Aq dlg@openbsd.org
and
.An Marco Peereboom Aq marco@openbsd.org .
