openbsd/src/share/man/man4/mpt.4
.\"	$OpenBSD: mpt.4,v 1.5 2004/08/24 05:37:26 david Exp $
.\"
.\" Copyright (c) 2003 Wasabi Systems, Inc.
.\" All rights reserved.
.\"
.\" Written by Jason R. Thorpe for Wasabi Systems, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project by
.\"	Wasabi Systems, Inc.
.\" 4. The name of Wasabi Systems, Inc. may not be used to endorse
.\"    or promote products derived from this software without specific prior
.\"    written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY WASABI SYSTEMS, INC. ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL WASABI SYSTEMS, INC
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 25, 2004
.Dt MPT 4
.Os
.Sh NAME
.Nm mpt
.Nd LSI Fusion-MPT SCSI and FibreChannel host adapter driver
.Sh SYNOPSIS
.Cd "mpt* at pci? dev ? function ?"
.Cd "scsibus* at mpt?"
.Sh DESCRIPTION
The
.Nm
driver provides support
for the LSI Logic Fusion-MPT family of
.Tn SCSI
and
.Tn Fibre Channel
controllers:
.Pp
.Bl -bullet -compact -offset indent
.It
53c1020
.Pq Single Ultra320 Tn SCSI
.It
53c1030
.Pq Dual Ultra320 Tn SCSI
.It
FC909
.Pq 1Gb/s Tn Fibre Channel
.It
FC909A
.Pq Dual 1Gb/s Tn Fibre Channel
.It
FC919
.Pq 2Gb/s Tn Fibre Channel
.It
FC929
.Pq Dual 2Gb/s Tn Fibre Channel
.It
Emulated in VMWare ESX Server 2
.El
.Pp
The LSI Logic SCSI and Fibre Channel controllers contain firmware that presents
a multiprotocol service layer based on the LSI Logic Fusion-MPT architecture.
The firmware isolates the host drivers from the hardware and controls the
device side of the message passing interface to the host device drivers.
The firmware manages all phases of an I/O request and optimizes the interrupt
management for the system.
For Fibre Channel, the firmware also manages all FC-2 through FC-4 services,
which minimizes the amount of Fibre Channel unique services required with the
host driver.
.Pp
The MPI (Message Passing Interface) defintion includes a register-level
transport mechanism and a messaging protocol.
A system doorbell and message queues define the MPI transport interface.
Inbound Message Frames (MF), allocated in host memory, identify I/O operations
to be performed by the IO Controller (IOC).
These operations are queued on the Request Queue by the host driver.
Outbound Message Frames, also in host memory, track I/O operations as they
complete.
These frames are queued on the Reply Queue by the IOC.
A doorbell mechanism is provided for IOC configuration, reset management,
and IOC status.
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr pci 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr siop 4 ,
.Xr st 4 ,
.Xr uk 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.5 .
.Sh AUTHORS
The
.Om
driver was ported from
.Nx
by Milos Urbanek, Kenneth R. Westerback and Marco Peereboom.
