openbsd/src/share/man/man4/msk.4
.\"	$OpenBSD: msk.4,v 1.1 2006/12/12 23:54:44 pedro Exp $
.\"
.\" Copyright (c) 1997, 1998, 1999
.\"	Bill Paul <wpaul@ctr.columbia.edu>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/man4.i386/sk.4,v 1.3 1999/08/28 00:20:29 peter Exp $
.\"
.Dd July 3, 1999
.Dt MSK 4
.Os
.Sh NAME
.Nm msk ,
.Nm mskc
.Nd "Marvell Yukon-2 based Fast Ethernet and Gigabit Ethernet device"
.Sh SYNOPSIS
.Cd "mskc* at pci?"
.Cd "msk* at mskc?"
.Cd "eephy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Marvell Yukon-2 based Fast Ethernet and Gigabit Ethernet
adapters, including the following:
.Pp
.Bl -bullet -offset indent -compact
.It
D-Link DGE-550SX, multimode fiber adapter
.It
D-Link DGE-560SX, multimode fiber adapter
.It
D-Link DGE-560T, copper adapter
.It
SysKonnect SK-9E21 single port, copper adapter
.It
SysKonnect SK-9E22 dual port, copper adapter
.It
SysKonnect SK-9E81 single port, multimode fiber adapter
.It
SysKonnect SK-9E82 dual port, multimode fiber adapter
.It
SysKonnect SK-9E91 single port, single mode fiber adapter
.It
SysKonnect SK-9E92 dual port, single mode fiber adapter
.It
SysKonnect SK-9S21 single port, copper adapter
.It
SysKonnect SK-9S22 dual port, copper adapter
.It
SysKonnect SK-9S81 single port, multimode fiber adapter
.It
SysKonnect SK-9S82 dual port, multimode fiber adapter
.It
SysKonnect SK-9S91 single port, single mode fiber adapter
.It
SysKonnect SK-9S92 dual port, single mode fiber adapter
.It
SysKonnect SK-9E21D single port, copper adapter
.El
.Pp
The
.Nm
driver supports the following media types:
.Bl -tag -width 1000baseSX
.It Cm autoselect
Enable autoselection of the media type and options.
The user can manually override
the autoselected mode by adding media options to the appropriate
.Xr hostname.if 5
file.
.It Cm 10baseT
Set 10Mbps operation.
The
.Xr ifconfig 8
.Ic mediaopt
option can also be used to select either
.Cm full-duplex
or
.Cm half-duplex
modes.
.It Cm 100baseTX
Set 100Mbps (Fast Ethernet) operation.
The
.Xr ifconfig 8
.Ic mediaopt
option can also be used to select either
.Cm full-duplex
or
.Cm half-duplex
modes.
.It Cm 1000baseT
Set 1000baseT (Gigabit Ethernet) operation over twisted pair.
Both
.Cm full-duplex
and
.Cm half-duplex
modes are supported.
.It Cm 1000baseSX
Set 1000Mbps (Gigabit Ethernet) operation.
Both
.Cm full-duplex
and
.Cm half-duplex
modes are supported.
.El
.Pp
The
.Nm
driver supports the following media options:
.Bl -tag -width full-duplex
.It Cm full-duplex
Force full duplex operation.
.It Cm half-duplex
Force half duplex operation.
.El
.Pp
The
.Nm
driver also supports one special link option for 1000baseT cards:
.Bl -tag -width link0
.It Cm link0
With 1000baseT cards, establishing a link between two ports requires
that one port be configured as a master and the other a slave.
With autonegotiation,
the master/slave settings will be chosen automatically.
However when manually selecting the link state, it is necessary to
force one side of the link to be a master and the other a slave.
The
.Nm
driver configures the ports as slaves by default.
Setting the
.Cm link0
flag with
.Xr ifconfig 8
will set a port as a master instead.
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
To view a list of media types and options supported by the card, try
.Ic ifconfig -m <device> .
For example,
.Ic ifconfig -m sk0 .
.Sh SEE ALSO
.Xr arp 4 ,
.Xr eephy 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
.Sh BUGS
The
.Nm
driver does not support hardware receive IP checksum offload yet.
