openbsd/src/share/man/man4/mvneta.4
.\"	$OpenBSD: mvneta.4,v 1.1 2018/04/01 09:03:25 jsg Exp $
.\"
.\" Copyright (c) 2018 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 1 2018 $
.Dt MVNETA 4
.Os
.Sh NAME
.Nm mvneta ,
.Nm mvmdio
.Nd Marvell ARMADA Ethernet device
.Sh SYNOPSIS
.Cd "mvmdio* at fdt?"
.Cd "mvneta* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Ethernet controller on the Marvell ARMADA
37x, 38x and 37xx series SoCs.
Access to the MDIO bus is provided by the
.Nm mvmdio
driver.
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr mii 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.2 .
