openbsd/src/share/man/man4/ne.4
.\"	$OpenBSD: ne.4,v 1.7 2001/05/21 19:47:02 aaron Exp $
.\"	$NetBSD: ne.4,v 1.4 1998/02/22 05:21:20 enami Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe of the Numerical Aerospace Simulation Facility,
.\" NASA Ames Research Center.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 22, 1998
.Dt NE 4
.Os
.Sh NAME
.Nm ne
.Nd NE2000 and compatible Ethernet driver
.Sh SYNOPSIS
.Cd "ne0 at isa? port 0x300 irq 9"
.Cd "ne* at isapnp?"
.Cd "ne* at pci? dev ? function ?"
.Cd "ne* at pcmcia? function ?"
.Cd "ne* at zbus0"
.Sh DESCRIPTION
The
.Nm
device driver supports NE2000 and compatible (including NE1000) Ethernet
cards.
.Sh MEDIA SELECTION
The RealTek 8019 (ISA, ISAPnP, some PCMCIA) and RealTek 8029 (PCI)
NE2000-compatible Ethernet chips include support for software media
selection.  If one of these chips is detected by the driver, the list
of supported media will be displayed.
.Pp
For all other chips supported by the
.Nm
driver, media selection must be performed either via card jumper settings or
by vendor-supplied configuration programs.
.Sh DIAGNOSTICS
.Bl -diag
.It "ne0: where did the card go?"
The driver found the card, but was unable to make the card respond
to complete the configuration sequence.
.El
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr isa 4 ,
.Xr isapnp 4 ,
.Xr pci 4 ,
.Xr pcmcia 4 ,
.Xr ifconfig 8
