openbsd/src/share/man/man4/nhi.4
.\"	$OpenBSD: nhi.4,v 1.2 2025/11/03 20:56:08 jsg Exp $
.\"
.\" Copyright (c) 2025 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 3 2025 $
.Dt NHI 4
.Os
.Sh NAME
.Nm nhi
.Nd USB4 host interface
.Sh SYNOPSIS
.Cd "nhi* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the USB4 host interface.
.Pp
The driver does not implement any meaningful USB4 connection manager
functionality.
It only puts the router that is part of the host interface into a sleep state
during suspend.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr xhci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.9 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
