openbsd/src/share/man/man4/nsgphy.4
.\"	$OpenBSD: nsgphy.4,v 1.2 2003/03/22 08:07:12 david Exp $
.\"
.\" Copyright (c) 2001 Nathan L. Binkert
.\" All rights reserved.
.\"
.\" Permission to redistribute, use, copy, and modify this software
.\" without fee is hereby granted, provided that the following
.\" conditions are met:
.\"
.\" 1. This entire notice is included in all source code copies of any
.\"    software which is or includes a copy or modification of this
.\"    software.
.\" 2. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior
.\"    written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
.\" NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
.\" SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.Dd April 2, 2002
.Dt NSGPHY 4
.Os
.Sh NAME
.Nm nsgphy
.Nd Driver for National Semiconductor DP83891 and DP83861 10/100/1000 PHYs
.Sh SYNOPSIS
.Cd "nsgphy* at mii? phy ?"
.Sh DESCRIPTION
The
.Nm
driver supports the National Semiconductor DP83891 and DP83861 10/100/1000
Ethernet PHYs.
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr mii 4 ,
.Xr nge 4 ,
.Xr ifconfig 8
