openbsd/src/share/man/man4/nsgphy.4
.\"	$OpenBSD: nsgphy.4,v 1.3 2003/06/04 18:31:13 nate Exp $
.\"
.\" Copyright (c) 2001 Nathan L. Binkert <binkertn@umich.edu>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.Dd April 2, 2002
.Dt NSGPHY 4
.Os
.Sh NAME
.Nm nsgphy
.Nd Driver for National Semiconductor DP83891 and DP83861 10/100/1000 PHYs
.Sh SYNOPSIS
.Cd "nsgphy* at mii? phy ?"
.Sh DESCRIPTION
The
.Nm
driver supports the National Semiconductor DP83891 and DP83861 10/100/1000
Ethernet PHYs.
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr mii 4 ,
.Xr nge 4 ,
.Xr ifconfig 8
