openbsd/src/share/man/man4/nx.4
.\" $OpenBSD: nx.4,v 1.3 2007/05/31 19:19:51 jmc Exp $
.\"
.\" Copyright (c) 2007 Reyk Floeter <reyk@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt NX 4
.Os
.Sh NAME
.Nm nx ,
.Nm nxb
.Nd NetXen NX2031/NX2035 10Gb and 10/100/Gigabit Ethernet device
.Sh SYNOPSIS
.Cd "nxb* at pci?"
.Cd "nx* at nxb?"
.Sh DESCRIPTION
The
.Nm
driver supports multi port Gigabit and 10Gb Ethernet adapters based on
the NetXen NX2031 and NX2035 chipsets, including the following:
.Pp
.Bl -bullet -offset indent -compact
.It
HP NC510C PCIe 10Gb Ethernet server adapter (10GbaseCX4)
.It
HP NC510F PCIe 10Gb Ethernet server adapter (10GbaseSR)
.It
NetXen NXB-10GXxR PCIe 10Gb Ethernet adapter (10GbaseSR/LR XFP)
.It
NetXen NXB-10GCX4 PCIe 10Gb Ethernet adapter (10GbaseCX4)
.It
NetXen NXB-4GCU PCIe Quad Gigabit Ethernet adapter (1000baseT)
.It
NetXen BladeCenter-H Dual 10Gb Ethernet Expansion Card (CFFh)
.El
.Pp
.\" The
.\" .Nm
.\" driver supports the IPv4 receive/transmit IP/TCP/UDP checksum offload
.\" and hardware VLAN tagging functionality of the NX2031/NX2035 chipsets.
.\" The TSO (TCP Segmentation Offload), TOE (TCP Offload Engine), and
.\" IPsec SA insertion/removal hardware capabilities are not supported by
.\" the driver.
.\" .Pp
The NX2031/NX2035 supports a maximum hardware transmit/receive unit
with up to 8000 bytes.
These jumbo frames will be enabled when the MTU is set to a value
higher than 1500 bytes using the
.Xr ifconfig 8
.Ar mtu
command.
.Pp
Multiple
.Nm nx
ports can be attached to a
.Nm nxb
board, either operating in 10Gb or in 10/100/Gigabit Ethernet mode.
The
.Nm
driver supports the following media types depending on the type
of the port:
.Bl -tag -width 10GbaseCX4
.It Cm autoselect
Enable autoselection of the media type and options.
The user can manually override
the autoselected mode by adding media options to the appropriate
.Xr hostname.if 5
file.
.It Cm 10baseT
Set 10Mbps operation.
.It Cm 100baseTX
Set 100Mbps (Fast Ethernet) operation.
.It Cm 1000baseT
Set 1000Mbps (Gigabit Ethernet) operation over twisted pair.
.It Cm 10GbaseCX4
Set 10Gbps (10Gb Ethernet) operation over copper pairs.
.It Cm 10GbaseSR
Set 10Gbps (10Gb Ethernet) operation over short range fibre.
.It Cm 10GbaseLR
Set 10Gbps (10Gb Ethernet) operation over long range fibre.
.El
.Pp
The
.Nm
driver supports the following media options:
.Bl -tag -width full-duplex
.It Cm full-duplex
Force full duplex operation.
.It Cm half-duplex
Force half duplex operation.
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
To view a list of media types and options supported by the card, try
.Ic ifconfig -m <device> .
For example,
.Ic ifconfig -m nx0 .
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Pp
NetXen, Inc.:
.Pa http://www.netxen.com
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.2 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Reyk Floeter Aq reyk@openbsd.org .
