openbsd/src/share/man/man4/options.4
.\"	$OpenBSD: options.4,v 1.9 1998/03/16 23:28:09 gene Exp $
.\"	$NetBSD: options.4,v 1.21 1997/06/25 03:13:00 thorpej Exp $
.\"
.\" Copyright (c) 1998 Theo de Raadt 
.\" Copyright (c) 1998 Todd Miller
.\" Copyright (c) 1998 Gene Skonicki
.\" Copyright (c) 1996
.\" 	Perry E. Metzger.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"	This product includes software developed for the NetBSD Project
.\"	by Perry E. Metzger.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd August 17, 1997
.Os
.Dt OPTIONS 4
.Sh NAME
.Nm option
.Nd Miscellaneous kernel configuration options
.Sh SYNOPSIS
.Cd option ...
.Sh DESCRIPTION
This manual page describes a number of miscellaneous kernel
configuration options that may be specified in a kernel config
file. See
.Xr config 8
for information on how to configure and build kernels.
.Em Note:
Options are passed to the compile process as -D flags to the C
compiler.
.Ss Compatibility Options
.Bl -ohang
.It Cd option COMPAT_SVR4
On those architectures that support it, this enables binary
compatibility with
.At V.4
binaries built for the same architecture.  This currently includes
the sparc, and i386.  Possibly the most widely-known operating system
based on this binary architecture is Sun's Solaris 2.x.
See
.Xr compat_svr4 8 .
.It Cd option COMPAT_LINUX
On those architectures that support it, this enables binary
compatibility with
.Em Linux
ELF and a.out
applications built for the same architecture.  This option is
supported on the i386 architecture.
See
.Xr compat_linux 8 .
.It Cd option COMPAT_SUNOS
On those architectures that support it, this enables binary
compatibility with
.Em SunOS 4.x
applications built for the same architecture.  This option is
supported on the sparc and most m68k platforms.
See
.Xr compat_sunos 8 .
.It Cd option COMPAT_ULTRIX
On those architectures that support it, this enables binary
compatibility with
.Tn Ultrix
applications built for the same architecture.  This option is
available on the little-endian MIPS platforms like the pmax and arc.
See
.Xr compat_ultrix 8 .
.It Cd option COMPAT_FREEBSD
On those architectures that support it, this enables binary
compatibility with
.Em FreeBSD
applications built for the same architecture.  This option is
available on the i386 architecture.
See
.Xr compat_freebsd 8 .
.It Cd option COMPAT_HPUX
On those architectures that support it, this enables binary
compatibility with
.Em HP/UX
applications built for the same architecture.  This option is
available on some m68k architectures.
See
.Xr compat_hpux 8 .
.It Cd option COMPAT_IBCS2
On those architectures that support it, this enables binary
compatibility with
.Em iBCS2
applications built for the same architecture.  This option is
available on the i386 architecture.
See
.Xr compat_ibcs2 8 .
.It Cd option COMPAT_OSF1
On those architectures that support it, this enables binary
compatibility with
.Em Digital UNIX
(formerly
.Em OSF/1 )
applications built for the same architecture.  This option is
available on the alpha architecture.
See
.Xr compat_osf1 8 .
.It Cd option COMPAT_NOMID
Enable compatibility with a.out executables that lack a machine id.
On the i386, this includes NetBSD 0.8's ZMAGIC format, 386BSD and BSDI's
QMAGIC, NMAGIC, and OMAGIC a.out formats.  On the hp300 and other m68k
architectures this permits
certain old 4.3BSD binaries to work, though it's use is discouraged now.
.It Cd option COMPAT_43
Use of this option is discouraged. It enables compatibility with
.Bx 4.3 .
It adds an old syscall for lseek as well as ioctls for TIOCGETP and
TIOCSETP.  The return values for getpid, getgid, and getuid syscalls
are modified as well, to return the parent's pid and uid as well as
the current process's.  It also enables the deprecated NTTYDISC terminal
line discipline. It also provides backwards compatibility with the
.Dq old
SIOC[GS]IF{ADDR,DSTADDR,BRDADDR,NETMASK} interface ioctls, including
binary compatibility for code written before the introduction of the
sa_len field in sockaddrs.
It also enables support for some older pre BSD 4.4 socket calls.
.El
.Ss Debugging Options
.Bl -ohang
.It Cd option DDB
Compiles in a kernel debugger for diagnosing kernel problems. See
.Xr ddb 4
for details. 
.Em NOTE:
not available on all architectures.
.It Cd option KGDB
Compiles in a remote kernel debugger stub for diagnosing kernel problems
using the
.Dq remote target
feature of gdb. See
.Xr gdb 1
for details. 
.Em NOTE:
not available on all architectures.
.It Cd makeoptions DEBUG="-g"
The -g flag causes
.Pa bsd.gdb
to be built in addition to
.Pa bsd .
.Pa bsd.gdb
is useful for debugging kernel crash dumps with gdb.
The command
.Dl gdb -k
invokes gdb in kernel debugger mode.
See
.Xr gdb 1
for details. This also turns on
.Em option DEBUG .
.It Cd option DEBUG
Turns on miscellaneous kernel debugging. Since options are turned into
preprocessor defines (see above),
.Em option DEBUG
is equivalent to doing a 
.Em #define DEBUG
throughout the kernel. Much of the kernel has
.Em #ifdef DEBUG
conditional debugging code. Note that many parts of the kernel
(typically device drivers) include their own
.Em #ifdef XXX_DEBUG
conditionals instead.
This option also turns on certain other options, notably the
.Em KMEMSTATS
option, which may decrease system performance.
.It Cd option DIAGNOSTIC
Adds code to the kernel that does internal consistency checks.  This
code will cause the kernel to panic if corruption of internal data
structures is detected.
.It Cd option KTRACE
Add hooks for the system call tracing facility, which allows users to
watch the system call invocation behavior of processes. See
.Xr ktrace 1
for details.
.El
.Ss File Systems
.Bl -ohang
.It Cd option FFS
Includes code implementing the Berkeley Fast File System
.Em ( FFS ) .
Most machines need this if they are not running diskless.
.It Cd option EXT2FS
Includes code implementing the Second Extended File System
.Em ( EXT2FS ) .
This is the most commonly used file system on the Linux operating system,
and is provided here for compatibility. Some specific features
of
.Em EXT2FS 
like the "behavior on errors" are not implemented. This file system can't be
used with uid_t or gid_t values greater than 65535. Also, the filesystem will not
function correctly on architectures with differing byte-orders.  That is,
a big-endian machine will not be able to read an ext2fs filesystem created
on an i386 or other little-endian machine.  See
.Xr mount_ext2fs 8
for details.
.It Cd option MFS
Include the memory file system
.Em ( MFS ) .
This file system stores files in swappable memory, and produces
notable performance improvements when it is used as the file store
for
.Pa /tmp
or similar mount points. Unfortunately, it is known to contain some bugs
render it unstable, and it is not yet recommended for production.  See
.Xr mount_mfs 8
for details.
.It Cd option NFS
Include the client side of the
.Em NFS
(Network File System) remote file sharing protocol.
Although the bulk of the code implementing
.Em NFS
is kernel based, several user level daemons are needed for it to
work. See 
.Xr mount_nfs 8
and
.Xr nfsiod 8
for details on NFS.
.It Cd option CD9660
Includes code for the ISO 9660 + Rock Ridge file system, which is the
standard file system used on many CD-ROMs. It is useful mostly if you have a CD
drive. See
.Xr mount_cd9660 8
for details.
.It Cd option MSDOSFS
Includes support for the
.Tn MS-DOS
FAT file system.
The kernel also implements the 
.Tn Windows 95
extensions which permit the use of longer, mixed-case file names.
See
.Xr mount_msdos 8
and
.Xr fsck_msdos 8
for details.
.It Cd option FDESC
Includes code for a file system which can be mounted on
.Pa /dev/fd .
This filesystem permits access to the per-process file descriptor
space via special files in the file system.
See
.Xr mount_fdesc 8
for details.
Note that this facility is redundant, and thus unneeded on most
.Ox
systems, since the
.Xr fd 4
pseudodevice driver already provides identical functionality. On most
systems, instances of
.Xr fd 4
are mknoded under
.Pa /dev/fd/
and on
.Pa /dev/stdin ,
.Pa /dev/stdout ,
and
.Pa /dev/stderr .
.It Cd option KERNFS
Includes code which permits the mounting of a special file system
(normally mounted on
.Pa /kern )
in which files representing various kernel variables and parameters
may be found.
See
.Xr mount_kernfs 8
for details.
.It Cd option NULLFS
Includes code for a loopback file system. This permits portions of the file
hierarchy to be re-mounted in other places. The code really exists to
provide an example of a stackable file system layer. See
.Xr mount_null 8
for details.  Most 
.It Cd option PORTAL
Includes the (experimental) portal filesystem. This permits
interesting tricks like opening TCP sockets by opening files in the
file system. The portal file system is conventionally mounted on
.Pa /p
and is partially implemented by a special daemon. See
.Xr mount_portal 8
for details.
.It Cd option PROCFS
Includes code for a special file system (conventionally mounted on
.Pa /proc )
in which the process space becomes visible in the file system. Among
other things, the memory spaces of processes running on the system are
visible as files, and signals may be sent to processes by writing to
.Pa ctl
files in the procfs namespace. See
.Xr mount_procfs 8
for details.
.It Cd option UMAPFS
Includes a loopback file system in which user and group ids may be
remapped -- this can be useful when mounting alien file systems with
different uids and gids than the local system (eg, remote NFS).  See
See
.Xr mount_umap 8
for details.
.It Cd option UNION
Includes code for the union file system, which permits directories to
be mounted on top of each other in such a way that both file systems
remain visible -- this permits tricks like allowing writing (and the
deleting of files) on a read-only file system like a CD-ROM by
mounting a local writable file system on top of the read-only file
system. This filesystem is still experimental and is known to be somewhat
unstable. See
.Xr mount_union 8
for details.
.El
.Ss File System Options
.Bl -ohang
.It Cd option FFS_SOFTUPDATES
Enables a scheme that uses partial ordering of buffer cache operations
to allow metadata updates in FFS to happen asynchronously.  For more
details see
.Xr ffs_softupdates 4 .
.It Cd option NFSSERVER
Include the server side of the
.Em NFS
(Network File System) remote file sharing protocol.
Although the bulk of the code implementing
.Em NFS
is kernel based, several user level daemons are needed for it to
work. See 
.Xr mountd 8
and
.Xr nfsd 8 
for details.
.It Cd option QUOTA
Enables kernel support for file system quotas. See
.Xr quotaon 8 ,
.Xr edquota 8 ,
.Xr repquota 8 ,
and
.Xr quota 1
for details. Note that quotas only work on
.Dq ffs
file systems, although
.Xr rpc.rquotad 8
permits them to be accessed over 
.Em NFS .
.It Cd option FIFO
Adds support for
.At V
style FIFOs (i.e.
.Dq named pipes
). This option is recommended in almost all cases as many programs use these.
.It Cd option NVNODE=integer
This option sets the size of the cache used by the name-to-inode translation
routines, (a.k.a. the
.Fn namei
cache, though called by many other names in the kernel source).  By default,
this cache has NPROC (set as 20 + 16 * MAXUSERS) * (80 + NPROC / 8) entries.
A reasonable way to derive a value of NVNODE, should you notice a large
number of namei cache misses with a tool such as
.Xr systat 1 ,
is to examine your system's current computed value with
.Xr sysctl 1 ,
(which calls this parameter "kern.maxvnodes") and to increase this value
until either the namei cache hit rate improves or it is determined that
your system does not benefit substantially from an increase in the size of
the namei cache.
.It Cd option EXT2FS_SYSTEM_FLAGS
This option changes the behavior of the APPEND and IMMUTABLE flags
for a file on an
.Em EXT2FS 
filesystem. Without this option, the superuser or owner of the file can
set and clear them. With this option, only the superuser can set them, and
they can't be cleared if the securelevel is greater than 0. See also
.Xr chflags 1 .
.El
.Ss Miscellaneous Options
.Bl -ohang
.It Cd option LKM
Enable support for loadable kernel modules. See
.Xr lkm 4
for details.
.Em NOTE:
This option is not yet available on all architectures.
.It Cd option INSECURE
Hardwires the kernel security level at -1. This means that the system
always runs in secure level 0 mode, even when running multiuser. See
the manual page for
.Xr init 8
for details on the implications of this. The kernel secure level may
manipulated by the superuser by altering the
.Em kern.securelevel
sysctl variable. (It should be noted that the secure level may only be
lowered by a call from process id 1, i.e.
.Em init . )
See also
.Xr sysctl 8
and
.Xr sysctl 3 .
.It Cd option MACHINE_NONCONTIG
This option changes part of the VM/pmap interface, to allow for
non-contiguous memory.  On some ports it is not an option.  These
ports typically only use one of the interfaces.
.It Cd option RAM_DISK_HOOKS
This option allows for some machine dependent functions to be called when
the ramdisk driver is configured. This can result in automatically loading
a ramdisk from floppy on open (among other things).
.It Cd option RAM_DISK_IS_ROOT
Forces the ramdisk to be the root device. This can only be overridden when
the kernel is booted in the 'ask-for-root' mode.
.It Cd option CCDNBUF=integer
The
.Xr ccd 4
device driver uses "component buffers" to distribute I/O requests to the
components of a concatenated disk.  It keeps a freelist of buffer headers
in order to reduce use of the kernel memory allocator.
.Em CCDNBUF
is the number of buffer headers allocated on the freelist for
each component buffer.  It defaults to 8.
.It Cd option KMEMSTATS
The kernel memory allocator,
.Xr malloc 9 ,
will keep statistics on its performance if this option is enabled.
Unfortunately, this option therefore essentially disables 
.Fn MALLOC
and
.Fn FREE
forms of the memory allocator, which are used to enhance the performance
of certain critical sections of code in the kernel.
This option therefore can
lead to a significant decrease in the performance of certain code in the kernel
if enabled.  Examples of such code include the
.Fn namei
routine, the
.Xr ccd 4
driver,
the
.Xr ncr 4
driver,
and much of the networking code.
.Em N.B. This option is silently
.Em turned on by the DEBUG option.
.El
.Ss Networking Options
.Bl -ohang
.It Cd option GATEWAY
Enables 
.Em IPFORWARDING
(which see) 
and (on most ports) increases the size of 
.Em NMBCLUSTERS
(which see). In general,
.Em GATEWAY
is used to indicate that a system should act as a router, and
.Em IPFORWARDING
is not invoked directly.
(Note that
.Em GATEWAY
has no impact on protocols other than IP, such as CLNP or XNS.)
.It Cd option IPFORWARDING
Enables IP routing behavior. With this option enabled, the machine
will forward IP datagrams between its interfaces that are destined for
other machines. Note that even without this option, the kernel will
still forward some packets (such as source routed packets) -- removing
.Em GATEWAY
and
.Em IPFORWARDING
is insufficient to stop all routing through a bastion host on a
firewall -- source routing is controlled independently.
Note that IP forwarding may be turned on and off independently of the
setting of the
.Em IPFORWARDING
option through the use of the
.Em net.inet.ip.forwarding
sysctl variable. If
.Em net.inet.ip.forwarding
is 1, IP forwarding is on. See
.Xr sysctl 8
and
.Xr sysctl 3
for details.
.It Cd option MROUTING
Includes support for IP multicast routers. You certainly want 
.Em INET
with this. Multicast routing is controlled by the
.Xr mrouted 8
daemon.
.It Cd option INET
Includes support for the TCP/IP protocol stack. You almost certainly
want this. See
.Xr inet 4
for details.
This option is currently required.
.It Cd option MCLSHIFT=value
This option is the base-2 logarithm of the size of mbuf clusters.
The BSD networking stack keeps network packets in a linked
list, or chain, of kernel buffer objects called mbufs.  The system
provides larger mbuf clusters as an optimization for large packets,
instead of using long chains for large packets.
The mbuf cluster size,
or 
.Em MCLBYTES, 
must be a power of two, and is computed as two raised to the power
.Em MCLSHIFT.
On systems with Ethernet network adaptors,
.Em	MCLSHIFT
is often set to 11, giving 2048-byte mbuf clusters, large enough to
hold a 1500-byte Ethernet frame in a single cluster. Systems with
networks supporting larger frame sizes like ATM, FDDI, or HIPPI may
perform better with MCLSHIFT set to 12 or 13, giving mbuf cluster
sizes of 4096 and 8192 bytes, respectively.
.It Cd option NS
Include support for the Xerox XNS protocol stack. See
.Xr ns 4
for details.
.It Cd option ISO,TPIP
Include support for the ubiquitous OSI protocol stack. See
.Xr iso 4
for details.
.It Cd option EON
Include support for OSI tunneling over IP.
.It Cd option CCITT,LLC,HDLC
Include support for the X.25 protocol stack.
The state of this code is currently unknown. It probably contains
bugs.
.It Cd option IPX,IPXIP
Include support for Internetwork Packet Exchange protocol commonly in
use by
.Tn Novell NetWare .
.It Cd option NETATALK
Include kernel support for the AppleTalk family of protocols.  This suite
of supporting code is sometimes called
.Em netatalk 
support.
.It Cd option TCP_COMPAT_42
Use of this option is
.Em extremely
discouraged.  Do not enable this.  If any other machines on your network
require you to enable this, you're better off just disconnecting
.Em them
from the network.
.Pp
TCP bug compatibility with 4.2BSD.  In 4.2BSD, TCP sequence numbers
were 32-bit signed values.  Modern implementations of TCP use unsigned
values.  This option clamps the initial sequence number to start in
the range 2^31 rather than the full unsigned range of 2^32.  Also,
under 4.2BSD, keepalive packets must contain at least one byte or else
the remote end would not respond.
.It Cd option PFIL_HOOKS
This option turns on the packet filter interface hooks.  See
.Xr pfil 9
for details.
.It Cd option IPFILTER
This option enables the IP filtering on the packet level using the
ip-filter package.  This option requires that the
.Em PFIL_HOOK
option also be included.
.It Cd option IPFILTER_LOG
This option, in conjunction with
.Em IPFILTER ,
enables logging of IP packets using ip-filter.
.It Cd option IPFILTER_DEFAULT_BLOCK
This option sets the default policy of ip-filter.  If it is set,
ip-filter will block packets by default.
.It Cd option PPP_FILTER
This option turns on
.Xr pcap 3
based filtering for ppp connections. This option is used by
.Xr pppd 8
which needs to be compiled with 
.Em PPP_FILTER
defined (the current default).
.El
.Ss SCSI Subsystem Options
.Bl -ohang
.It Cd option SCSITERSE
Terser SCSI error messages.  This omits the table for decoding ASC/ASCQ
info, saving about 8 bytes or so.
.It Cd option SCSIDEBUG
Prints extra debugging info for the SCSI subsystem to the console.
.Ss System V IPC Options
.Bl -ohang
.It Cd option SYSVMSG
Includes support for
.At V
style message queues.  See
.Xr msgctl 2 ,
.Xr msgget 2 ,
.Xr msgrcv 2 ,
.Xr msgsnd 2 .
.It Cd option SYSVSEM
Includes support for
.At V
style semaphores. See
.Xr semctl 2 ,
.Xr semget 2 ,
.Xr semop 2 .
.It Cd option SYSVSHM
Includes support for
.At V
style shared memory.  See
.Xr shmat 2 ,
.Xr shmctl 2 ,
.Xr shmdt 2 ,
.Xr shmget 2 .
.It Cd option SHMPAXPGS=value
Sets the maximum number of
.At V
style shared memory pages that are available through the
.Xr shmget 2
system call. Default value is 1024 on most ports. See
.Pa /usr/include/machine/vmparam.h
for the default.
.El
.Ss VM Related Options
.Bl -ohang
.It Cd option SWAPPAGER
Turns on paging.  (To be specific, this enables the virtual memory
module responsible for handling page faults for
.Dq anonymous 
objects (i.e. BSS pages)).
.Em MANDATORY
-- you cannot actually run without
this
.Dq option .
.It Cd option DEVPAGER
Support for mmap()ing of devices.  (Specifically, this enables the
virtual memory module responsible for handling page faults on mapped
devices (
.Dq cdev
vnodes)).
.Em MANDATORY
-- you cannot actually run without
this
.Dq option .
.It Cd option NMBCLUSTERS=value
Size of kernel mbuf cluster map,
.Em mb_map ,
in CLBYTES-sized logical
pages.  Default on most ports is 256 (512 with
.Dq option GATEWAY ).
See
.Pa /usr/include/machine/param.h
for exact default information.  Increase this value if you get 
.Dq mb_map full
messages.
.It Cd option NKMEMCLUSTERS=value
Size of kernel malloc arena in CLBYTES-sized logical pages.  This area
is covered by the kernel submap 
.Em kmem_map .
See
.Pa /usr/include/machine/param.h
for the default value, which is port specific.  Increase this value if
you get 
.Dq out of space in kmem_map
panics.
.\" , which mean you have run out of mallocable kernel memory.
.It Cd option NBUF=value
.It Cd option BUFPAGES=value
These option set the number of pages available for the buffer cache.
Their default value is a machine dependent value, often calculated as
between 5% and 10% of total available RAM.
.El
.\" The following requests should be uncommented and used where appropriate.
.\" .Sh FILES
.\" .Sh EXAMPLES
.Sh SEE ALSO
.Xr config 8 ,
.Xr init 8 ,
.Xr gettimeofday 2 ,
.Xr sysctl 8 ,
.Xr sysctl 3 ,
.Xr xntpd 8 ,
.Xr ntp_adjtime 2 ,
.Xr ntp_gettime 2 ,
.Xr i386_iopl 2 ,
.Xr msgctl 2 ,
.Xr msgget 2 ,
.Xr msgrcv 2 ,
.Xr msgsnd 2 ,
.Xr semctl 2 ,
.Xr semget 2 ,
.Xr semop 2 ,
.Xr shmat 2 ,
.Xr shmctl 2 ,
.Xr shmdt 2 ,
.Xr shmget 2 ,
.Xr ddb 4 ,
.Xr lkm 4 ,
.Xr inet 4 ,
.Xr ns 4 ,
.Xr iso 4 ,
.Xr mrouted 8 ,
.Xr mount_mfs 8 ,
.Xr mount_nfs 8 ,
.Xr mount_cd9660 8 ,
.Xr mount_msdos 8 ,
.Xr mount_fdesc 8 ,
.Xr mount_kernfs 8 ,
.Xr mount_null 8 ,
.Xr mount_portal 8 ,
.Xr mount_procfs 8 ,
.Xr mount_umap 8 ,
.Xr mount_union 8 ,
.Xr edquota 8 ,
.Xr quotaon 8 ,
.Xr quota 1 ,
.Xr rpc.rquotad 8 ,
.Xr ktrace 1 ,
.Xr gdb 1
.Sh HISTORY
The
.Nm
man page first appeared in
.Ox 2.3 .
.Sh BUGS
The
.Em INET
option should not be required.
