openbsd/src/share/man/man4/pcaled.4
.\"	$OpenBSD: pcaled.4,v 1.1 2006/06/27 03:54:24 deraadt Exp $
.\"
.\" Copyright (c) 2006 Theo de Raadt <deraadt@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd June 26, 2006
.Dt PCALED 4
.Os
.Sh NAME
.Nm pcaled
.Nd Philips PCA9532 LED dimmer
.Sh SYNOPSIS
.Cd "pcaled* at iic?"
.Cd "gpio* at pcaled?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Philips PCA9532 GPIO controller
which is specifically optimized to dim LEDs in 256 discrete steps.
.Sh SEE ALSO
.Xr gpio 4 ,
.Xr iic 4 ,
.Xr intro 4 ,
.Xr gpioctl 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Dale Rahn Aq drahn@openbsd.org .
