openbsd/src/share/man/man4/pcdisplay.4
.\" $OpenBSD: pcdisplay.4,v 1.1 2000/11/15 21:29:32 aaron Exp $
.\" $NetBSD: pcdisplay.4,v 1.3 2000/05/13 15:22:17 mycroft Exp $
.Dd March 20, 1999
.Os
.Dt PCDISPLAY 4
.Sh NAME
.Nm pcdisplay
.Nd PC display adapter driver for wscons
.Sh SYNOPSIS
.Cd "pcdisplay0 at isa?"
.Cd "wsdisplay* at pcdisplay? console ?"
.Cd option PCDISPLAY_SOFTCURSOR
.Sh DESCRIPTION
This driver supports PC display adapter hardware within the
.Xr wscons 4
console framework.
It doesn't provide direct device driver entry points but makes its
functions available via the internal
.Xr wsdisplay 4
interface.
.Pp
The
.Nm
driver is indended as a minimal
.Dq catch-all
driver for the different kinds of MDA or CGA compatible adapters.
It doesn't support multiple screens, nor colors or font loading.
.Pp
Supported kernel option(s):
.Bl -tag -ohang -width xxxx
.It Cd option PCDISPLAY_SOFTCURSOR
Use a large, non-blinking cursor generated by software. The default is to use
the cursor provided by the underlying display hardware.
.El
.Sh SEE ALSO
.Xr isa 4 ,
.Xr vga 4 ,
.Xr wscons 4
