openbsd/src/share/man/man4/pchb.4
.\"	$OpenBSD: pchb.4,v 1.5 2000/05/15 21:34:39 deraadt Exp $
.\"
.\" Copyright (c) 2000 Michael Shalayeff. All rights reserved.
.\"
.Dd April 12, 2000
.Dt PCHB 4
.Os
.Sh NAME
.Nm pchb
.Nd PCI-Host Bridge
.Sh SYNOPSIS
.Cd "pchb* at pci? dev ? function?"
.Cd "pci* at pchb?
.Sh DESCRIPTION
The
.Nm
driver provides support for PCI-Host adapter-specific functions for
the following devices:
.Pp
.Bl -tag -width -offset indent -compact
.It i450 PCIset (Orion)
Supports additional PCI busses.
.It Reliance Computer ROSB4, CNB20HE, CNB20LE
Supports additional PCI busses.
.It i82424ZX (Saturn)
Disables CPU-PCI write posting.
.It i82443BX
Provides workaround for the following errata:
"An incorrect address may be driven on the
DRAM bus, resulting in memory data being
fetched from the wrong location."
.It i82810/810E
Supports the random numbers generator,
supplying random bytes from the system's thermal noise.
Driven by periodic checks for available data from the generator,
it supplies entropy to the
.Xr random 4
driver for common usage.
.El
.Pp
On i386 systems all other PCI devices of class
.Nm Bridge
and sub-class
.Nm Bridge Host
are supported just as PCI attachment point.
.Pp
The Power-PC port supports several Apple and Motorola bridges.
.Pp
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr random 4
.Sh HISTORY
Random number generator support first appeared in
.Ox 2.7 .
.Sh AUTHORS
Support for true RNG present on i82810 chips was added by
Michael Shalayeff <mickey@openbsd.org>.
.Sh BUGS
Real RNG probe should fix the PCI scanning loop so it would find the Firmware
Hub (i82802) which actually contains the RNG device and
probe it as a real PCI device (i.e., common PCI registers are there).
