openbsd/src/share/man/man4/pchtemp.4
.\"	$OpenBSD: pchtemp.4,v 1.3 2016/02/06 12:50:27 kettenis Exp $
.\"
.\" Copyright (c) 2015 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 6 2016 $
.Dt PCHTEMP 4
.Os
.Sh NAME
.Nm pchtemp
.Nd Intel PCH temperature sensor
.Sh SYNOPSIS
.Cd "pchtemp* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the temperature sensor in the Intel X99,
C610 series, 9 series and 100 series platform controller hub (PCH).
.Pp
These sensors provide 0.5 degC resolution.
Sensor values are made available through the
.Xr sysctl 8
interface.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.9 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Mt kettenis@openbsd.org .
.Sh CAVEATS
The temperature sensor only attached if it has been enabled by the
BIOS.
