openbsd/src/share/man/man4/pci.4
.\"	$OpenBSD: pci.4,v 1.176 2006/09/01 10:06:19 jmc Exp $
.\"	$NetBSD: pci.4,v 1.29 2000/04/01 00:32:23 tsarna Exp $
.\"
.\" Copyright (c) 2000 Theo de Raadt.  All rights reserved.
.\" Copyright (c) 1997 Jason R. Thorpe.  All rights reserved.
.\" Copyright (c) 1997 Jonathan Stone
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgements:
.\"      This product includes software developed by Jonathan Stone
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 20, 2004
.Dt PCI 4
.Os
.Sh NAME
.Nm pci
.Nd introduction to PCI bus support
.Sh SYNOPSIS
.Cd "# alpha"
.Cd "pci* at apecs?"
.Cd "pci* at cia?"
.Cd "pci* at irongate?"
.Cd "pci* at lca?"
.Cd "pci* at tsp?"
.Pp
.Cd "# amd64, i386"
.Cd "pci* at mainbus0"
.Pp
.Cd "# cats"
.Cd "pci0 at footbridge?"
.Pp
.Cd "# hppa"
.Cd "pci* at dino?"
.Pp
.Cd "# macppc"
.Cd "pci* at mpcpcibr?"
.Pp
.Cd "# sparc64"
.Cd "pci* at psycho?"
.Cd "pci* at schizo?"
.Pp
.Cd "# all architectures"
.Cd "pci* at pchb?"
.Cd "pci* at ppb?"
.Sh DESCRIPTION
The system includes a machine-independent
.Tn PCI
bus subsystem and
several machine-independent
.Tn PCI
device drivers.
.Pp
Your system may support additional
.Tn PCI
devices.
Drivers for
.Tn PCI
devices not listed here are machine-dependent.
Consult your system's
.Xr intro 4
for additional information.
.Ss Details specific to the i386
Note that interrupt mappings on the i386 may require that you configure
your BIOS to reserve sufficient interrupts as "PCI/ISAPnP" so that there
are sufficient interrupts remaining to configure the discovered PCI
devices.
For more information, see
.Xr pcibios 4 .
.Sh SUPPORTED DEVICES
The system includes machine-independent
.Tn PCI
drivers, sorted by device type and driver name:
.Ss SCSI host adapters
.Bl -tag -width 10n -offset ind -compact
.It Xr adv 4 , Xr adw 4
AdvanSys PCI
.Tn SCSI
interfaces.
.It Xr ahc 4
Adaptec 27xx, 29xx, 39xx, 29160, and other AIC-7xxx-based
.Tn SCSI
interfaces.
.It Xr ahd 4
Adaptec PCI/PCI-X Ultra320 AIC79xx-based
.Tn SCSI
interfaces.
.It Xr bha 4
Buslogic BT-9xx
.Tn SCSI
interfaces.
.It Xr iha 4
Initio INIC-940 and INIC-950 based
.Tn SCSI
interfaces.
.It Xr isp 4
QLogic ISP-1020, ISP-1040, and ISP-2100
.Tn SCSI
and
.Tn FibreChannel
interfaces.
.It Xr mpi 4
LSI Logic Fusion-MPT Message Passing Interface.
.It Xr pcscp 4
AMD Am53c974 PCscsi-PCI
.Tn SCSI
interfaces.
.It Xr siop 4
LSI/Symbios Logic/NCR 53c8xx and 53c1010-family
.Tn SCSI
interfaces.
.It Xr trm 4
Tekram DC-3x5U (TRM-S1040 based)
.Tn SCSI
interfaces.
.El
.Ss IDE disk controllers
.Bl -tag -width 10n -offset ind -compact
.It Xr pciide 4
PCI IDE controller driver.
.El
.Ss RAID and cache controllers
.Bl -tag -width 10n -offset ind -compact
.It Xr aac 4
Adaptec SCSI RAID controller.
.It Xr ami 4
American Megatrends Inc. MegaRAID PATA/SATA/SCSI RAID controller.
.It Xr arc 4
Areca Technology Corporation SATA RAID controller.
.It Xr cac 4
Compaq Smart ARRAY 2/3/4 SCSI RAID controller.
.It Xr ciss 4
Compaq Smart ARRAY 5/6 SATA/SCSI RAID controller.
.It Xr dpt 4
DPT EATA SCSI RAID controller.
.It Xr gdt 4
ICP-Vortex and Intel GDT SCSI RAID controller.
.It Xr iop 4
Generic
.Tn I2O
specification
.Tn RAID
controllers.
.It Xr mfi 4
LSI Logic & Dell MegaRAID SAS RAID controller.
.It Xr twe 4
3ware 5000/6000/7000/8000 series PATA/SATA RAID controller.
.El
.Ss Network interfaces
.Bl -tag -width 10n -offset ind -compact
.It Xr acx 4
TI ACX100/ACX111 IEEE 802.11a/b/g wireless network device.
.It Xr an 4
Aironet Communications 4500/4800 IEEE 802.11FH/b wireless network device.
.It Xr art 4
Accoom Networks Artery T1/E1 network adapters.
.It Xr ath 4
Atheros IEEE 802.11a/b/g wireless network device.
.It Xr atw 4
ADMtek ADM8211 IEEE 802.11b wireless network device.
.It Xr bce 4
Broadcom BCM4401 10/100 Ethernet device.
.It Xr bge 4
Broadcom BCM57xx/BCM590x 10/100/Gigabit Ethernet device.
.It Xr bnx 4
Broadcom NetXtreme II 10/100/Gigabit Ethernet device.
.It Xr dc 4
DEC/Intel 21140, 21142, 21143, 21145 and clones 10/100 Ethernet device.
.It Xr de 4
DEC DC21x4x (Tulip) 10/100 Ethernet device.
Multi-port interfaces are typically configured as
.Tn PCI Ns \- Ns Tn PCI
bridges with multiple
.Xr de 4
instances on the
.Tn PCI
bus on the other side of the bridge.
.It Xr em 4
Intel PRO/1000 10/100/Gigabit Ethernet device.
.\" .It Xr en 4
.\" Midway-based Efficient Networks Inc.\&
.\" and Adaptec ATM interfaces.
.It Xr ep 4
3Com EtherLink III and Fast EtherLink III 10/100 Ethernet device.
.It Xr epic 4
SMC 83C170 (EPIC/100) 10/100 Ethernet device.
.It Xr fpa 4
.Tn DEC
DEFPA
.Tn FDDI
interfaces.
.It Xr fxp 4
Intel EtherExpress PRO/100 10/100 Ethernet device.
.It Xr gem 4
GEM 10/100/Gigabit Ethernet device.
.It Xr hme 4
Sun Happy Meal 10/100 Ethernet device.
.It Xr ipw 4
.Tn Intel
PRO/Wireless 2100 IEEE 802.11b wireless network device.
.It Xr iwi 4
.Tn Intel
PRO/Wireless 2200BG/2225BG/2915ABG IEEE 802.11a/b/g wireless network device.
.It Xr ixgb 4
Intel(R) PRO/10GbE 10Gb Ethernet device.
.It Xr lge 4
Level 1 LXT1001 NetCellerator PCI Gigabit Ethernet device.
.It Xr lmc 4
Lan Media Corporation
.Tn SSI/DS1/HSSI/DS3
interfaces.
.It Xr msk 4
SysKonnect XMAC II and Marvell Yukon based Gigabit Ethernet device.
.It Xr mtd 4
Myson Technology MTD800/MTD803/MTD891 10/100/Gigabit Ethernet device.
.It Xr ne 4
NE2000 and compatible 10/100 Ethernet device.
.It Xr nfe 4
NVIDIA nForce MCP 10/100/Gigabit Ethernet device.
.It Xr nge 4
National Semiconductor PCI 10/100/Gigabit Ethernet device.
.It Xr pcn 4
AMD PCnet-PCI 10/100 Ethernet device.
.It Xr pgt 4
Connexant/Intersil Prism GT Full-MAC IEEE 802.11a/b/g wireless network device.
.It Xr ral 4
Ralink Technology IEEE 802.11a/b/g wireless network device.
.It Xr re 4
RealTek 8139C+/8169/816xS/811xS/8101E 10/100/Gigabit Ethernet device.
.It Xr rl 4
Realtek 8129/8139 10/100 Ethernet device.
.It Xr rtw 4
Realtek RTL8180L IEEE 802.11b wireless network device.
.It Xr san 4
Sangoma Technologies AFT T1/E1 Network interfaces.
.It Xr sf 4
Adaptec AIC-6915 "Starfire" PCI 10/100 Ethernet device.
.It Xr sis 4
SiS 900, SiS 7016, and NS DP83815/6 10/100 Ethernet device.
.It Xr sk 4
SysKonnect SK-984x Gigabit Ethernet interfaces.
.It Xr ste 4
Sundance Technologies ST201 10/100 Ethernet device.
.It Xr stge 4
Sundance/Tamarack TC9021 Gigabit Ethernet device.
.It Xr ti 4
Alteon Networks Tigon I and II Gigabit Ethernet device.
.It Xr tl 4
Texas Instruments ThunderLAN 10/100 Ethernet device.
.It Xr txp 4
3Com 3XP Typhoon/Sidewinder (3CR990) 10/100 Ethernet device.
.It Xr vge 4
VIA Networking Technologies VT6122 PCI 10/100/Gigabit Ethernet device.
.It Xr vr 4
VIA Technologies VT3043, VT86C100A, VT6105/VT6105M 10/100 Ethernet device.
.It Xr wb 4
Winbond W89C840F 10/100 Ethernet device.
.It Xr wi 4
WaveLAN/IEEE, PRISM 2-3, and Spectrum24 IEEE 802.11b wireless network
device.
.It Xr wpi 4
Intel PRO/Wireless 3945ABG IEEE 802.11a/b/g wireless network device.
.It Xr xge 4
Neterion Xframe/Xframe II 10Gb Ethernet device.
.It Xr xl 4
3Com EtherLink XL and Fast EtherLink XL 10/100 Ethernet device.
.El
.Ss Cryptography accelerators
.Bl -tag -width 10n -offset ind -compact
.It Xr hifn 4
Hifn 7751, 7811, and 7951.
Symmetric Encryption Accelerator.
.It Xr ises 4
Pijnenburg PCC-ISES hardware crypto accelerator.
.It Xr lofn 4
Hifn 6500 crypto accelerator.
.It Xr noct 4
NetOctave NSP2000 crypto accelerator.
.It Xr nofn 4
Hifn 7814, 7851 and 7854 crypto processor.
.It Xr safe 4
Safenet SafeXcel 1141/1741 crypto accelerator.
.It Xr ubsec 4
Broadcom Bluesteelnet uBsec 5501, 5601, 5805, 5820, and 5821.
.El
.Ss Serial interfaces
.Bl -tag -width 10n -offset ind -compact
.It Xr cy 4
Cyclades Cyclom-4Y, -8Y, and -16Y asynchronous serial communications devices.
.It Xr cz 4
Cyclades-Z series multi-port serial adapter device driver.
.It Xr puc 4
PCI
.Dq universal
communications cards, containing
.Xr com 4
and
.Xr lpt 4
communications ports.
.El
.Ss Display adapters
.Bl -tag -width 10n -offset ind -compact
.It Xr vga 4
VGA graphics cards.
.El
.Ss Audio devices
.Bl -tag -width 10n -offset ind -compact
.It Xr auich 4
ICH-based PCI audio device.
.It Xr auixp 4
ATI IXP series integrated AC'97 audio device.
.It Xr autri 4
Trident 4DWAVE-DX/NX, SiS 7018, ALi M5451 audio device.
.It Xr auvia 4
VIA VT82C686A, VT8233, VT8235, VT8237 integrated AC'97 audio device.
.It Xr azalia 4
Generic High Definition Audio device.
.It Xr clcs 4
Cirrus Logic CS4280/CS4610/CS4615 audio device.
.It Xr clct 4
Cirrus Logic CS4281 audio device.
.It Xr cmpci 4
C-Media CMI8x38 PCI audio device.
.It Xr eap 4
Ensoniq AudioPCI audio device.
.It Xr emu 4
Creative Labs SBLive!, PCI 512, and Audigy audio device.
.It Xr esa 4
ESS Technology Allegro-1/Maestro-3 family audio device.
.It Xr eso 4
ESS Technology Solo-1 PCI AudioDrive audio device.
.It Xr fms 4
Forte Media FM801 audio device.
.It Xr maestro 4
ESS Maestro 1 and 2 audio device.
.It Xr neo 4
NeoMagic 256AV/ZX audio device.
.It Xr sv 4
S3 SonicVibes audio device.
.It Xr yds 4
Yamaha DS-XG audio device.
.El
.Ss Radio receiver devices
.Bl -tag -width 10n -offset ind -compact
.It Xr fms 4
SoundForte RadioLink SF64-PCR, SoundForte Quad X-treme SF256-PCP-R and
SoundForte Theatre X-treme 5.1 SF256-PCS-R FM radio devices driver.
.It Xr gtp 4
Gemtek PCI FM radio device driver.
.El
.Ss Miscellaneous devices
.Bl -tag -width 10n -offset ind -compact
.It Xr alipm 4
Acer Labs M7101 Power Management controller.
.It Xr amdiic 4
AMD-8111 SMBus controller.
.It Xr amdpm 4
AMD-756/766/768/8111 Power Management controller.
.It Xr bktr 4
Brooktree Bt848
.Tn PCI
TV tuners and video capture boards.
.It Xr cbb 4
.Tn PCI
Yenta compatible
.Tn CardBus
bridges.
.It Xr ehci 4
USB EHCI host controller.
.It Xr ichiic 4
Intel ICH SMBus controller.
.It Xr ichwdt 4
Intel 6300ESB ICH watchdog timer.
.It Xr nviic 4
NVIDIA nForce and MCP SMBus controller.
.It Xr ohci 4
USB OHCI host controller.
.It Xr pcic 4
.Tn PCI
.Tn PCMCIA
controllers, including the Cirrus Logic GD6729.
.It Xr piixpm 4
Intel PIIX and compatible Power Management controller.
.It Xr ppb 4
Generic
.Tn PCI Ns \- Ns Tn PCI
bridges, including
.Tn PCI
expansion backplanes.
.It Xr sdhc 4
SD Host Controller
.It Xr uhci 4
USB UHCI host controller.
.It Xr viapm 4
VIA VT8233/8235/8237 Bus Control and Power Management controller.
.It Xr wdt 4
ICS PCI-WDT500/501 watchdog timer devices.
.El
.Sh IOCTLS
If the kernel is compiled with the
.Va USER_PCICONF
kernel option, the following
.Xr ioctl 2
calls are supported by the
.Nm
driver.
They are defined in the header file
.Aq Pa sys/pciio.h .
.Bl -tag -width 012345678901234
.Pp
.It PCIOCREAD
This
.Xr ioctl 2
reads the
.Tn PCI
configuration registers specified by the passed-in
.Va pci_io
structure.
The
.Va pci_io
structure consists of the following fields:
.Bl -tag -width pi_width
.It pi_sel
A
.Va pcisel
structure which specifies the bus, slot and function the user would like to
query.
.It pi_reg
The
.Tn PCI
configuration register the user would like to access.
.It pi_width
The width, in bytes, of the data the user would like to read.
This value can be only 4.
.It pi_data
The data returned by the kernel.
.El
.It PCIOCWRITE
This
.Xr ioctl 2
allows users to write to the
.Tn PCI
specified in the passed-in
.Va pci_io
structure.
The
.Va pci_io
structure is described above.
The limitations on data width described for
reading registers, above, also apply to writing
.Tn PCI
configuration registers.
.El
.Sh FILES
.Bl -tag -width /dev/pci -compact
.It Pa /dev/pci
Character device for the
.Nm
driver.
.El
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The machine-independent
.Tn PCI
subsystem appeared in
.Ox 1.2 .
Support for device listing and matching was re-implemented by
Kenneth Merry, and first appeared in
.Fx 3.0 .
