openbsd/src/share/man/man4/pciide.4
.\"	$OpenBSD: pciide.4,v 1.7 2000/03/24 17:52:00 chris Exp $
.\"	$NetBSD: pciide.4,v 1.8 1999/03/16 01:19:17 garbled Exp $
.\"
.\" Copyright (c) 1998 Manuel Bouyer.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"

.Dd October 15, 1998
.Dt PCIIDE 4
.Os
.Sh NAME
.Nm pciide
.Nd PCI IDE controller driver
.Sh SYNOPSIS
.Cd "pciide* at pci ? dev ? function ? flags 0x0000"
.Cd "options PCIIDE_CMD064x_DISABLE"
.Sh DESCRIPTION
The
.Nm
driver supports the PCI IDE controllers as specified in the
"PCI IDE controller specification, revision 1.0" draft, and provides the core
functions for the
.Xr wd 4
and
.Xr atapiscsi 4
drivers. This driver includes specific, enhanced support for the CMD Tech
PCI0640 controller and IDE DMA/UltraDMA support for the following PCI IDE
controllers:
.Pp
.Bl -item -compact -offset indent
.It
Acer Labs M5229
.It
Advanced Micro Devices AMD-756
.It
CMD Tech PCI0643 and PCI0646
.It
Contaq Microsystems/Cypress CY82C693
.It
Intel PIIX, PIIX3, and PIIX4
.It
Intel 82801 (ICH/ICH0)
.It
Promise PDC20246 (Ultra/33) and PDC20262 (Ultra/66)
.It
Silicon Integrated System 5513 (5597/5598)
.It
VIA Technologies VT82C586 and VT82C586A
.El 
.Pp
Some of these controllers are only available in multifunction PCI chips.
.Pp
The 0x0001 flag forces the
.Nm 
driver to use DMA when there is no explicit DMA mode setting support for
the controller but DMA is present. If the BIOS didn't configure the controller
properly, this can cause a machine hang.

.Sh BUGS
There's no way to reliably know if a PCI064x controller is enabled or not.
If the driver finds a PCI064x, it will assume it is enabled unless
.Dv PCIIDE_CMD064x_DISABLE
is specified in the kernel config file.
This will be a problem only if the controller has been disabled in the BIOS
and another controller has been installed which uses the ISA legacy I/O ports
and interrupts.
.Pp
The timings used for the PIO and DMA modes for controllers listed above
are for a PCI bus running at 30 or 33 Mhz. This driver may not
work properly on overclocked systems.
.Sh SEE ALSO
.Xr atapiscsi 4 ,
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr wd 4 ,
.Xr wdc 4
