openbsd/src/share/man/man4/pckbd.4
.\" $OpenBSD: pckbd.4,v 1.38 2011/01/30 07:53:57 jmc Exp $
.\" $NetBSD: pckbd.4,v 1.3 1999/12/21 11:31:07 drochner Exp $
.\"
.\" Copyright (c) 1999
.\" 	Matthias Drochner.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: January 30 2011 $
.Dt PCKBD 4
.Os
.Sh NAME
.Nm pckbd
.Nd PC keyboard driver for wscons
.Sh SYNOPSIS
.Cd "pckbd* at pckbc?"
.Cd "pckbd* at gsckbc?" Pq hppa
.Cd "pckbd* at mkbc?" Pq sgi
.Cd "wskbd* at pckbd?"
.Cd "option PCKBD_LAYOUT=XXX"
.Sh DESCRIPTION
This driver supports PC/AT keyboards within the
.Xr wscons 4
console framework.
It doesn't provide direct device driver entry points but makes its
functions available via the internal
.Xr wskbd 4
interface.
.Pp
The
.Nm
driver supports a number of different key mappings which
can be chosen from with the kernel option
.Dq PCKBD_LAYOUT
at compile time or with the utility
.Xr wsconsctl 8
(variable:
.Dq keyboard.encoding )
at runtime.
Other mappings can be used if the whole keymap is replaced by means of
.Xr wsconsctl 8 .
The built-in mappings are at this time:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It KB_BE
.Pq be
Belgium French.
.It KB_BR
.Pq br
Brazilian.
.It KB_CF
.Pq cf
Canadian French.
.It KB_DE
.Pq de
German with
.Pq dead accents .
.It KB_DK
.Pq dk
Danish with
.Dq dead accents .
.It KB_ES
.Pq es
Spanish.
.It KB_FR
.Pq fr
French.
.It KB_FR | KB_DVORAK
.Pq fr.dvorak
French keyboard with
.Dq Dvorak-Bepo
layout.
.It KB_HU
.Pq hu
Hungarian.
.It KB_IT
.Pq it
Italian.
.It KB_JP
.Pq jp
Japanese.
.It KB_LA
.Pq la
Latinamerican.
.It KB_LT
.Pq \&lt
Lithuanian in
.Dq ISO 8859-13 .
.It KB_LV
.Pq \&lv
Latvian
.It KB_NL
.Pq \&nl
Dutch with
.Dq dead accents .
.It KB_NO
.Pq no
Norwegian with
.Dq dead accents .
.It KB_PL
.Pq pl
Polish in
.Dq ISO 8859-2 .
.It KB_PT
.Pq pt
Portuguese.
.It KB_RU
.Pq ru
Russian in
.Dq KOI8 .
.It KB_SF
.Pq sf
Swiss French with
.Dq dead accents .
.It KB_SG
.Pq sg
Swiss German with
.Dq dead accents .
.It KB_SI
.Pq si
Slovenian.
.It KB_SV
.Pq sv
Swedish with
.Dq dead accents .
.It KB_TR
.Pq tr
Turkish in
.Dq ISO 8859-9
with
.Dq dead accents .
.It KB_UA
.Pq ua
Ukrainian in
.Dq KOI8 .
.It KB_UK
.Pq uk
British.
.It KB_US
.Pq us
English/US keyboard mapping (default).
.It KB_US | KB_DECLK
.Pq us.declk
English/US mapping for
DEC LK400-style keyboards with PC keyboard interface (eg LK461).
.It KB_US | KB_DVORAK
.Pq us.dvorak
English/US keyboard with
.Dq Dvorak
layout.
.El
.Pp
The KB_DE, KB_DK, KB_NO, KB_SF, KB_SG, KB_SV and KB_TR mappings can be used in
the KB_NODEAD
.Pq .nodead
variant.
This switches off the
.Dq dead accents .
.Pp
The KB_BE, KB_FR, KB_FR | KB_DVORAK, KB_JP, KB_UK, KB_US and KB_US | KB_DVORAK
mappings can be modified
to swap the left Control and the Caps Lock keys by the
KB_SWAPCTRLCAPS variant bit or the
.Dq .swapctrlcaps
suffix.
.Pp
The KB_METAESC
.Pq .metaesc
option can be applied to any layout.
If set, keys pressed together
with the ALT modifier are prefixed by an ESC character.
(Standard behaviour is to add 128 to the ASCII value.)
.Pp
Because PC keyboard hardware doesn't contain a beeper, requests for
.Dq keyboard beeps
cannot be handled directly.
On alpha and i386, a helper device attached to the pcppi
driver allows use of the standard ISA speaker for this purpose.
.Sh EXAMPLES
To set a German keyboard layout without
.Dq dead accents
and sending an ESC character before the key symbol if the ALT
key is pressed simultaneously, use
.Ic wsconsctl keyboard.encoding=de.nodead.metaesc .
To set it at kernel build time, add
the following to the kernel configuration file:
.Bd -literal -offset indent
option PCKBD_LAYOUT="(KB_DE|KB_NODEAD|KB_METAESC)"
.Ed
.Sh SEE ALSO
.Xr intro 4 ,
.Xr isa 4 ,
.Xr mkbc 4 ,
.Xr pckbc 4 ,
.Xr wskbd 4 ,
.Xr wsconsctl 8
.Sh BUGS
The list of built-in mappings doesn't follow any logic.
It grew as people submitted what they needed.
