openbsd/src/share/man/man4/pcmcia.4
.\"	$OpenBSD: pcmcia.4,v 1.9 1999/12/16 02:56:55 deraadt Exp $
.\"	$NetBSD: pcmcia.4,v 1.4 1998/06/07 09:10:30 enami Exp $
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"

.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 11, 1998
.Dt PCMCIA 4
.Os
.Sh NAME
.Nm pcmcia
.Nd introduction to PCMCIA (PC Card) support
.Sh SYNOPSIS
.Cd "pcic0   at isa? port 0x3e0 iomem 0xd0000 iosiz 0x4000"
.Cd "pcic1   at isa? port 0x3e2 iomem 0xd4000 iosiz 0x4000"
.Cd "pcmcia* at pcic? controller ? socket ?"
.Cd "xx*     at pcmcia? function ?"
.Pp
.Sh INTRODUCTION
The
.Nm pcmcia
subsystem provides machine-independent bus support and
drivers for PCMCIA (PC Card)
devices.
.Sh SUPPORTED DEVICES
The following devices are supported, sorted by function
and driver name:
.Pp
.Ss Serial interfaces and modems
.Bl -tag -width speaker -offset indent -compact
.It com
8250/16450/16550-compatible PCMCIA serial cards and modems.
.It pccom
8250/16450/16550-compatible PCMCIA serial cards and modems.
i386-specific driver.
.El
.Pp
.Ss Network interfaces
.Bl -tag -width speaker -offset indent -compact
.It awi
BayStack 650 wireless 802.11 FH controller.
.It cnw
Xircom Creditcard Netwave cards.
.It ep
3com 3c589 Etherlink-III ethernet cards.
.It ne
NE2000 compatible cards.
.It rln
Proxim RangeLAN2 PC-Card
.It sm
Megahertz ethernet cards.
.It xe
Xircom 16bit ethernet cards.
.It wi
Lucent WaveLAN IEEE 802.11-compatible cards.
.El
.Pp
.Ss SCSI controllers
.Bl -tag -width speaker -offset indent -compact
.It aic
Adaptec APA-14[56]0 and NewMedia BusToaster SCSI controller cards.
.El
.Ss IDE controllers
.Bl -tag -width speaker -offset indent -compact
.It wdc
Devices which implement an ATA/IDE interface, such as mini disk drives,
CDROMS.  This includes flash cards which emulate a disk drive.
.El
.Pp
The supported PCMCIA controllers are those that are i82365 compatible.
.Sh SEE ALSO
.Xr aic 4 ,
.Xr awi 4 ,
.Xr com 4 ,
.Xr cnw 4 ,
.Xr ep 4 ,
.Xr intro 4 ,
.Xr isa 4 ,
.Xr ne 4 ,
.Xr pccom 4 ,
.Xr sm 4 ,
.Xr wdc 4 ,
.Xr wi 4 ,
.Xr xe 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Ox 2.3 .
