openbsd/src/share/man/man4/pcscp.4
.\"	$OpenBSD: pcscp.4,v 1.16 2017/07/06 16:52:32 schwarze Exp $
.\"	$NetBSD: pcscp.4,v 1.3 1999/09/12 18:47:12 kleink Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: July 6 2017 $
.Dt PCSCP 4
.Os
.Sh NAME
.Nm pcscp
.Nd Advanced Micro Devices Am53c974 PCscsi-PCI SCSI interface
.Sh SYNOPSIS
.Cd "pcscp* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Advanced Micro Devices Am53c974
PCscsi-PCI SCSI controller and boards using this chip, including
the Tekram DC-390 PCI SCSI host adapter.
.Pp
For Tekram DC-390U/F PCI SCSI host adapters, use the
.Xr siop 4
driver.
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr pci 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr st 4 ,
.Xr uk 4
.Pp
.Lk http://www.amd.com/
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 2.9 .
.Sh BUGS
The driver currently ignores EEPROM settings, which establish
per-target parameters etc.
