openbsd/src/share/man/man4/pgt.4
.\"	$OpenBSD: pgt.4,v 1.26 2008/04/17 14:01:22 jmc Exp $
.\"
.\" Copyright (c) 2006 Theo de Raadt.
.\" Copyright (c) 2006 The DragonFly Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: April 17 2008 $
.Os
.Dt PGT 4
.Sh NAME
.Nm pgt
.Nd Conexant/Intersil Prism GT Full-MAC IEEE 802.11a/b/g wireless network
device
.Sh SYNOPSIS
.Cd "pgt* at cardbus?"
.Cd "pgt* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Conexant/Intersil GT-series devices
which can support the Full-Mac firmwares, using the ISL3877,
ISL3880, and ISL3890 chips.
The
.Nm
driver will not (yet) work on similar devices using the ISL3886 or
similar chips which use the Soft-Mac firmwares.
.Pp
These are the modes the
.Nm
driver can operate in:
.Bl -tag -width "IBSS-masterXX"
.It BSS mode
Also known as
.Em infrastructure
mode, this is used when associating with an access point, through
which all traffic passes.
This mode is the default.
.It IBSS mode
Also known as
.Em IEEE ad-hoc
mode or
.Em peer-to-peer
mode.
This is the standardized method of operating without an access point.
Stations associate with a service set.
However, actual connections between stations are peer-to-peer.
.It Host AP
In this mode the driver acts as an access point (base station)
for other cards.
.It monitor mode
In this mode the driver is able to receive packets without
associating with an access point.
This disables the internal receive filter and enables the card to
capture packets from networks which it wouldn't normally have access to,
or to scan for access points.
.El
.Pp
.Nm
supports hardware WEP.
Wired Equivalent Privacy (WEP) is the de facto encryption standard
for wireless networks.
It can be typically configured in one of three modes:
no encryption; 40-bit encryption; or 104-bit encryption.
Unfortunately, due to serious weaknesses in WEP protocol
it is strongly recommended that it not be used as the
sole mechanism to secure wireless communication.
WEP is not enabled by default.
.Pp
The
.Nm
driver can be configured at runtime with
.Xr ifconfig 8
or on boot with
.Xr hostname.if 5 .
.Sh FILES
The driver needs a set of firmware files which are loaded when
an interface is brought up:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Pa /etc/firmware/pgt-isl3877
.It Pa /etc/firmware/pgt-isl3890
.El
.Pp
These firmware files are not free because Conexant refuses
to grant distribution rights.
In fact they have rebuffed thousands
of attempts to start a dialogue on this issue.
As a result, even though
.Ox
includes the driver, the firmware files cannot be included and
users have to download these files on their own.
.Pp
A prepackaged version of the firmware, designed to be used with
.Xr pkg_add 1 ,
can be found at:
.Bd -literal -offset indent
http://www.nazgul.ch/pgt/pgt-firmware-1.2.tgz
.Ed
.Sh HARDWARE
The following cards are among those supported by the
.Nm
driver:
.Pp
.Bl -column -compact "SMC EZ Connect g 2.4GHz SMC2835W-v2" "ISL38xx" "CardBus" -offset 6n
.Em "Card	Chip	Bus"
3COM 3CRWE154G72	ISL3880	CardBus
D-Link DWL-g650 A1	ISL3890	PCI
I-O Data WN-G54/CB	ISL3890	PCI
I4 Z-Com XG-600	ISL3890	PCI
I4 Z-Com XG-900	ISL3890	PCI
Intersil PRISM Indigo	ISL3877	PCI
Intersil PRISM Duette	ISL3890	PCI
NETGEAR WG511 (Taiwanese, not Chinese)	ISL3890	CardBus
PLANEX GW-DS54G	ISL3890	PCI
SMC EZ Connect g 2.4GHz SMC2802W	ISL3890	PCI
SMC EZ Connect g 2.4GHz SMC2835W-v2	ISL3890	CardBus
SMC 2802Wv2	ISL3890	PCI
Soyo Aerielink	ISL3890	CardBus
ZyXEL ZyAIR G-100	ISL3890	CardBus
.El
.Sh EXAMPLES
The following
.Xr hostname.if 5
example configures pgt0 to join whatever network is available on boot,
using WEP key
.Dq 0x1deadbeef1 ,
channel 11, obtaining an IP address using DHCP:
.Bd -literal -offset indent
dhcp NONE NONE NONE nwkey 0x1deadbeef1 chan 11
.Ed
.Pp
The following
.Xr hostname.if 5
example creates a host-based access point on boot:
.Bd -literal -offset indent
inet 192.168.1.1 255.255.255.0 NONE media autoselect \e
	mediaopt hostap nwid my_net chan 11
.Ed
.Pp
Configure pgt0 for WEP, using hex key
.Dq 0x1deadbeef1 :
.Bd -literal -offset indent
# ifconfig pgt0 nwkey 0x1deadbeef1
.Ed
.Pp
Return pgt0 to its default settings:
.Bd -literal -offset indent
# ifconfig pgt0 -bssid -chan media autoselect \e
	nwid "" -nwkey
.Ed
.Pp
Join an existing BSS network,
.Dq my_net :
.Bd -literal -offset indent
# ifconfig pgt0 192.168.1.1 netmask 0xffffff00 nwid my_net
.Ed
.Sh SEE ALSO
.Xr arp 4 ,
.Xr cardbus 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr hostname.if 5 ,
.Xr hostapd 8 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was originally written for
.Fx
by
.An Brian Fundakowski ,
and then rewritten for
.Ox
by
.An Marcus Glocker
and
.An Claudio Jeker .
