openbsd/src/share/man/man4/piixpm.4
.\"	$OpenBSD: piixpm.4,v 1.5 2005/12/25 18:19:47 grange Exp $
.\"
.\" Copyright (c) 2004, 2005 Alexander Yurchenko <grange@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd September 16, 2004
.Dt PIIXPM 4
.Os
.Sh NAME
.Nm piixpm
.Nd Intel PIIX and compatible SMBus controllers
.Sh SYNOPSIS
.Cd "piixpm* at pci?"
.Cd "iic* at piixpm?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Intel PIIX and compatible SMBus controllers
to be used with the
.Xr iic 4
framework.
.Pp
Supported chipsets:
.Bl -bullet -compact -offset indent
.It
Intel 82371AB PIIX4, 82440MX
.It
ServerWorks OSB4, CSB5, CSB6
.El
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.7
to provide support for the power management (ACPI) timer.
In
.Ox 3.9
power management support was dropped in favor of
.Xr acpitimer 4
driver and SMBus functionality was added.
.Sh AUTHORS
.An -nosplit
Current
.Nm
driver was written by
.An Alexander Yurchenko Aq grange@openbsd.org .
.Sh BUGS
The driver doesn't support I2C commands with data buffer size more
than 2 bytes.
