openbsd/src/share/man/man4/piixpm.4
.\"	$OpenBSD: piixpm.4,v 1.3 2005/09/30 20:34:24 jaredy Exp $
.\"
.\" Copyright (c) 2004 Alexander Yurchenko <grange@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd September 16, 2004
.Dt PIIXPM 4
.Os
.Sh NAME
.Nm piixpm
.Nd Intel PIIX Power Management
.Sh SYNOPSIS
.Cd "piixpm* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Intel PIIX Power Management controller.
Only power management timer is supported for now.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Poul-Henning Kamp Aq phk@FreeBSD.ORG
for
.Fx
and ported to
.Ox
by
.An Thorsten Lockert Aq tholo@openbsd.org .
