openbsd/src/share/man/man4/pms.4
.\" $OpenBSD: pms.4,v 1.7 2002/09/26 22:09:53 miod Exp $
.\" $NetBSD: pms.4,v 1.4 2000/07/05 15:45:34 msaitoh Exp $
.\"
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"          This product includes software developed for the
.\"          NetBSD Project.  See http://www.netbsd.org/ for
.\"          information about NetBSD.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" <<Id: LICENSE,v 1.2 2000/06/14 15:57:33 cgd Exp>>
.\"
.Dd March 12, 1997
.Dt PMS 4
.Os
.Sh NAME
.Nm pms ,
.Nm pmsi
.Nd PS/2 auxiliary port mouse driver
.Sh SYNOPSIS
.Cd "pms* at pckbc?"
.Cd "pmsi* at pckbc?"
.Cd "wsmouse* at pms?"
.Cd "wsmouse* at pmsi?"
.Sh DESCRIPTION
The
.Nm pms
drivers provide an interface to PS/2 auxiliary port mice within the
.Xr wscons 4
framework.
Parent device in terms of the autoconfiguration framework is
.Xr pckbc 4 ,
the PC keyboard controller.
.Dq pms
is a generic driver which supports 2 coordinate axes and 3 buttons.
The
.Dq pmsi
variant provides specific support for wheel mice of the
.Dq IntelliMouse
breed; wheel movements are mapped to a third (z-) axis.
Mouse related data are accessed by
.Xr wsmouse 4
devices.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr lms 4 ,
.Xr mms 4 ,
.Xr pckbc 4 ,
.Xr ums 4 ,
.Xr wsmouse 4
