openbsd/src/share/man/man4/pnp.4
.\"	$OpenBSD: pnp.4,v 1.2 1998/03/09 02:45:52 millert Exp $
.\"
.\" Copyright (c) 1996, Shawn Hsiao <shawn@alpha.secc.fju.edu.tw>
.\" All rights reserved.
.\"
.\" Sujal M. Patel wrote initial codes for FreeBSD, and was ported to
.\" OpenBSD and extended by Shawn Hsiao.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 11, 1996
.Dt pnp 4
.Os
.Sh NAME
.Nm pnp
.Nd
Plug-and-Play devices probing and attaching
.Sh SYNOPSIS
.Cd "pnp0 at isa?"
.Sh DESCRIPTION
The
.Nm pnp
driver provides probing and attaching support for those cards compliant
with Plug and Play Specification V1.0a, published by Intel Corporation
and Microsoft Corporation.
.Pp
To make a plug-and-play device probed and attached, the
.Cm pnpid
of the device needs to be known in advance, and described in the
configuration file, e.g.
.Pp
.Cm "sb0	at isa? pnpid 0x31008c0e"
.Pp
or
.Pp
.Cm "ed0	at isa? pnpid 0x01228b11"
.Pp
The
.Cm pnpid
can be obtained by using
.Xr pnpinfo 8
utility.
.Sh BUGS
Many
.Pp
Memory descriptors are not yet supported, soon though.
.Pp
.Sh SEE ALSO
.Xr pnpinfo 8 ,
.Xr sb 4 ,
.Xr ed 4
.Sh HISTORY
The
.Nm pnp
device driver appeared in
.Ox 1.2 .
