openbsd/src/share/man/man4/pppx.4
.\"	$OpenBSD: pppx.4,v 1.2 2013/01/29 18:21:55 jmc Exp $
.\"
.\" Copyright (c) 2013 YASUOKA Masahiko <yasuoka@yasuoka.net>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 29 2013 $
.Dt PPPX 4
.Os
.Sh NAME
.Nm pppx
.Nd PPP multiplexer device
.Sh SYNOPSIS
.Cd "pseudo-device pppx"
.Pp
.Fd #include <sys/socket.h>
.Fd #include <sys/ioctl.h>
.Fd #include <net/pipex.h>
.Sh DESCRIPTION
The
.Nm
driver works with the
.Xr npppd 8
daemon,
allocating a network interface for each Point-to-Point Protocol (PPP)
session by request from the daemon.
It also works with
.Xr pipex 4
to accelerate the performance of packet forwarding and supports ioctls
which are added by
.Xr pipex 4 .
.Pp
To use
.Nm
from
.Xr npppd 8
the administrator needs to configure the interface configuration in
.Xr npppd.conf 5 .
Also the administrator needs to enable
.Xr pipex 4
by setting
.Va net.pipex.enable
to
.Sq 1
using
.Xr sysctl 8 .
.Sh SEE ALSO
.Xr inet 4 ,
.Xr inet6 4 ,
.Xr pipex 4 ,
.Xr hostname.if 5 ,
.Xr npppd.conf 5 ,
.Xr netstart 8 ,
.Xr npppd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.3 .
.Sh AUTHORS
.An David Gwynne Aq dlg@openbsd.org
.An Claudio Jeker Aq claudio@openbsd.org
