openbsd/src/share/man/man4/pvbus.4
.\"	$OpenBSD: pvbus.4,v 1.3 2015/12/08 18:46:53 reyk Exp $
.\"
.\" Copyright (c) 2015 Reyk Floeter <reyk@openbsd.org>
.\" Copyright (c) 2006 Jason McIntyre <jmc@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: December 8 2015 $
.Dt PVBUS 4
.Os
.Sh NAME
.Nm pvbus
.Nd paravirtual device tree root
.Sh SYNOPSIS
.Cd "pvbus0 at mainbus0"
.Sh DESCRIPTION
.Nm
is used on virtual machines that are running on hypervisors.
It provides a pseudo-bus for all paravirtual devices that do not
attach to a well-known bus like
.Xr pci 4 .
The
.Nm
driver is responsible for detecting the hypervisor interface,
checking the capabilities, and attaching the paravirtual devices.
.Ss Supported hypervisors
.Bl -tag -width 13n -offset ind -compact
.It KVM
Kernel-based Virtual Machine
.It Hyper-V
Microsoft Hyper-V
.It Xr vmm 4
.Ox
virtual machine monitor
(VMM)
.It VMware
VMware vSphere Hypervisor and ESXi
.It Xen
Xen VMM
.El
.Pp
Note that a hypervisor can attempt to emulate other hypervisors, so
multiple hypervisor interfaces may be available on the same host.
.Ss VMware paravirtual devices
.Bl -tag -width 13n -offset ind -compact
.It Xr vmt 4
VMware Tools driver
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr intro 4 ,
.Xr mainbus 4 ,
.Xr vmm 4
.Sh HISTORY
The
.Nm
pseudo-bus first appeared in
.Ox 5.8 .
.Sh AUTHORS
The
.Nm
pseudo-bus was written by
.An Reyk Floeter Aq Mt reyk@openbsd.org .
