openbsd/src/share/man/man4/pwmbl.4
.\"	$OpenBSD: pwmbl.4,v 1.1 2019/10/21 20:53:11 kettenis Exp $
.\"
.\" Copyright (c) 2019 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 21 2019 $
.Dt PWMBL 4
.Os
.Sh NAME
.Nm pwmbl
.Nd PWM backlight controller
.Sh SYNOPSIS
.Cd "pwmbl* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for backlight controllers that are controlled
by a PWM signal.
.Sh SEE ALSO
.Xr intro 4 ,
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 6.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Krystian Lewandowski .
