openbsd/src/share/man/man4/qccpucp.4
.\"	$OpenBSD: qccpucp.4,v 1.1 2024/11/19 10:03:19 tobhe Exp $
.\"
.\" Copyright (c) 2024 Tobias Heider <tobhe@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 19 2024 $
.Dt QCCPUCP 4
.Os
.Sh NAME
.Nm qccpucp
.Nd Qualcomm CPUCP mailbox controller
.Sh SYNOPSIS
.Cd "qccpucp* at fdt?"
.Sh DESCRIPTION
The
.Nm
handles communication with the Qualcomm CPUSS Control Processor.
It is used as a doorbell for CPU frequency management via
.Xr scmi 4
on Qualcomm Snapdragon X Elite devices.
.Sh SEE ALSO
.Xr intro 4
.Xr scmi 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 7.7 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Tobias Heider Aq Mt tobhe@openbsd.org .
