openbsd/src/share/man/man4/qcdrm.4
.\"	$OpenBSD: qcdrm.4,v 1.1 2025/07/17 15:53:36 kettenis Exp $
.\"
.\" Copyright (c) 2025 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 17 2025 $
.Dt QCDRM 4
.Os
.Sh NAME
.Nm qcdrm
.Nd Qualcomm Snapdragon DRM subsystem
.Sh SYNOPSIS
.Cd "qcdrm* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the MSM Mobile Display Subsystem (MDSS)
found on the Qualcomm Snapdragon SoCs.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr drm 4 ,
.Xr qcdpc 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
.Sh BUGS
The
.Nm
driver does not implement any usable DRM functionality yet.
