openbsd/src/share/man/man4/qcdwusb.4
.\"	$OpenBSD: qcdwusb.4,v 1.1 2022/11/10 12:36:38 patrick Exp $
.\"
.\" Copyright (c) 2018 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 10 2022 $
.Dt QCDWUSB 4
.Os
.Sh NAME
.Nm qcdwusb
.Nd Qualcomm USB 3.0 glue logic
.Sh SYNOPSIS
.Cd "qcdwusb* at fdt?"
.Cd "xhci* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver controls the interface logic for the Synopsys DesignWare USB
3.0 controller on Qualcomm SoCs.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr xhci 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 7.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Patrick Wildt Aq Mt patrick@blueri.se .
