openbsd/src/share/man/man4/qcpmic.4
.\"	$OpenBSD: qcpmic.4,v 1.1 2022/11/10 12:57:08 patrick Exp $
.\"
.\" Copyright (c) 2022 Patrick Wildt <patrick@blueri.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 10 2022 $
.Dt QCPMIC 4
.Os
.Sh NAME
.Nm qcpmic
.Nd Qualcomm Power Management IC
.Sh SYNOPSIS
.Cd "qcpmic* at qcspmi?"
.Cd "qcpmicgpio* at qcpmic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PMIC found on various Qualcomm
Snapdragon SoCs.
The functionality for the hardware blocks found in each PMIC is
implemented in the children attaching to this driver.
.Sh SEE ALSO
.Xr qcspmi 4 ,
.Xr qcpmicgpio 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Patrick Wildt Aq Mt patrick@blueri.se .
