openbsd/src/share/man/man4/qcuart.4
.\"	$OpenBSD: qcuart.4,v 1.1 2026/01/29 23:03:02 kettenis Exp $
.\"
.\" Copyright (c) 2026 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 29 2026 $
.Dt QCUART 4
.Os
.Sh NAME
.Nm qcuart
.Nd Qualcomm GENI UART
.Sh SYNOPSIS
.Cd "qcuart* at acpi?"
.Cd "qcuart* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver supports the Qualcomm GENI UIART.
.Sh SEE ALSO
.Xr tty 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.9 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
