openbsd/src/share/man/man4/ral.4
.\" $OpenBSD: ral.4,v 1.9 2005/03/09 09:05:41 damien Exp $
.\"
.\" Copyright (c) 2005
.\"	Damien Bergamini <damien.bergamini@free.fr>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd February 15, 2005
.Os
.Dt RAL 4
.Sh NAME
.Nm ral
.Nd Ralink Technology RT2500 IEEE 802.11b/g wireless network driver
.Sh SYNOPSIS
.Cd "ral* at cardbus?"
.Cd "ral* at pci?"
.Sh DESCRIPTION
The
.Nm
driver supports PCI/CardBus wireless adapters based on the Ralink RT2500
chipset.
.Pp
These are the modes the
.Nm
driver can operate in:
.Bl -tag -width "IBSS-masterXX"
.It BSS mode
Also known as
.Em infrastructure
mode, this is used when associating with an access point, through
which all traffic passes.
This mode is the default.
.It IBSS mode
Also known as
.Em IEEE ad-hoc
mode or
.Em peer-to-peer
mode.
This is the standardized method of operating without an access point.
Stations associate with a service set.
However, actual connections between stations are peer-to-peer.
.It monitor mode
In this mode the driver is able to receive packets without
associating with an access point.
This disables the internal receive filter and enables the card to
capture packets from networks which it wouldn't normally have access to,
or to scan for access points.
.El
.Pp
.Nm
supports software WEP.
Wired Equivalent Privacy (WEP) is the de facto encryption standard
for wireless networks.
It can be typically configured in one of three modes:
no encryption; 40-bit encryption; or 104-bit encryption.
Unfortunately, due to serious weaknesses in WEP protocol
it is strongly recommended that it not be used as the
sole mechanism to secure wireless communication.
WEP is not enabled by default.
.Sh CONFIGURATION
The
.Nm
driver can be configured at runtime with
.Xr ifconfig 8
or on boot with
.Xr hostname.if 5
using the following parameters:
.Bl -tag -width Ds
.It Cm bssid Ar bssid
Set the desired BSSID.
.It Fl bssid
Unset the desired BSSID.
The interface will automatically select a BSSID in this mode, which is
the default.
.It Cm chan Ar n
Set the channel (radio frequency) to be used by the driver based on
the given channel ID
.Ar n .
.It Fl chan
Unset the desired channel to be used by the driver.
The driver will automatically select a channel in this mode, which is
the default.
.It Cm media Ar media
The
.Nm
driver supports the following
.Ar media
types:
.Pp
.Bl -tag -width autoselect -compact
.It Cm autoselect
Enable autoselection of the media type and options.
.It Cm DS1
Set 802.11b DS 1Mbps operation.
.It Cm DS2
Set 802.11b DS 2Mbps operation.
.It Cm DS5
Set 802.11b DS 5.5Mbps operation.
.It Cm DS11
Set 802.11b DS 11Mbps operation.
.It Cm OFDM6
Set 802.11g OFDM 6Mbps operation.
.It Cm OFDM9
Set 802.11g OFDM 9Mbps operation.
.It Cm OFDM12
Set 802.11g OFDM 12Mbps operation.
.It Cm OFDM18
Set 802.11g OFDM 18Mbps operation.
.It Cm OFDM24
Set 802.11g OFDM 24Mbps operation.
.It Cm OFDM36
Set 802.11g OFDM 36Mbps operation.
.It Cm OFDM48
Set 802.11g OFDM 48Mbps operation.
.It Cm OFDM54
Set 802.11g OFDM 54Mbps operation.
.El
.It Cm mediaopt Ar opts
The
.Nm
driver supports the following media options:
.Pp
.Bl -tag -width monitor -compact
.It Cm ibss
Select IBSS operation.
.It Cm monitor
Select monitor mode.
.El
.It Fl mediaopt Ar opts
Disable the specified media options on the driver and returns it to the
default mode of operation (BSS).
.It Cm mode Ar mode
The
.Nm
driver supports the following modes:
.Pp
.Bl -tag -width 11b -compact
.It Cm 11b
Force 802.11b operation.
.It Cm 11g
Force 802.11g operation.
.El
.It Cm nwid Ar id
Set the network ID.
The
.Ar id
can either be any text string up to 32 characters in length,
or a series of hexadecimal digits up to 64 digits.
An empty
.Ar id
string allows the interface to connect to any available access points.
By default the
.Nm
driver uses an empty string.
.It Cm nwkey Ar key
Enable WEP encryption using the specified
.Ar key .
The
.Ar key
can either be a string, a series of hexadecimal digits (preceded by
.Sq 0x ) ,
or a set of keys of the form
.Dq n:k1,k2,k3,k4 ,
where
.Sq n
specifies which of the keys will be used for transmitted packets,
and the four keys,
.Dq k1
through
.Dq k4 ,
are configured as WEP keys.
If a set of keys is specified, a comma
.Pq Sq \&,
within the key must be escaped with a backslash.
Note that if multiple keys are used, their order must be the same within
the network.
.Nm
is capable of using both 40-bit (5 characters or 10 hexadecimal digits)
or 104-bit (13 characters or 26 hexadecimal digits) keys.
.It Fl nwkey
Disable WEP encryption.
This is the default mode of operation.
.El
.Sh HARDWARE
The following adapters should work:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It A-Link WL54H PCI
.It A-Link WL54PC CardBus
.It Amigo AWI-914W CardBus
.It Amigo AWI-922W mini-PCI
.It Amigo AWI-926W PCI
.It AMIT WL531C CardBus
.It AMIT WL531P PCI
.It AOpen AOI-831 PCI
.It ASUS WL-107G CardBus
.It ASUS WL-130g PCI
.It Atlantis Land A02-PCI-W54 PCI
.It Atlantis Land A02-PCM-W54 CardBus
.It Belkin F5D7000 v3 PCI
.It Belkin F5D7010 v2 CardBus
.It Billionton MIWLGRL mini-PCI
.It Canyon CN-WF511 PCI
.It Canyon CN-WF513 CardBus
.It CC&C WL-2102 CardBus
.It CNet CWC-854 CardBus
.It CNet CWP-854 PCI
.It Compex WL54G CardBus
.It Compex WLP54G PCI
.It Conceptronic C54RC CardBus
.It Conceptronic C54Ri PCI
.It Digitus DN-7001G-RA CardBus
.It Digitus DN-7006G-RA PCI
.It E-Tech WGPC02 CardBus
.It E-Tech WGPI02 PCI
.It Edimax EW-7108PCg CardBus
.It Edimax EW-7128g PCI
.It Eminent EM3036 CardBus
.It Eminent EM3037 PCI
.It Encore ENLWI-G-RLAM PCI
.It Encore ENPWI-G-RLAM CardBus
.It Fiberline WL-400P PCI
.It Fibreline WL-400X CardBus
.It Gigabyte GN-WIKG mini-PCI
.It Gigabyte GN-WMKG CardBus
.It Gigabyte GN-WPKG PCI
.It Hawking HWC54GR CardBus
.It Hawking HWP54GR PCI
.It iNexQ CR054g-009 (R03) PCI
.It JAHT WN-4054P CardBus
.It JAHT WN-4054PCI PCI
.It LevelOne WNC-0301 v2 PCI
.It LevelOne WPC-0301 v2 CardBus
.It Linksys WMP54G v4 PCI
.It Micronet SP906GK PCI
.It Micronet SP908GK V3 CardBus
.It Minitar MN54GCB-R CardBus
.It Minitar MN54GPC-R PCI
.It MSI CB54G2 CardBus
.It MSI MP54G2 mini-PCI
.It MSI PC54G2 PCI
.It OvisLink EVO-W54PCI PCI
.It PheeNet HWL-PCIG/RA PCI
.It Pro-Nets CB80211G CardBus
.It Pro-Nets PC80211G PCI
.It Repotec RP-WB7108 CardBus
.It Repotec RP-WP0854 PCI
.It SATech SN-54C CardBus
.It SATech SN-54P PCI
.It Sitecom WL-112 CardBus
.It Sitecom WL-115 PCI
.It SparkLAN WL-685R CardBus
.It Surecom EP-9321-g PCI
.It Surecom EP-9321-g1 PCI
.It Surecom EP-9428-g CardBus
.It Sweex LC500050 CardBus
.It Sweex LC700030 PCI
.It TekComm NE-9321-g PCI
.It TekComm NE-9428-g CardBus
.It Unex CR054g-R02 PCI
.It Unex MR054g-R02 CardBus
.It Zinwell ZWX-G160 CardBus
.It Zinwell ZWX-G360 mini-PCI
.It Zinwell ZWX-G361 PCI
.It Zonet ZEW1500 CardBus
.It Zonet ZEW1600 PCI
.El
.Sh EXAMPLES
The following
.Xr hostname.if 5
example configures ral0 to join whatever network is available on boot,
using WEP key
.Dq 0x1deadbeef1 ,
channel 11, obtaining an IP address using DHCP:
.Bd -literal -offset indent
dhcp NONE NONE NONE nwkey 0x1deadbeef1 chan 11
.Ed
.Pp
Configure ral0 for WEP, using hex key
.Dq 0x1deadbeef1 :
.Bd -literal -offset indent
# ifconfig ral0 nwkey 0x1deadbeef1
.Ed
.Pp
Return ral0 to its default settings:
.Bd -literal -offset indent
# ifconfig ral0 -bssid -chan media autoselect -mediaopt \e
	nwid "" -nwkey
.Ed
.Pp
Join an existing BSS network,
.Dq my_net :
.Bd -literal -offset indent
# ifconfig ral0 192.168.1.1 netmask 0xffffff00 nwid my_net
.Ed
.Sh DIAGNOSTICS
.Bl -diag
.It "ral%d: device timeout"
The driver will reset the hardware.
This should not happen.
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr cardbus 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Rs
.%T Ralink Technology
.%O http://www.ralinktech.com
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.7 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Damien Bergamini Aq damien@openbsd.org .
.Sh CAVEATS
PCI
.Nm
adapters seem to strictly require a system supporting PCI 2.2 or greater and
will likely not work in systems based on older revisions of the PCI
specification.
