openbsd/src/share/man/man4/random.4
.\"	$OpenBSD: random.4,v 1.1 1996/12/17 22:56:03 millert Exp $
.\"
.\" Copyright (c) 1996 Michael Shalayeff
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Michael Shalayeff.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd March 25, 1996
.Dt RND 4
.Os OpenBSD
.Sh NAME
.Nm random
.Nm srandom
.Nm urandom
.Nm prandom
.Nd random data source devices.
.Sh SYNOPSIS
.Cd "pseudo-device random"
.Sh DESCRIPTION
The
.Nm
device produces random data, with different random quality.
{s,u}random devices generates random data based on the system activity
(like disk and network devices).
.Pp
.Bl -hang -width Ds
.It random
reserved for nuclear noise generators.
.It srandom
strong random data.
.It urandom
same as above, but does not guaranties the data to be strong.
.It prandom
simple pseudo-random generator (as it is in the kernel).
.Sh SEE ALSO
random(9)
.Sh FILES
.Bl -tag -width /dev/random, /dev/srandom, /dev/urandom, /dev/prandom
.It Pa /dev/random, /dev/srandom, /dev/urandom, /dev/prandom
.El
.Sh HISTORY
An
.Nm
device appeared in Linux operating system.
