openbsd/src/share/man/man4/random.4
.\"	$OpenBSD: random.4,v 1.2 1997/06/15 03:41:49 mickey Exp $
.\"
.\" Copyright (c) 1996, 1997 Michael Shalayeff
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Michael Shalayeff.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd March 25, 1996
.Dt RND 4
.Os OpenBSD
.Sh NAME
.Nm random ,
.Nm srandom ,
.Nm urandom ,
.Nm prandom ,
.Nm arandom
.Nd random data source devices.
.Sh SYNOPSIS
.Fd #include <sys/types.h>
.Fd #include <dev/rndvar.h>
.Fd #include <dev/rndioctl.h>
.Sh DESCRIPTION
The
.Nm
device produces random data, with different random quality.
{u,s,a}random devices generates random data based on the system activity
(like disk and network devices).
.Pp
.Bl -hang -width /dev/srandomXXX
.It /dev/random
reserved for nuclear noise generators.
.It /dev/srandom
strong random data.
.It /dev/urandom
same as above, but does not guaranties the data to be strong.
.It /dev/prandom
simple pseudo-random generator (as it is in the kernel).
.It /dev/arandom
aRC4 hashed data (as apposed to the {u,s}random, as they are MD5).
.Sh SEE ALSO
.Xr random 9 ,
.Xr random 3 ,
.Xr md5 9 ,
.Xr md5 3 ,
.Xr arc4random 3 .
.Sh FILES
.Bl -tag -width /dev/srandom
.It Pa /dev/random, /dev/srandom, /dev/urandom, /dev/prandom, /dev/arandom
.El
.Sh BUGS
No randomness testing suite provided.
.Sh HISTORY
An
.Nm
device first appeared in Linux operating system.
.Pp
aRC4 routines added by David Mazieres.
