openbsd/src/share/man/man4/random.4
.\"	$OpenBSD: random.4,v 1.23 2010/10/03 23:14:22 tedu Exp $
.\"
.\" Copyright (c) 1996, 1997 Michael Shalayeff
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: October 3 2010 $
.Dt RANDOM 4
.Os
.Sh NAME
.Nm random ,
.Nm arandom
.Nd random data source devices
.Sh SYNOPSIS
.Fd #include <sys/types.h>
.Fd #include <dev/rndvar.h>
.Fd #include <dev/rndioctl.h>
.Sh DESCRIPTION
The various
.Nm
devices produce random output data with different random qualities.
Entropy data is collected from system activity (like disk and
network device interrupts and such), and then run through various
hash or message digest functions to generate the output.
.Bl -hang -width /dev/arandomX
.It Pa /dev/random
This device is reserved for future support of hardware
random generators.
.It Pa /dev/arandom
As required, entropy pool data re-seeds an ARC4 generator,
which then generates high-quality pseudo-random output data.
.Pp
The
.Xr arc4random 3
function in userland libraries seeds itself from this device,
providing a second level of ARC4 hashed data.
.El
.Sh FILES
.Bl -tag -width /dev/arandom -compact
.It Pa /dev/random
.It Pa /dev/arandom
.El
.Sh SEE ALSO
.Xr arc4random 3 ,
.Xr md5 3 ,
.Xr random 3 ,
.Xr amdpm 4 ,
.Xr glxsb 4 ,
.Xr pchb 4 ,
.Xr md5 9 ,
.Xr random 9
.Sh HISTORY
A
.Nm
device first appeared in the Linux operating system.
This is a cloned interface.
.Pp
Previous versions of
.Ox
included the
.Nm srandom
and
.Nm urandom
devices.
These interfaces have been deprecated and replaced with
.Nm arandom .
.Pp
ARC4 routines added by David Mazieres.
.Sh BUGS
No randomness testing suite provided.
