openbsd/src/share/man/man4/ray.4
.\"	$OpenBSD: ray.4,v 1.24 2008/04/17 14:01:22 jmc Exp $
.\"	$NetBSD: ray.4,v 1.5 2000/02/28 13:54:55 enami Exp $
.\"
.\" Copyright (c) 2000 Christian E. Hopps
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: April 17 2008 $
.Dt RAY 4
.Os
.Sh NAME
.Nm ray
.Nd Raytheon Raylink/WebGear Aviator IEEE 802.11FH wireless network device
.Sh SYNOPSIS
.Cd "ray* at pcmcia?"
.Cd "option RAY_PID_COUNTRY_CODE_DEFAULT=RAY_PID_COUNTRY_CODE_USA"
.Sh DESCRIPTION
The
.Nm
device driver supports the Raytheon Raylink and Aviator 2.4/PRO
802.11 Frequency Hopping 2Mbps wireless PCMCIA cards.
.Pp
The device uses IEEE 802.11 standard Frequency Hopping Spread Spectrum
signaling and operates in the ranges of 2.400 to 2.4835 Gigahertz.
This frequency range is further restricted by country according to
that country's regulations.
Currently the
.Nm
driver defaults to using the ranges appropriate for the USA.
To change this setting, define the kernel option
.Dv RAY_PID_COUNTRY_CODE_DEFAULT
to one of the following values:
.Bd -literal -offset indent
RAY_PID_COUNTRY_CODE_USA
RAY_PID_COUNTRY_CODE_EUROPE
RAY_PID_COUNTRY_CODE_JAPAN
RAY_PID_COUNTRY_CODE_KOREA
RAY_PID_COUNTRY_CODE_SPAIN
RAY_PID_COUNTRY_CODE_FRANCE
RAY_PID_COUNTRY_CODE_ISRAEL
RAY_PID_COUNTRY_CODE_AUSTRALIA
.Ed
.Pp
These are the modes the
.Nm
driver can operate in:
.Bl -tag -width "IBSS-masterXX"
.It BSS mode
Also known as
.Em infrastructure
mode, this is used when associating with an access point, through
which all traffic passes.
This mode is the default.
.It IBSS mode
Also known as
.Em IEEE ad-hoc
mode or
.Em peer-to-peer
mode.
This is the standardized method of operating without an access point.
Stations associate with a service set.
However, actual connections between stations are peer-to-peer.
.El
.Pp
The
.Nm
driver can be configured at runtime with
.Xr ifconfig 8
or on boot with
.Xr hostname.if 5 .
.Sh HARDWARE
Cards supported by the
.Nm
driver include:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Raytheon Raylink WLAN
.It WebGear Aviator 2.4
.It WebGear Aviator PRO
.El
.Sh EXAMPLES
The following
.Xr hostname.if 5
example configures ray0 to join whatever network is available on boot,
channel 11, obtaining an IP address using DHCP:
.Bd -literal -offset indent
dhcp NONE NONE NONE chan 11
.Ed
.Pp
Return ray0 to its default settings:
.Bd -literal -offset indent
# ifconfig ray0 -bssid -chan media autoselect nwid ""
.Ed
.Pp
Join an existing BSS network,
.Dq my_net :
.Bd -literal -offset indent
# ifconfig ray0 192.168.1.1 netmask 0xffffff00 nwid my_net
.Ed
.Sh DIAGNOSTICS
.Bl -diag
.It "ray0: card failed self test: status x"
Indicates the card has failed its initial startup tests.
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pcmcia 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Nx 1.5 .
.Ox
support was added in
.Ox 2.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Christian E. Hopps Aq chopps@netbsd.org
and ported to
.Ox
by
.An Michael Shalayeff Aq mickey@openbsd.org .
.Sh BUGS
Currently the infrastructure mode is untested, and authentication
using WEP is unimplemented.
.Pp
Firmware version 4 does not interop with version 5 or higher.
