openbsd/src/share/man/man4/rd.4
.\"   $OpenBSD: rd.4,v 1.5 2013/10/18 15:11:07 deraadt Exp $
.\"
.\" This file is in the public domain.
.\"
.Dd $Mdocdate: October 18 2013 $
.Dt RD 4
.Os
.Sh NAME
.Nm rd
.Nd ramdisk driver
.Sh SYNOPSIS
.Cd "pseudo-device rd" Op Ar count
.Sh DESCRIPTION
The
.Nm
driver enables use of system or user memory as a disk.
Memory for the disk must be allocated and initialized inside the
kernel image at build-time using the
.Nm elfrdsetroot ( Xr elf 5 )
tool.
.Sh FILES
.Bl -tag -width /dev/rrdXX -compact
.It Pa "/dev/rd??"
block mode ramdisk devices.
.It Pa "/dev/rrd??"
raw mode ramdisk devices.
.El
.Sh SEE ALSO
The
.Nm elfrdsetroot
tool is available as part of the distribution toolset.
