openbsd/src/share/man/man4/rgephy.4
.\"	$OpenBSD: rgephy.4,v 1.9 2009/07/31 14:20:29 jmc Exp $
.\"
.\" Copyright (c) 2004 Peter Valchev <pvalchev@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 31 2009 $
.Dt RGEPHY 4
.Os
.Sh NAME
.Nm rgephy
.Nd Realtek 8169S/8110S/8211B/8211C 10/100/Gigabit Ethernet PHY
.Sh SYNOPSIS
.Cd "rgephy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver supports the internal PHY found on Realtek 8169S/8110S
Ethernet adapters and the external 8211B/8211C PHY.
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr mii 4 ,
.Xr ifconfig 8
