openbsd/src/share/man/man4/rkrng.4
.\"	$OpenBSD: rkrng.4,v 1.1 2020/04/03 16:38:53 kettenis Exp $
.\"
.\" Copyright (c) 2020 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 3 2020 $
.Dt RKRNG 4
.Os
.Sh NAME
.Nm rkrng
.Nd Amlogic random number generator
.Sh SYNOPSIS
.Cd "rkrng* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the random number generator found on the
Rockchip SoCs.
.Pp
It feeds the random subsystem's entropy pool with 256 bits of random
data every second.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr random 4 ,
.Xr arc4random 9
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
