openbsd/src/share/man/man4/rln.4
.\"	$OpenBSD: rln.4,v 1.20 2004/09/30 19:59:25 mickey Exp $
.\"
.\" David Leonard <d@openbsd.org>, 1999. Public Domain.
.\"
.\" Driver for the Proxim RangeLAN2 wireless network adaptor.
.\"
.\" Information and ideas gleaned from disassembly of Dave Koberstein's
.\" <davek@komacke.com> Linux driver (apparently based on Proxim source),
.\" from Yoichi Shinoda's <shinoda@cs.washington.edu> BSDI driver, and
.\" Geoff Voelker's <voelker@cs.washington.edu> Linux port of the same.
.\"
.\"
.Dd April 2, 1999
.Dt RLN 4
.Os
.Sh NAME
.Nm rln
.Nd device driver for RangeLAN2-based wireless network cards
.Sh SYNOPSIS
.Cd "rln0 at isa? port 0x270 flags 0x00"
.\" .Cd "rln* at isapnp? flags 0x00"
.Cd "rln* at pcmcia? flags 0x00"
.Sh DESCRIPTION
The
.Nm
device driver supports at least the following cards:
.Bl -bullet -compact
.It
Proxim RangeLAN2 7100 ISA Card
.\" .It
.\" Proxim RangeLAN2 630x Mini ISA OEM Module
.\" .It
.\" Proxim RangeLAN2 633x Micro design-in module
.It
Symphony PC Cards
.\" .It
.\" Symphony PnP ISA Card
.It
Proxim RangeLAN2 7200 Two Piece PC Card
.It
Proxim RangeLAN2 7400 One Piece PC Card
.It
Digital RoamAbout FH 2400 PC-Card
.It
AMP Wireless PC-Card
.El
.Pp
The Proxim RangeLAN2 air protocol is incompatible with the older
RangeLAN(1) cards, Lucent Technologies' WaveLan cards, and with
the newer 802.11 cards in general.
.Pp
The RangeLAN2 cards communicate using an Ethernet-like protocol
over the 2.4\(em2.483GHz part of the spectrum.
This frequency happens to coincide with that of strong harmonics emitted
by common consumer microwave ovens.
You can guess the rest.
Depending on the channel condition, the NICs operate in one of two
modes: 1.6Mb/s or 0.8Mb/s signalling rate.
.\" .Sh CONFIGURATION
.\" Because there is no reliable way to determine between
.\" the different types of cards listed above,
.\" the following flags can be specified in the kernel config file:
.\" .Pp
.\" .Bl -tag -offset indent -width 10n -compact
.\" .It RangeLAN2 630x series (Mini ISA)
.\" .Cd flags 1
.\" .It RangeLAN2 633x series (Micro ISA)
.\" .Cd flags 3
.\" .It Symphony PnP ISA
.\" .Cd flags 3
.\" .El
.\" .Pp
.\" Flags can be omitted for devices not listed here, and PC-Card devices.
.Pp
In the event of errors, the card can be reset by using
.Xr ifconfig 8
to bring the card down, then up.
.Sh MEDIA SELECTION
Not supported.
The medium used by the device is always air.
.Sh DIAGNOSTICS
.Bl -diag
.It "rln0: hardware fault"
The card reported a hardware fault condition.
Check the antenna.
The interface is automatically marked down.
.It "rln0: synchronised to ? (?) channel ?/?"
The card has successfully synchronised with a nearby unit.
Packets are only transmitted when the unit has synchronised with
another.
.It "rln0: lost sync"
Synchronisation was lost.
Check for microwave ovens being used.
.It "rln0: nothing to sync to; now master"
The card was unsuccessful in (re-)synchronising with any other unit,
and was configured as an alternate master.
.It "rln0: packet too big (? > ?)"
The card generated a message bigger than the maximum size allowable for
Ethernet.
.It "rln0: command error 0x?? command ??"
The card reported an error condition in the host-card protocol.
.It "rln0: reset timeout"
An attempt to hard reset the card failed.
This is either a serious hardware fault, or a bus conflict.
.It "rln0: tx_request timed out, status 0x??"
The host-to-card message transfer protocol timed out.
This could mean a duplex transfer is in progress and the interrupt service
routine has not run.
Check the CPU load.
.It "rln0: lost message ?? seq ?"
An expected response to the command did not appear within a reasonable time.
.It "rln0: unknown RangeLAN2 wireless network card"
The card model was not matched in the known-card tables.
.El
.Sh SEE ALSO
.Xr cnw 4 ,
.Xr intro 4 ,
.Xr isa 4 ,
.\" .Xr isapnp 4 ,
.Xr netintro 4 ,
.Xr pcmcia 4 ,
.Xr ifconfig 8
.Pa http://www.proxim.com/
.Sh AUTHORS
David Leonard,
Dept Computer Science and Electrical Engineering, University of Queensland
.Aq david.leonard@csee.uq.edu.au .
.Pp
Information and ideas gleaned from disassembly of Dave Koberstein's
.Aq davek@komacke.com
Linux driver (which apparently uses Proxim code),
from Yoichi Shinoda's
.Aq shinoda@cs.washington.edu
BSDI driver, and
Geoff Voelker's
.Aq voelker@cs.washington.edu
Linux port of the same.
.Sh BUGS
This driver has not been tested with lots of cards, so there are bound
to be subtle timing problems with different hardware.
It should also work with the Symphony PC cards.
.Pp
I couldn't figure out how to make roaming work, nor how to interpret
the RSSI link quality values.
.Pp
There is no way to change the channel or security ID on the card, or
to make it a master, except through source code.
This is because it is currently impossible under
.Ox
to trigger such changes through calls to
.Xr ioctl 2
on the interface.
.Pp
Oh, and transmit doesn't seem to work.
