openbsd/src/share/man/man4/rtii.4
.\"	$RuOBSD: rtii.4,v 1.3 2001/10/26 05:38:44 form Exp $
.\"
.\" Copyright (c) 2001 Vladimir Popov <jumbo@narod.ru>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
.\" ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 8, 2001
.Dt rtii 4
.Os
.Sh NAME
.Nm rtii
.Nd AIMS Lab Radiotrack II FM radio device driver
.Sh SYNOPSIS
.Cd "rtii0   at isa? port 0x20c"
.Cd "rtii0   at isa? port 0x30c"
.Cd "radio* at rtii0"
.Sh DESCRIPTION
The
.Nm
driver provides support for the AIMS Lab Radiotrack II FM radio tuners.
.Pp
The Radiotrack II is a stereo FM tuner that allows to tune in the range
87.5 - 108.0 MHz, report signal status on the current frequency, force
audio output to mono, perform hardware signal search, and has an internal
AFC.
.Pp
The Radiotrack II cards take only one I/O port.
The I/O port is set by the driver to the value specified in the configuration
file and must be either 0x20c or 0x30c.
.Sh SEE ALSO
.Xr radio 4 ,
.Xr isa 4 .
.Sh AUTHORS
The
.Nm
driver was written by Vladimir Popov and Maxim Tsyplakov.
The man page was written by Vladimir Popov.
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 3.0 .
