openbsd/src/share/man/man4/rtw.4
.\"	$OpenBSD: rtw.4,v 1.3 2004/12/29 10:26:58 jmc Exp $
.\"
.\" Copyright (c) 2004 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd December 29, 2004
.Dt RTW 4
.Os
.Sh NAME
.Nm rtw
.Nd Realtek 8180 802.11 wireless network driver
.Sh SYNOPSIS
.Cd "rtw* at cardbus?"
.Cd "rtw* at pci?"
.Sh DESCRIPTION
The
.Nm
driver supports PCI/Cardbus 802.11b wireless adapters based on the
Realtek 8180.
.Pp
The operating mode is selected using the
.Xr ifconfig 8
utility.
For more information on configuring this device, see
.Xr ifconfig 8
and
.Xr ifmedia 4 .
.Sh SEE ALSO
.Xr arp 4 ,
.Xr cardbus 4 ,
.Xr ifmedia 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr ifconfig 8
.Rs
.%T Realtek
.%O http://www.realtek.com.tw
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 3.7 .
.Sh AUTHORS
The
.Nm
driver was written by
.An David Young
.Aq dyoung@NetBSD.org .
