openbsd/src/share/man/man4/safe.4
.\"	$OpenBSD: safe.4,v 1.3 2003/08/15 20:10:57 jason Exp $
.\\"-
.\\" Copyright (c) 2003	Sam Leffler, Errno Consulting
.\\" All rights reserved.
.\\"
.\\" Redistribution and use in source and binary forms, with or without
.\\" modification, are permitted provided that the following conditions
.\\" are met:
.\\" 1. Redistributions of source code must retain the above copyright
.\\"    notice, this list of conditions and the following disclaimer.
.\\" 2. Redistributions in binary form must reproduce the above copyright
.\\"    notice, this list of conditions and the following disclaimer in the
.\\"    documentation and/or other materials provided with the distribution.
.\\"
.\\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\\" SUCH DAMAGE.
.\\"
.\\" $FreeBSD: /repoman/r/ncvs/src/share/man/man4/safe.4,v 1.1 2003/07/21 21:52:14 sam Exp $
.\\"/
.Dd May 30, 2002
.Dt SAFE 4
.Os
.Sh NAME
.Nm safe
.Nd SafeNet crypto accelerator
.Sh SYNOPSIS
.Cd "safe* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
driver supports cards containing any of the following chips:
.Bl -tag -width "SafeNet 1141" -offset indent
.It SafeNet 1141
The original chipset.  Supports DES, Triple-DES, AES, MD5, and SHA-1
symmetric crypto operations, RNG, public key operations, and full IPsec
packet processing.
.It SafeNet 1741
A faster version of the 1141.
.El
.Pp
The
.Nm
driver registers itself to accelerate DES, Triple-DES, AES, MD5-HMAC,
and SHA1-HMAC operations for
.Xr ipsec 4
and
.Xr crypto 4 .
.Pp
On all models, the driver registers itself to provide random data to the
.Xr random 4
subsystem.
.Sh DIAGNOSTICS
.Bl -diag
.It "safe%d: Reduce max DMA size to %u words for rev %u.%u"
The 1.0 silicon has major
.Xr pci 4
bugs and may lock the bus completely.
There is no easy workaround.
.El
.Sh SEE ALSO
.Xr crypt 3 ,
.Xr crypto 4 ,
.Xr intro 4 ,
.Xr ipsec 4 ,
.Xr pci 4 ,
.Xr random 4 ,
.Xr crypto 9
.Sh BUGS
Public key support is not implemented and early silicon revisions can
wedge the PCI bus.
