openbsd/src/share/man/man4/sambat.4
.\"	$OpenBSD: sambat.4,v 1.1 2026/05/19 04:42:20 mglocker Exp $
.\"
.\" Copyright (c) 2026 Marcus Glocker <mglocker@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 19 2026 $
.Dt SAMBAT 4
.Os
.Sh NAME
.Nm sambat
.Nd Samsung laptop battery monitor
.Sh SYNOPSIS
.Cd "sambat* at iic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the embedded controller found in Samsung
laptops based on the Qualcomm Snapdragon X1E80100, such as the Galaxy
Book4 Edge.
The controller, identified as
.Dq SAM060B
in ACPI, is an ENE KB9058 micro controller running Samsung firmware,
and provides battery and AC adapter status over the I2C bus using a
vendor
.Dq Mbox
command protocol.
.Pp
Battery values are exposed through the
.Xr sysctl 8
sensor framework and the
.Xr apm 8
power management interface.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr apm 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 8.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Marcus Glocker Aq Mt mglocker@openbsd.org .
.Sh BUGS
The AC adapter online status is reported correctly at boot and after
the power cable is unplugged, but does not refresh after the cable
is plugged back in.
