openbsd/src/share/man/man4/san.4
.\"	$OpenBSD: san.4,v 1.5 2004/09/30 19:59:25 mickey Exp $
.\"
.\" Copyright (c) 2001-2004 Sangoma Technologies (SAN)
.\" All rights reserved.  www.sangoma.com
.\"
.\"This code is written by Alex Feldman <al.feldman@sangoma.com> for SAN.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above
.\"    copyright notice, this list of conditions and the following disclaimer
.\"    in the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of Sangoma Technologies nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY SANGOMA TECHNOLOGIES AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd June 25, 2004
.Dt SAN 4
.Os
.Sh NAME
.Nm san
.Nd Sangoma Technologies AFT T1/E1 Network driver
.Sh SYNOPSIS
.Cd "san* at pci?"
.Sh DESCRIPTION
The
.Nm
device driver supports the Sangoma Technologies Inc AFT Series Network
cards.
This includes the following models:
.Pp
.Bl -item -offset indent -compact
.It
Sangoma AFT A101 PCI
.It
Sangoma AFT A102 PCI
.El
.Pp
The following media types and options (as given to
.Xr ifconfig 8 )
are supported:
.Bl -tag -width xxx -offset indent
.It Cm media No T1
Configure Sangoma card for T1, B8ZS, ESF, all channels
(default).
.It Cm media No T1-AMI
Configure Sangoma card for T1, AMI, ESF, all channels.
.It Cm media No E1
Configure Sangoma card for E1, HDB3, NCRC4, all channels.
.It Cm media No E1-AMI
Configure Sangoma card for E1, AMI, NCRC4, all channels.
.El
.Pp
If no media options are present, the
.Nm
driver places the card into default mode (T1, B8ZS, ESF, all channels).
.Pp
Use
.Xr ifconfig 8
to change the timeslot range for this card.
The following format is supported:
.Bl -tag -width xxx -offset indent
.It Cm # ifconfig san0 timeslot all
Enable all channels for this card.
.It Cm # ifconfig san0 timeslot 1-10
Enable channels 1-10 for this card.
.It Cm # ifconfig san0 timeslot 1-10.14-15.20
Enable channels 1-10, 14-15 and 20 for this card.
.El
.Pp
If the timeslot option is not present, the
.Nm
driver configures the card to use all the channels.
.Sh DIAGNOSTICS
.Bl -diag
.It "san%d: couldn't map memory"
A fatal initialization error has occurred.
.It "san%d: No PCI memory allocated for CPU #B"
A fatal initialization error has occurred.
.It "san%d: couldn't map interrupt"
A fatal initialization error has occurred.
.It "san%d: IRQ not allocated"
A fatal initialization error has occurred.
.El
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr pci 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 3.6 .
.Sh AUTHORS
The
.Nm
device driver and this manual page were written by
Alex Feldman.
