openbsd/src/share/man/man4/schsio.4
.\"	$OpenBSD: schsio.4,v 1.2 2009/02/08 15:34:06 mk Exp $
.\"
.\" Copyright (c) 2009 Michael Knudsen <mk@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.Dd $Mdocdate: February 8 2009 $
.Dt SCHSIO 4
.Os
.Sh NAME
.Nm schsio
.Nd SMSC SCH311x LPC Super I/O
.Sh SYNOPSIS
.Cd "schsio* at isa? port 0x2e
.Cd "schsio* at isa? port 0x4e
.Cd "schsio* at isa? port 0x162e
.Cd "schsio* at isa? port 0x164e
.Sh DESCRIPTION
The
.Nm
driver provides support for the SMSC SCH3112, SCH3114, and SCH3116
ICs.
Among other things, the devices contain environment sensors, a watchdog
timer, and fan control.
The
.Nm
driver currently only supports the environment sensors.
The hardware provides the following sensors:
.Bl -column "Internal diode" "Units" "Typical" -offset indent
.It Sy "Sensor" Ta Sy "Units" Ta Sy "Typical use"
.It Li "Internal diode" Ta "uK" Ta "IC internal thermal diode"
.It Li "Remote diode 1" Ta "uK" Ta "External thermal diode"
.It Li "Remove diode 2" Ta "uK" Ta "External thermal diode"
.It Li "FAN1" Ta "RPM" Ta "Fan tachometer"
.It Li "FAN2" Ta "RPM" Ta "Fan tachometer"
.It Li "FAN3" Ta "RPM" Ta "Fan tachometer"
.It Li "+2.5V" Ta "uV" Ta "Voltage"
.It Li "+1.5V (Vccp)" Ta "uV" Ta "Voltage"
.It Li "+3.3V (VCC)" Ta "uV" Ta "Voltage"
.It Li "+5V" Ta "uV" Ta "Voltage"
.It Li "+12V" Ta "uV" Ta "Voltage"
.It Li "+3.3V (VTR)" Ta "uV" Ta "Voltage"
.It Li "+3V (Vbat)" Ta "uV" Ta "Voltage"
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr isa 4 ,
.Xr watchdog 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.5 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Michael Knudsen Aq mk@openbsd.org .
