openbsd/src/share/man/man4/sdtemp.4
.\"	$OpenBSD: sdtemp.4,v 1.3 2008/04/09 22:04:11 deraadt Exp $
.\"
.\" Copyright (c) 2008 Theo de Raadt <deraadt@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 9 2008 $
.Dt SDTEMP 4
.Os
.Sh NAME
.Nm sdtemp
.Nd SO-DIMM (JC-42.4) temperature sensor
.Sh SYNOPSIS
.Cd "sdtemp* at iic?"
.Sh DESCRIPTION
The
.Nm
driver retrieves temperature sensor information from memory
modules which contain sensor chips defined in JEDEC JC-42.4.
.Pp
Current sensor chips include the NPX SE97, NPX SE98, Microchip MCP9805,
and AD ADT7408.
.Sh SEE ALSO
.Xr iic 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 4.4 .
