openbsd/src/share/man/man4/se.4
.\"	$OpenBSD: se.4,v 1.2 2010/04/02 21:29:04 deraadt Exp $
.\"
.\" Copyright (c) 2010
.\"	Christopher Zimmermann <madroach@zakweb.de>. All rights reserved.
.\" Copyright (c) 1997, 1998, 1999
.\"	Bill Paul <wpaul@ee.columbia.edu>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/sis.4,v 1.2 1999/11/15 23:14:27 phantom Exp $
.\"
.Dd $Mdocdate: April 2 2010 $
.Dt SIS 4
.Os
.Sh NAME
.Nm sis
.Nd "SiS 190 10/100(/1000) Ethernet device"
.Sh SYNOPSIS
.Cd "sis* at pci?"
.Cd "rlphy* at mii?"
.Sh DESCRIPTION
The
.Nm
.An driver provides support for the Fast Ethernet controler SiS190
integrated into the SiS965L and SiS966L southbridges. The SiS191
gigabit controler in the SiS965 and SiS966 southbridges is not yet
supported. If you own such hardware and want to help please contact
.Aq madroach@zakweb.de
or the
.Aq tech@openbsd.org
mailing list.
.Pp
The SiS 190/191 are 100Mbps Ethernet MACs with external PHY. It uses a bus
master DMA and a scatter/gather descriptor scheme and includes a 64-bit
multicast hash filter.
.Pp
The
.Nm
driver supports the following media types:
.Bl -tag -width full-duplex
.It autoselect
Enable autoselection of the media type and options.
The user can manually override
the autoselected mode by adding media options to the
.Xr hostname.if 5
file.
.It 10baseT
Set 10Mbps operation.
The
.Ar mediaopt
option can also be used to select either
.Ar full-duplex
or
.Ar half-duplex
modes.
.It 100baseTX
Set 100Mbps (Fast Ethernet) operation.
The
.Ar mediaopt
option can also be used to select either
.Ar full-duplex
or
.Ar half-duplex
modes.
.El
.Pp
The
.Nm
driver supports the following media options:
.Bl -tag -width full-duplex
.It full-duplex
Force full duplex operation.
.It half-duplex
Force half duplex operation.
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh DIAGNOSTICS
.Bl -diag
.It "seN: couldn't map ports/memory"
A fatal initialization error has occurred.
.It "seN: couldn't map/establish interrupt"
A fatal initialization error has occurred.
.It "seN: EEPROM read timeout"
The driver could not acquire the controlers MAC address by EEPROM.
.It "seN: Could not find ISA bridge to retrieve MAC address"
The driver could not acquire the controlers MAC address by CMOS.
.It "seN: MIIBUS timeout"
The driver could not talk to PHY
.It "seN: cannot init the RX map array!"
A fatal initialization error has occurred.
.It "seN: cannot init the RX map array!"
A fatal initialization error has occurred.
.It "seN: no memory for rx/tx list buffers"
The driver failed to allocate an mbuf for the receiver/transmitter ring.
.It "seN: can't map rx/tx list buffers"
The driver failed to map DMA memory for the receiver/transmitter ring.
.It "seN: can't alloc rx/tx list buffers"
The driver failed to create DMA map for the receiver/transmitter ring.
.It "seN: can't load rx/tx ring mapping"
The driver failed to load the DMA mapping for the receiver/transmitter ring.
.It "seN: unable to allocate MBUF"
.It "seN: initialization failed: no memory for rx buffers"
The driver failed allocate memory for a receive or transmit buffer.
.It "seN: unable to load MBUF"
The driver failed to load the DMA mapping for a receive or transmit buffer.
.It "seN: watchdog timeout"
The device has stopped responding to the network, or there is a problem with
the network connection (cable).
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr rlphy 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Ox
support was added in
.Ox 4.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Bill Paul Aq wpaul@ee.columbia.edu , 
.An ported to FreeBSD by Alexander Pohoyda Aq alexander.pohoyda@gmx.net
and ported to
.Ox
by
.An Christopher Zimmermann Aq madroach@zakweb.de .
