openbsd/src/share/man/man4/sequencer.4
.\" $OpenBSD: sequencer.4,v 1.6 2008/06/26 05:42:07 ray Exp $
.\" $NetBSD: midi.4,v 1.4 1998/08/22 14:45:35 augustss Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: June 26 2008 $
.Dt SEQUENCER 4
.Os
.Sh NAME
.Nm sequencer
.Nd OSS-compatible MIDI sequencer device
.Sh SYNOPSIS
.Cd "pseudo-device sequencer" Op Ar count
.Pp
.Fd #include <sys/types.h>
.Fd #include <sys/midiio.h>
.Sh DESCRIPTION
The
.Nm
device provides an event-oriented interface simultaneously
to all MIDI ports.
Events sent to or received from this device not only contain the
actual MIDI events, but also timing information.
The kernel will make sure that data is sent to the physical
device at the indicated time.
The
.Nm
device uses the
.Xr midi 4
devices internally and they are unavailable when used by the
.Nm
device.
.Pp
The API for the
.Nm
device is binary compatible with the OSS sequencer
interface.
.Sh FILES
.Bl -tag -width /dev/sequencer -compact
.It Pa /dev/music
new
.Nm
device using 8-byte events
.It Pa /dev/sequencer
old
.Nm
device using 4-byte events
.El
.Sh SEE ALSO
.Xr midiplay 1 ,
.Xr ioctl 2 ,
.Xr ossaudio 3 ,
.Xr midi 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 2.5 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Lennart Augustsson .
