openbsd/src/share/man/man4/ses.4
.\"	$OpenBSD: ses.4,v 1.18 2007/05/31 19:19:52 jmc Exp $
.\"
.\" Copyright (c) 2005 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" TORTIOUS ACTION, ARISING OUT OF
.\" PERFORMANCE OF THIS SOFTWARE.
.Dd $Mdocdate: May 31 2007 $
.Dt SES 4
.Os
.Sh NAME
.Nm ses
.Nd SCSI Enclosure Services
.Sh SYNOPSIS
.Cd "ses* at scsibus?"
.Sh DESCRIPTION
The
.Nm
driver provides support for monitoring the various environmental sensors
present in SCSI enclosures using the SCSI Enclosure Services command set.
The hardware monitoring is accessed via the
.Va hw.sensors
.Xr sysctl 8
variable.
.Pp
SCSI devices have a fairly high level interface to the system and talk to it
via a SCSI host adapter (e.g.\&
.Xr ahc 4 ) .
A SCSI adapter must also be separately configured into the system before a
SCSI enclosure can be configured.
.Pp
When the SCSI adapter is probed during boot, the SCSI bus is scanned for
devices.
Any SCSI-2 devices of type
.Dq Enclosure service
or SCSI-3 devices of type
.Dq Processor
will be attached to the
.Nm
driver.
.Pp
SES compliant devices can provide an arbitrary set of sensors which may
include the following types:
.Bl -column "Sensor" "Units" "Typical" -offset indent
.It Sy "Sensor" Ta Sy "Units" Ta Sy "Typical Use"
.It Li "temp" Ta "uK" Ta "temperature"
.It Li "fan" Ta "RPM" Ta "fan"
.It Li "psu" Ta "On/Off" Ta "power supply"
.It Li "doorlock" Ta "On/Off" Ta "door lock"
.It Li "alarm" Ta "On/Off" Ta "enclosure alarm"
.El
.Pp
Sensor data is updated every 10 seconds.
.Pp
An enclosure may provide environmental information using an alternative
command set to the SCSI Enclosure Services used by this driver.
Enclosures using the SCSI Accessed Fault-Tolerant Enclosure command set
may be monitored by the
.Xr safte 4
driver.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr safte 4 ,
.Xr scsibus 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.8 .
.Sh AUTHORS
The
.Nm
driver was written by
.An David Gwynne Aq dlg@openbsd.org .
