openbsd/src/share/man/man4/sf4r.4
.\"	$RuOBSD: sf4r.4,v 1.3 2001/10/26 05:38:44 form Exp $
.\"	$OpenBSD: sf4r.4,v 1.3 2002/01/07 18:37:45 mickey Exp $
.\"
.\" Copyright (c) 2001 Vladimir Popov
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
.\" ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 8, 2001
.Dt SF4R 4
.Os
.Sh NAME
.Nm sf4r
.Nd SoundForte RadioLink SF64-PCR FM radio device driver
.Sh SYNOPSIS
.Cd "sf4r0   at pci? flags 0x00"
.Cd "radio* at sf4r0"
.Sh DESCRIPTION
The
.Nm
driver provides support for the SF64-PCR FM radio tuners.
.Pp
The SF64-PCR cards are stereo FM tuners that allow to tune in the range
87.5 - 108.0 MHz, report signal status on the current frequency, force
audio output to mono, perform hardware signal search, and have an internal
AFC.
.Pp
The card is based on the TEA5757 chip, see
.Xr radio 4
for details.
.Pp
The flags control the driver behavior. For example, with flags 0x01 the driver
will assume that there is a TEA5759 chip is used.
.Sh BUGS
Because MediaForte put FM801 on the board, the current driver cannot
distinguish sound cards based on FM801 and SF64-PCR.
.Sh SEE ALSO
.Xr pci 4 ,
.Xr radio 4 ,
.Xr radio 9
.Sh AUTHORS
The
.Nm
driver was written by
.An Vladimir Popov Aq jumbo@narod.ru
and
.An Maxim Tsyplakov Aq tm@oganer.net .
The man page was written by
.An Vladimir Popov Aq jumbo@narod.ru .
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 3.0 .
