openbsd/src/share/man/man4/sfr.4
.\"	$OpenBSD: sfr.4,v 1.8 2013/07/16 16:05:49 schwarze Exp $
.\"
.\" Copyright (c) 2002 Vladimir Popov
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
.\" ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt SFR 4
.Os
.Sh NAME
.Nm sfr
.Nd SoundForte RadioLink SF16-FMR FM radio device
.Sh SYNOPSIS
.Cd "sfr0   at isa? port 0x384"
.Cd "sfr1   at isa? port 0x284"
.Cd "radio* at sfr?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the SF16-FMR FM radio tuners.
.Pp
The SF16-FMR is a stereo FM tuner that can tune in the range
87.5 - 108.0 MHz.
.Pp
The
.Nm
cards are based upon the TC9216P chip.
See
.Xr radio 4
for details.
.Pp
The SF16-FMR cards take only one I/O port.
The I/O port is set by the driver to the value specified in the configuration
file and must be 0x384 or 0x284.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr isa 4 ,
.Xr radio 4 ,
.Xr radio 9
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 3.2 .
.Sh AUTHORS
The
.Nm
driver and the man page was written by
.An Vladimir Popov Aq Mt jumbo@narod.ru .
