openbsd/src/share/man/man4/sk.4
.\"	$OpenBSD: sk.4,v 1.47 2006/12/12 20:51:15 mk Exp $
.\"
.\" Copyright (c) 1997, 1998, 1999
.\"	Bill Paul <wpaul@ctr.columbia.edu>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/man4.i386/sk.4,v 1.3 1999/08/28 00:20:29 peter Exp $
.\"
.Dd July 3, 1999
.Dt SK 4
.Os
.Sh NAME
.Nm sk ,
.Nm skc ,
.Nm msk ,
.Nm mskc
.Nd "SysKonnect XMAC II and Marvell Yukon based Gigabit Ethernet device"
.Sh SYNOPSIS
.Cd "skc* at pci?"
.Cd "sk* at skc?"
.Cd "mskc* at pci?"
.Cd "msk* at mskc?"
.Cd "brgphy* at mii?"
.Cd "eephy* at mii?"
.Cd "xmphy* at mii?"
.Sh DESCRIPTION
The
.Nm sk
driver provides support for SysKonnect based Gigabit Ethernet adapters
and Marvell based Gigabit Ethernet adapters, including the following:
.Pp
.Bl -bullet -offset indent -compact
.It
3Com 3c940 single port, copper adapter
.It
3Com 3c2000-T single port, copper adapter
.It
Belkin F5D5005, copper adapter
.It
D-Link DGE-530T A1, copper adapter
.It
D-Link DGE-530T B1, copper adapter
.It
Linksys EG1032v2, copper adapter
.It
Linksys EG1064v2, copper adapter
.It
SK-9821 SK-NET GE-T single port, copper adapter
.It
SK-9822 SK-NET GE-T dual port, copper adapter
.It
SK-9841 SK-NET GE-LX single port, single mode fiber adapter
.It
SK-9842 SK-NET GE-LX dual port, single mode fiber adapter
.It
SK-9843 SK-NET GE-SX single port, multimode fiber adapter
.It
SK-9844 SK-NET GE-SX dual port, multimode fiber adapter
.It
SK-9521 V2.0 single port, copper adapter (32-bit)
.It
SK-9821 V2.0 single port, copper adapter
.It
SK-9843 V2.0 single port, copper adapter
.It
SMC 9452TX, copper adapter
.El
.Pp
The
.Nm msk
driver provides support for the Marvell Yukon-2 based Gigabit Ethernet
adapters, including the following:
.Pp
.Bl -bullet -offset indent -compact
.It
D-Link DGE-550SX, multimode fiber adapter
.It
D-Link DGE-560SX, multimode fiber adapter
.It
D-Link DGE-560T, copper adapter
.It
SK-9E21 1000Base-T single port, copper adapter
.It
SK-9E22 1000Base-T dual port, copper adapter
.It
SK-9E81 1000Base-SX single port, multimode fiber adapter
.It
SK-9E82 1000Base-SX dual port, multimode fiber adapter
.It
SK-9E91 1000Base-LX single port, single mode fiber adapter
.It
SK-9E92 1000Base-LX dual port, single mode fiber adapter
.It
SK-9S21 1000Base-T single port, copper adapter
.It
SK-9S22 1000Base-T dual port, copper adapter
.It
SK-9S81 1000Base-SX single port, multimode fiber adapter
.It
SK-9S82 1000Base-SX dual port, multimode fiber adapter
.It
SK-9S91 1000Base-LX single port, single mode fiber adapter
.It
SK-9S92 1000Base-LX dual port, single mode fiber adapter
.It
SK-9E21D 1000Base-T single port, copper adapter
.El
.Pp
The SysKonnect based adapters consist of two main components: the
XaQti Corp.\&
XMAC II Gigabit MAC (sk) and the SysKonnect GEnesis controller ASIC (skc).
The XMAC provides the Gigabit MAC and PHY support
while the GEnesis provides an interface to the PCI bus, DMA support,
packet buffering and arbitration.
The GEnesis can control up to two XMACs simultaneously,
allowing dual-port NIC configurations.
.Pp
The Marvell based adapters are a single integrated circuit, but are
still presented as a separate MAC (sk) and controller ASIC (skc).
.Pp
The
.Nm
driver configures dual port SysKonnect adapters such that each XMAC
is treated as a separate logical network interface.
Both ports can operate independently of each other and can be connected
to separate networks.
.Pp
The XaQti XMAC II supports full and half duplex operation with
autonegotiation.
The XMAC also supports a frame size of up to 9000 bytes.
Support for Jumbo frames is provided via the interface MTU setting.
Selecting an MTU larger than 1500 bytes with the
.Xr ifconfig 8
utility configures the adapter to transmit Jumbo frames.
Using Jumbo frames can greatly improve performance for certain tasks,
such as file transfers and data streaming.
.Pp
Hardware receive IP checksum offload for IPv4 is supported.
.Pp
The following media types and options (as given to
.Xr ifconfig 8 )
are supported:
.Bl -tag -width xxx -offset indent
.It Cm media No autoselect
Enable autoselection of the media type and options.
The user can manually override
the autoselected mode by adding media options to the appropriate
.Xr hostname.if 5
file.
.It Cm media No 1000baseSX Cm mediaopt No full-duplex
Set 1000Mbps (Gigabit Ethernet) operation on fiber and force full-duplex mode.
.It Cm media No 1000baseSX Cm mediaopt No half-duplex
Set 1000Mbps (Gigabit Ethernet) operation on fiber and force half-duplex mode.
.It Cm media No 1000baseT Cm mediaopt No full-duplex
Set 1000Mbps (Gigabit Ethernet) operation and force full-duplex mode.
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
To view a list of media types and options supported by the card, try
.Ic ifconfig -m <device> .
For example,
.Ic ifconfig -m sk0 .
.Sh DIAGNOSTICS
.Bl -diag
.It "sk%d: can't map mem space"
A fatal initialization error has occurred.
.It "sk%d: couldn't map interrupt"
A fatal initialization error has occurred.
.It "sk%d: no memory for jumbo buffer queue!"
The driver failed to allocate memory for jumbo frames during
initialization.
.It "sk%d: watchdog timeout"
The device has stopped responding to the network, or there is a problem with
the network connection (cable).
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr brgphy 4 ,
.Xr eephy 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr xmphy 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Rs
.%T XaQti XMAC II datasheet
.%O http://www.xaqti.com
.Re
.Rs
.%T SysKonnect GEnesis programming manual
.%O http://www.syskonnect.com
.Re
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 3.0 ,
and
.Ox
support was added in
.Ox 2.6 .
.Pp
The
.Nm msk
driver first appeared in
.Ox 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Bill Paul Aq wpaul@ctr.columbia.edu .
Support for the Marvell Yukon-2 was added by
.An Mark Kettenis Aq kettenis@openbsd.org .
.Sh BUGS
The
.Nm msk
driver does not support hardware receive IP checksum offload yet.
