openbsd/src/share/man/man4/sm.4
.\"	$OpenBSD: sm.4,v 1.6 1999/10/01 04:10:48 downsj Exp $
.\"	$NetBSD: sm.4,v 1.3 1998/08/09 00:39:02 thorpej Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe of the Numerical Aerospace Simulation Facility,
.\" NASA Ames Research Center.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 11, 1998
.Dt SM 4
.Os
.Sh NAME
.Nm sm
.Nd device driver for SMC91C9x-based Ethernet interfaces
.Sh SYNOPSIS
.Cd "sm0 at isa? port 0x300 irq 10"
.Cd "sm* at pcmcia? function ?"
.Sh DESCRIPTION
The
.Nm
device driver supports SMC91C9x-based Ethernet interfaces.
.Pp
The ISA attachment of the
.Nm
driver supports any SMC91C9x-based Ethernet interface on the ISA
bus, including the EFA Info*Express SVC VLB interface, and the
on-board SMC91C9x Ethernet found in many embedded PCs and laptop
docking stations.
.Pp
The PCMCIA attachment of the
.Nm
driver supports Megahertz X-JACK Ethernet cards, NewMedia BASICS Ethernet
cards, and SMC EtherEZ 8020 series cards.
.Sh MEDIA SELECTION
The SMC91C9x supports AUI and UTP media types.
.Pp
To enable the AUI media, select the
.Em 10base5
or
.Em aui
media type with
.Xr ifconfig 8 's
.Sq media
directive.  To select UTP, select the
.Em 10baseT
or
.Em utp
media type.
.Sh DIAGNOSTICS
.Bl -diag
.It "sm0: unable to read MAC address from CIS"
This indicates that the Ethernet address, which is stored in the
CIS information on the Megahertz X-JACK PCMCIA Ethernet card, is
corrupted.
.El
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr isa 4 ,
.Xr pcmcia 4 ,
.Xr ifconfig 8
