openbsd/src/share/man/man4/smsc.4
.\"	$OpenBSD: smsc.4,v 1.1 2012/09/19 16:33:05 jsg Exp $
.\"
.\" Copyright (c) 2012 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 19 2012 $
.Dt SMSC 4
.Os
.Sh NAME
.Nm smsc
.Nd SMSC LAN95xx 10/100 USB Ethernet device
.Sh SYNOPSIS
.Cd "smsc* at uhub?"
.Cd "ukphy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver supports SMSC LAN95xx USB Ethernet devices.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr mii 4 ,
.Xr netintro 4 ,
.Xr uhub 4 ,
.Xr ukphy 4 ,
.Xr usb 4
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 5.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Ben Gray
.Aq bgray@freebsd.org .
