openbsd/src/share/man/man4/smsc.4
.\"	$OpenBSD: smsc.4,v 1.4 2013/07/16 16:05:49 schwarze Exp $
.\"
.\" Copyright (c) 2012 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 16 2013 $
.Dt SMSC 4
.Os
.Sh NAME
.Nm smsc
.Nd SMSC LAN95xx 10/100 USB Ethernet device
.Sh SYNOPSIS
.Cd "smsc* at uhub?"
.Cd "ukphy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver supports SMSC LAN9500/LAN9500A/LAN9530/LAN9730/LAN89530 USB 2.0 10/100
Ethernet devices and LAN951x USB 2.0 hub and 10/100 Ethernet devices, including:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Gamber Johnson MAG Docking Station 7160-0204
.It Gamber Johnson MAG Docking Station 7160-0205
.It Gamber Johnson MAG Docking Station 7160-0227
.It GWC Technology HE2440
.It HP USB Media Port Replicator
.It j5create Newport Station JUD200
.It Kensington Universal Notebook Docking Station (K33926US)
.It LevelOne USB-0501
.It Samsung Central Station monitors
.It StarTech USBVGADOCK2
.It XPower XP2440
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr mii 4 ,
.Xr netintro 4 ,
.Xr uhub 4 ,
.Xr ukphy 4 ,
.Xr usb 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 5.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Ben Gray Aq Mt bgray@freebsd.org .
