openbsd/src/share/man/man4/spdmem.4
.\"	$OpenBSD: spdmem.4,v 1.3 2007/10/27 04:21:28 jsg Exp $
.\"
.\" Copyright (c) 2007 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 27 2007 $
.Dt SPDMEM 4
.Os
.Sh NAME
.Nm spdmem
.Nd Serial Presence Detect memory
.Sh SYNOPSIS
.Cd "spdmem* at iic?"
.Pp
.Cd "# macppc"
.Cd "spdmem* at mem?"
.Sh DESCRIPTION
The
.Nm
driver retrieves information about memory modules from an
onboard EEPROM, standardised as JEDEC 21-C.  Currently
.Nm
is able to decode information relating to SDRAM, DDR SDRAM,
and DDR2 SDRAM.
.Sh SEE ALSO
.Xr iic 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 4.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Nicolas Joly ,
.An Paul Goyette ,
and
.An Tobias Nygren
and ported to
.Ox
by
.An Jonathan Gray
.Aq jsg@openbsd.org .
