openbsd/src/share/man/man4/sxisid.4
.\"	$OpenBSD: sxisid.4,v 1.2 2019/10/24 11:49:13 kettenis Exp $
.\"
.\" Copyright (c) 2019 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 24 2019 $
.Dt SXISID 4
.Os
.Sh NAME
.Nm sxisid
.Nd Allwinner security ID
.Sh SYNOPSIS
.Cd "sxisid* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for reading the on-chip eFuses integrated on
various Allwinner SoCs.
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 6.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Krystian Lewandowski
and
.An Mark Kettenis Mt kettenis@openbsd.org .
