openbsd/src/share/man/man4/tipd.4
.\"	$OpenBSD: tipd.4,v 1.1 2022/12/12 19:25:49 kettenis Exp $
.\"
.\" Copyright (c) 2020 Patrick Wildt <patrick@blueri.se>
.\" Copyright (c) 2022 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: December 12 2022 $
.Dt TIPD 4
.Os
.Sh NAME
.Nm tipd
.Nd TI USB Type-C power delivery controller
.Sh SYNOPSIS
.Cd "tipd* at iic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the TI TPS659x and CD321x Type-C power
delivery controllers.
It takes care of plug and unplug events on the USB Type-C port.
Additionally it enables power on the USB Type-C port when a sink
is connected to power attached devices.
.Sh SEE ALSO
.Xr iic 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
