openbsd/src/share/man/man4/trm.4
.\"	$OpenBSD: trm.4,v 1.1 2002/02/18 01:55:30 krw Exp $
.\"
.\" Copyright (c) 2001-2002, Ashley R. Martens and  Kenneth R. Westerback.
.\"    All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd February 16, 2002
.Dt TRM 4
.Os
.Sh NAME
.Nm trm
.Nd TRM-S1040 based PCI SCSI Host Adapters
.Sh SYNOPSIS
.Cd "trm* at pci? dev ? function ?"
.Cd "scsibus* at trm?"
.Sh DESCRIPTION
The
.Nm
driver supports PCI SCSI host adapters based on Tekram's TRM-S1040
chip, including the following:
.Pp
.Bl -bullet -offset indent -compact
.It
Tekram DC395U/UW/F
.It
Tekram DC315/U
.El
.Sh SEE ALSO
.Xr cd 4 ,
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr st 4
.Pp
.Pa http://www.tekram.com/
.Sh AUTHORS
The
.Nm
driver was written for
.Ox
by Kenneth R. Westerback and Ashley R. Martens, based on a
.Nx
driver by Erich Chen, which was ported to 
.Ox
by Martin Akesson.
