openbsd/src/share/man/man4/tsl.4
.\"	$OpenBSD: tsl.4,v 1.1 2005/11/15 23:20:33 kettenis Exp $
.\"
.\" Copyright (c) 2005 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd November 16, 2004
.Dt TSL 4
.Os
.Sh NAME
.Nm tsl
.Nd TAOS TSL2560/61 light-to-digital converter
.Sh SYNOPSIS
.Cd "# i386"
.Cd "tsl0 at iic? addr 0x29"
.Cd "tsl1 at iic? addr 0x39"
.Cd "tsl2 at iic? addr 0x49"
.Pp
.Cd "# macppc"
.Cd "tsl* at maciic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the TAOS TSL2560/61 light-to-digital
converters that transform light intensity into a digital signal
output.
These sensors contain a broadband photodiode and a infrared-responding
photodiode allowing tye derivation of the ambient light level as
experienced by the human eye.
This illuminace (in lux) is made available through the
.Xr sysctl 8
interface.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
