openbsd/src/share/man/man4/twe.4
.\"	$OpenBSD: twe.4,v 1.5 2000/09/21 14:28:49 mickey Exp $
.\"
.\" Copyright (c) 2000 Michael Shalayeff.  All rights reserved.
.\"
.\"
.Dd September 15, 2000
.Dt TWE 4
.Os
.Sh NAME
.Nm twe
.Nd
.Tn 3ware Escalade RAID driver
.Sh SYNOPSIS
.Cd "twe* at pci? dev ? function ?"
.Cd "scsibus* at twe?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Escalade family of raid controllers,
including the
.Tn 3W-5x00 and
.Tn 3W-6x00
models.
.Pp
These controllers support RAID 0, RAID 1, RAID 10 and JBOD
configurations.
All the RAID set volume management is done via the card BIOS.
.Pp
Even though the card uses IDE drives, this driver makes drives
and/or RAID sets appear as
.Xr sd 4 .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr sd 4
.Sh AUTHOR
The
.Nm
driver was written by
.An Michael Shalayeff Aq mickey@opensbd.org ,
inspired by the FreeBSD driver by
.An Mike Smith Aq msmith@freebsd.org .
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 2.8 .
.Sh BUGS
The card's BIOS seems to conflict with some other disk controllers
which have their own BIOS, if such devices are configured earlier
than this one.
To avoid this situation, place
.Nm
cards in the lowest slot before other SCSI or RAID disk controllers.
.Pp
The current 3ware firmware is known to fail if a redundant configuration
is selected (RAID0 or RAID10) and the array is heavily used
(eg. installation) before the controller has finished initialising the array.
In this case, create the array, boot the installation media and
leave the array idle untill all controller activity has ceased.
.Pp
The card provides a mechanism to receive asynchronous notifications
about RAID set status change and so forth, unfortunately this
information is not public.
.Pp
Only 3W-5400 was tested, but others should work.
