openbsd/src/share/man/man4/ubsa.4
.\" $OpenBSD: ubsa.4,v 1.9 2007/02/21 05:43:06 fkr Exp $
.\" $NetBSD: ubsa.4,v 1.1 2002/10/08 13:18:42 augustss Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 8, 2002
.Dt UBSA 4
.Os
.Sh NAME
.Nm ubsa
.Nd Belkin USB serial adapter
.Sh SYNOPSIS
.Cd "ubsa*  at uhub?"
.Cd "ucom*  at ubsa?"
.Sh HARDWARE
The
.Nm
driver supports the following adapters:
.Pp
.Bl -tag -width Dv -offset indent -compact
.It Belkin F5U103
.It Belkin F5U120
.It e-Tek Labs Kwik232
.It GoHubs GoCOM232
.It HUAWEI Mobile Connect E618
.It Novatel Wireless Merlin U740
.It Option GlobeTrotter 3G FUSION
.It Option GlobeTrotter 3G QUAD
.It Option GlobeTrotter 3G QUAD PLUS
.It Peracom single port serial adapter
.It Vodafone Mobile Connect 3G
.El
.Sh DESCRIPTION
The
.Nm
driver provides support for the USB-to-RS232 Bridge chip used by a variety of
serial adapters from Belkin and other vendors.
.Pp
Some 3G (UMTS/GPRS/GSM)
.Xr cardbus 4
devices use a Belkin serial adapter and an
.Xr ohci 4
controller to provide a common AT interface.
.Pp
The device is accessed through the
.Xr ucom 4
driver which makes it behave like a
.Xr tty 4 .
.Sh SEE ALSO
.Xr cardbus 4 ,
.Xr tty 4 ,
.Xr ucom 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 5.0
and was ported to
.Ox 3.3 .
.Sh CAVEATS
The additional IEEE 802.11 wireless chipset found in the Option
GlobeTrotter 3G FUSION is not yet supported.
