openbsd/src/share/man/man4/ubsec.4
.\"	$OpenBSD: ubsec.4,v 1.10 2001/11/08 22:36:47 deraadt Exp $
.\"
.\" Copyright (c) 2000 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Jason L. Wright
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 10, 2000
.Dt UBSEC 4
.Os
.Sh NAME
.Nm ubsec
.Nd Broadcom (BlueSteel) uBsec 5x0x crypto accelerator
.Sh SYNOPSIS
.Cd "ubsec* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
driver supports cards containing any of the following chips:
.Bl -tag -width namenamenamena -offset indent -compact
.It Bluesteel 5501
.It Bluesteel 5601
.It Broadcom BCM95805
.It Broadcom BCM95820
.El
.Pp
The
.Nm
driver registers itself to accelerate DES, Triple-DES, MD5-HMAC96,
and SHA1-HMAC96 operations in
.Xr ipsec 4 .
On all models except the Bluesteel 5501, the driver also registers
itself to provide random data to the
.Xr random 4
subsystem.
.Sh SEE ALSO
.Xr crypt 3 ,
.Xr ipsec 4 ,
.Xr random 4 ,
.Xr crypto 9
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 2.8 .
