openbsd/src/share/man/man4/ubt.4
.\"	$OpenBSD: ubt.4,v 1.4 2007/06/11 08:42:01 jmc Exp $
.\"
.\" Copyright (c) 2004 Alexander Yurchenko <grange@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: June 11 2007 $
.Dt UBT 4
.Os
.Sh NAME
.Nm ubt
.Nd USB Bluetooth adapter
.Sh SYNOPSIS
.Cd "ubt* at uhub?"
.Sh DESCRIPTION
The
.Nm
device driver provides support for USB Bluetooth adapters.
.Sh SEE ALSO
.Xr bluetooth 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 3.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
device driver was written by
.An Maksim Yevmenkin Aq m_evmenkin@yahoo.com
for
.Fx
and ported to
.Ox
by
.An Alexander Yurchenko Aq grange@openbsd.org .
