openbsd/src/share/man/man4/uchcom.4
.\"	$OpenBSD: uchcom.4,v 1.3 2024/04/12 00:43:32 kevlo Exp $
.\"
.\" Copyright (c) 2007 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 12 2024 $
.Dt UCHCOM 4
.Os
.Sh NAME
.Nm uchcom
.Nd WinChipHead CH343/341/340 based USB serial adapter
.Sh SYNOPSIS
.Cd "uchcom* at uhub?"
.Cd "ucom* at uchcom?"
.Sh DESCRIPTION
The
.Nm
driver supports WinChipHead CH343/341/340 serial devices.
.Pp
The CH341/340 devices only support a variety of baud rates
up to 921600.
CH343 devices support any baud rate up to 6 Mbps.
.Sh SEE ALSO
.Xr tty 4 ,
.Xr ucom 4 ,
.Xr uhub 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 4.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Takuya SHIOZAKI Aq Mt tshiozak@netbsd.org
and ported to
.Ox
by
.An Jonathan Gray Aq Mt jsg@openbsd.org .
