openbsd/src/share/man/man4/udcf.4
.\" $OpenBSD: udcf.4,v 1.13 2006/10/27 11:29:06 mbalmer Exp $
.\"
.\" Copyright (c) 2006 Marc Balmer <mbalmer@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd January 12, 2006
.Dt UDCF 4
.Os
.Sh NAME
.Nm udcf
.Nd Gude ADS Expert mouseCLOCK DCF77/HBG time signal station receiver
.Sh SYNOPSIS
.Cd "udcf* at uhub?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Gude ADS Expert mouseCLOCK, a receiver for the
German DCF77 and the Swiss HBG time signal stations.
.Nm
implements a timedelta sensor and the delta (in nanoseconds) between the
received time information and the local time can be accessed through the
.Xr sysctl 8
interface.
.Sh CLOCK TYPE
The driver automatically detects if it is receiving the German DCF77 timecode
or the Swiss HBG timecode and indicates the clock type in the sensor
description.
This value will not be changed once set, even when the receiver
module is changed at runtime.
.Bl -tag -width "DCFXX"
.It DCF77
German DCF77 time signal station
(77.5 kHz longwave transmitter located in Mainflingen near Frankfurt)
.It HBG
Swiss HBG time signal station
(75 kHz longwave transmitter located in Prangins near Geneva)
.It Unknown
The clock type has not yet been determined.
.El
.Sh SENSOR STATES
The quality of the timedelta is reported as the sensor status:
.Bl -tag -width "CRITICALXX"
.It UNKNOWN
No valid time information has been received yet.
.It OK
The time information is valid and the timedelta is safe to use for
applications like
.Xr ntpd 8 .
.It WARN
The time information is still valid, but no new time information has been
decoded for at least 5 minutes due to a reception or parity error.
The timedelta should be used with care.
.It CRITICAL
No valid time information has been received for more than 15 minutes since
the sensor state degraded from OK to WARN.
This is an indication that hardware should be checked
to see if it is still functional.
The timedelta will eventually degrade to a lie
as all computer internal clocks have a drift.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr uhub 4 ,
.Xr usb 4 ,
.Xr ntpd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Marc Balmer Aq mbalmer@openbsd.org .
