openbsd/src/share/man/man4/udcf.4
.\" $OpenBSD: udcf.4,v 1.4 2006/04/20 08:11:53 jmc Exp $
.\"
.\" Copyright (c) 2006 Marc Balmer <mbalmer@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd January 12, 2006
.Dt UDCF 4
.Os
.Sh NAME
.Nm udcf
.Nd Gude ADS Expert mouseCLOCK DCF77 time signal receiver
.Sh SYNOPSIS
.Cd "udcf* at uhub?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Gude ADS Expert mouseCLOCK, a receiver for the
German DCF77 time signal station.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr uhub 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.0 .
