openbsd/src/share/man/man4/udfu.4
.\" $OpenBSD: udfu.4,v 1.1 2009/01/25 03:11:44 ian Exp $
.\"
.\" Copyright (c) 2008 Ian Darwin <ian@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 25 2009 $
.Dt UDFU 4
.Os
.Sh NAME
.Nm udfu
.Nd Device Firmware Upgrade (DFU) Attach
.Sh SYNOPSIS
.Cd "udfu*     at uhub?"
.Sh DESCRIPTION
The
.Nm
driver configures a DFU-compatible device such as the Openmoko telephone
into DFU mode, then detaches it,
permitting it to be attached for read/write access as a
.Xr ugen 4
device to re-flash the memory.
.Pp
Note that this interferes with using the
.Xr umodem 4
interface to this device, which is sometimes neeeded for manual re-configuration.
To enable the use of 
.Xr umodem 4 ,
it is necessary to disable
.Nm ,
either permanently in the kernel configuration file or using
.Xr boot_config 8 .
.Sh SEE ALSO
.Xr ugen 4 ,
.Xr uhub 4 ,
.Xr usb 4 ,
.Xr boot_config 8 ,
.Xr config 8 
.\" .Pp
.\" The
.\" .Xr dfu-util 
.\" program is available in the OpenBSD ports tree.
.Sh HISTORY
The
.Nm
driver
first appeared in
.Ox 4.5 .
