openbsd/src/share/man/man4/ufshci.4
.\"	$OpenBSD: ufshci.4,v 1.2 2024/04/09 14:58:41 mglocker Exp $
.\"
.\" Copyright (c) 2023 Marcus Glocker <mglocker@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.\"
.Dd $Mdocdate: April 9 2024 $
.Dt UFSHCI 4
.Os
.Sh NAME
.Nm ufshci
.Nd Universal Flash Storage Host Controller Interface
.Sh SYNOPSIS
.Cd "ufshci* at acpi?"
.Cd "ufshci* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Universal Flash Storage (UFS) Host Controllers
conforming to the JESD223C and JESD220C version 2.1 specifications.
.Pp
UFS uses NAND flash, and is based on the SCSI architectural model.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr intro 4 ,
.Xr scsi 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Marcus Glocker Aq Mt mglocker@openbsd.org .
