openbsd/src/share/man/man4/uftdi.4
.\" $OpenBSD: uftdi.4,v 1.15 2006/05/11 14:56:57 jason Exp $
.\" $NetBSD: uftdi.4,v 1.3 2001/01/13 20:53:22 nathanw Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 13, 2000
.Dt UFTDI 4
.Os
.Sh NAME
.Nm uftdi
.Nd USB support for serial adapters based on the FT8U100AX
.Sh SYNOPSIS
.Cd "uftdi* at uhub?"
.Cd "ucom*  at uftdi?"
.Sh DESCRIPTION
The
.Nm
driver provides support for various serial adapters based on the FTDI chip
FT8U100AX.
.Pp
The device is accessed through the
.Xr ucom 4
driver which makes it behave like a
.Xr tty 4 .
.Pp
The
.Nm
driver supports the following adapters:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Tn 2232C (Dual) Serial converter
.It Tn 8U232AM Serial converter
.It B&B Electronics USB->RS422/485 adapter
.It Tn Crystalfontz CFA-631 USB LCD
.It Tn Crystalfontz CFA-632 USB LCD
.It Tn Crystalfontz CFA-633 USB LCD
.It Tn Crystalfontz CFA-634 USB LCD
.It Tn D-Link DSB-H4SMK
.It Tn Falcom Twist/Samba USB GSM/GPRS modem
.It Tn Inland UAS111
.It Tn Intrepidcs NeoVI Blue
.It Tn Intrepidcs ValueCAN
.It Tn Matrix Orbital LK202-24 USB LCD
.It Tn Matrix Orbital LK204-24 USB LCD
.It Tn Matrix Orbital MX200 Series LCD
.It Tn microHAM USB microKEYER
.It Tn microHAM USB CW Keyer
.It Tn microHAM USB Interface II
.It Tn QVS USC-1000
.It Tn Sealevel USB-Serial
.It Tn SEMC DSS-20 SyncStation
.It Tn SIIG US2308
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr tty 4 ,
.Xr ucom 4 ,
.Xr uhub 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
driver appeared in
.Nx 1.5 .
.Ox
support was added in
.Ox 2.9 .
