openbsd/src/share/man/man4/uguru.4
.\"	$OpenBSD: uguru.4,v 1.1 2010/03/28 17:04:28 deraadt Exp $
.\"
.\" Copyright (c) 2010 Mikko Tolmunen <oskari@sefirosu.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.Dd $Mdocdate: March 28 2010 $
.Dt UGURU 4
.Os
.Sh NAME
.Nm uguru
.Nd ABIT temperature, voltage and fan sensors
.Sh SYNOPSIS
.Cd "uguru0 at isa? port 0xe0"
.Sh DESCRIPTION
The
.Nm
driver provides support for the microcontroller
found in various
.Tn ABIT
motherboards which serves as
the gateway chip between system management software
and hardware. Sensor values are made available through the
.Xr sysctl 8
interface.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr isa 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.8
.Sh AUTHORS
The
.Nm
driver was written by
.An Mikko Tolmunen Aq oskari@sefirosu.org .
.Sh BUGS
Interrupt support is unimplemented.
