openbsd/src/share/man/man4/umidi.4
.\" $OpenBSD: umidi.4,v 1.7 2008/03/12 20:25:17 ratchov Exp $
.\" $NetBSD: umidi.4,v 1.4 2002/02/07 03:15:09 ross Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 12 2008 $
.Dt UMIDI 4
.Os
.Sh NAME
.Nm umidi
.Nd USB MIDI devices
.Sh SYNOPSIS
.Cd "umidi* at uhub?"
.Cd "midi*  at umidi?"
.Sh DESCRIPTION
The
.Nm
driver supports USB MIDI devices that follow the USB MIDI standard.
It also supports the following vendor specific devices:
.Pp
.Bl -tag -width Dv -offset indent -compact
.It Tn Roland UM1
.It Tn Yamaha UX256
.It Tn Yamaha UX96
.It Tn other Yamaha MIDI devices (hopefully)
.El
.Pp
The
.Nm
driver is accessible through the
.Xr midi 4
driver.
.Sh SEE ALSO
.Xr midi 4 ,
.Xr uhub 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Ox 3.2 .
.Sh CAVEATS
Some USB MIDI devices provide a switch for selecting between
a vendor specific mode and standard USB MIDI mode.
Selecting standard USB MIDI mode may allow a device to attach as
.Nm
rather than
.Xr ugen 4 .
This is particularly true for Roland branded devices.
