openbsd/src/share/man/man4/ums.4
.\" $OpenBSD: ums.4,v 1.11 2013/08/09 22:10:17 edd Exp $
.\" $NetBSD: ums.4,v 1.7 2001/12/28 17:38:00 augustss Exp $
.\"
.\" Copyright (c) 1999, 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: August 9 2013 $
.Dt UMS 4
.Os
.Sh NAME
.Nm ums
.Nd USB HID mouse, touchscreen and digitiser devices
.Sh SYNOPSIS
.Cd "ums*     at uhidev?"
.Cd "wsmouse* at ums? mux 0"
.Sh DESCRIPTION
The
.Nm
driver provides support for USB HID mice, touchscreens and digitisers.
Access to these devices is through the
.Xr wscons 4
driver.
.Pp
If the touchscreen sensor is poorly aligned, then
.Xr xtsscale 1
should be used to provide calibration results to the
.Nm
driver.
.Sh SEE ALSO
.Xr xtsscale 1 ,
.Xr uhidev 4 ,
.Xr usb 4 ,
.Xr wsmouse 4
.Sh HISTORY
The
.Nm
driver
first appeared in
.Ox 2.8 .
.Sh AUTHORS
.An -nosplit
HID touchscreen and digitiser support was written by
.An Robert Nagy
and
.An Matthieu Herrb
then later merged into the generic
.Xr ums 4
driver by
.An Edd Barrett .
.Sh CAVEATS
Touchscreen and digitiser pressure sensitivity is not yet implemented.
