openbsd/src/share/man/man4/umsm.4
.\"	$OpenBSD: umsm.4,v 1.59 2010/05/20 11:35:53 yuo Exp $
.\"
.\" Copyright (c) 2006 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 20 2010 $
.Dt UMSM 4
.Os
.Sh NAME
.Nm umsm
.Nd Qualcomm MSM modem device
.Sh SYNOPSIS
.Cd "umsm* at uhub?"
.Cd "ucom* at umsm?"
.Sh DESCRIPTION
The
.Nm
driver supports Qualcomm MSM modem adapters.
The MSM chipset is found in EVDO and UMTS capable modems.
Typically these are CardBus and PCI Express Mini Cards that incorporate a
USB controller with the actual device attached to it.
.Pp
The following devices are known to work with the
.Nm
driver:
.Pp
.Bl -column "Device                " "Bus" -compact -offset 6n
.It Em "Device		Bus"
.It Li "AirPrime PC5220" Ta Ta CardBus
.It Li "Alcatel One Touch X060" Ta Ta USB
.It Li "Alcatel One Touch X200" Ta Ta USB
.It Li "AnyDATA ADU-500A" Ta Ta USB
.It Li "AnyDATA ADU-E100H" Ta Ta USB
.It Li "AnyDATA A2502" Ta Ta USB
.It Li "Emobile D01HW (Huawei OEM)" Ta Ta USB
.It Li "Emobile D02HW (Huawei OEM)" Ta Ta USB
.It Li "Emobile D12HW (Huawei OEM)" Ta Ta USB
.It Li "Emobile D22HW (Huawei OEM)" Ta Ta USB
.It Li "Emobile H12HW (Huawei OEM)" Ta Ta USB
.It Li "Emobile D21LC (longcheer OEM)" Ta Ta USB
.It Li "Huawei Mobile E156G" Ta Ta USB
.It Li "Huawei Mobile E160E" Ta Ta USB
.It Li "Huawei Mobile E161" Ta Ta USB
.It Li "Huawei Mobile E160g" Ta Ta USB
.It Li "Huawei Mobile E172" Ta Ta USB
.It Li "Huawei Mobile E180" Ta Ta USB
.It Li "Huawei Mobile E220" Ta Ta USB
.It Li "Huawei Mobile E510" Ta Ta USB
.It Li "Huawei Mobile Connect E169g" Ta Ta USB
.It Li "Huawei Mobile Connect E618" Ta Ta USB
.It Li "Huawei Mobile Connect E620" Ta Ta USB
.It Li "IIJMobile 120FU (ZTE OEM)" Ta Ta USB
.It Li "Kyocera KPC650" Ta Ta CardBus
.It Li "Novatel Wireless ES620" Ta Ta USB
.It Li "Novatel Wireless Ovation U727" Ta Ta USB
.It Li "Novatel Wireless U760" Ta Ta USB
.It Li "NTT DoCoMo A2502" Ta Ta USB
.It Li "ONDA Communication H600" Ta Ta CardBus
.It Li "Option GlobeSurfer ICON7.2" Ta Ta USB
.It Li "Option GlobeTrotter 3G+" Ta Ta CardBus
.It Li "Option GlobeTrotter 3G Quad" Ta Ta CardBus
.It Li "Option GlobeTrotter 3G Quad Plus" Ta Ta CardBus
.It Li "Option GlobeTrotter GT Fusion" Ta Ta CardBus
.It Li "Option GlobeTrotter GT Max" Ta Ta CardBus
.It Li "Option GlobeTrotter HSDPA" Ta Ta USB
.It Li "Option GlobeTrotter HSDPA ICON225" Ta Ta USB
.It Li "Option GlobeTrotter HSUPA 380E" Ta Ta PCI Express Mini Card
.It Li "Sierra Wireless MC8755" Ta Ta PCI Express Mini Card
.It Li "Sierra Wireless MC8775" Ta Ta PCI Express Mini Card
.It Li "Sierra Wireless AirCard 580" Ta Ta CardBus
.It Li "Sierra Wireless AirCard 875" Ta Ta CardBus
.It Li "Sierra Wireless AirCard 881" Ta CardBus
.It Li "Sierra Wireless AirCard 881U" Ta Ta USB
.It Li "Softbank C01SW (Sierra OEM)" Ta Ta USB
.It Li "Vodafone Mobile Connect 3G" Ta Ta CardBus
.It Li "Vodafone Mobile Broadband K3765" Ta Ta USB
.It Li "ZTE MF633" Ta Ta USB
.It Li "ZTE MF637" Ta Ta USB
.El
.Pp
Devices suspected of being compatible are:
.Pp
.Bl -column "Device                " "Bus" -compact -offset 6n
.It Em "Device		Bus"
.It Li "Dell W5500" Ta Ta PCI Express Mini Card
.It Li "Novatel Wireless ExpressCard" Ta ExpressCard
.It Li "Novatel Wireless Merlin V620" Ta CardBus
.It Li "Novatel Wireless Merlin V740" Ta CardBus
.It Li "Novatel Wireless Merlin X950D" Ta ExpressCard
.It Li "Novatel Wireless MC950D" Ta Ta USB
.It Li "Novatel Wireless S720" Ta Ta CardBus
.It Li "Novatel Wireless U720" Ta Ta USB
.It Li "Novatel Wireless U740" Ta Ta CardBus
.It Li "Novatel Wireless U870" Ta Ta CardBus
.It Li "Novatel Wireless V720" Ta Ta CardBus
.It Li "Novatel Wireless X950D" Ta Ta ExpressCard
.It Li "Novatel Wireless XU870 HSDPA" Ta ExpressCard
.It Li "Sierra Wireless AirCard 595" Ta CardBus
.It Li "Sierra Wireless AirCard 597E" Ta CardBus
.It Li "Sierra Wireless AirCard 880" Ta CardBus
.It Li "Sierra Wireless AirCard 880E" Ta ExpressCard
.It Li "Sierra Wireless AirCard 880U" Ta Ta USB
.It Li "Sierra Wireless AirCard 881E" Ta ExpressCard
.It Li "Sierra Wireless AirCard 885U" Ta Ta USB
.It Li "Sierra Wireless C597" Ta Ta USB
.It Li "Sierra Wireless EM5625" Ta Ta USB
.It Li "Sierra Wireless MC5720" Ta Ta PCI Express Mini Card
.It Li "Sierra Wireless MC5725" Ta Ta PCI Express Mini Card
.It Li "Sierra Wireless MC8755" Ta Ta PCI Express Mini Card
.It Li "Sierra Wireless MC8765" Ta Ta PCI Express Mini Card
.It Li "Sierra Wireless MC8780" Ta Ta PCI Express Mini Card
.It Li "Sierra Wireless MC8781" Ta Ta PCI Express Mini Card
.El
.Pp
Some modems have multiple serial ports,
however almost all modems have only one effective serial port
for PPP connections.
For example, the Huawei E220 has two serial ports,
but only the first port can be used to make connections;
the second one is for management.
The Option GlobeTrotter HSDPA/HSUPA modems have three serial ports,
but only the last port can be used to make PPP connections.
.Sh EXAMPLES
An example
.Pa /etc/ppp/ppp.conf
configuration for Verizon Wireless might look something like below;
see
.Xr ppp 8
for more information.
.Bd -literal -offset indent
default:
   set device /dev/cuaU0
   set speed 230400
   set dial "ABORT BUSY ABORT NO\e\esCARRIER TIMEOUT 5 \e
             \e"\e" AT OK-AT-OK ATE1Q0s7=60 OK \e\edATDT\e\eT TIMEOUT 40 CONNECT"
   set phone "#777"
   set login
   set authname 4517654321@vzw3g.com
   set authkey vzw
   set timeout 120
   set ifaddr 10.0.0.1/0 10.0.0.2/0 255.255.255.0 0.0.0.0
   add default HISADDR
   enable dns
.Ed
.Pp
In this example the phone number is (451) 765-4321: replace this with
the number issued for the card or your phone's number if a handset is being
used.
.Pp
An example demand dial configuration for Cingular Wireless using
.Xr pppd 8
appears below.
.Pp
.Pa /etc/ppp/cingular-chat :
.Bd -literal -offset indent
TIMEOUT 10
REPORT CONNECT
ABORT BUSY
ABORT 'NO CARRIER'
ABORT ERROR
'' ATZ OK AT&F OK
AT+CGDCONT=1,"IP","isp.cingular" OK
ATD*99***1# CONNECT
.Ed
.Pp
.Pa /etc/ppp/peers/ac875 :
.Bd -literal -offset indent
cuaU0
115200
debug
noauth
nocrtscts
:10.254.254.1
ipcp-accept-remote
defaultroute
user isp@cingulargprs.com
demand
active-filter 'not udp port 123'
persist
idle 600
connect "/usr/sbin/chat -v -f /etc/ppp/cingular-chat"
.Ed
.Pp
.Pa /etc/ppp/chap-secrets :
.Bd -literal -offset indent
# Secrets for authentication using CHAP
# client		server	secret		IP addresses
isp@cingulargprs.com	*	CINGULAR1
.Ed
.Pp
.Xr pppd 8
is then started using:
.Pp
.Dl # pppd call ac875
.Sh SEE ALSO
.Xr ucom 4 ,
.Xr uhub 4 ,
.Xr usb 4 ,
.Xr ppp 8 ,
.Xr pppd 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jonathan Gray
.Aq jsg@openbsd.org ,
and
.An Yojiro UO
.Aq yuo@nui.org .
.Sh CAVEATS
For Verizon Wireless (and possibly other services),
cards require a one-time activation before they will work;
.Nm
does not currently support this.
.Pp
The additional IEEE 802.11 wireless chipset found in the Option
GlobeTrotter GT FUSION is not yet supported.
