openbsd/src/share/man/man4/upd.4
.\"	$OpenBSD: upd.4,v 1.2 2014/03/17 20:07:09 deraadt Exp $
.\"
.\" Copyright (c) 2014 Andre de Oliveira <andre@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 17 2014 $
.Dt UPD 4
.Os
.Sh NAME
.Nm upd
.Nd USB Power Devices sensor
.Sh SYNOPSIS
.Cd "upd* at uhub?"
.Sh DESCRIPTION
The
.Nm
driver exposes data from USB Power Devices (such as an UPS),
as hardware sensors via
.Xr sysctl 3 .
.Pp
The following sensors are provided by the
.Nm
driver, which can be monitored using
.Xr sensorsd 8 :
.Pp
.Bl -item -offset indent -compact
.It
RelativeStateOfCharge
.It
AbsoluteStateOfCharge
.It
RemainingCapacity
.It
FullChargeCapacity
.It
Charging
.It
Discharging
.It
BatteryPresent
.It
ShutdownImminent
.It
ACPresent
.It
AtRateTimeToFull
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr uhub 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.6 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Andre de Oliveira .
