openbsd/src/share/man/man4/uplcom.4
.\" $OpenBSD: uplcom.4,v 1.22 2007/06/01 16:56:26 jmc Exp $
.\" $NetBSD: uplcom.4,v 1.6 2001/05/22 00:21:25 jhawk Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: June 1 2007 $
.Dt UPLCOM 4
.Os
.Sh NAME
.Nm uplcom
.Nd Prolific PL-2303 USB serial adapter
.Sh SYNOPSIS
.Cd "uplcom* at uhub?"
.Cd "ucom*   at uplcom?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Prolific PL-2303 USB-to-RS232 Bridge chip.
.Pp
The device is accessed through the
.Xr ucom 4
driver which makes it behave like a
.Xr tty 4 .
.Sh HARDWARE
The
.Nm
driver supports the following adapters:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Alcatel One Touch 535/735
.It Belkin F5U257
.It Digitus DA-70145
.It ELECOM UC-SGT
.It Ericsson DCU-10 & DCU-11, made by Susteen, Inc.
.It HAL Crossam2+USB
.It HIGH-EDGE HE800
.It I/O DATA USB-RSAQ
.It I/O DATA USB-RSAQ2
.It I/O DATA USB-RSAQ3
.It IOGEAR UC-232A
.It iTegno WM1080A
.It Leadtek 9531 GPS
.It Maxxtro UC-232A
.It Nokia CA-42
.It Ours Technology DKU-5 clone
.It Pharos USB GPS
.It PLANEX USB-RS232 URS-03
.It RATOC REX-USB60
.It Samsung I330 cradle
.It Siemens X65
.It Siemens X75
.It Siemens SX1
.It Sitecom USB-Serial CNA-104
.It SOURCENEXT KeikaiDenwa 8
.It Speed Dragon MS3303H
.It TDK USB-PDC Adapter UPA9664
.It TDK USB-PHS Adapter UHA6400
.It Tripp-Lite U209
.El
.Sh SEE ALSO
.Xr tty 4 ,
.Xr ucom 4 ,
.Xr uhub 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 1.6 .
.Ox
support was added in
.Ox 3.0 .
