openbsd/src/share/man/man4/urio.4
.\" $OpenBSD: urio.4,v 1.15 2004/09/30 19:59:26 mickey Exp $
.\" $NetBSD: urio.4,v 1.1 2000/04/14 14:48:29 augustss Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 6, 2000
.Dt URIO 4
.Os
.Sh NAME
.Nm urio
.Nd USB driver for Diamond Multimedia Rio MP3 players
.Sh SYNOPSIS
.Cd "urio* at uhub?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Rio500 and Rio600 MP3 players from
Diamond MultiMedia.
.Pp
The driver implements minimal support to access the device and requires
a user application for up and downloading music.
.Sh FILES
.Bl -tag -width /dev/urio0 -compact
.It Pa /dev/urio0
device node
.El
.Sh EXAMPLES
Using the Rio500 package the command
.Pp
.Dl rio_add_song Rammstein-Wollt_Ihr_Das_Bett_In_Flammen_Sehen.mp3
.Pp
will download a song over the
.Nm USB
connection into your Rio500.
.Sh SEE ALSO
.Xr uhub 4 ,
.Xr usb 4
.Pp
.Pa /usr/ports/audio/rio500
.Sh HISTORY
The
.Nm
driver
appeared in
.Ox 2.7 .
This driver is based on a
.Fx
Rio driver written by Iwasa Kazmi.
