openbsd/src/share/man/man4/urlphy.4
.\"	$OpenBSD: urlphy.4,v 1.1 2002/05/07 19:40:54 nate Exp $
.\"
.\" Copyright (c) 2002 Nathan L. Binkert
.\" All rights reserved.
.\"
.\" Permission to redistribute, use, copy, and modify this software
.\" without fee is hereby granted, provided that the following
.\" conditions are met:
.\"
.\" 1. This entire notice is included in all source code copies of any
.\"    software which is or includes a copy or modification of this
.\"    software.
.\" 2. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior
.\"    written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
.\" NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
.\" SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 7, 2002
.Dt URLPHY 4
.Os
.Sh NAME
.Nm urlphy
.Nd Realtek RTL8150L Internal PHY driver
.Sh SYNOPSIS
.Cd "urlphy* at mii? phy ?"
.Sh DESCRIPTION
The
.Nm
driver supports the internal PHY found on Realtek RTL8150L USB Ethernet
devices (see
.Xr url 4 ) .
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr mii 4 ,
.Xr url 4 ,
.Xr ifconfig 8

