openbsd/src/share/man/man4/uscanner.4
.\" $OpenBSD: uscanner.4,v 1.12 2008/06/26 05:42:07 ray Exp $
.\" $NetBSD: uscanner.4,v 1.4 2000/10/13 21:05:18 augustss Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: June 26 2008 $
.Dt USCANNER 4
.Os
.Sh NAME
.Nm uscanner
.Nd USB scanner support
.Sh SYNOPSIS
.Cd "uscanner* at uhub?"
.Sh DESCRIPTION
The
.Nm
driver provides minimal support for USB scanners.
The driver recognizes a number of USB scanners, but to
actually scan anything there needs to be software that knows
about the particular scanner.
The SANE package provides support for some scanners.
.Pp
For multifunction USB devices
such as scanner/printer/card readers,
this driver only attaches to the USB interface that controls the scanner.
For the other USB interfaces
separate drivers are needed,
such as
.Xr ulpt 4
and
.Xr umass 4 .
.Sh HARDWARE
The
.Nm
driver works with the following scanners:
.Pp
.Bl -bullet -compact -offset indent
.It
Acer: Acerscan 320U, 620U, 640U, C310U
.It
Agfa: SnapScan 1212U, 1236U, e20, e25, e26, e40, e50, e52, Touch
.It
Avision: 1200U
.It
Canon: CanoScan N656U, N670U, N1220U, N1240U
.It
Epson: GT-7000, GT-9700F
.It
Epson: Perfection 610U, 636U, 640U, 12xxU, 12xxU Photo, 16xxU,
16xxU Photo, 1650, 2400
.It
Epson: Stylus DX38xx DX40xx DX50xx DX60xx (multifunction)
.It
HP: Photosmart S20
.It
HP: ScanJet 2200C, 3300C, 3400cse, 4100C, 4200C, 4300C, 5200C, 5300C,
6200C, 6300C
.It
Kye: ColorPage Vivid-Pro
.It
Microtek: ScanMaker X6USB
.It
Mustek: 600, 600 CU, 1200, 1200 CU, 1200 UB, 1200 Plus, 1200 CU Plus,
BearPaw 1200F
.It
National: BearPaw 1200, 2400
.It
Primax: Colorado 600u, 9600, 19200, 1200u
.It
Primax: G2-200, G2-300, G2-600, G2E-300, G2E-600
.It
Primax: ReadyScan 636i
.It
Primax: Visioneer 6200
.It
Ultima: 1200 UB Plus
.It
Umax: Astra 1220U, 1236U, 2000U, 2200U, 3400
.It
Visioneer: OneTouch 5300, 6100, 6200, 7600, 8100, 8600, 3000
.El
.Pp
Many other scanners are recognized, but there is no software support
for them yet.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr uhub 4 ,
.Xr usb 4
.Pp
.Pa http://www.buzzard.org.uk/jonathan/scanners-usb.html
.Sh HISTORY
The
.Nm
driver appeared in
.Nx 1.6 .
.Ox
support was first added in
.Ox 2.9 .
.Sh BUGS
This driver should not really exist.
The scanners it recognizes can be accessed through the
.Xr ugen 4
driver instead.
A proper scanner driver would provide a uniform interface to scanners
instead of exposing the innards of the scanner.
The reason the driver exists is to have something that is compatible
with the Linux driver.
