openbsd/src/share/man/man4/uscanner.4
.\" $OpenBSD: uscanner.4,v 1.10 2007/11/10 17:30:26 ajacoutot Exp $
.\" $NetBSD: uscanner.4,v 1.4 2000/10/13 21:05:18 augustss Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: November 10 2007 $
.Dt USCANNER 4
.Os
.Sh NAME
.Nm uscanner
.Nd USB scanner support
.Sh SYNOPSIS
.Cd "uscanner* at uhub?"
.Sh DESCRIPTION
The
.Nm
driver provides minimal support for USB scanners.
The driver recognizes a number of USB scanners, but to
actually scan anything there needs to be software that knows
about the particular scanner.
The SANE package provides support for some scanners.
.Pp
For multifunction USB devices
such as scanner/printer/card readers,
this driver only attaches to the USB interface that controls the scanner.
For the other USB interfaces
separate drivers are needed,
such as
.Xr ulpt 4
and
.Xr umass 4 .
.Sh HARDWARE
The
.Nm
driver works with the following scanners:
.Ss Acer
.Bl -tag -width Ds -offset indent -compact
.It Acerscan 320U
.It Acerscan 620U
.It Acerscan 640U
.It Acerscan C310U
.El
.Ss Agfa
.Bl -tag -width Ds -offset indent -compact
.It SnapScan 1212U
.It SnapScan 1236U
.It SnapScan e20
.It SnapScan e25
.It SnapScan e26
.It SnapScan e40
.It SnapScan e50
.It SnapScan e52
.It SnapScan Touch
.El
.Ss Avision
.Bl -tag -width Ds -offset indent -compact
.It 1200U
.El
.Ss Canon
.Bl -tag -width Ds -offset indent -compact
.It CanoScan N656U
.It CanoScan N670U
.It CanoScan N1220U
.It CanoScan N1240U
.El
.Ss Epson
.Bl -tag -width Ds -offset indent -compact
.It GT-7000
.It GT-9700F
.It Perfection 610U
.It Perfection 636U
.It Perfection 640U
.It Perfection 12xxU
.It Perfection 12xxU Photo
.It Perfection 16xxU
.It Perfection 16xxU Photo
.It Perfection 1650
.It Perfection 2400
.It Stylus DX38xx DX40xx DX50xx DX60xx (multifunction)
.El
.Ss HP
.Bl -tag -width Ds -offset indent -compact
.It Photosmart S20
.It ScanJet 2200C
.It ScanJet 3300C
.It ScanJet 3400cse
.It ScanJet 4100C
.It ScanJet 4200C
.It ScanJet 4300C
.It ScanJet 5200C
.It ScanJet 5300C
.It ScanJet 6200C
.It ScanJet 6300C
.El
.Ss Kye
.Bl -tag -width Ds -offset indent -compact
.It ColorPage Vivid-Pro
.El
.Ss Microtek
.Bl -tag -width Ds -offset indent -compact
.It ScanMaker X6USB
.El
.Ss Mustek
.Bl -tag -width Ds -offset indent -compact
.It 600
.It 600 CU
.It 1200
.It 1200 CU
.It 1200 UB
.It 1200 Plus
.It 1200 CU Plus
.It BearPaw 1200F
.El
.Ss National
.Bl -tag -width Ds -offset indent -compact
.It BearPaw 1200
.It BearPaw 2400
.El
.Ss Primax
.Bl -tag -width Ds -offset indent -compact
.It Colorado 600u
.It Colorado 9600
.It Colorado 19200
.It Colorado 1200u
.It G2-200
.It G2-300
.It G2-600
.It G2E-300
.It G2E-600
.It ReadyScan 636i
.It Visioneer 6200
.El
.Ss Umax
.Bl -tag -width Ds -offset indent -compact
.It Astra 1220U
.It Astra 1236U
.It Astra 2000U
.It Astra 2200U
.It Astra 3400
.El
.Ss Visioneer
.Bl -tag -width Ds -offset indent -compact
.It OneTouch 5300
.It OneTouch 6100
.It OneTouch 6200
.It OneTouch 7600
.It OneTouch 8100
.It OneTouch 8600
.It Scanport 3000
.El
.Ss Ultima
.Bl -tag -width Ds -offset indent -compact
.It 1200 UB Plus
.El
.Pp
Many other scanners are recognized, but there is no software support
for them yet.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr uhub 4 ,
.Xr usb 4
.Pp
.Pa http://www.buzzard.org.uk/jonathan/scanners-usb.html
.Sh HISTORY
The
.Nm
driver appeared in
.Nx 1.6 .
.Ox
support was first added in
.Ox 2.9 .
.Sh BUGS
This driver should not really exist.
The scanners it recognizes can be accessed through the
.Xr ugen 4
driver instead.
A proper scanner driver would provide a uniform interface to scanners
instead of exposing the innards of the scanner.
The reason the driver exists is to have something that is compatible
with the Linux driver.
