openbsd/src/share/man/man4/uslcom.4
.\"	$OpenBSD: uslcom.4,v 1.6 2007/10/08 03:10:42 jcs Exp $
.\"
.\" Copyright (c) 2006 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 8 2007 $
.Dt USLCOM 4
.Os
.Sh NAME
.Nm uslcom
.Nd Silicon Laboratories CP2101/CP2102 based USB serial adapter
.Sh SYNOPSIS
.Cd "uslcom* at uhub?"
.Cd "ucom* at uslcom?"
.Sh DESCRIPTION
The
.Nm
driver supports Silicon Laboratories CP2101/CP2102 based serial adapters.
.Pp
The following devices should work with the
.Nm
driver:
.Bd -literal -offset indent
Argussoft ISP
Baltech card reader
Burnside Telecom Desktop Mobile
chip45.com Crumb128 module
Jablotron PC-60B
Lipowsky Baby-JTAG
Lipowsky Baby-LIN
Lipowsky HARP-1
Pololu USB to Serial
Silicon Laboratories CP2101
Silicon Laboratories CP2102
Track Systems Traqmate
.Ed
.Sh SEE ALSO
.Xr tty 4 ,
.Xr ucom 4 ,
.Xr uhub 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jonathan Gray
.Aq jsg@openbsd.org .
.Sh CAVEATS
Setting hardware flow control is not currently supported.
.Pp
Silicon Laboratories don't release any programming information
on their products.
