openbsd/src/share/man/man4/uslcom.4
.\"	$OpenBSD: uslcom.4,v 1.14 2017/05/20 14:24:46 jmc Exp $
.\"
.\" Copyright (c) 2006 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 20 2017 $
.Dt USLCOM 4
.Os
.Sh NAME
.Nm uslcom
.Nd Silicon Laboratories CP210x based USB serial adapter
.Sh SYNOPSIS
.Cd "uslcom* at uhub?"
.Cd "ucom* at uslcom?"
.Sh DESCRIPTION
The
.Nm
driver supports Silicon Laboratories CP2101/CP2102/CP2103/CP2104/CP2105
based serial adapters.
.Pp
The CP2101/CP2102/CP2103 devices only support a variety of baud rates
up to 921600.
CP2104 and CP2105 devices support any baud rate up to 2 Mbps.
.Pp
The following devices should work with the
.Nm
driver:
.Bd -literal -offset indent
Aerocomm Radio
Argussoft ISP
Aruba Networks USB-to-UART
Baltech card reader
Burnside Telecom Desktop Mobile
chip45.com Crumb128 module
Clipsal 5500PCU C-Bus
Dynastream ANT2USB
Elan Digital Systems USBscope50
Elan Digital Systems USBwave12
Elan Digital Systems USBpulse100
Elan Digital Systems USBcount50
Enfora EDG1228
Gemalto Prox-PU/CU Smartcard Readers
IRZ MC35pu GSM Terminal
Jablotron PC-60B
Lipowsky Baby-JTAG
Lipowsky Baby-LIN
Lipowsky HARP-1
MobiData GPRS Modem
Pololu USB to Serial
SPORTident BSM7-D-USB
Tracient RFID
Track Systems Traqmate
West Mountain Radio RIGblaster P&P
West Mountain Radio RIGtalk
.Ed
.Sh SEE ALSO
.Xr tty 4 ,
.Xr ucom 4 ,
.Xr uhub 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jonathan Gray Aq Mt jsg@openbsd.org .
