openbsd/src/share/man/man4/viaenv.4
.\"	$OpenBSD: viaenv.4,v 1.2 2003/10/06 19:30:48 henning Exp $
.\"	$NetBSD: viaenv.4,v 1.5 2001/09/11 23:18:55 wiz Exp $
.\"
.\" Copyright (c) 2000 Johan Danielsson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" 3. Neither the name of author nor the names of any contributors may
.\"    be used to endorse or promote products derived from this
.\"    software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.Dd May 8, 2000
.Dt VIAENV 4
.Os
.Sh NAME
.Nm viaenv
.Nd VIA VT82C686A hardware monitor
.Sh SYNOPSIS
.Cd "viaenv* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the hardware monitor in the
.Tn VIA
VT82C686A South Bridge to be used with the
.Xr sysctl 3
interface.
.Pp
The device has 10 sensors:
.Bl -column "Sensor" "Units" "Typical" -offset indent
.It Sy "Sensor" Ta Sy "Units" Ta Sy "Typical Use"
.It Li "TSENS1" Ta "uK" Ta "CPU temperature"
.It Li "TSENS2" Ta "uK" Ta "System temperature"
.It Li "TSENS3" Ta "uK" Ta "Unknown"
.It Li "FAN1" Ta "RPM" Ta "CPU fan"
.It Li "FAN2" Ta "RPM" Ta "System fan"
.It Li "VSENS1" Ta "uV DC" Ta "CPU core voltage (2.0V)"
.It Li "VSENS2" Ta "uV DC" Ta "North Bridge core voltage (2.5V)"
.It Li "Vcore" Ta "uV DC" Ta "Internal core voltage (3.3V)"
.It Li "VSENS3" Ta "uV DC" Ta "+5V"
.It Li "VSENS4" Ta "uV DC" Ta "+12V"
.El
.Pp
Sensor data is updated every 1.5 seconds.
.Sh SEE ALSO
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.5 ,
.Ox
support was added in
.Ox 3.4 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Johan Danielsson
and ported to
.Ox 3.4
by
.An Alexander Yurchenko Aq grange@openbsd.org .
.Sh BUGS
Interrupt support is unimplemented, as is support for setting values.
