openbsd/src/share/man/man4/vioscsi.4
.\"	$OpenBSD: vioscsi.4,v 1.1 2013/12/20 22:10:19 matthew Exp $
.\"
.\" Copyright (c) 2013 Google Inc.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: December 20 2013 $
.Dt VIOSCSI 4
.Os
.Sh NAME
.Nm vioscsi
.Nd VirtIO SCSI adapter
.Sh SYNOPSIS
.Cd "vioscsi* at virtio?"
.Cd "scsibus* at vioscsi?"
.Sh DESCRIPTION
The
.Nm
driver provides support for
.Xr virtio 4
SCSI adapters.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr virtio 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.5 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Matthew Dempsky Aq matthew@dempsky.org .
.Sh BUGS
Device hotplug is not supported yet.
