openbsd/src/share/man/man4/virtio.4
.\"     $OpenBSD: virtio.4,v 1.11 2017/01/26 01:19:17 jsg Exp $
.\"
.\" Copyright (c) 2012 Stefan Fritsch <sf@sfritsch.de>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 26 2017 $
.Dt VIRTIO 4
.Os
.Sh NAME
.Nm virtio
.Nd VirtIO support driver
.Sh SYNOPSIS
.Cd "virtio* at fdt?"
.Cd "virtio* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support service for paravirtualized devices using the VirtIO
protocol.
Such devices are provided by bhyve, KVM, QEMU, and VirtualBox.
.Pp
Currently there are drivers for the following
.Nm
devices:
.Pp
.Bl -tag -width "vioscsi(4)XXX" -offset indent -compact
.It Xr vio 4
VirtIO network device
.It Xr vioblk 4
VirtIO disk
.It Xr viomb 4
VirtIO memory ballooning driver
.It Xr viornd 4
VirtIO random number device
.It Xr vioscsi 4
VirtIO SCSI adapter
.El
.Pp
The
.Nm
driver conforms to the virtio 0.9.5 specification.
The virtio 1.0 standard is not supported, yet.
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was ported to
.Ox
and improved by
.An Stefan Fritsch Aq Mt sf@sfritsch.de .
It is based on the
.Nx
driver by
.An Minoura Makoto .
