openbsd/src/share/man/man4/virtio.4
.\"     $OpenBSD: virtio.4,v 1.1 2012/09/19 19:24:33 sf Exp $
.\"
.\" Copyright (c) 2012 Stefan Fritsch <sf@sfritsch.de>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 19 2012 $
.Dt VIRTIO 4
.Os
.Sh NAME
.Nm virtio
.Nd virtio support driver
.Sh SYNOPSIS
.Cd "virtio* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support service for paravirtualized devices like the virtio
network adapter
.Xr vio 4
or the virtio block device.
Such a devices are provided by some hypervisors like kvm or virtualbox.
.Pp
.Sh SEE ALSO
.Xr vioblk 4 ,
.Xr vio 4 ,
.Xr intro 4 ,
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.3 .
.Sh AUTHORS
The
.Nm
driver was ported to OpenBSD and improved by
.An Stefan Fritsch Aq sf@sfritsch.de .
It is based on the NetBSD driver by
.An Minoura Makoto .
