openbsd/src/share/man/man4/vmt.4
.\"	$OpenBSD: vmt.4,v 1.1 2008/07/08 13:41:20 dlg Exp $
.\"
.\" Copyright (c) 2008 Marco Peereboom <marco@openbsd.org>
.\" Text was heavily borrowed from the IPMI spec V1.5
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" TORTIOUS ACTION, ARISING OUT OF
.\" PERFORMANCE OF THIS SOFTWARE.
.Dd $Mdocdate: July 8 2008 $
.Dt VMT 4
.Os
.Sh NAME
.Nm vmt
.Nd VMware Tools driver
.Sh SYNOPSIS
.Cd "vmt0 at mainbus0"
.Sh DESCRIPTION
The
.Nm
driver is a kernel level implementation of VMware Tools.
VMware Tools are intended to provide better support for operating systems
running inside virtual machines.
.Pp
.Nm
provides access to the host machines clock as a timedelta sensor.
.Sh SEE ALSO
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
.Sh AUTHORS
The
.Nm
driver was written by
.An David Gwynne Aq dlg@openbsd.org .
