openbsd/src/share/man/man4/vnd.4
.\"	$OpenBSD: vnd.4,v 1.12 2000/03/29 01:28:56 deraadt Exp $
.\"	$NetBSD: vnd.4,v 1.1 1995/12/30 18:10:48 thorpej Exp $
.\"
.\" Copyright (c) 1995 Jason R. Thorpe.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by Jason R. Thorpe.
.\" 4. Neither the name of the author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd December 30, 1995
.Dt VND 4
.Os
.Sh NAME
.Nm vnd
.Nd Vnode Disk Driver
.Sh SYNOPSIS
.Cd "pseudo-device vnd 4"
.Sh DESCRIPTION
The
.Nm
driver provides a disk-like interface to a file.  This is useful for
a variety of applications, including swap files and building miniroot
or floppy disk images.  There are two variants, the traditional
.Nm
that bypasses the buffercache and thus is suitable for swap on files, but
not for building disk-images, and the
.Nm svnd
("safe"
.Nm
) variant that goes
through the buffercache, thereby maintaining cache-coherency after the
block-device is closed which makes it suitable for creating disk images.
The latter is not good for swapping on, though.
.Pp
This document assumes that you're familiar with how to generate kernels,
how to properly configure disks and pseudo-devices in a kernel
configuration file.
.Pp
In order to compile in support for the
.Nm
, you must add a line similar
to the following to your kernel configuration file:
.Bd -unfilled -offset indent
pseudo-device	vnd	4	# vnode disk driver
.Ed
.Pp
The count argument is how many
.Nm vnds
memory is allocated for a boot time.  In this example, no more than 4
.Nm vnds
may be configured.
.Pp
There is a run-time utility that is used for configuring
.Nm vnds .
See
.Xr vnconfig 8
for more information.
.Sh BUGS
The
.Nm
driver does not work if the file does not reside in a local filesystem.
However the
.Nm svnd
variant does.
.Pp
Currently, in order to be able to enable swap on a vnd device, the kernel
must have been configured for it, e.g.,
.Bd -unfilled -offset indent
config   bsd   root on sd0a swap on sd0b and vnd0c dumps on sd0b
.Ed
.Sh FILES
/dev/{,r}{,s}vnd* - vnd device special files.
.Sh HISTORY
The vnode disk driver was originally written at the University of
Utah.  The svnd variant was first seen in
.Ox 2.1 .
.Sh SEE ALSO
.Xr MAKEDEV 8 ,
.Xr config 8 ,
.Xr fsck 8 ,
.Xr mount 8 ,
.Xr newfs 8 ,
.Xr vnconfig 8
