openbsd/src/share/man/man4/wbsd.4
.\"	$OpenBSD: wbsd.4,v 1.2 2009/10/04 11:36:55 jmc Exp $
.\"
.\" Copyright (c) 2009 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 4 2009 $
.Dt WBSD 4
.Os
.Sh NAME
.Nm wbsd
.Nd Winbond W83L518D/W83L519D SD memory card interface
.Sh SYNOPSIS
.Cd "wbsd* at ebus?"
.Cd "sdmmc* at wbsd?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the SD memory card interface of the
Winbond W83L518D/W83L519D integrated media reader.
.Pp
The
.Xr sdmmc 4
subsystem performs SD/MMC transactions to communicate with
whatever MMC, SD, SDHC, or SDIO devices are inserted into the SD slot.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sdmmc 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jared D. McNeill Aq jmcneill@invisible.ca
and ported to
.Ox
by
.An Mark Kettenis Aq kettenis@openbsd.org .
