openbsd/src/share/man/man4/wi.4
.\"	$OpenBSD: wi.4,v 1.21 2001/12/01 19:23:49 deraadt Exp $
.\"
.\" Copyright (c) 1997, 1998, 1999
.\"	Bill Paul <wpaul@ctr.columbia.edu>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$FreeBSD: wi.4,v 1.3 1999/05/22 16:12:43 wpaul Exp $
.\"
.Dd June 24, 2001
.Dt WI 4
.Os
.Sh NAME
.Nm wi
.Nd WaveLAN/IEEE and PRISM-II 802.11DS wireless network driver
.Sh SYNOPSIS
.Cd "wi* at pci? dev ? function ?"
.Cd "wi* at pcmcia? function ?"
.Cd "wi* at macobio?"
.Sh DESCRIPTION
The
.Nm
driver provides support for PCMCIA adapters based on the Lucent Technologies
WaveLAN/IEEE (aka WaveLAN II) and Intersil PRISM-II chipsets.
The compatible cards supported are:
.Pp
.Bl -tag -width -offset indent -compact
.It 3Com AirConnect Wireless LAN
.It Addtron AWP-100
.It BUFFALO AirStation 11Mbps PC Card
.It BUFFALO AirStation 11Mbps CF Card
.It Cabletron RoamAbout
.It Compaq Agency NC5004 Wireless Card
.It Contec FLEXLAN/FX-DS110-PCC
.It Corega Wireless LAN PCC-11
.It Corega Wireless LAN PCCA-11
.It Corega Wireless LAN PCCB-11
.It EMTAC A2424i 11Mbps PC Card
.It I-O DATA WN-B11/PCM
.It Intel PRO/Wireless 2011
.It Intersil Prism II
.It Linksys WPC11
.It NANOSPEED ROOT-RZ2000 WLAN Card
.It NEC Wireless Card CMZ-RT-WP
.It NTT-ME 11Mbps Wireless LAN PC Card
.It Samsung MagicLAN SWL-2000N
.It SMC 2632 EZ Connect Wireless PC Card
.It TDK LAK-CD011WL
.It XI300 Wireless LAN
.El
.Pp
Note that while Lucent sells PCI, ISA and PCMCIA WaveLAN/IEEE
devices, the PCI and ISA products are actually a PCMCIA card in a
PCMCIA bridge adapter.
Consequently, the
.Nm
driver is required for PCI, ISA and PCMCIA NICs.
The original WaveLAN/IEEE cards (2Mbps), the WaveLAN/IEEE Turbo (6Mbps), the
WaveLAN/IEEE Bronze Turbo (8Mbps), and the
WaveLAN/IEEE Silver/Gold (11Mbps) adapters are supported.
.Pp
Unlike the Lucent devices, several vendors sell PCI adapters built
around the PLX Technology 9050 or 9052 chip.
These adapters are dumb PCMCIA bridges that do not attach as a
normal PCMCIA bus.
Instead they appear to the host as a normal PCI device and do
not require any PCMCIA support.
Some have a real PCI interface chip on them.
The following such bridges are supported or expected to work:
.Pp
.Bl -tag -width -offset indent -compact
.It 3Com AirConnect 3CRWE777A
.It Eumitcom WL11000P (untested)
.It Global Sun Technology GL24110P (untested)
.It Global Sun Technology GL24110P02
.It Intersil Mini-PCI (real PCI)
.It LinkSys WDT11 (a rebadged GL24110P02)
.It Netgear MA301
.El
.Pp
Also note that some of the PRISM-II adapters only work at 3.3V, hence
.Xr cardbus 4
support is required for those cards to set VCC correctly, even
though they are really 16bit cards.
.Pp
The core of the WaveLAN/IEEE is the Lucent Hermes controller.
All host/device interaction is via programmed I/O with the Hermes.
The Hermes supports 802.11 and 802.3 frames, power management, BSS,
WDS and ad-hoc operation modes.
.Pp
The
.Nm
driver encapsulates all IP and ARP traffic as 802.11 frames, however
it can receive either 802.11 or 802.3 frames.
Transmit speed is selectable between 1Mbps fixed, 2Mbps fixed, 2Mbps
with auto fallback, 6Mbps, 8Mbps, or 11Mbps depending on your hardware
(see above).
The Lucent WaveLAN/IEEE Silver and Gold cards as well as the Intersil
PRISM-II cards have support for WEP encryption.
The WaveLAN Gold cards support 104bit keys, the others only accept
40bit keys.
The Lucent Bronze cards do not support WEP.
To enable the encryption, use the
.Xr wicontrol 8
utility to set your keys.
.Pp
By default, the
.Nm
driver configures the WaveLAN card for BSS operation (aka infrastructure
mode).
This mode requires the use of an access point (base station).
.br
The
.Nm
driver also supports an ad-hoc (point-to-point) mode where
the nwid is ignored and stations can communicate among
each other without the aid of an access point.
Note that this mode is not in the IEEE 802.11 specification and the
driver may not be able to interoperate with other vendor's cards
while in ad-hoc mode.
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh DIAGNOSTICS
.Bl -diag
.It "wi%d: init failed"
The WaveLAN card failed to come ready after an initialization command
was issued.
.It "wi%d: failed to allocate %d bytes on NIC"
The driver was unable to allocate memory for transmit frames in the
NIC's on-board RAM.
.It "wi%d: device timeout"
The WaveLAN failed to generate an interrupt to acknowledge a transmit
command.
.El
.Sh SEE ALSO
.Xr an 4 ,
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8 ,
.Xr wicontrol 8
.Rs
.%T HCF Light programming specification
.%O http://www.wavelan.com
.Re
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 3.0 .
.Ox
support was added in
.Ox 2.6 .
.Sh AUTHORS
The
.Nm
driver was written by Bill Paul <wpaul@ctr.columbia.edu> and ported to
.Ox
by Niklas Hallqvist <niklas@appli.se>.
.Sh CAVEATS
The original Lucent WaveLAN cards usually default to channel 3;
newer cards use channel 10 by default.
Non-Lucent cards vary, for instance the Addtron cards use channel
11 by default.
See
.Xr wicontrol 8
for information on how to change the channel.
