openbsd/src/share/man/man4/wi.4
.\"	$OpenBSD: wi.4,v 1.7 2001/04/06 19:11:15 deraadt Exp $
.\"
.\" Copyright (c) 1997, 1998, 1999
.\"	Bill Paul <wpaul@ctr.columbia.edu>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$FreeBSD: wi.4,v 1.3 1999/05/22 16:12:43 wpaul Exp $
.\"
.Dd April 21, 1999
.Dt WI 4
.Os
.Sh NAME
.Nm wi
.Nd Lucent Technologies WaveLAN/IEEE 802.11DS PCMCIA driver
.Sh SYNOPSIS
.Cd "wi* at pcmcia? function ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for WaveLAN/IEEE and compatible pcmcia adapters
(also known as WaveLAN II cards) which support IEEE 802.11 Direct Sequence.
The compatible cards supported are:
.Pp
.Bl -tag -width -offset indent -compact
.It 3Com AirConnect Wireless LAN
.It Corega Wireless LAN PCC-11
.It Corega Wireless LAN PCCA-11
.It Intersil Prism II
.It Samsung MagicLAN SWL-2000N
.It SMC 2632 EZ Connect Wireless PC Card
.It NANOSPEED ROOT-RZ2000 WLAN Card
.It XI300 Wireless LAN
.It Compaq Agency NC5004 Wireless Card
.It Contec FLEXLAN/FX-DS110-PCC
.It TDK LAK-CD011WL
.It NEC Wireless Card CMZ-RT-WP
.It NTT-ME 11Mbps Wireless LAN PC Card
.It Addtron AWP-100
.It Cabletron RoamAbout
.It I-O DATA WN-B11/PCM
.El
.Pp
Note that while Lucent sells both ISA and PCMCIA
WaveLAN/IEEE devices, the ISA product is actually a PCMCIA card in an
ISA to PCMCIA bridge adapter. Consequently, the
.Nm
driver is required for both the ISA and PCMCIA NICs. The original
WaveLAN/IEEE cards (2Mbps), the WaveLAN/IEEE Turbo (6Mbps), the
WaveLAN/IEEE Bronze Turbo (8Mbps), and the
WaveLAN/IEEE Silver/Gold (11Mbps) adapters are supported.
.Pp
The core of the WaveLAN/IEEE is the Lucent Hermes controller. All
host/device interaction is via programmed I/O with the Hermes. The
Hermes supports 802.11 and 802.3 frames, power management, BSS, WDS
and ad-hoc operation modes. The
.Nm
driver encapsulates all IP and ARP traffic as 802.11 frames, however
it can receive either 802.11 or 802.3 frames. Transmit speed is
selectable between 1Mbps fixed, 2Mbps fixed, 2Mbps with auto fallback,
6Mbps, 8Mbps, or 11Mbps depending on your hardware (see above).  The
Gold and Silver cards also have support for encryption.  Silver adapters
will do 64bit encryption and Gold adapters will do 128bit encryption.
To enable the encryption, use the
.Xr wicontrol 8
utility to set your keys.
.Pp
By default, the
.Nm
driver configures the WaveLAN card for BSS operation. In this mode,
stations can communicate among each other without the aid of an access
point. To join a service set, the driver must be set for BSS mode using
the
.Xr wicontrol 8
utility.
.Pp
For more information on configuring this device, see
.Xr ifconfig 8
.Sh DIAGNOSTICS
.Bl -diag
.It "wi%d: init failed"
The WaveLAN failed to come ready after an initialization command was
issued.
.It "wi%d: failed to allocate %d bytes on NIC"
The driver was unable to allocate memory for transmit frames in the
NIC's on-board RAM.
.It "wd%d: device timeout"
The WaveLAN failed to generate an interrupt to acknowledge a transmit
command.
.El
.Sh SEE ALSO
.Xr an 4 ,
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8 ,
.Xr wicontrol 8
.Rs
.%T HCF Light programming specification
.%O http://www.wavelan.com
.Re
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 3.0 .
.Ox
support was added in
.Ox 2.6 .
.Sh AUTHORS
The
.Nm
driver was written by Bill Paul <wpaul@ctr.columbia.edu> and ported to
.Ox
by Niklas Hallqvist <niklas@appli.se>.
.Sh CAVEATS
Lucent WaveLAN cards are usually default to channel 3 for operation,
while some non-Lucent cards have different default channel (11 for
Addtron cards, for example). See
.Xr wicontrol 8
for information on how to change the channel.
.Sh BUGS
Addtron cards do not seem to work in infrastructure mode with
Lucent base station with current driver source.
