openbsd/src/share/man/man4/wsdisplay.4
.\" $OpenBSD: wsdisplay.4,v 1.37 2005/11/01 08:46:01 jmc Exp $
.\" $NetBSD: wsdisplay.4,v 1.5 2000/05/13 15:22:19 mycroft Exp $
.\"
.\" Copyright (c) 2005, Miodrag Vallat.
.\" Copyright (c) 1999 Matthias Drochner.
.\" Copyright (c) 2002 Ben Harris.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 4, 2005
.Dt WSDISPLAY 4
.Os
.Sh NAME
.Nm wsdisplay
.Nd generic display device support in wscons
.Sh SYNOPSIS
.\".Cd wsdisplay* at ega?
.\"(EGA display on ISA)
.Cd "wsdisplay* at vga?"
(VGA textmode display on ISA or PCI)
.Cd "wsdisplay* at pcdisplay?"
(generic PC (ISA) display)
.Cd "wsdisplay* at vgafb?"
(VGA graphics display on PCI, as found on macppc and sparc64 platforms)
.Cd "wsdisplay* at tga?"
(DEC TGA display, alpha only)
.\" .Cd wsdisplay* at nextdisplay?
.\" (NeXT display)
.Cd "wsdisplay* at sti?"
(HP CRX and Visualize series framebuffers)
.Cd "wsdisplay* at agten?"
.Cd "wsdisplay* at bwtwo?"
.Cd "wsdisplay* at cgtwo?"
.Cd "wsdisplay* at cgthree?"
.Cd "wsdisplay* at cgfour?"
.Cd "wsdisplay* at cgsix?"
.Cd "wsdisplay* at cgeight?"
.Cd "wsdisplay* at cgtwelve?"
.Cd "wsdisplay* at cgfourteen?"
.Cd "wsdisplay* at mgx?"
.Cd "wsdisplay* at pninek?"
.Cd "wsdisplay* at pnozz?"
.Cd "wsdisplay* at rfx?"
.Cd "wsdisplay* at tcx?"
.Cd "wsdisplay* at tvtwo?"
.Cd "wsdisplay* at vigra?"
.Cd "wsdisplay* at zx?"
(sparc and/or sparc64 framebuffers)
.Cd "wsdisplay* at creator?"
(sparc64 framebuffers)
.Cd "wsdisplay0 at smg?"
(VAXstation small monochrome display)
.Cd "wsdisplay* at lcd?"
(Zaurus LCD display)
.Cd "option WSDISPLAY_DEFAULTSCREENS=N"
.Sh DESCRIPTION
The
.Nm
driver is an abstraction layer for display devices within the
.Xr wscons 4
framework.
It attaches to the hardware specific display device driver and
makes it available as text terminal or graphics interface.
.Pp
Display devices have the ability to display characters on them
(without help of an X server), either directly by hardware or through
software drawing pixel data into the display memory.
The
.Nm
driver will connect a terminal emulation module and provide a
tty-like software interface.
.Pp
The
.Em console
locator in the configuration line refers to the device's use as output
part of the operating system console.
A device specification containing a positive value here will only match
if the device is in use as system console.
(The console device selection in early system startup is not influenced.)
This way, the console device can be connected to a known
.Nm wsdisplay
device instance.
.Pp
The
.Em mux
locator in the configuration line refers to the
.Xr wsmux 4
that will be used to get keyboard events.
If this locator is -1 no mux will be used.
.Pp
The logical unit of an independent contents displayed on a display
(sometimes referred to as
.Dq virtual terminal )
is called a
.Dq screen
here.
If the underlying device driver supports it, multiple screens can
be used on one display.
(As of this writing, only the
.Xr lcd 4 ,
.Xr smg 4 ,
and
.Xr vga 4
display drivers provide this ability.)
Screens have different minor device numbers and separate tty instances.
One screen possesses the
.Dq focus ,
this means it is displayed on the display and its tty device will get
the keyboard input.
(In some cases, if no screen is set up or if a screen
was just deleted, it is possible that no focus is present at all.)
The focus can be switched by either special keyboard input (typically
CTL-ALT-Fn) or an ioctl command issued by a user program.
Screens are set up or deleted through the
.Pa /dev/ttyCcfg
control device (preferably using the
.Xr wsconscfg 8
utility).
Alternatively, the compile-time option
.Cm WSDISPLAY_DEFAULTSCREENS=N
will set up N screens of the display driver's default type and using
the system's default terminal emulator at autoconfiguration time.
.Pp
In addition and with help from backend drivers the following features
are also provided:
.Bl -bullet
.It
Loading, deleting and listing the loaded fonts.
.It
Browsing backwards in the screen output, the size of the
buffer for saved text is defined by the particular hardware driver.
.It
Blanking the screen by timing out on inactivity in the
screen holding the input focus.
Awakening activities consist of:
.Pp
.Bl -bullet -compact
.It
pressing any keys on the keyboard;
.It
moving or clicking the mouse;
.It
any output to the screen.
.El
.Pp
Blanking the screen is usually done by disabling the horizontal sync
signal on video output, but may also include blanking the vertical
sync in which case most monitors go into power saving mode.
See
.Xr wsconsctl 8
for controlling variables.
.El
.Pp
Consult the back-end drivers' documentation for which features are supported
for each particular hardware type.
.Ss IOCTL INTERFACE
The following
.Xr ioctl 2
calls are provided by the
.Nm
driver or by devices which use it.
Their definition are found in
.Aq Pa dev/wscons/wsconsio.h .
.Bl -tag -width 4n
.It Dv WSDISPLAYIO_GTYPE Pq Li u_int
Retrieve the type of the display.
The list of types is in
.Aq Pa dev/wscons/wsconsio.h .
.It Dv WSDISPLAYIO_GINFO Pq Li "struct wsdisplay_fbinfo"
Retrieve basic information about a framebuffer display.
The returned structure is as follows:
.Bd -literal -offset indent
struct wsdisplay_fbinfo {
        u_int   height;
        u_int   width;
        u_int   depth;
        u_int   cmsize;
};
.Ed
.Pp
The
.Va height
and
.Va width
members are counted in pixels.
The
.Va depth
member indicates the number of bits per pixel, and
.Va cmsize
indicates the number of color map entries accessible through
.Dv WSDISPLAYIO_GETCMAP
and
.Dv WSDISPLAYIO_PUTCMAP .
This call is likely to be unavailable on text-only displays.
.It Dv WSDISPLAYIO_GETCMAP Pq Li "struct wsdisplay_cmap"
Retrieve the current color map from the display.
This call needs the
following structure set up beforehand:
.Bd -literal -offset indent
struct wsdisplay_cmap {
        u_int   index;
        u_int   count;
        u_char  *red;
        u_char  *green;
        u_char  *blue;
};
.Ed
.Pp
The
.Va index
and
.Va count
members specify the range of color map entries to retrieve.
The
.Va red ,
.Va green ,
and
.Va blue
members should each point to an array of
.Va count
.Li u_char Ns s .
On return, these will be filled in with the appropriate entries from the
color map.
On all displays that support this call, values range from 0 for minimum
intensity to 255 for maximum intensity, even if the display does not use
eight bits internally to represent intensity.
.It Dv WSDISPLAYIO_PUTCMAP Pq Li "struct wsdisplay_cmap"
Change the display's color map.
The argument structure is the same as for
.Dv WSDISPLAYIO_GETCMAP ,
but
.Va red ,
.Va green ,
and
.Va blue
are taken as pointers to the values to use to set the color map.
This call is not available on displays with fixed color maps.
.It Dv WSDISPLAYIO_GVIDEO Pq Li u_int
Get the current state of the display's video output.
Possible values are:
.Bl -tag -width 21n
.It Dv WSDISPLAYIO_VIDEO_OFF
The display is blanked.
.It Dv WSDISPLAYIO_VIDEO_ON
The display is enabled.
.El
.It Dv WSDISPLAYIO_SVIDEO Pq Li u_int
Set the state of the display's video output.
See
.Dv WSDISPLAYIO_GVIDEO
above for possible values.
.It Dv WSDISPLAYIO_GCURPOS Pq Li "struct wsdisplay_curpos"
Retrieve the current position of the hardware cursor.
The returned structure
is as follows:
.Bd -literal -offset indent
struct wsdisplay_curpos {
        u_int x, y;
};
.Ed
.Pp
The
.Va x
and
.Va y
members count the number of pixels right and down, respectively, from
the top-left corner of the display to the hot spot of the cursor.
This call is not available on displays without a hardware cursor.
.It Dv WSDISPLAYOP_SCURPOS Pq Li "struct wsdisplay_curpos"
Set the current cursor position.
The argument structure, and its semantics,
are the same as for
.Dv WSDISPLAYIO_GCURPOS .
This call is not available on displays without a hardware cursor.
.It Dv WSDISPLAYIO_GCURMAX Pq Li "struct wsdisplay_curpos"
Retrieve the maximum size of cursor supported by the display.
The
.Va x
and
.Va y
members of the returned structure indicate the maximum number of pixel rows
and columns, respectively, in a hardware cursor on this display.
This call is not available on displays without a hardware cursor.
.It Dv WSDISPLAYIO_GCURSOR Pq Li "struct wsdisplay_cursor"
Retrieve some or all of the hardware cursor's attributes.
The argument structure is as follows:
.Bd -literal -offset indent
struct wsdisplay_cursor {
        u_int   which;
        u_int   enable;
        struct wsdisplay_curpos pos;
        struct wsdisplay_curpos hot;
        struct wsdisplay_cmap cmap;
        struct wsdisplay_curpos size;
        u_char *image;
        u_char *mask;
};
.Pp
.Ed
The
.Va which
member indicates which of the values the application requires to be returned.
It should contain the logical OR of the following flags:
.Bl -tag -width 4n
.It Dv WSDISPLAYIO_CURSOR_DOCUR
Get
.Va enable ,
which indicates whether the cursor is currently displayed (non-zero) or
not (zero).
.It Dv WSDISPLAYIO_CURSOR_DOPOS
Get
.Va pos ,
which indicates the current position of the cursor on the display, as
would be returned by
.Dv WSDISPLAYIO_GCURPOS .
.It Dv WSDISPLAYIO_CURSOR_DOHOT
Get
.Va hot ,
which indicates the location of the
.Dq hot spot
within the cursor.
This is the point on the cursor whose position on the display is treated
as being the position of the cursor by other calls.
Its location is counted in pixels from the top-left corner of the cursor.
.It Dv WSDISPLAYIO_CURSOR_DOCMAP
Get
.Va cmap ,
which indicates the current cursor color map.
Unlike in a call to
.Dv WSDISPLAYIO_GETCMAP ,
.Va cmap
here need not have its
.Va index
and
.Va count
members initialized.
They will be set to 0 and 2 respectively by the call.
This means that
.Va cmap . Ns Va red ,
.Va cmap . Ns Va green ,
and
.Va cmap . Ns Va blue
must each point to at least enough space to hold two
.Li u_char Ns s .
.It Dv WSDISPLAYIO_CURSOR_DOSHAPE
Get
.Va size , image ,
and
.Va mask .
These are, respectively, the dimensions of the cursor in pixels, the
bitmap of set pixels in the cursor and the bitmap of opaque pixels in
the cursor.
The format in which these bitmaps are returned, and hence the amount of
space that must be provided by the application, are device-dependent.
.It Dv WSDISPLAYIO_CURSOR_DOALL
Get all of the above.
.El
.Pp
The device may elect to return information that was not requested by the user,
so those elements of
.Li "struct wsdisplay_cursor"
which are pointers should be initialized to
.Dv NULL
if not otherwise used.
This call is not available on displays without a hardware cursor.
.It Dv WSDISPLAYIO_SCURSOR Pq Li "struct wsdisplay_cursor"
Set some or all of the hardware cursor's attributes.
The argument structure is the same as for
.Dv WSDISPLAYIO_GCURSOR .
The
.Va which
member specifies which attributes of the cursor are to be changed.
It should contain the logical OR of the following flags:
.Bl -tag -width 4n
.It Dv WSDISPLAYIO_CURSOR_DOCUR
If
.Va enable
is zero, hide the cursor.
Otherwise, display it.
.It Dv WSDISPLAYIO_CURSOR_DOPOS
Set the cursor's position on the display to
.Va pos ,
the same as
.Dv WSDISPLAYIO_SCURPOS .
.It Dv WSDISPLAYIO_CURSOR_DOHOT
Set the
.Dq hot spot
of the cursor, as defined above, to
.Va hot .
.It Dv WSDISPLAYIO_CURSOR_DOCMAP
Set some or all of the cursor color map based on
.Va cmap .
The
.Va index
and
.Va count
elements of
.Va cmap
indicate which color map entries to set, and the entries themselves come from
.Va cmap . Ns Va red ,
.Va cmap . Ns Va green ,
and
.Va cmap . Ns Va blue .
.It Dv WSDISPLAYIO_CURSOR_DOSHAPE
Set the cursor shape from
.Va size , image ,
.Va mask .
See above for their meanings.
.It Dv WSDISPLAYIO_CURSOR_DOALL
Do all of the above.
.El
.Pp
This call is not available on displays without a hardware cursor.
.It Dv WSDISPLAYIO_GMODE Pq Li u_int
Get the current mode of the display.
Possible results include:
.Bl -tag -width 4n
.It Dv WSDISPLAYIO_MODE_EMUL
The display is in emulating (text) mode.
.It Dv WSDISPLAYIO_MODE_MAPPED
The display is in mapped (graphics) mode.
.It Dv WSDISPLAYIO_MODE_DUMBFB
The display is in mapped (frame buffer) mode.
.El
.It Dv WSDISPLAYIO_SMODE Pq Li u_int
Set the current mode of the display.
For possible arguments, see
.Dv WSDISPLAYIO_GMODE .
.\" WSDISPLAYIO_LDFONT
.\" WSDISPLAYIO_LSFONT
.\" WSDISPLAYIO_DELFONT
.\" WSDISPLAYIO_USEFONT
.It Dv WSDISPLAYIO_GBURNER Pq Li struct wsdisplay_burner
Retrieves the state of the screen burner.
The returned structure is as follows:
.Bd -literal -offset indent
struct wsdisplay_burner {
        u_int   off;
        u_int   on;
        u_int   flags;
};
.Ed
.Pp
The
.Va off
member contains the inactivity time before the screen is turned off,
in milliseconds.
The
.Va on
member contains the time before the screen is turned back on,
in milliseconds.
The
.Va flags
member contains a logical OR of the following flags:
.Bl -tag -width 4n
.It Dv WSDISPLAY_BURN_VBLANK
When turning the display off, disable the vertical synchronization signal.
.It Dv WSDISPLAY_BURN_KBD
Monitor keyboard activiy.
.It Dv WSDISPLAY_BURN_MOUSE
Monitor mouse activity
(this only works for mice using the
.Xr wsmouse 4
driver).
.It Dv WSDISPLAY_BURN_OUTPUT
Monitor display output activity.
.El
.Pp
If none of the activity source flags are set, the screen burner is disabled.
.It Dv WSDISPLAYIO_SBURNER Pq Li struct wsdisplay_burner
Sets the state of the screen burner.
The argument structure, and its semantics, are the same as for
.Dv WSDISPLAYIO_GBURNER .
.\" WSDISPLAYIO_ADDSCREEN
.\" WSDISPLAYIO_DELSCREEN
.\" WSDISPLAYIO_GETSCREEN
.\" WSDISPLAYIO_SETSCREEN
.It Dv WSDISPLAYIO_WSMOUSED Pq Li struct wscons_event
This call is used by the
.Xr wsmoused 8
daemon to inject mouse events gathered from serial mice, as well as
various control events.
.It Dv WSDISPLAYIO_GETPARAM Pq Li struct wsdisplay_param
Retrieves the state of a display parameter.
This call needs the following structure set up beforehand:
.Bd -literal -offset indent
struct wsdisplay_param {
        int param;
        int min, max, curval;
        int reserved[4];
};
.Ed
.Pp
The
.Va param
member should be set with the parameter to be returned.
The following parameters are supported:
.Bl -tag -width 4n
.It Dv WSDISPLAYIO_PARAM_BACKLIGHT
The intensity of the display backlight (usually on laptop computers).
.It Dv WSDISPLAYIO_PARAM_BRIGHTNESS
The brightness level.
.It Dv WSDISPLAYIO_PARAM_CONTRAST
The contrast level.
.El
.Pp
On return,
.Va min
and
.Va max
specify the allowed range for the value, while
.Va curval
specifies the current setting.
Not all parameters are supported by all display drivers.
.It Dv WSDISPLAYIO_SETPARAM Pq Li struct wsdisplay_param
Sets a display parameter.
The argument structure is the same as for
.Dv WSDISPLAYIO_GETPARAM ,
with the
.Va param
and
.Va curval
members filled in.
Not all parameters are supported by all display drivers.
.It Dv WSDISPLAYIO_LINEBYTES Pq Li u_int
Get the number of bytes per row when the device is in
.Dv WSDISPLAYIO_MODE_DUMBFB
mode.
.El
.Sh FILES
.Bl -tag -width /usr/include/dev/wscons/wsconsio.h -compact
.It Pa /dev/tty[C-F]*
terminal devices (per screen)
.It Pa /dev/tty[C-F]cfg
control device (per screen)
.It Pa /usr/include/dev/wscons/wsconsio.h
.El
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr agten 4 ,
.Xr bwtwo 4 ,
.Xr cgeight 4 ,
.Xr cgfour 4 ,
.Xr cgfourteen 4 ,
.Xr cgsix 4 ,
.Xr cgthree 4 ,
.Xr cgtwelve 4 ,
.Xr cgtwo 4 ,
.Xr creator 4 ,
.Xr intro 4 ,
.Xr lcd 4 ,
.Xr mgx 4 ,
.Xr pcdisplay 4 ,
.Xr pninek 4 ,
.Xr pnozz 4 ,
.Xr rfx 4 ,
.Xr smg 4 ,
.Xr sti 4 ,
.Xr tcx 4 ,
.Xr tga 4 ,
.Xr tty 4 ,
.Xr tvtwo 4 ,
.Xr vga 4 ,
.Xr vgafb 4 ,
.Xr vigra 4 ,
.Xr wscons 4 ,
.Xr zx 4 ,
.Xr wsconscfg 8 ,
.Xr wsconsctl 8 ,
.Xr wsfontload 8
.Sh BUGS
The
.Nm
code currently limits the number of screens on one display to 8.
.Pp
The terms
.Dq wscons
and
.Dq wsdisplay
are not cleanly distinguished in the code and in manual pages.
