openbsd/src/share/man/man4/wx.4
.\"	$OpenBSD: wx.4,v 1.1 2000/02/11 19:01:01 jason Exp $
.\"
.\" Copyright (c) 2000
.\"	Traakan Software. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/wx.4,v 1.1 2000/01/29 22:04:28 mjacob Exp $
.\"
.Dd January 29, 2000
.Dt WX 4
.Os
.Sh NAME
.Nm wx
.Nd
Intel Gigabit Ethernet device driver
.Sh SYNOPSIS
.Cd "wx* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm wx
driver provides support for Intel Gigabit Ethernet PCI cards.
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh AUTHOR
The
.Nm
driver was written by
.An Matthew Jacob Aq mjacob@freebsd.org .
.Sh BUGS
The
.Nm
has not got a very good recovery from link-up/link-down events.
