openbsd/src/share/man/man4/xen.4
.\"	$OpenBSD: xen.4,v 1.1 2015/12/09 00:26:39 mikeb Exp $
.\"
.\" Copyright (c) 2015 Mike Belopuhov
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: December 9 2015 $
.Dt XEN 4
.Os
.Sh NAME
.Nm xen
.Nd Xen domU nexus device
.Sh SYNOPSIS
.Cd "xen0 at pvbus?"
.Sh DESCRIPTION
.Nm
driver performs HVM domU guest initialization, provides abstraction for
virtual Xen interrupts, access to the XenStore configuration storage as
well as a device probing facility for paravirtualized devices such as
disk and network interfaces.
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr intro 4 ,
.Xr pvbus 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.9 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mike Belopuhov Aq Mt mikeb@openbsd.org
from scratch, inspired by the
.Fx
implementation.
