openbsd/src/share/man/man4/xf86.4
.\"	$OpenBSD: xf86.4,v 1.9 2004/05/03 15:18:19 drahn Exp $
.\"
.\" Copyright (c) 1998 Matthieu Herrb
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 20, 1998
.Dt XF86 4
.Os
.Sh NAME
.Nm xf86
.Nd XFree86 aperture driver
.Sh SYNOPSIS
.Cd "option APERTURE"
.Sh DESCRIPTION
On
.Va alpha ,
.Va amd64 ,
.Va cats ,
.Va i386 ,
.Va macppc ,
and
.Va sparc64
the
.Pa /dev/xf86
driver provides access to the memory and I/O ports of a VGA board
and to the PCI configuration registers
for use by the XFree86 X servers
when running with a kernel security level > 0.
.Pp
The X servers require the use of this driver.
.Sh ACCESS CONTROL
Access to the
.Pa /dev/xf86
device is allowed when the sysctl variable
.Va machdep.allowaperture
>= 1.
This variable (which has a default value of 0)
can only be manipulated when the security level is <= 0, so it should be
set in
.Pa /etc/sysctl.conf .
The possible values for
.Va machdep.allowaperture
are:
.Bl -tag -width Ds
.It 0
the aperture driver is disabled.
Opening it returns
.Dv EPERM .
.It 1
the aperture driver allows access to standard VGA framebuffer and BIOS.
Access to
.Xr pci 4
configuration registers is also allowed.
.It 2
in addition to allowing access to
.Xr pci 4
configuration registers,
the aperture driver allows access to the whole 1st megabyte of physical
memory, permitting use of the int10 emulation in XFree86 4.0.x.
Note that this can cause some security problems, since the process that
has access to the aperture driver can also access part of the kernel
memory.
This mode is not supported on alpha or sparc64.
.El
.Sh SEE ALSO
.Xr XF86_Accel 1 ,
.Xr XF86_SVGA 1 ,
.Xr options 4 ,
.Xr pci 4 ,
.Xr sysctl.conf 5 ,
.Xr config 8 ,
.Xr sysctl 8
.Sh HISTORY
.Pa /dev/xf86
was introduced as a loadable kernel module for
.Nx 0.9 c
with XFree86 3.1.
It was integrated as an in-kernel device on
.Ox 2.3 .
It is required in order to allow access to I/O ports for all X servers since
.Ox 2.4 .
.Sh AUTHORS
The aperture driver was written by Matthieu Herrb.
.Sh BUGS
This driver allows access to all addresses above
.Va physmem .
It should be restricted to the actual address range of the video
memory.
