openbsd/src/share/man/man4/xge.4
.\"	$OpenBSD: xge.4,v 1.15 2007/02/28 08:51:10 jmc Exp $
.\"	$NetBSD: xge.4,v 1.2 2005/09/10 22:48:09 wiz Exp $
.\"
.\" Copyright (c) 2005, SUNET, Swedish University Computer Network.
.\" All rights reserved.
.\"
.\" Written by Anders Magnusson for SUNET, Swedish University Computer Network.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed for the NetBSD Project by
.\"      SUNET, Swedish University Computer Network.
.\" 4. The name of SUNET may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY SUNET ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL SUNET
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 9, 2005
.Dt XGE 4
.Os
.Sh NAME
.Nm xge
.Nd Neterion Xframe/Xframe II 10Gb Ethernet device
.Sh SYNOPSIS
.Cd "xge* at pci?"
.Sh DESCRIPTION
The
.Nm
device driver provides support for various NICs based on the Neterion
Xframe and Xframe II controller chips, including the following:
.Pp
.Bl -bullet -compact
.It
Hitachi PCI-X 10 Gigabit Ethernet Adapter (Xframe II)
.It
HP AB287A 10 Gigabit Ethernet Adapter (Xframe)
.It
IBM 10GbE SR Server Adapter (Xframe II)
.It
IBM 10 Gb Ethernet-LR PCI-X 2.0 DDR Adapter (Xframe II)
.It
IBM 10 Gb Ethernet-SR PCI-X 2.0 DDR Adapter (Xframe II)
.It
Neterion Xframe (Xframe)
.It
Neterion Xframe II (Xframe II)
.It
Neterion Xframe II Sun Fire (Xframe II)
.It
Neterion Xframe E (Xframe II)
.It
SGI 10 Gigabit Ethernet Network Adapter (Xframe)
.El
.Pp
The Xframe and Xframe II support IPv4 transmit/receive IP/TCP/UDP
checksum offload and VLAN tag insertion.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Anders Magnusson Aq ragge@ludd.luth.se
and ported to
.Ox
by
.An Brad Smith Aq brad@openbsd.org .
