openbsd/src/share/man/man4/xnf.4
.\"	$OpenBSD: xnf.4,v 1.2 2016/01/07 11:57:27 mikeb Exp $
.\"
.\" Copyright (c) 2016 Mike Belopuhov
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 7 2016 $
.Dt XNF 4
.Os
.Sh NAME
.Nm xnf
.Nd Xen Netfront networking interface driver
.Sh SYNOPSIS
.Cd "xnf* at xen?"
.Sh DESCRIPTION
The
.Nm
driver provides support for a paravirtual networking interface
.Dq Netfront
native to the Xen hypervisor.
.Sh IMPLEMENTATION NOTES
Both receive and transmit ring sizes are fixed at 256 entries due to
limitations of the interface.
.Pp
Currently
.Nm
will reassemble all packet chains consisting of more than 8 fragments
by calling
.Xr m_defrag 9 .
In case the chain still has more than 8 fragments, it will be dropped.
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr intro 4 ,
.Xr xen 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.9 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mike Belopuhov Aq Mt mikeb@openbsd.org
from scratch, inspired by the
.Fx
implementation.
