openbsd/src/share/man/man4/yds.4
.\"	$OpenBSD: yds.4,v 1.8 2004/12/20 23:28:44 jmc Exp $
.\"
.\" Copyright (c) 2001 Aaron Campbell.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 29, 2001
.Dt YDS 4
.Os
.Sh NAME
.Nm yds
.Nd Yamaha DS-XG sound hardware driver
.Sh SYNOPSIS
.Cd "yds* at pci? flags 0x0000"
.Cd "audio* at yds?"
.Cd "opl* at yds?"
.Sh DESCRIPTION
The
.Nm
driver supports Yamaha DS-XG based sound chips, as found in, e.g., many
Sony Vaio notebooks.
.Pp
The flags can be used to pass additional information
to the
.Nm
driver.
.Pp
A value of 0x1000 forces the driver to disable the Sound Blaster
legacy mode.
This is needed to make the floppy work on some machines
but is disabled by default because it is known to break
.Xr apm 4
support.
.Sh FILES
The driver needs a firmware file,
which is loaded on demand when the device is attached:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Pa /etc/firmware/yds
.El
.Sh SEE ALSO
.Xr ac97 4 ,
.Xr audio 4 ,
.Xr intro 4 ,
.Xr opl 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 2.9 .
.Sh AUTHORS
Kazuki Sakamoto and Minoura Makoto.
