openbsd/src/share/man/man4/ym.4
.\" $OpenBSD: ym.4,v 1.12 2004/10/15 05:05:02 jsg Exp $
.\"
.\" Copyright (c) 1998 Constantine Paul Sapuntzakis
.\" All rights reserved
.\"
.\" Author: Constantine Paul Sapuntzakis (csapuntz@cvs.openbsd.org)
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The author's name or those of the contributors may not be used to
.\"    endorse or promote products derived from this software without
.\"    specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 20, 1998
.Dt YM 4
.Os
.Sh NAME
.Nm ym
.Nd Yamaha OPL3-SAx audio driver
.Sh SYNOPSIS
.Cd "ym* at isapnp?"
.Cd "midi* at ym?"
.Cd "audio* at ym?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Yamaha OPL3-SAx chipset-based cards.
.Sh SEE ALSO
.Xr audio 4 ,
.Xr intro 4 ,
.Xr isapnp 4 ,
.Xr midi 4 ,
.Xr wss 4
.Sh HISTORY
This driver is a thin wrapper around the
.Xr wss 4
driver.
The
.Nm
device driver appeared in
.Ox 2.4 .
.Sh BUGS
The "FM" DAC, wavetable synth, and MIDI port are not supported.
I can't seem to access any of the extended registers so
master volume, mute, 3-d control might not work through the mixer interface.
Lots of work needed.
