openbsd/src/kerberosIV/kpasswdd/kpasswdd.8
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from @(#)kpasswdd.8	8.1 (Berkeley) 6/9/93
.\"	$OpenBSD: kpasswdd.8,v 1.3 1998/06/15 21:04:00 mickey Exp $
.\"
.Dd June 9, 1993
.Dt KPASSWDD 8
.Os
.Sh NAME
.Nm kpasswdd
.Nd Kerberos password changing daemon
.Sh SYNOPSIS
.Nm kpasswdd
.Sh DESCRIPTION
.Nm Kpasswdd
is the server for the
.Xr passwd 1
program.
The server provides a remote password changing facility
with Kerberos authentication.
A user must provide the old Kerberos password, encrypted
in a random session key, to the server.
.Nm Kpasswdd
runs only on the Kerberos server, as it directly updates the
Kerberos database.
.Sh SEE ALSO
.Xr kerberos 1 ,
.Xr passwd 1
.Sh HISTORY
The
.Nm kpasswdd
utility first appeared in
.Bx 4.4 .
