openbsd/src/usr.sbin/ypserv/ypxfr/ypxfr.8
.\"	$OpenBSD: ypxfr.8,v 1.18 2008/06/01 21:45:08 sobrado Exp $
.\"
.\" Copyright (c) 1994 Mats O Jansson <moj@stacken.kth.se>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$OpenBSD: ypxfr.8,v 1.18 2008/06/01 21:45:08 sobrado Exp $
.\"
.Dd $Mdocdate: June 1 2008 $
.Dt YPXFR 8
.Os
.Sh NAME
.Nm ypxfr
.Nd get a YP map from YP server
.Sh SYNOPSIS
.Nm ypxfr
.Op Fl cf
.Op Fl C Ar tid prog ipadd port
.Op Fl d Ar domain
.Op Fl h Ar host
.Op Fl s Ar domain
.Ar mapname
.Sh DESCRIPTION
.Nm ypxfr
is the utility in YP that transfers maps to the local host.
.Pp
Since the YP master transfers a map when it has changed, an YP slave should
check for missed maps regularly.
This can be done via an entry in
.Xr crontab 5 .
The scripts
.Ar ypxfr_1perhour , ypxfr_2perday
and
.Ar ypxfr_1perday
could be used for that.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl c
Don't send a "Clear current map" to local ypserv process.
Useful if ypserv isn't running localy to avoid timeout message.
.It Fl f
Force map transfer, even if version of master is older than local copy.
.It Fl d Ar domain
Don't use default domain, use the specified domain.
.It Fl h Ar host
Get map from host instead of the maps master host.
.It Fl s Ar domain
Specify a source domain other than the target domain.
.It Fl C Ar tid prog ipadd port
This option is only used by ypserv.
This is to open communication with a yppush on another host.
.El
.Sh FILES
.Bl -tag -width /usr/sbin/ypxfr_1perhour -compact
.It Pa /usr/sbin/ypxfr_1perhour
.It Pa /usr/sbin/ypxfr_2perday
.It Pa /usr/sbin/ypxfr_1perday
.El
.Sh SEE ALSO
.Xr yp 8 ,
.Xr yppush 8 ,
.Xr ypserv 8
.Sh AUTHORS
.An Mats O Jansson Aq moj@stacken.kth.se
