openbsd/src/usr.sbin/hostated/hostated.8
.\"	$OpenBSD: hostated.8,v 1.4 2006/12/18 19:48:04 jmc Exp $
.\"
.\" Copyright (c) 2006 Pierre-Yves Ritschard <pyr@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd November 1, 2006
.Dt HOSTATED 8
.Os
.Sh NAME
.Nm hostated
.Nd Host Status daemon
.Sh SYNOPSIS
.Nm
.Op Fl dnv
.Op Fl f Ar file
.Sh DESCRIPTION
.Nm
is the host status daemon for server load balancing.
Its main purpose is to keep
.Xr pf 4
tables up to date
as well as any related pf rdr rules.
To communicate with pf,
.Nm
uses the anchor facility.
To enable
.Nm
to install rulesets through the anchor,
the following line is required in the NAT section of
.Xr pf.conf 5 :
.Bd -literal -offset indent
rdr-anchor "hostated/*"
.Ed
.Pp
.Nm
manipulates three data types: services, tables, and hosts.
Each service represents a
.Xr pf 4
rdr rule.
A service contains at least one table and one virtual IP which are
used to create the proper rule.
Each table contains at least one host, and is mapped to a pf table.
Additionally a table can be backed up i.e. its content will be swapped
by the content of another table when it is empty.
This can be used to serve static content when a dynamic service goes down.
See
.Xr hostated.conf 5
for a more detailed explanation of how to configure
.Nm .
.Pp
.Xr hostatectl 8
can be used to enable or disable hosts, tables, and services as well
as showing the current status of each object.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl d
Do not daemonize.
If this option is specified,
.Nm
will run in the foreground and log to
.Em stderr .
.It Fl f Ar file
Specify an alternative configuration file.
The default is
.Pa /etc/hostated.conf .
.It Fl n
Configtest mode.
Only check the configuration file for validity.
.It Fl v
Produce more verbose output.
.El
.Sh FILES
.Bl -tag -width "/var/run/hostated.sockXX" -compact
.It /etc/hostated.conf
Default
.Nm
configuration file.
.It /var/run/hostated.sock
Unix-domain socket used for communication with
.Xr hostatectl 8 .
.El
.Sh SEE ALSO
.Xr hostated.conf 5 ,
.Xr hostatectl 8
