openbsd/src/share/man/man4/man4.amiga/ae.4
.\"   $OpenBSD: ae.4,v 1.8 2001/11/13 13:54:26 mpech Exp $
.\"	$NetBSD: ae.4,v 1.3 1995/10/07 18:09:11 chopps Exp $
.\"
.\" Copyright (c) 1995 Bernd Ernesti and Klaus Burkert. All rights reserved.
.\" Copyright (c) 1992, 1993
.\" 	The Regents of the University of California. All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Ralph Campbell and Rick Macklem.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Klaus Burkert,by Bernd
.\"	Ernesti, by Michael van Elst, and by the University of California,
.\"	Berkeley and its contributors.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" 	This is based on the original LANCE files, as the PCnet-ISA used on
.\" 	the Ariadne is a LANCE-descendant optimized for the PC-ISA bus.
.\" 	This causes some modifications, all data that is to go into registers
.\" 	or to structures (buffer-descriptors, init-block) has to be
.\" 	byte-swapped. In addition ALL write accesses to the board have to be
.\" 	WORD or LONG, BYTE-access is prohibited!!
.\"
.\" The following requests are required for all man pages.
.Dd August 1, 1995
.Dt AE 4 amiga
.Os
.Sh NAME
.Nm ae
.Nd Ethernet driver for AMD 79C960 LANCE based boards
.Sh SYNOPSIS
.Cd "ae* at zbus0"
.Sh DESCRIPTION
The
.Nm
interface provides access to the 10 Mb/s Ethernet network via the
.Tn AMD
79C960
.Tn LANCE
Ethernet chip set.
.Pp
Each of the host's network addresses
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm
interface employs the address resolution protocol described in
.Xr arp 4
to dynamically map between Internet and Ethernet addresses on the local
network.
.Pp
This card come with two different assortment of connectors:
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It 10Base2
BNC, also known as thin-net
.It 10BaseT
UTP, also known as twisted pair
.El
.Pp
The card uses an autoselect between UTP and BNC, so it uses UTP when an
active UTP line is connected or otherwise BNC.
To choose an alternate port, use the following flag combinations with
.Xr ifconfig 8
or in your /etc/hostname.ae? file.
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It -link0
Use the autoselect between UTP and BNC (default).
.It \ link0 -link1
Use the BNC port.
.It \ link0 \ link1
Use the UTP port.
.El
.Sh HARDWARE
The
.Nm
interface supports the following Zorro II expansion cards:
.Bl -tag -width "ARIADNE" -offset indent
.It Em ARIADNE
Village Tronic's ethernet card, manufacturer\ 2167, product\ 201
.El
.Sh NOTES
Multicasting needs to be tested.
.Sh HISTORY
The
.Nm
interface first appeared in
.Nx 1.0a
.Sh SEE ALSO
.Xr arp 4 ,
.Xr inet 4 ,
.Xr intro 4 ,
.Xr ifconfig 8
