openbsd/src/share/man/man4/man4.amiga/bah.4
.\"   $OpenBSD: bah.4,v 1.6 1999/07/09 13:35:45 aaron Exp $
.\"	$NetBSD: bah.4,v 1.2 1995/06/06 23:41:37 cgd Exp $
.\"
.\" Copyright (c) 1995 Ignatios Souvatzis
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Ignatios Souvatzis
.\"      for the NetBSD project.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"

.\" The following requests are required for all man pages.
.Dd May 31, 1995
.Dt BAH 4 amiga
.Os
.Sh NAME
.Nm bah
.Nd ARCnet driver for SMC COM90C26 based boards
.Sh SYNOPSIS
.Cd "bah* at zbus0"
.Sh DESCRIPTION
The
.Nm
interface provides access to the 2.5 Mb/s ARCnet network via the
.Tn SMC
COM90C26
ARCnet chip set.
.Pp
Each of the host's network addresses
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl .
The
.Nm
interface does not employ the address resolution protocol described in
.Xr arp 4
to dynamically map between Internet and Ethernet addresses on the local
network. Instead, it uses the least significant 8 bits of the IP address
as hardware address, as described in
.Xr RFC 1051
and
.Xr RFC 1201
as one option.
.Pp
With the IFF_LINK0 flag cleared, IP encoding is done according to the
deprecated, but popular among Amiga users, RFC 1051 encoding (that
is, with simple header, packet type 240), and the MTU is 507.
.Pp
With the IFF_LINK0 flag set, IP encoding is done according to RFC 1201 (that
is, with Packet Header Definition Standard header and packet type 212). The MTU
is normally 1500.
.Pp
When switching between the two modes, do a
.Cd ifconfig interfacename down up
to switch the mtu.
.Sh HARDWARE
The
.Nm
interface supports the following Zorro II expansion cards:
.Bl -tag -width "AMERISTAR" -offset indent
.It Em A2060
Commodore's arcnet card, manufacturer\ 514, product\ 9
.It Em AMERISTAR
Ameristar's arcnet card, manufacturer\ 1053, product\ 9
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr inet 4 ,
.Xr intro 4 ,
.Xr ifconfig 8
.Xr RFC1051
,
.Xr RFC1201
.br
ARCnet Packet Header Definition Standard, Novell Inc., 1989
.Sh STANDARDS
RFC 1051 / RFC1201 without ARP, using direct mapping of lower 8 IP
address bits instead.
.Sh HISTORY
The
.Tn Amiga
.Nm
interface first appeared in
.Nx 1.0a
.Sh AUTHOR
Ignatios Souvatzis
