openbsd/src/share/man/man4/man4.amiga/intro.4
.\"	$OpenBSD: intro.4,v 1.10 2002/03/29 22:46:00 jason Exp $
.\" Copyright (c) 1990, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)intro.4	5.2 (Berkeley) 3/27/91
.\"
.Dd August 30, 1994
.Dt INTRO 4 amiga
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
The manual pages in section 4 describe the special files, 
related driver functions, and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on the
.Tn Amiga .
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system will have to be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.
Pseudo-devices are not listed.
Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width gvpbus(4) -compact -offset indent
.It Xr afsc 4
A4091 low level SCSI adapter interface.
.It Xr ahsc 4
A3000 low level SCSI adapter interface.
.It Xr atzsc 4
A2091 low level SCSI adapter interface.
.It Xr ed 4
DP8390-based ethernet interface.
.It Xr es 4
SMC91C90-based ethernet interface.
.It Xr fdc 4
Floppy disk controller device.
.It Xr fd 4
Floppy disk device.
.It Xr grf 4
Custom Chips/Retina/Retina ZIII frame buffer.
.It Xr gtsc 4
GVP low level SCSI adapter interface.
.It Xr gvpbus 4
GVP custom bus.
.It Xr kbd 4
Amiga Keyboard device.
.It Xr kmem 4
kernel virtual memory.
.It Xr ite 4
Amiga Internal Terminal Emulator.
.It Xr ivsc 4
IVS low level SCSI adapter interface.
.It Xr le 4
AMD 7990 Lance-based ethernet interface.
.It Xr mfcs 4
MultiFaceCard II/II serial interface.
.It Xr mgnsc 4
Magnum 40 low level SCSI adapter interface.
.It Xr otgsc 4
12 Gauge low level SCSI adapter interface.
.It Xr par 4
8520 built-in parallel interface.
.It Xr ser 4
8520 built-in serial interface.
.It Xr wesc 4
Warp Engine low level SCSI adapter interface.
.It Xr wstsc 4
Wordsync II low level SCSI adapter interface.
.It Xr zssc 4
Zeus low level SCSI adapter interface.
.It Xr zbus 4
Amiga Zorro II/III bus.
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HISTORY
The
.Tn Amiga
.Nm intro
first appeared in
.Nx 1.0a .
