openbsd/src/share/man/man4/man4.amiga/joy.4
.\"	$OpenBSD: joy.4,v 1.2 2001/10/05 14:45:53 mpech Exp $
.\"
.\" Copyright (c) 2000 Marc Espie
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 2, 2000
.Dt JOY 4 amiga
.Os
.Sh NAME
.Nm joy
.Nd
.Tn amiga
joystick driver
.Sh SYNOPSIS
.Cd "joy0 at mainbus0"
.Sh DESCRIPTION
This driver provides access to
.Tn amiga
joysticks.
The lower bit in the minor device number selects the joystick: 0 is the first
joystick and 1 is the second.
.Pp
The joystick connectors also accept mouses.
There is no simple way to find out whether a mouse or a joystick is currently
plugged in.
.Pp
The joystick is a digital device. Each
.Fn read
on the file descriptor does return
one byte representing the current state of the joystick,
as a set of ORed values as listed in
.Aq Pa machine/joystick.h .
.Sh FILES
.Bl -tag -width /dev/joy0 -compact
.It Pa /dev/joy0
first joystick
.It Pa /dev/joy1
second joystick
.El
.Sh AUTHORS
This very simple driver was written by Marc Espie on
.Ox .
