openbsd/src/usr.sbin/btctl/bt.conf.5
.\"	$OpenBSD: bt.conf.5,v 1.5 2011/08/19 19:59:51 jmc Exp $
.\"
.\" Copyright (c) 2008 Todd T. Fries <todd@OpenBSD.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 19 2011 $
.Dt BT.CONF 5
.Os
.Sh NAME
.Nm bt.conf
.Nd bluetooth configuration file
.Sh DESCRIPTION
The
.Nm
file specifies interfaces and device attachments for bluetooth.
.Pp
The bluetooth daemon,
.Xr btd 8 ,
can be enabled to run at boot time via the
.Va bt
variable in
.Xr rc 8 .
The
.Nm
configuration itself is loaded at boot time
in
.Xr rc.conf.local 8 .
A utility called
.Xr btctl 8
is also available to load
.Nm
configurations.
.Sh BT.CONF FILE FORMAT
Lines beginning with
.Sq #
and empty lines are regarded as comments,
and ignored.
.\" Lines may be split using the
.\" .Sq \e
.\" character.
.Pp
.Ar interface
describes the
.Xr bluetooth 3
interface to attach to.
Possible arguments include
.Ar interfacemac
and
.Ar name .
.Ar interfacemac
may be
.Sq *
to match any further interfaces.
.Ar name
may be
.Dq disable
to disable an interface from being used.
.Pp
.Ar attach
describes the
.Xr bluetooth 3
devices to attach.
Possible arguments include
.Ar devicemac ,
.Ar type ,
and
.Ar pin .
.Ar devicemac
may be
.Sq *
to match any device.
.Ar type
describes the type of device to attach.
Possible types are
.Bl -column "noneXX" "Keyboard/Mouse" -offset indent
.It Em "Type" Ta Em "Description"
.It Li none Ta "catchall"
.It Li hf Ta "Hands Free"
.It Li hid Ta "Keyboard/Mouse"
.It Li hset Ta "Handset"
.El
.Pp
.Ar pin
describes the pin number used to pair with the device.
The pin number must be specified in quotes.
.Pp
For example:
.Bd -literal -offset indent
# Enable all interfaces.
interface * "OpenBSD BT"
# Attach a keyboard and/or mouse,
# or a mobile phone emulating such things.
attach 00:02:76:08:1c:37 type hid pin "0000"
.Ed
.Sh SEE ALSO
.Xr sbt 4 ,
.Xr ubt 4 ,
.Xr btctl 8 ,
.Xr btd 8
.Sh HISTORY
The
.Nm
file format first appeared in
.Ox 4.5 .
