openbsd/src/usr.sbin/btctl/btctl.8
.\"	$OpenBSD: btctl.8,v 1.1 2008/12/01 20:22:56 todd Exp $
.\"
.\" Copyright (c) 2008 Todd T. Fries <todd@OpenBSD.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: December 1 2008 $
.Dt BTCTL 8
.Os
.Sh NAME
.Nm btctl
.Nd Bluetooth configuration utility
.Sh SYNOPSIS
.Nm btctl
.Op Fl f Ar file
.Sh DESCRIPTION
The
.Nm
utility loads rules into
.Xr btd 8 .
.Nm only does parsing, no interpretation.
The rulset grammer is described in
.Xr bt.conf 5 .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl f Ar file
Load the rules contained in
.Ar file .
.Sh EXAMPLES
The following command, executed from the command line, would configure
the
.Xr btd 8
daemon with the contents of /etc/bt.conf:
.Bd -literal -offset 3n
# btctl -f /etc/bt.conf
.Ed
.Sh SEE ALSO
.Xr bt.conf 5 ,
.Xr btd 8
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 4.5 .
