openbsd/src/usr.bin/watch/watch.1
.\"	$OpenBSD: watch.1,v 1.6 2025/05/20 08:24:16 job Exp $
.\"
.\" Copyright (c) 2000, 2001, 2014, 2016 Internet Initiative Japan Inc.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 20 2025 $
.Dt WATCH 1
.Os
.Sh NAME
.Nm watch
.Nd periodically execute a command and display its output
.Sh SYNOPSIS
.Nm
.Op Fl erwx
.Op Fl s Ar seconds 
.Ar command Op Ar arg ...
.Sh DESCRIPTION
The
.Nm
utility periodically executes and displays the output of
.Ar command .
Differences between successive runs can be highlighted.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl r
Highlight the changed character.
.It Fl e
Highlight the changed line.
.It Fl s Ar seconds
Set the interval between updates to
.Ar seconds .
The default is 1 second.
.It Fl w
Highlight the changed word.
.It Fl x
Pass
.Ar command
to
.Xr execl 3
instead of
.Ic sh -c ,
for different quoting and shell escaping behaviour.
.It Fl i Ar interval
Set the initial interval second of the periodical update to
.Ar interval .
This value must be positive and may be valid for the sixth decimal place.
The default is 2 seconds.
.El
.Pp
Certain characters cause immediate action by
.Nm .
These are:
.Bl -tag -width Fl
.It Ic k \*(Ba Ic -
Scroll up 1 line.
.It Ic j \*(Ba Aq Ic RETURN
Scroll down 1 line.
.It Ic l
Scroll right 1 column.
.It Ic h
Scroll left 1 column.
.It Ic u \*(Ba Ic ^U
Scroll up half of the screen size.
.It Ic d \*(Ba Ic ^D
Scroll down half of the screen size.
.It Ic L
Scroll right half of the screen size.
.It Ic H
Scroll left half of the screen size.
.It Ic b \*(Ba Ic ^B
Scroll up one of the screen size.
.It Ic f \*(Ba Ic F
Scroll down one of the screen size.
.It Ic >
Scroll right one of the screen size.
.It Ic <
Scroll left one of the screen size.
.It Ic [
Scroll right 8 columns.
.It Ic ]
Scroll left 8 columns.
.It Ic g
Goto the top or the prefix nubmer of lines on the output.
Enter the value before press this character.
This value must be positive.
.It Aq Ic SPACE
Update the buffer by executing the command.
.It Ic ^L
Refresh the screen without executing the command.
.It Ic r
Toggle highlighting the changing characters.
.It Ic e
Toggle highlighting the changing lines.
.It Ic w
Toggle highlighting the changing words.
.It Ic t
Toggle current highlighting mode.
.It Ic s
Change the update interval.
.It Ic p
Toggle the pausing of update output.
.It Ic ?
Show help message.
.It Ic q
Quit the program.
.El
.Sh SEE ALSO
.Xr sh 1 ,
.Xr execl 3
.Sh HISTORY
.Nm
was first published in 1991 and has been available since
.Ox 7.8 .
.Sh AUTHORS
Takuya Sato, Kazumasa Utashiro, YASUOKA Masahiko, and Job Snijders.
