openbsd/src/usr.sbin/adduser/rmgroup.8
.\"	$OpenBSD: rmgroup.8,v 1.3 1998/11/08 00:21:25 aaron Exp $
.\"
.\" Copyright (c) 1996 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $From: rmgroup.8,v 1.1 1996/11/04 17:21:11 wosch Exp $

.Dd Oct, 30, 1996
.Dt RMGROUP 8
.Os
.Sh NAME
.Nm rmgroup
.Nd delete a Unix group
.Sh SYNOPSIS
.Nm
.Ar group
.Sh DESCRIPTION
.Nm 
deletes the specified Unix
.Ar group
from group database. 
.Nm 
will not delete the system groups wheel, daemon, kmem, sys, tty,
operator, bin, nogroup, nobody,
or groups with gid 0. Do not delete these groups.
.Sh SEE ALSO
.Xr group 5 ,
.Xr adduser 8 ,
.Xr rmuser 8
.Sh HISTORY
The
.Nm
command appeared in FreeBSD 2.2.
