openbsd/src/usr.sbin/acme-client/acme-client.conf.5
.\"	$OpenBSD: acme-client.conf.5,v 1.13 2018/07/08 15:41:17 benno Exp $
.\"
.\" Copyright (c) 2005 Esben Norby <norby@openbsd.org>
.\" Copyright (c) 2004 Claudio Jeker <claudio@openbsd.org>
.\" Copyright (c) 2003, 2004 Henning Brauer <henning@openbsd.org>
.\" Copyright (c) 2002 Daniel Hartmeier <dhartmei@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 8 2018 $
.Dt ACME-CLIENT.CONF 5
.Os
.Sh NAME
.Nm acme-client.conf
.Nd acme-client configuration file
.Sh DESCRIPTION
The
.Nm
file is divided into the following main sections:
.Bl -tag -width xxxx
.It Sy Macros
User-defined variables may be defined and used later, simplifying the
configuration file.
.It Sy Authorities
Certificate authorities (CAs) that can be contacted via ACME.
.It Sy Domains
Certificate specifications.
.El
.Pp
Additional configuration files can be included with the
.Ic include
keyword, for example:
.Bd -literal -offset indent
include "/etc/acme-client.sub.conf"
.Ed
.Pp
The current line can be extended over multiple lines using a backslash
.Pq Sq \e .
Comments can be put anywhere in the file using a hash mark
.Pq Sq # ,
and extend to the end of the current line.
Care should be taken when commenting out multi-line text:
the comment is effective until the end of the entire block.
.Pp
Argument names not beginning with a letter, digit, underscore, or '/'
must be quoted.
.Sh MACROS
Macros can be defined that will later be expanded in context.
Macro names must start with a letter, digit, or underscore,
and may contain any of those characters.
Macro names may not be reserved words.
Macros are not expanded inside quotes.
.Pp
For example:
.Bd -literal -offset indent
le="letsencrypt"
domain example.com {
	sign with $le
}
.Ed
.Sh AUTHORITIES
The configured certificate authorities.
.Pp
Each authority section starts with a declaration of the name identifying a
certificate authority.
.Bl -tag -width Ds
.It Ic authority Ar name Brq ...
The
.Ar name
is a string used to reference this certificate authority.
.El
.Pp
It is followed by a block of options enclosed in curly brackets:
.Bl -tag -width Ds
.It Ic account key Ar file
Specify a
.Ar file
used to identify the user of this certificate authority.
.It Ic api url Ar url
Specify the
.Ar url
under which the ACME API is reachable.
.El
.Pp
An example authority block:
.Bd -literal -offset indent
authority letsencrypt {
	api url "https://acme-v01.api.letsencrypt.org/directory"
	account key "/etc/ssl/private/my-acme.key"
}
.Ed
.Sh DOMAINS
The certificates to be obtained through ACME.
.Bl -tag -width Ds
.It Ic domain Ar name Brq ...
Each domain section begins with the
.Ic domain
keyword followed by the name to be used as the common name component
of the subject of the X.509 certificate.
.El
.Pp
It is followed by a block of options enclosed in curly brackets:
.Bl -tag -width Ds
.It Ic alternative names Brq ...
Specify a list of alternative names for which the certificate will be valid.
The common name is included automatically if this option is present,
but there is no automatic conversion/inclusion between "www." and
plain domain name forms.
.It Ic domain key Ar file
The private key file for which the certificate will be obtained.
.It Ic domain certificate Ar file
The filename of the certificate that will be issued.
.It Ic domain chain certificate Ar file
The filename in which to store the certificate chain
that will be returned by the certificate authority.
It needs to be in the same directory as the
.Ar domain certificate
(or in a subdirectory) and can be specified as a relative or absolute path.
.It Ic domain full chain certificate Ar file
The filename in which to store the full certificate chain
that will be returned by the certificate authority.
It needs to be in the same directory as the
.Ar domain certificate
(or in a subdirectory) and can be specified as a relative or absolute path.
This is a combination of the
.Ar domain certificate
and the
.Ar domain chain certificate
in one file, and is required by most browsers.
.It Ic sign with Ar authority
The certificate authority (as declared above in the
.Sx AUTHORITIES
section) to use.
.It Ic challengedir Ar path
The directory in which the challenge file will be stored.
If it is not specified, a default of
.Pa /var/www/acme
will be used.
.El
.Pp
An example domain declaration looks like this:
.Bd -literal -offset indent
domain www.example.com {
	alternative names { example.com secure.example.com }
	domain key "/etc/ssl/private/www.example.com.key"
	domain certificate "/etc/ssl/www.example.com.crt"
	domain full chain certificate "/etc/ssl/www.example.com.fullchain.pem"
	sign with letsencrypt
	challengedir "/var/www/acme"
}
.Ed
.Pp
An
.Xr httpd.conf 5
server declaration to use that certificate looks like this:
.Bd -literal -offset indent
server "www.example.com" {
        alias "example.com"
        alias "secure.example.com"
        listen on $ext_addr port 80
        listen on $ext_addr tls port 443
        tls certificate "/etc/ssl/www.example.com.fullchain.pem"
        tls key "/etc/ssl/private/www.example.com.key"
        location "/.well-known/acme-challenge/*" {
                root "/acme"
                request strip 2
        }
        root "/htdocs"
}
.Ed
.Sh FILES
.Bl -tag -width "/etc/acme-client.conf" -compact
.It Pa /etc/acme-client.conf
.Xr acme-client 1
configuration file
.El
.Sh SEE ALSO
.Xr acme-client 1
.Sh HISTORY
The
.Nm
file format first appeared in
.Ox 6.1 .
