openbsd/src/share/man/man4/man4.mvme68k/cl.4
.\"	$OpenBSD: cl.4,v 1.1 2013/05/18 17:45:38 miod Exp $
.\"
.\" Copyright (c) 2013 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 18 2013 $
.Dt CL 4 mvme68k
.Os
.Sh NAME
.Nm cl
.Nd Cirrus Logic CD2401 serial controller
.Sh SYNOPSIS
.Cd "cl0 at pcctwo0 offset 0x45000 ipl 3"
.Sh DESCRIPTION
The
.Nm
driver provides support for the CD2401 serial controller found on
MVME167 and MVME177 systems.
.Pp
Each CD2401 controller supports four serial ports with a 16-character buffer.
.Pp
The following link speeds are supported by the
.Nm
driver:
50, 110, 150, 300, 600, 1200, 2401, 3600, 4800, 7200, 9600, 19200, 38400,
56000 and 64000 bps,
with an error margin smaller than 0.25%
(except for 56000 bps, where the error margin is 0.80%).
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/tty[0-3]
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr tty 4
