openbsd/src/share/man/man4/man4.mvme68k/ie.4
.\"     $OpenBSD: ie.4,v 1.3 2002/10/01 21:01:35 miod Exp $
.\"
.\" Copyright (c) 1998 The OpenBSD Project
.\" All rights reserved.
.\"
.Dd March 9, 1998
.Dt IE 4 mvme68k
.Os
.Sh NAME
.Nm ie
.Nd Intel 82586 Ethernet driver
.Sh SYNOPSIS
.Cd "ie0 at mc0 offset 0x46000 ipl 1" Pq "MVME162"
.Cd "ie0 at pcctwo0 offset 0x46000 ipl 1" Pq "MVME167/177"
.Sh DESCRIPTION
The
.Nm
interface provides access to the 10 Mb/s Ethernet network via the
.Tn Intel
82586
Ethernet chip set.
.Pp
Each of the host's network addresses
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm
interface employs the address resolution protocol described in
.Xr arp 4
to dynamically map between Internet and Ethernet addresses on the local
network.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr inet 4 ,
.Xr intro 4 ,
.Xr le 4 ,
.Xr netintro 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
