openbsd/src/share/man/man4/man4.mvme68k/le.4
.\"	$OpenBSD: le.4,v 1.19 2013/05/18 17:45:38 miod Exp $
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This software was developed by the Computer Systems Engineering group
.\" at Lawrence Berkeley Laboratory under DARPA contract BG 91-66 and
.\" contributed to Berkeley.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: Header: le.4,v 1.2 92/10/13 05:31:33 leres Exp
.\"	from: @(#)le.4	8.1 (Berkeley) 6/9/93
.\"
.Dd $Mdocdate: May 18 2013 $
.Dt LE 4 mvme68k
.Os
.Sh NAME
.Nm le
.Nd AMD LANCE Ethernet device
.Sh SYNOPSIS
.Cd "le* at pcc0 offset 0x1800 ipl 3                      " Pq "MVME147"
.Cd "le* at vmes0 addr 0xffff1200 ipl 3 vec 0x74 len 0x100" Pq "MVME376"
.Cd "le* at vmes0 addr 0xffff1400 ipl 3 vec 0x75 len 0x100" Pq "MVME376"
.Cd "le* at vmes0 addr 0xffff1600 ipl 3 vec 0x76 len 0x100" Pq "MVME376"
.Cd "le* at vmes0 addr 0xffff5400 ipl 3 vec 0x77 len 0x100" Pq "MVME376"
.Cd "le* at vmes0 addr 0xffff5600 ipl 3 vec 0x78 len 0x100" Pq "MVME376"
.Cd "le* at vmes0 addr 0xffffa400 ipl 3 vec 0x79 len 0x100" Pq "MVME376"
.Sh DESCRIPTION
The
.Nm
interface provides access to the 10 Mb/s Ethernet network via the
.Tn AMD
7990
.Tn LANCE
Ethernet chip set.
.Sh HARDWARE
The
.Nm
interface supports the following mvme68k hardware:
.Bl -tag -width "onboard" -offset indent
.It Em onboard
MVME147 onboard Ethernet interface
.It Em MVME376
MVME376 VMEbus Ethernet card
.El
.Sh HARDWARE CONFIGURATION
For MVME376, the card's base address
.Po
matching the
.Em addr
locator on the configuration line
.Pc
is defined through three sets of DIP switches,
.Dq SW1
and
.Dq SW2 ,
located in the middle of the board, near the space between the two
VME connectors, and
.Dq SW3 ,
closer to the AM7990DC chip at the bottom edge.
.Pp
The only supported configurations are:
.Bl -column "xxxxxxxx" "xxxxxxxx" "xxxxxxxx" "0xffffffff" -offset indent
.It Sy SW1 Ta Sy SW2 Ta Sy SW3 Ta Sy Address
.It Li "UUU_UU_U" Ta "U__U____" Ta "______U_" Ta "0xffff1200"
.It Li "UUU_U_UU" Ta "U__U_U__" Ta "______U_" Ta "0xffff1400"
.It Li "UUU_U__U" Ta "U__UU___" Ta "______U_" Ta "0xffff1600"
.It Li "U_U_U_UU" Ta "U__UUU__" Ta "______U_" Ta "0xffff5400"
.It Li "U_U_U__U" Ta "U_U_____" Ta "______U_" Ta "0xffff5600"
.It Li "_U_UU_UU" Ta "U_U__U__" Ta "______U_" Ta "0xffffa400"
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr inet 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The mvme68k
.Nm
interface first appeared in
.Ox 2.0 .
