openbsd/src/share/man/man4/man4.mvme68k/lrc.4
.\"	$OpenBSD: lrc.4,v 1.1 2009/03/01 21:40:49 miod Exp $
.\"
.\" Copyright (c) 2009 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 1 2009 $
.Dt LRC 4 mvme68k
.Os
.Sh NAME
.Nm lrc
.Nd Local Resource Controller
.Sh SYNOPSIS
.Cd "lrc0 at mainbus0 addr 0xfff90000"
.Sh DESCRIPTION
The
.Nm
ASIC provides address decoding for the local peripherals,
as well as timers and interrupt handling facilities,
and is found on the MVME165 Single-Board Computers.
.Sh SEE ALSO
.\" .Xr clock 4 ,
.\" .Xr dart 4 ,
.Xr intro 4 ,
.\" .Xr nvram 4
.\" .Xr vsb 4
.\" .Xr vme 4
