openbsd/src/share/man/man4/man4.mvme68k/memc.4
.\"	$OpenBSD: memc.4,v 1.1 2013/05/18 17:45:38 miod Exp $
.\"
.\" Copyright (c) 2013 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 18 2013 $
.Dt MEMC 4 mvme68k
.Os
.Sh NAME
.Nm memc
.Nd MVME1[67]x memory controller
.Sh SYNOPSIS
.Cd "memc0 at mc0 offset 0x43000    " Pq MVME162/172
.Cd "memc1 at mc0 offset 0x43100    " Pq MVME162/172
.Cd "memc0 at pcctwo0 offset 0x43000" Pq MVME166/167/176/177
.Cd "memc1 at pcctwo0 offset 0x43100" Pq MVME166/167/176/177
.Sh DESCRIPTION
MVME16x and MVME17x boards support up to two memory mezzanine boards.
Each board contains its own memory controller, of which two flavours exist:
.Pp
.Bl -tag -compact -width 8n
.It MEMC040
Memory Controller with parity memory
.It MCECC
Memory Controller with ECC memory
.El
.Pp
The
.Nm
driver recognizes both.
.Sh SEE ALSO
.Xr intro 4 ,
.\" Xr mc 4 ,
.Xr pcctwo 4
.Sh BUGS
The
.Nm
driver does not report corrected ECC memory errors.
