openbsd/src/share/man/man4/man4.mvme68k/vsbic.4
.\"	$OpenBSD: vsbic.4,v 1.4 2009/02/19 17:14:13 jmc Exp $
.\"
.\" Copyright (c) 2009 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 19 2009 $
.Dt VSBIC 4 mvme68k
.Os
.Sh NAME
.Nm vsbic
.Nd MVME327A SCSI and floppy controller
.Sh SYNOPSIS
.Cd "vsbic* at vmes0 addr 0xffffa600 ipl 2 vec 0x8c"
.Cd "vsbic* at vmes0 addr 0xffffa700 ipl 2 vec 0x8d"
.Cd "scsibus* at vsbic?"
.Sh DESCRIPTION
The
.Nm
driver supports the SCSI interface of the Motorola MVME327A
SCSI and floppy VME controller.
The WD33C93 SCSI controller found on this board is not directly accessible;
instead, the
.Nm
driver runs SCSI commands through the MVME327A firmware interface.
.Sh HARDWARE CONFIGURATION
The card's base address
.Po
matching the
.Em addr
locator on the configuration line
.Pc
is defined through a block of eight jumpers, labeled
.Dq J5
on the board, near its center.
.Pp
With the card oriented with its faceplate at the bottom and the VME connectors
at the top, the supported configurations are:
.Bl -column "xxxxxxxx" "0xffffffff" -offset indent
.It Li J5 Ta Address Ta Configuration
.It Li "_X_XX__X" Ta "0xffffa600" Ta "1st board"
.It Li "_X_XX___" Ta "0xffffa700" Ta "2nd board"
.El
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr ss 4 ,
.Xr st 4 ,
.Xr uk 4
.Sh BUGS
Due to firmware limitations, SCSI commands using command blocks larger than
12 bytes are not supported.
Therefore, only the first 2TB of SCSI disks are accessible.
