openbsd/src/libexec/lockspool/lockspool.1
.\"	$OpenBSD: lockspool.1,v 1.6 2002/09/18 07:33:47 deraadt Exp $
.\"
.\"
.\" Copyright (c) 1998 Todd C. Miller <Todd.Miller@courtesan.com>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL
.\" THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
.\" EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
.\" PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
.\" OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
.\" ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 13, 1998
.Dt LOCKSPOOL 1
.Os
.Sh NAME
.Nm lockspool
.Nd lock user's system mailbox
.Sh SYNOPSIS
.Nm lockspool
.Op Ar username
.Sh DESCRIPTION
.Nm
is useful for a client mail program to attain proper locking.
.Nm
obtains a
.Pa username.lock
for the calling user and retains it until stdin is closed or a signal like
.Dv SIGINT ,
.Dv SIGTERM ,
or
.Dv SIGHUP
is received.
Additionally, the superuser may specify the name of a user in order
to lock a different mailbox.
.Pp
If
.Nm
is able to create the lock file,
.Dq 1
is written to stdout, otherwise
.Dq 0
is written and an error message is written to stderr.
.Nm
will try up to 10 times to get the lock (sleeping
for a short period in between tries).
.Pp
The
.Nm
utility exits 0 on success, and 1 if an error occurs.
.Sh FILES
.Bl -tag -width /var/mail/username.lock -compact
.It Pa /var/mail/username.lock
user's mail lock file
.El
.Sh SEE ALSO
.Xr mail 1 ,
.Xr mail.local 8 ,
.Xr sendmail 8
.Sh HISTORY
The
.Nm
program appeared in
.Ox 2.4 .
