openbsd/src/share/man/man8/compat_bsdos.8
.\"	$OpenBSD: compat_bsdos.8,v 1.9 2003/08/23 19:26:25 tedu Exp $
.\"
.\" Copyright (c) 1997, Jason Downs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd September 2, 1997
.Dt COMPAT_BSDOS 8
.Os
.Sh NAME
.Nm compat_bsdos
.Nd setup for running BSDI binaries under emulation
.Sh DESCRIPTION
.Ox
supports the execution of BSDI binaries; most binaries should
work, at least from the BSDI 2.1 era.
Some things that are not currently
supported are proprietary extensions made to the BSDI kernel.
.Pp
To activate the BSDI compatibility feature, the kernel must be compiled
with the
.Nm COMPAT_BSDOS
option and the kern.emul.bsdos
.Xr sysctl 8
enabled.
.Pp
.Nm COMPAT_BSDOS
follows the standard
.Dq emul
filesystem scheme, using
.Pa /emul/bsdos
as the prefix.
This means that all BSDI executables first look in
.Pa /emul/bsdos
whenever opening a file; configuration information, shared library images,
etc., for BSDI binaries should all be installed under the emulation
directory in order to avoid conflicts with native files.
.Pp
Although many commercial BSDI binaries are
.Dq pure
(in that they need no shared libraries), system binaries and those
compiled/linked with the BSDI
.\" no .Xr here because we don't have junk like shlicc.
.Nm shlicc
program require the appropriate shared library images.
These may be found in the
.Pa /shlib
directory on a BSDI system, and must be copied to
.Pa /emul/bsdos/shlib
in order for such binaries to work.
The user is responsible for having the appropriate BSDI licenses in order
to use the shared library images.
.Sh BUGS
If BSDI ever manages to port their system to more architectures or switch
to real dynamically linked libraries these instructions may have to change.
.Pp
.Nm COMPAT_BSDOS
is currently only supported on the i386.
