openbsd/src/share/man/man8/compat_linux.8
.\"	$OpenBSD: compat_linux.8,v 1.43 2014/01/23 04:36:05 tedu Exp $
.\"	$NetBSD: compat_linux.8,v 1.2 1995/10/16 20:17:59 fvdl Exp $
.\"
.\" Copyright (c) 1995 Frank van der Linden
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed for the NetBSD Project
.\"      by Frank van der Linden
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: January 23 2014 $
.Dt COMPAT_LINUX 8
.Os
.Sh NAME
.Nm compat_linux
.Nd setup for running Linux binaries under emulation
.Sh DESCRIPTION
.Ox
supports running Linux binaries.
This only applies to i386 systems for now.
Both the a.out and ELF binary formats are supported.
Most programs should work, including the ones that use the Linux SVGAlib.
Additionally, OSS audio is emulated, so Linux binaries can access the
native audio transparently.
Programs that will not work include those that use i386-specific calls,
such as enabling virtual 8086 mode.
.Pp
The Linux compatibility feature is active
for kernels compiled with the
.Nm COMPAT_LINUX
option and kern.emul.linux
.Xr sysctl 8
enabled.
.Pp
A lot of programs are dynamically linked.
This means that the Linux shared libraries that the programs depend on
and the runtime linker are also needed.
Additionally, a "shadow root" directory for Linux binaries
on the
.Ox
system will have to be created.
This directory is named
.Pa /emul/linux .
Any file operations done by Linux programs run under
.Ox
will look in this directory first.
So, if a Linux program opens, for example,
.Pa /etc/passwd ,
.Ox
will first try to open
.Pa /emul/linux/etc/passwd ,
and if that does not exist open the `real'
.Pa /etc/passwd
file.
It is recommended that Linux packages that include configuration
files, etc., be installed under
.Pa /emul/linux ,
to avoid naming conflicts with possible
.Ox
counterparts.
Shared libraries should also be installed in the shadow tree.
.Pp
Generally, it will only be necessary to look for the shared libraries
that Linux binaries depend on the first few times that Linux programs
are installed on the
.Ox
system.
After a while, there will be a sufficient set of Linux shared libraries
on the system to be able to run newly imported Linux binaries without
any extra work.
.Ss Setting up shared libraries
How to get to know which shared libraries Linux binaries need, and where
to get them?
Basically, there are 2 possibilities.
(When following these instructions, root privileges are required on the
.Ox
system to perform the necessary installation steps).
.Bl -enum
.It
Access to the
.Ox
.Xr ports 7
system:
Install the port named
.Nm fedora/base
in the
.Nm emulators
category.
The
.Nm fedora/base
port contains the shared libraries, binaries, and other related files
necessary to run Linux applications.
Access to a Linux system is not needed.
.It
Access to a Linux system:
In this case temporarily install the binary there, see what
shared libraries it needs, and copy them to the
.Ox
system.
Example: ftp the Linux binary of Doom.
Put it on the Linux system, and check which shared
libraries it needs by running `ldd linuxxdoom':
.Pp
.Dl (me@linux) ldd linuxxdoom
.Bd -unfilled -offset indent
libXt.so.3 (DLL Jump 3.1) => /usr/X11/lib/libXt.so.3.1.0
libX11.so.3 (DLL Jump 3.1) => /usr/X11/lib/libX11.so.3.1.0
libc.so.4 (DLL Jump 4.5pl26) => /lib/libc.so.4.6.29
.Ed
.Pp
Get all the files from the last column, and put them under
.Pa /emul/linux ,
with the names in the first column
as symbolic links pointing to them.
The following files would therefore be required on the
.Ox
system:
.Bd -unfilled -offset indent
/emul/linux/usr/X11/lib/libXt.so.3.1.0
/emul/linux/usr/X11/lib/libXt.so.3 (symbolic link to the above)
/emul/linux/usr/X11/lib/libX11.so.3.1.0
/emul/linux/usr/X11/lib/libX11.so.3 (symbolic link to the above)
/emul/linux/lib/libc.so.4.6.29
/emul/linux/lib/libc.so.4 (symbolic link to the above)
.Ed
.Pp
Note that if a Linux shared library with a
matching major revision number to the first column of the 'ldd'
output is already present, it isn't necessary to copy the file named
in the last column to the
.Ox
system; the one already there should work.
It is advisable to copy the shared library anyway, if it is a newer version.
The old one can be removed, as long as the symbolic
link points to the new one.
So, if these libraries exist on the system:
.Bd -unfilled -offset indent
/emul/linux/lib/libc.so.4.6.27
/emul/linux/lib/libc.so.4 -> /emul/linux/lib/libc.so.4.6.27
.Ed
.Pp
and the ldd output for a new binary is:
.Bd -unfilled -offset indent
libc.so.4 (DLL Jump 4.5pl26) => /lib/libc.so.4.6.29
.Ed
.Pp
it isn't necessary to copy
.Pa /lib/libc.so.4.6.29
too, because the program should work fine with the slightly older version.
.Pa libc.so
can be replaced anyway, and that should leave:
.Bd -unfilled -offset indent
/emul/linux/lib/libc.so.4.6.29
/emul/linux/lib/libc.so.4 -> /emul/linux/lib/libc.so.4.6.29
.Ed
.Pp
Please note that the symbolic link mechanism is
only needed for Linux binaries, the
.Ox
runtime linker takes care of looking for matching major revision numbers
itself.
.Pp
Finally, the Linux runtime linker and its config files must be present
on the system.
These files should be copied from the Linux system to their appropriate
place on the
.Ox
system (in the
.Pa /emul/linux
tree):
.Bd -unfilled -offset indent
/lib/ld.so
/etc/ld.so.cache
/etc/ld.so.config
.Ed
.El
.Ss Programs using SVGAlib
SVGAlib binaries require some extra care.
The pcvt virtual console driver has to be in the kernel for them to work,
and some symbolic links in the
.Pa /emul/linux/dev
directory will have to be created, namely:
.Bd -unfilled -offset indent
/emul/linux/dev/console -> /dev/tty
/emul/linux/dev/mouse -> whatever device the mouse is connected to
/emul/linux/dev/ttyS0 -> /dev/tty00
/emul/linux/dev/ttyS1 -> /dev/tty01
.Ed
.Pp
Be warned: the first link mentioned here makes SVGAlib binaries
work, but may confuse others, so it may be necessary to remove it again at
some point.
.Ss Programs using OSS (Linux) audio
Only the DSP device is emulated, the following link should be created:
.Pp
.D1 /emul/linux/dev/dsp -> /dev/audio
.Ss Other links Linux binaries may require
CD-ROM support requires a link to the CD-ROM device, similar to:
.Pp
.D1 /emul/linux/dev/cdrom -> /dev/cd0a   (first CD-ROM)
.Ss File systems
Many Linux binaries expect
.Pa /proc
to have procfs mounted on it.
Some binaries will require it to be mounted using the
.Fl o Ar linux
option.
.Sh BUGS
.Nm
is incomplete and currently only supported on the i386.
