openbsd/src/share/man/man8/netstart.8
.\"	$OpenBSD: netstart.8,v 1.1 2002/02/21 02:36:09 miod Exp $
.\"
.\" Copyright (c) 2002, Miodrag Vallat.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"     @(#)rc.8	8.2 (Berkeley) 12/11/93
.\"
.Dd February 20, 2002
.Dt NETSTART 8
.Os
.Sh NAME
.Nm netstart
.Nd command scripts for network startup
.Sh SYNOPSIS
.Nm /etc/netstart
.Op interface ...
.Sh DESCRIPTION
.Nm netstart
is the command script that is invoked by
.Xr rc 8
during an automatic reboot and after single user mode is exited;
it performs network initialization.
.Pp
The
.Nm netstart
script can also be used to start newly-created bridges or interfaces,
or reset existing interfaces to their default state.
The behaviour of this script is (or can be) controlled to some
extent by variables defined in
.Nm rc.conf ,
which specifies which daemons and services are to be run.
.Pp
During the system boot,
.Nm 
is executed.
.Nm netstart
will perform the following operations:
.Bl -bullet -compact
.It
Set the machine's name.
.It
Configure the loopback interface.
.It
Configure all the physical interfaces.
.It
Initialize the routing table and setup the default routes.
.It
Configure all the
.Xr gif 4
and
.Xr gre 4
interfaces.
.It
Configure all the bridges.
.El
.Pp
After the system is completely initialized, it is possible to start a
newly-created interface or
.Xr bridge 4 ,
or reset an existing interface to its default state, by invoking
.Bd -literal -compact
sh /etc/netstart foo0
.Ed
where
.Ar foo0
is the interface or bridge name.
.Sh SEE ALSO
.Xr bridge 4 ,
.Xr bridgename.if 5 ,
.Xr gif 4 ,
.Xr gre 4 ,
.Xr hostname.if 5 ,
.Xr rc.conf 8 ,
.Xr rc 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.0 .
