openbsd/src/share/man/man8/rc.8
.\"	$OpenBSD: rc.8,v 1.7 1999/07/20 06:20:03 deraadt Exp $
.\"
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)rc.8	8.2 (Berkeley) 12/11/93
.\"
.Dd December 11, 1993
.Dt RC 8
.Os
.Sh NAME
.Nm rc
.Nd command script for auto\-reboot and daemons
.Sh SYNOPSIS
.Nm /etc/rc
.Nm /etc/rc.local
.Nm /etc/rc.securelevel
.Nm /etc/netstart
.Nm /etc/rc.shutdown
.Sh DESCRIPTION
.Nm rc
is the command script that is invoked by
.Xr init 8
during an automatic reboot and after single user mode is exited;
it performs system housekeeping chores and starts up system daemons.
As well,
.Nm rc
is intricately tied to the
.Nm netstart
script, which runs commands and daemons pertaining to the network.
The
.Nm rc.securelevel
and
.Nm rc.local
scripts hold commands which are pertinent only to a specific site.
.Pp
All four of these startup scripts are (or can be) controlled to some
extent by variables defined in
.Xr rc.conf 8 , Ns
which specifies which daemons and services are to be run.
.Pp
When an automatic reboot is in progress,
.Nm rc
is invoked with the argument
.Em autoboot .
The first portion of
.Nm rc
runs an
.Xr fsck 8
with option
.Fl p
to ``preen'' all the disks of minor inconsistencies resulting
from the last system shutdown and to check for serious inconsistencies
caused by hardware or software failure.
If this auto-check and repair succeeds, then the second part of
.Nm rc
is run.
.Pp
The second part of
.Nm rc ,
which is run after an auto-reboot succeeds and also if
.Nm rc
is invoked when a single user shell terminates (see
.Xr init 8 ) ,
then asks
.Xr rc.conf 8
for configuration variables,
mounts filesystems, starts system daemons,
preserves editor files,
clears the scratch directory
.Pa /tmp ,
and saves any possible core image that might have been
generated as a result of a system crash, with
.Xr savecore 8 .
.Pp
Before
.Nm rc
starts most system daemons,
.Nm netstart
is executed.
.Nm netstart
defines the machine's name, configures various  network interfaces
and system features, initializes the routing table, and numerous
other tasks.
.Pp
.Nm rc.securelevel
is executed by
.Nm rc
to start daemons that must run before the security level changes.
Following this,
.Nm rc
then sets the security level to the values specified in
.Xr rc.conf 8 .
.Pp
.Nm rc.local
is executed towards the end of
.Nm rc
(it is not the very last as there are a few services that must be
the started at the very end).
Normally,
.Nm rc.local
contains commands and daemons that are not part of the
stock installation.
.Pp
.Sh SEE ALSO
.Xr sysctl.conf 5 ,
.Xr init 8 ,
.Xr rc.conf 8 ,
.Xr reboot 8 ,
.Xr savecore 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.0 .
