openbsd/src/share/man/man8/rc.conf.8
.\"	$OpenBSD: rc.conf.8,v 1.20 2012/03/17 14:46:40 jmc Exp $
.\"
.\" Copyright (c) 1997 Ian F. Darwin
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 17 2012 $
.Dt RC.CONF 8
.Os
.Sh NAME
.Nm rc.conf ,
.Nm rc.conf.local
.Nd system daemon configuration database
.Sh DESCRIPTION
The file
.Nm rc.conf
contains a series of Bourne shell syntax assignments
that are used to configure the system daemons.
It is not read by the kernel, but is sourced by various other files
in the
.Pa /etc/rc.*
series in order to set shell variables used therein
to control the behaviour of the scripts.
.Pp
It is advisable to leave
.Nm rc.conf
untouched, and instead create and edit a new
.Nm rc.conf.local
file.
Variables set in this file will override variables previously set in
.Nm rc.conf .
.Pp
Some variables are used to turn features on or off.
For example, whether the system runs the
.Xr dhcpd 8
daemon is determined by the following line:
.Bd -literal -offset indent
dhcpd_flags=NO			# for normal use: ""
.Ed
.Pp
To run the dhcpd daemon,
add the following line to
.Nm rc.conf.local :
.Bd -literal -offset indent
dhcpd_flags=""			# for normal use: ""
.Ed
.Pp
If instead some options are specified,
then the dhcpd daemon will be started with those options.
For example:
.Bd -literal -offset indent
dhcpd_flags="-A abandoned"	# for normal use: ""
.Ed
.Pp
Other variables specify a simple YES or NO,
or simply determine the location of a file.
For example, the location of the ruleset for
.Xr pf 4
is given thus:
.Bd -literal -offset indent
pf_rules=/etc/pf.conf           # Packet filter rules file
.Ed
.Pp
Finally there is the
.Va pkg_scripts
variable, responsible for starting and stopping
.Xr rc.d 8
scripts installed by packages in the specified order.
For example:
.Bd -literal -offset indent
pkg_scripts="dbus_daemon cupsd"
.Ed
.Pp
This will run
.Pa /etc/rc.d/dbus_daemon
then
.Pa /etc/rc.d/cupsd
with the
.Va start
argument at boot time,
and in reverse order with the
.Va stop
argument at shutdown.
.Sh SEE ALSO
.Xr init 8 ,
.Xr intro 8 ,
.Xr rc 8 ,
.Xr rc.d 8
.Sh HISTORY
The
.Nm
file first appeared in
.Ox 2.2 .
