openbsd/src/share/man/man8/rc.d.8
.\" 	$OpenBSD: rc.d.8,v 1.7 2011/03/15 12:21:08 ajacoutot Exp $
.\"
.\" Copyright (c) 2011 Robert Nagy, Antoine Jacoutot, Ingo Schwarze
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 15 2011 $
.Dt RC.D 8
.Os
.Sh NAME
.Nm rc.d
.Nd daemon control scripts
.Sh SYNOPSIS
.Nm /etc/rc.d/ Ns Ar daemon action
.Sh DESCRIPTION
The
.Pa /etc/rc.d
directory contains shell scripts to start, stop, and reconfigure daemon
programs
.Pq Dq services .
Currently, it is only used for daemons installed from
.Xr packages 7 ,
and not for the
.Ox
base system.
.Pp
Those services may be started at boot time in the order specified by the
.Va rc_scripts
variable from
.Xr rc.conf 8 ,
the order will be reversed during shutdown.
.Pp
Each such script responds to the following
.Ar actions :
.Pp
.Bl -tag -width restart -offset indent -compact
.It Cm start
Start the service, if not already running.
.It Cm stop
Stop the service.
.It Cm reload
Tell the daemon to reload its configuration.
.It Cm restart
Perform a stop, then a start.
.It Cm check
Return 0 if the daemon is running or 1 if it is not.
.El
.Sh ENVIRONMENT
Daemon control scripts use a fixed number of
.Xr sh 1
variables when starting a daemon.
The following two can be overridden by site-specific values provided in
.Xr rc.conf.local 8 :
.Pp
.Bl -tag -width daemon_flags -offset indent -compact
.It Ar daemon Ns _flags
Arguments to call the daemon with.
.It Ar daemon Ns _user
User to run the daemon as, using
.Xr su 1 .
.El
.Pp
To obtain the actual variable names, replace
.Ar daemon
with the name of the script.
For example, postgres is managed through
.Pa /etc/rc.d/postgresql .
To run the daemon using a site-specific user account, define the following in
.Xr rc.conf.local 8 :
.Pp
.Dl postgresql_user=mypgsqluser
.Pp
Each script may define its own defaults, as explained in
.Xr rc.subr 8 .
.Pp
.Va daemon_class
is a special read-only variable.
It is set to
.Dq daemon
unless there is a login class configured in
.Xr login.conf 5
with the same name as the
.Nm rc.d
script itself,
in which case it will be set to that login class.
.Sh FILES
.Bl -tag -width Ds
.It Pa /etc/rc.d/
Directory containing daemon control scripts.
.It Pa /etc/rc.d/rc.subr
Functions and variables used by
.Nm rc.d
scripts.
.El
.Sh SEE ALSO
.Xr rc 8 ,
.Xr rc.conf 8 ,
.Xr rc.subr 8
.Sh HISTORY
The
.Pa /etc/rc.d
directory
first appeared in
.Ox 4.9 .
.Sh BUGS
Changing
.Ar daemon Ns _flags
in
.Xr rc.conf.local 8
will change the corresponding pattern used with
.Xr pkill 1 ,
so that
.Ar actions
may not work on already running processes.
