openbsd/src/share/man/man8/rc.shutdown.8
.\"	$OpenBSD: rc.shutdown.8,v 1.8 2007/05/31 19:19:59 jmc Exp $
.\"
.\" Copyright (c) 1999 Aaron Campbell
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt RC.SHUTDOWN 8
.Os
.Sh NAME
.Nm rc.shutdown
.Nd command script run at system shutdown
.Sh DESCRIPTION
When the system is administratively shut down using either the
.Xr reboot 8
or
.Xr halt 8
command,
.Xr rc 8
is invoked with the argument
.Dq shutdown ,
which checks for the existence of a
.Pa /etc/rc.shutdown
script to run before halting the system.
This script, like
.Xr rc.local 8 ,
is entirely for commands added by the system administrator.
.Pp
The
.Nm
script is also executed by
.Xr init 8
if a keyboard-requested halt is issued (for architectures that support this).
.Pp
If
.Nm
sets the variable
.Va powerdown
to
.Dq YES ,
.Xr halt 8
will attempt to power down the machine after it has halted.
.Sh SEE ALSO
.Xr halt 8 ,
.Xr init 8 ,
.Xr rc 8 ,
.Xr reboot 8
