openbsd/src/share/man/man8/update.8
.\"
.\" Copyright (c) 1996 SigmaSoft, Th. Lockert
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by SigmaSoft, Th. Lockert.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$OpenBSD: update.8,v 1.5 1998/06/29 05:56:26 angelos Exp $
.\"
.Dd June 8, 1996
.Dt UPDATE 8
.Os
.Sh NAME
.Nm update
.Nd flush internal filesystem caches to disk frequently
.Sh SYNOPSIS
.Nm update
.Sh DESCRIPTION
The
.Nm update
command no longer exists, but has been incorporated into
the kernel where it will flush dirty buffers that have not
been touched for thirty seconds or more.
.Pp
The same effect can be obtained by using the
.Xr sync 8
command, although the in-kernel
.Nm update
process will do this in a staggered manner.
.Sh SEE ALSO
.Xr sync 2 ,
.Xr fsck 8 ,
.Xr init 8 ,
.Xr sync 8
.Sh BUGS
It is possible on some systems, that a
.Xr sync
occuring simultaneously with a crash may cause
file system damage. See
.Xr fsck 8 .
.Sh HISTORY
An
.Nm update
command appeared in
.At v6 .
.Pp
The
.Nm update
command was incorporated into the kernel in
.Ox 1.2 .
