openbsd/src/usr.sbin/afs/src/arlad/AliasDB.5
.\" Copyright (c) 2002, Kungliga Tekniska Högskolan
.\" (Royal Institute of Technology, Stockholm, Sweden).
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" 3. Neither the name of the Institute nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $arla: AliasDB.5,v 1.3 2003/02/14 16:24:51 lha Exp $
.\"
.Dd April 30, 2001
.Dt ALIASDB 5
.Os "The Arla Project"
.Sh NAME
.Nm AliasDB
.Nd add alias for an afs cell in dynroot
.Sh DESCRIPTION
The file
.Nm
add aliases for afs cellnames in dynroot, useful to add readwrite mountpoints
in dynroot.
.Pp
Each line in the file contains at least two elements with an optional
third element.
The first element is the cell name to make the alias for. The second
element is the alias.
The optional third element is describing properties of the
mountpoint.
.Pp
By default, an alias is a readonly mountpoint, which means that
.Nm afsd
will use readonly replicas of volumes, if they exist.
If an alias set to readwrite,
.Nm afsd
will disregard the readonly replicas and use the readwrite volumes only.
This will seriously limit performance, but maybe necessary to install
software packages etc.
.Pp
Each line that starts with a
.Sq #
is a comment
.Sh EXAMPLE
.Bd -literal
# This is a comment
# cell		alias		[property]
su.se		.su.se		readwrite
e.kth.se	.e.kth.se	rw
cs.cmu.edu	cs		readonly
andrew.cmu.edu	andrew  #andrew is a readonly alias
.Ed
.\"	su.se:www	su-web
.Sh FILES
.Pa AliasDB
.Sh SEE ALSO
.Xr CellServDB 5 ,
.Xr DynRootDB 5 ,
.Xr afsd 8
