openbsd/src/usr.sbin/afs/src/arlad/arla-cli.8
.\" Copyright (c) 2000 - 2002 Kungliga Tekniska Högskolan
.\" (Royal Institute of Technology, Stockholm, Sweden).
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" 3. Neither the name of the Institute nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$arla: arla-cli.8,v 1.7 2003/04/01 14:05:30 lha Exp $
.\"
.Dd September 23, 2000
.Dt ARLA-CLI 1
.Os "The Arla Project"
.Sh NAME
.Nm arla-cli
.Nd commandline AFS cache manager
.Sh SYNOPSIS
Has the same options as
.Xr arlad 8 .
See that manual page for complete reference.
.Sh DESCRIPTION
.Nm
is a cache manager that have a commadline interface to access AFS.
It's primarily used for testing if arla works.
.Pp
It creates a cache directory named 
.Pa .arlacache
in your home directory as the command tool is started in.
.Pp
Available commands are:
.Bl -tag -width 15
.It chdir
.It ls
.It cat
.It cp
.It wc
.It checkservers
.It conn-status
.It vol-status
.It cred-status
.It rx-status
.It flushfid
.It sysname
.It quit
.It help
.El
.Sh SEE ALSO
.Xr fs 1 ,
.Xr pts 1 ,
.Xr AliasDB 5 ,
.Xr CellServDB 5 ,
.Xr SuidCells 5 ,
.Xr ThisCell 5 ,
.Xr arla.conf 5 ,
.Xr arlad 8 ,
.Xr mount_nnpfs 8 ,
.Xr vos 8
