openbsd/src/usr.sbin/afs/src/arlad/arla.conf.5
.\" Copyright (c) 2000 Kungliga Tekniska Högskolan
.\" $KTH: arla.conf.5,v 1.1 2000/09/09 14:24:38 lha Exp $
.Dd Sep 09, 2000
.Dt arla.conf 5
.Os Arla
.Sh NAME
.Nm arla.conf
.Nd
configuration file for the arla afs implementation.
.Sh SYNOPSIS
The default configuration file works very well in most cases.
.Sh DESCRIPTION
Most flags can be overridden by command line arguments to
.Nm arlad .
.Pp
Supported flags:
.Bl -tag -width Ds
.It high_vnodes
The upper limit of
.Nm arlad's
vnodes (think files and directories).
.It low_vnodes
The number of used vnodes we try to keep in the cache. Any higher
number of used nodes will trigger the cleaner thread.
.It high_bytes
The high watermark for files used by arlad.
.It low_bytes
The number of bytes we try to keep in the cache. Any higher number of
bytes will trigger the cleaner thread.
.It numcreds
The number of credentials in arla, both unauthentic, and authentic
(like Kerberos V4 creds).
.It numconns
The maxium connections arla will have to all servers (fileserver and
vldb-server).
.It numvols
The number of volumes stored in cache.
.It fpriority
File priority, the describes how the cleaner process will clean out
files when set to a non-zero value. You might lose files that you fell
is important (and isn't marked with priority flag) when you are in
disconnected mode. You might not want to set this since then you'll
loose valuble diskspace for to `sticky' files.
.El
.Sh SEE ALSO
.Xr arlad 8 ,
.Xr ThisCell 5 ,
.Xr CellServDB 5 ,
.Xr TheseCells 5
