openbsd/src/usr.sbin/afs/src/arlad/arlad.8
.\" Copyright (c) 2000 - 2003 Kungliga Tekniska Högskolan
.\" (Royal Institute of Technology, Stockholm, Sweden).
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" 3. Neither the name of the Institute nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     $OpenBSD: arlad.8,v 1.11 2009/06/07 18:10:21 jmc Exp $
.\"	$arla: arlad.8,v 1.18 2003/06/06 12:53:56 hin Exp $
.\"
.Dd September 5, 1998
.Dt AFSD 8
.Os "The Arla Project"
.Sh NAME
.Nm afsd
.Nd AFS cache manager
.Sh SYNOPSIS
.Nm
.Bk -words
.Oo Fl c Ar string \*(Ba Xo
.Fl -conffile= Ns Ar string Oc
.Xc
.Oo Fl l Ar string \*(Ba Xo
.Fl -log= Ns Ar string Oc
.Xc
.Op Fl -debug= Ns Ar string
.Oo Fl d Ar string \*(Ba Xo
.Fl -device= Ns Ar string Oc
.Xc
.Op Fl -connected-mode= Ns Ar string
.Op Fl n | Fl -no-fork
.Oo Fl r Ar string \*(Ba Xo
.Fl -rxkad-level= Ns Ar string Oc
.Xc
.Oo Fl s Ar string \*(Ba Xo
.Fl -sysname= Ns Ar string Oc
.Xc
.Op Fl -root-volume= Ns Ar string
.Op Fl -port= Ns Ar number
.Op Fl z | Fl -recover
.Op Fl -cache-dir= Ns Ar string
.Op Fl D | -dynroot
.Op Fl -cpu-usage
.Op Fl -version
.Op Fl -help
.Op Ar device
.Ek
.Sh DESCRIPTION
.Nm
runs on AFS client machines.
It is used to manage the file cache, fetch files
from AFS servers, handle callbacks and manage the authentication information
for users.
.Pp
In normal cases
.Nm
will be started by enabling it in
.Pa /etc/rc.conf Ns .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Xo
.Fl c Ar string Ns ,
.Fl -conffile= Ns Ar string
.Xc
Path to configuration file.
.It Xo
.Fl l Ar string Ns ,
.Fl -log= Ns Ar string
.Xc
Where to write log [stderr|syslog|path] (default: stderr).
.It Xo
.Fl -debug= Ns Ar string
.Xc
What to write in the log (default: none).
.It Xo
.Fl d Ar string Ns ,
.Fl -device= Ns Ar string
.Xc
The XFS device to use
.Po default: Pa /dev/nnpfs0
.Pc .
.It Xo
.Fl -connected-mode= Ns Ar string
.Xc
Initial connected mode [conncted|fetch-only|disconnected].
.It Xo
.Fl n Ns ,
.Fl -no-fork
.Xc
Don't fork and daemonize.
.It Xo
.Fl r Ar string Ns ,
.Fl -rxkad-level= Ns Ar string
.Xc
The rxkad level to use [clear|auth|crypt] (default: crypt).
.It Xo
.Fl s Ar string Ns ,
.Fl -sysname= Ns Ar string
.Xc
Set the sysname of this system.
.It Xo
.Fl -root-volume= Ns Ar string
.Xc
Name of the root volume.
.It Xo
.Fl -port= Ns Ar number
.Xc
Port number to use.
.It Xo
.Fl z Ns ,
.Fl -recover
.Xc
Don't recover state.
.It Xo
.Fl -cache-dir= Ns Ar string
.Xc
Cache directory
.Po default: Pa /var/spool/afs
.Pc .
.It Xo
.Fl D Ns ,
.Fl -dynroot
.Xc
Use dynamic root.
.It Xo
.Fl -cpu-usage
.Xc
System and userland cpu-usage times is appended at the end line that
is logged.
.It Xo
.Fl -version
.Xc
Print version information.
.It Xo
.Fl -help
.Xc
Print usage information.
.El
.Pp
It is highly recommended that the cache filesystem size is increased
to at least few hundred megabytes, and that it is made as a separate
filesystem.
The cache size is configured in
.Xr afsd.conf 5 Ns .
If enough memory is available the cache filesystem could be a
.Xr mfs 8
to improve performance.
.Sh FILES
.Bl -tag -width /etc/afs/CellServDB -compact
.It Pa /etc/afs/afsd.conf
default configuration for afsd
.It Pa /etc/afs/CellServDB
database with all known AFS servers
.It Pa /etc/afs/ThisCell
default cell (where we get the root directory)
.It Pa /var/spool/afs
default cache directory
.El
.Sh SEE ALSO
.Xr fs 1 ,
.Xr pts 1 ,
.Xr afsd.conf 5 ,
.Xr AliasDB 5 ,
.Xr CellServDB 5 ,
.Xr DynRootDB 5 ,
.Xr SuidCells 5 ,
.Xr ThisCell 5 ,
.Xr mount_mfs 8 ,
.Xr mount_nnpfs 8 ,
.Xr rc.conf 8 ,
.Xr vos 8
.Sh BUGS
If
.Nm
happens to crash, it's recommended to restart it with the
.Fl z
flag.
Otherwise a corrupted cache can be reused.
