openbsd/src/usr.sbin/afs/src/arlad/CellServDB.5
.\" Copyright (c) 2000 - 2002 Kungliga Tekniska Högskolan
.\" (Royal Institute of Technology, Stockholm, Sweden).
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" 3. Neither the name of the Institute nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$arla: CellServDB.5,v 1.10 2003/06/06 12:53:52 hin Exp $
.\"     $OpenBSD: CellServDB.5,v 1.8 2003/09/26 22:13:46 jmc Exp $
.\"
.Dd April 19, 2000
.Dt CELLSERVDB 5
.Os "The Arla Project"
.Sh NAME
.Nm CellServDB
.Nd AFS cells and database servers
.Sh DESCRIPTION
The file
.Nm
lists AFS cells known to the local AFS cache manager.
Each entry describes the name of an AFS cell and specifies the
servers for that cell.
.Pp
Here is an example of the format of an entry in the file:
.Bd -literal
>cellname               # Freetext comment describing the cell
ip-address              #first.server.for.cell
ip-address              #second.server.for.cell
ip-address              #third.server.for.cell
.Ed
.Pp
.Nm
is read when
.Nm
is started, normally when the system boots.
.Pp
The text after the # is
.Em not
a comment, it's the hostname of the
db-server, and it's used to lookup the address. The address is only
used when the hostname is not found in DNS.
.Pp
Entries in the file are searched and expanded by many programs.
.Pp
In most cases it is better to distribute the information in
.Nm
with the AFSDB DNS resource records. This avoids having out of date
information in
.Nm Ns .
.Pp
When using AFSDB DNS resource records, entries entries should still
be listed, but without any hosts. This is needed for dynroot to work.
.Sh FILES
.Pa /etc/afs/CellServDB
.Sh SEE ALSO
.Xr fs 1 ,
.Xr AliasDB 5 ,
.Xr DynRootDB 5 ,
.Xr ThisCell 5 ,
.Xr afsd.conf 5 ,
.Xr afsd 8
