openbsd/src/usr.sbin/afs/src/arlad/CellServDB.5
.\"     $OpenBSD: CellServDB.5,v 1.3 2002/06/07 06:54:39 hin Exp $
.\"	$KTH: CellServDB.5,v 1.3 2000/09/25 07:24:18 lha Exp $
.Dd April 19, 2000
.Dt CellServDB 5
.Os
.Sh NAME
.Nm CellServDB
.Nd AFS cells and database servers
.Sh DESCRIPTION
The file
.Nm
lists AFS cells known to the local AFS cache manager.
Each entry describes the name of an AFS cell and specifies the
servers for that cell.
.Pp
Here is an example of the format of an entry in the file:
.Bd -literal
>cellname               # Freetext comment describing the cell
ip-address              #first.server.for.cell
ip-address              #second.server.for.cell
ip-address              #third.server.for.cell
.Ed
.Pp
.Nm
is read when 
.Nm arlad
is started, normally when the system boots.
.Pp
The text after the # is NOT a comment, it the hostname of the
db-server, and it's used to lookup the address. The address is only
used when the hostname doesn't resolve.
.Pp
Entires in the file are searched and expanded by many programs
.Pp
There is better way to distribute database-server location then
CellServDB and that is via a DNS resource record called AFSDB.  This
is better since there will be no more obsolete CellServDB files laying
around with no longer valid information.
.Pp
When useing AFSDB-rr, entries entries should still be listed, but
without listing any hosts. This is needed for dynroot to work.
.Sh FILES
.Pa /usr/arla/etc/CellServDB
.Sh SEE ALSO
.Xr arlad 8
