openbsd/src/usr.sbin/afs/src/arlad/DynRootDB.5
.\" Copyright (c) 2003 Kungliga Tekniska Högskolan
.\" (Royal Institute of Technology, Stockholm, Sweden).
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" 3. Neither the name of the Institute nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     $arla: DynRootDB.5,v 1.9 2003/06/06 12:53:53 hin Exp $
.\"
.Dd March 31, 2003
.Dt DYNROOTDB 5
.Os "The Arla Project"
.Sh NAME
.Nm DynRootDB
.Nd AFS cells and database servers
.Sh DESCRIPTION
The file
.Nm
specifies what AFS cells that should appear in the AFS root
.Pa ( /afs )
when starting
.Nm afsd .
.Pp
Each line in the file should contain one cell, for example:
.Bd -literal
stacken.kth.se
e.kth.se
nada.kth.se
it.kth.se
.Ed
.Pp
.Nm
is read when 
.Nm afsd
is started, normally when the system boots.
.Pp
If
.Nm
doesn't exist, then all cells listed in the CellServDB and the
dynamically found nodes appear in the
.Pa /afs
directory.
.Sh FILES
.Pa /etc/afs/DynRootDB
.Pa /etc/afs/CellServDB
.Sh SEE ALSO
.Xr AliasDB 5 ,
.Xr CellServDB 5 ,
.Xr SuidCells 5 ,
.Xr ThisCell 5 ,
.Xr afsd.conf 5 ,
.Xr afsd 8
