openbsd/src/usr.sbin/afs/src/arlad/ThisCell.5
.\" Copyright (c) 2000 - 2003 Kungliga Tekniska Högskolan
.\" (Royal Institute of Technology, Stockholm, Sweden).
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" 3. Neither the name of the Institute nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     $OpenBSD: ThisCell.5,v 1.5 2003/08/05 14:46:01 hin Exp $
.\"     $arla: ThisCell.5,v 1.10 2003/06/06 12:53:54 hin Exp $
.\"
.Dd March 31, 2003
.Dt ThisCell 5
.Os "The Arla Project"
.Sh NAME
.Nm ThisCell
.Nd specify a hosts home AFS cell
.Sh DESCRIPTION
The file
.Nm
specifies which cell the AFS client belongs to. This affects the
default cell to use for commands such as
.Xr pts 1 ,
.Xr fs 1 ,
.Xr vos 8 ,
.Xr kauth 1 ,
.Xr kinit 1 ,
.Xr afslog 1 ,
but other cells can still be used (mostly by giving a -cell argument).
.Pp
Unless dynroot is used, it also affects where
.Nm afsd
reads the root of afs, so 
having good connectivity to the default cell is very important.
.Pp
The cell specified must be listed in
.Pa CellServDB Ns .
.Pp
.Sh SEE ALSO
.Xr CellServDB 5 ,
.Xr DynRootDB 5 ,
.Xr SuidCells 5 ,
.Xr afsd 8
