openbsd/src/usr.sbin/afs/src/arlad/ThisCell.5
.\"     $OpenBSD: ThisCell.5,v 1.1 2000/09/11 14:40:39 art Exp $
.\"     $Id: ThisCell.5,v 1.1 2000/09/11 14:40:39 art Exp $
.Dd April 19, 2000
.Dt ThisCell 5
.Os
.Sh NAME
.Nm ThisCell
.Nd specify a hosts home AFS cell
.Sh DESCRIPTION
The file
.Nm
specifies which cell the AFS cache manager belongs to. This affects the
default cell to use for commands such as
.Xr pts 1 ,
.Xr fs 1 ,
.Xr vos 8 ,
.Xr kauth 1 ,
.Xr kinit 1 ,
.Xr afslog 1 ,
but other cells can still be used.
.Pp
It also affects where the cache manager reads the root of afs, so
having good connectivity to the default cell is very important. This
can be avoided by using the dynroot feature of arlad.
.Pp
.Sh SEE ALSO
.Xr arlad 1 ,
.Xr SuidCells 5 ,
.Xr CellServDB 5
