openbsd/src/usr.sbin/afs/src/arlad/ThisCell.5
.\"     $OpenBSD: ThisCell.5,v 1.3 2002/06/07 08:03:04 hin Exp $
.\"     $KTH: ThisCell.5,v 1.4 2000/09/26 22:36:29 lha Exp $
.Dd April 19, 2000
.Dt ThisCell 5
.Os Arla
.Sh NAME
.Nm ThisCell
.Nd specify a hosts home AFS cell
.Sh DESCRIPTION
The file
.Nm
specifies which cell the AFS cache manager belongs to. This affects the
default cell to use for commands such as
.Xr pts 1 ,
.Xr fs 1 ,
.Xr vos 8 ,
.Xr kauth 1 ,
.Xr kinit 1 ,
.Xr afslog 1 ,
but other cells can still be used (mostly by giving a -cell argument).
.Pp
Unless dynroot is used, it also affects where
the cache manager reads the root of afs, so
having good connectivity to the default cell is very important.
.Pp
.Sh SEE ALSO
.Xr CellServDB 5 ,
.Xr SuidCells 5 ,
.Xr arlad 8
