openbsd/src/share/man/man9/arc4random.9
.\"	$OpenBSD: arc4random.9,v 1.5 2011/01/09 02:20:53 jmc Exp $
.\"
.\" Copyright (c) 1996,2000 Michael Shalayeff
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: January 9 2011 $
.Dt ARC4RANDOM 9
.Os
.Sh NAME
.Nm arc4random
.Nd kernel random subsystem
.Sh SYNOPSIS
.Fd #include <dev/rndvar.h>
.Ft void
.Fn add_true_randomness "int"
.Ft void
.Fn add_timer_randomness "int"
.Ft void
.Fn add_mouse_randomness "int"
.Ft void
.Fn add_tty_randomness "int"
.Ft void
.Fn add_net_randomness "int"
.Ft void
.Fn add_disk_randomness "int"
.Ft void
.Fn add_audio_randomness "int"
.Ft u_int32_t
.Fn arc4random "void"
.Ft void
.Fn arc4random_buf "void *buf" "size_t nbytes"
.Ft u_int32_t
.Fn arc4random_uniform "u_int32_t upper_bound"
.Sh DESCRIPTION
The
.Fn add_mouse_randomness ,
.Fn add_tty_randomness ,
.Fn add_net_randomness ,
.Fn add_disk_randomness
and
.Fn add_audio_randomness
routines are used to
supply data for the random data source device for further processing.
The processing involves calculating inter-event timedelta and measuring
entropy contained in the resulting delta-T; the argument data supplied
is just mixed into the pool and does not increase the entropy counter.
.Pp
.Fn add_true_randomness
does not involve the usual timing calculations,
and causes the supplied data argument to be added to the entropy pool,
increasing the entropy counter by 32 bits.
.Pp
.Fn add_timer_randomness
will not cause the entropy counter to rise.
It is used to change the state of the pool periodically,
mostly by means of timing the random driver's operations.
.Pp
.Fn arc4random
and
.Fn arc4random_buf
provide random numbers.
They may be called safely in any kernel context.
.Pp
.Fn arc4random_uniform
will return a uniformly distributed random number less than
.Fa upper_bound ,
avoiding "modulo bias" when the upper bound is not a power of two.
.Sh SEE ALSO
.Xr arc4random 3 ,
.Xr pchb 4 ,
.Xr random 4
