openbsd/src/share/man/man9/atomic_setbits_int.9
.\" $OpenBSD: atomic_setbits_int.9,v 1.1 2014/02/04 20:55:22 dlg Exp $
.\"
.\" Copyright (c) 2007 Artur Grabowski <art@openbsd.org>
.\" All rights reserved.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 4 2014 $
.Dt ATOMIC_SETBITS_INT 9
.Os
.Sh NAME
.Nm atomic_setbits_int ,
.Nm atomic_clearbits_int
.Nd interface to perform atomic operations on data
.Sh SYNOPSIS
.In sys/atomic.h
.Ft void
.Fn atomic_setbits_int "unsigned int *p" "unsigned int b"
.Ft void
.Fn atomic_clearbits_int "unsigned int *p" "unsigned int b"
.Sh DESCRIPTION
The atomic bits set of functions provide an interface for changing data atomically with respect to interrupts and multiple processors in the system.
.Pp
The
.Fn atomic_setbits_int
function sets the bits in
.Fa b
in the integer pointed to by
.Fa p .
It is equivalent to
.Bd -literal -offset indent
*p |= b;
.Ed
.Pp
The
.Fn atomic_clearbits_int
function clears the bits in
.Fa b
in the integer pointed to by
.Fa p .
It is equivalent to
.Bd -literal -offset indent
*p &= ~b;
.Ed
.Sh SEE ALSO
.Xr atomic_add 9 ,
.Xr atomic_cas 9 ,
.Xr atomic_dec 9 ,
.Xr atomic_inc 9 ,
.Xr atomic_sub 9 ,
.Xr atomic_swap 9
.Sh HISTORY
The
.Nm
functions first appeared in
.Ox 4.1 .
