openbsd/src/share/man/man9/domountroothooks.9
.\"	$OpenBSD: domountroothooks.9,v 1.3 2007/05/31 19:20:00 jmc Exp $
.\"
.\" Copyright (c) 2001 Niklas Hallqvist.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt DOMOUNTROOTHOOKS 9
.Os
.Sh NAME
.Nm domountroothooks
.Nd run all mountroot hooks
.Sh SYNOPSIS
.Fd #include <sys/types.h>
.Fd #include <sys/systm.h>
.Ft void
.Fn domountroothooks "void"
.Sh DESCRIPTION
The
.Fn domountroothooks
function invokes all mountroot hooks established using the
.Xr mountroothook_establish 9
function.
Mountroot hooks are called in order, i.e.,
the mountroot hook established first will be called first.
.Pp
This function is called from
.Fn main
with interrupts turned on.
It is called immediately before the system configures its root and swap
devices, but fully after all normal autoconfiguration.
This can be used to let device subsystems needing delayed configuration (e.g.,
due to very long initialization times) still provide the root device.
The
I2O system, implemented by the
.Xr iop 4
and
.Xr ioprbs 4
drivers, is a good example.
.Pp
Mountroot hooks are, like shutdown hooks, implemented via the more general
.Xr dohooks 9
API.
.Sh SEE ALSO
.Xr iop 4 ,
.Xr ioprbs 4 ,
.Xr dohooks 9 ,
.Xr doshutdownhooks 9 ,
.Xr mountroothook_establish 9
