openbsd/src/share/man/man9/dopowerhooks.9
.\"	$OpenBSD: dopowerhooks.9,v 1.6 2009/01/17 18:02:29 krw Exp $
.\"
.\" Copyright (c) 2000 Aaron Campbell
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: January 17 2009 $
.Dt DOPOWERHOOKS 9
.Os
.Sh NAME
.Nm dopowerhooks
.Nd run all power hooks
.Sh SYNOPSIS
.Fd #include <sys/types.h>
.Fd #include <sys/systm.h>
.Ft void
.Fn dopowerhooks "int why"
.Sh DESCRIPTION
.Fn dopowerhooks
calls all power hooks that have been established using
.Xr powerhook_establish 9 .
At
.Dq suspend
and
.Dq standby
time, power hooks are called in reverse order, i.e.,
the power hook established last will be called first.
At
.Dq resume
time, power hooks are called in order, i.e., the power hook
established first will be called first.
.Pp
.Fn dopowerhooks
is invoked by
.Xr acpi 4
or
.Xr apm 4
when a power state change is detected.
The
.Fa why
argument is one of
.Dv PWR_SUSPEND ,
.Dv PWR_STANDBY ,
or
.Dv PWR_RESUME ,
describing the reason for the change in power state.
Each established power hook is passed this information so the appropriate
actions can be taken.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr apm 4 ,
.Xr powerhook_establish 9
