openbsd/src/share/man/man9/dopowerhooks.9
.\"	$OpenBSD: dopowerhooks.9,v 1.3 2003/04/23 22:07:41 tedu Exp $
.\"
.\" Copyright (c) 2000 Aaron Campbell
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 1, 2000
.Dt DOPOWERHOOKS 9
.Os
.Sh NAME
.Nm dopowerhooks
.Nd run all power hooks
.Sh SYNOPSIS
.Ft void
.Fn dopowerhooks "int why"
.Sh DESCRIPTION
The
.Fn dopowerhooks
function invokes all power hooks established using the
.Xr powerhook_establish 9
function.
At
.Dq suspend
and
.Dq standby
time, power hooks are called in reverse order, i.e.,
the power hook established last will be called first.
At
.Dq resume
time, power hooks are called in order, i.e., the power hook
established first will be called first.
.Pp
This routine is called from the
.Xr apm 4
driver when a power change is detected.
The
.Fa why
argument is one of
.Dv PWR_SUSPEND ,
.Dv PWR_STANDBY ,
or
.Dv PWR_RESUME ,
describing the reason for the change in power state.
Each established power hook is passed this information so the appropriate
actions can be taken.
.Sh SEE ALSO
.Xr apm 4 ,
.Xr powerhook_establish 9
