openbsd/src/share/man/man9/mountroothook_establish.9
.\"	$OpenBSD: mountroothook_establish.9,v 1.1 2004/11/28 02:29:16 deraadt Exp $
.\"	$NetBSD: mountroothook_establish.9,v 1.1 1995/11/25 21:24:52 perry Exp $
.\"
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou
.\"      for the NetBSD Project.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 13, 1995
.Dt MOUNTROOTHOOK_ESTABLISH 9
.Os
.Sh NAME
.Nm mountroothook_establish ,
.Nm mountroothook_disestablish
.Nd add or remove a mountroot hook
.Sh SYNOPSIS
.Fd #include <sys/types.h>
.Fd #include <sys/systm.h>
.Ft void *
.Fn mountroothook_establish "void (*fn)(void *)" "void *arg"
.Ft void
.Fn mountroothook_disestablish "void *cookie"
.Sh DESCRIPTION
The
.Fn mountroothook_establish
function adds
.Fa fn
to the list of hooks invoked by
.Xr domountroothooks 9
at mountroot.
When invoked, the hook function
.Fa fn
will be passed
.Fa arg
as its only argument.
.Pp
The
.Fn mountroothook_disestablish
function removes the hook described by the opaque pointer
.Fa cookie
from the list of hooks to be invoked at mountroot.
If
.Fa cookie
is invalid, the result of
.Fn mountroothook_disestablish
is undefined.
.Pp
Mountroot hooks should be used to perform one-time activities
that must happen immediately after the root filesystem has been
mounted by the kernel, but before
.Xr init 8
has been started.
.Pp
Mountroot hooks are, like startup hooks, implemented via the more general
.Xr dohooks 9
API.
.Sh RETURN VALUES
If successful,
.Fn mountroothook_establish
returns an opaque pointer describing the newly established
mountroot hook.
Otherwise, it returns
.Dv NULL .
.Sh EXAMPLES
It may be appropriate to use a mountroot hook to
split the attach function of a device driver.
Once the root filesystem is mounted, the hook will be called
and it is safe to use
.Xr loadfirmware 9
to get the firmware out of the filesystem.
.Sh SEE ALSO
.Xr dohooks 9 ,
.Xr domountroothooks 9 ,
.Xr dostartuphooks 9
.Sh BUGS
The names are clumsy, at best.
