openbsd/src/share/man/man9/powerhook_establish.9
.\"	$OpenBSD: powerhook_establish.9,v 1.1 2000/07/01 14:45:45 aaron Exp $
.\"
.\" Copyright (c) 2000 Aaron Campbell
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou
.\"      for the NetBSD Project.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 1, 2000
.Dt POWERHOOK_ESTABLISH 9
.Os
.Sh NAME
.Nm powerhook_establish ,
.Nm powerhook_disestablish
.Nd add or remove a power hook
.Sh SYNOPSIS
.Ft void *
.Fn powerhook_establish "void (*fn)(void *)" "void *arg"
.Ft void
.Fn powerhook_disestablish "void *cookie"
.Sh DESCRIPTION
The
.Fn powerhook_establish
function adds
.Fa fn
to the list of hooks invoked by
.Xr dopowerhooks 9
during any change in
.Xr apm 4
power state (i.e.,
during a
.Dq suspend ,
.Dq standby ,
or
.Dq resume ) .
When invoked, the hook function
.Fa fn
will be passed
.Fa arg
as its only argument.
.Pp
The
.Fn powerhook_disestablish
function removes the hook described by the opaque pointer
.Fa cookie
from the list of power hooks.
If
.Fa cookie
is invalid, the result of
.Fn powerhook_disestablish
is undefined.
.Sh RETURN VALUES
If successful,
.Fn powerhook_establish
returns an opaque pointer describing the newly established
power hook.
Otherwise, it returns 
.Dv NULL .
.Sh EXAMPLES
It may be appropriate to use a power hook to disestablish interrupts and
disable PCMCIA functions on PC Cards that are present when the system is put
into suspend mode.
The reverse should happen on resume.
.Pp
It may be appropriate to use a power hook to halt audio output in a sound
driver at suspend-time.
On resume, it may not be possible to recover audio output, but at least the
device can be put into a known, working state.
.Sh SEE ALSO
.Xr apm 4 ,
.Xr dopowerhooks 9
