openbsd/src/share/man/man9/random.9
.\"	$OpenBSD: random.9,v 1.7 2000/04/11 21:00:47 mickey Exp $
.\"
.\" Copyright (c) 1996,2000 Michael Shalayeff
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Michael Shalayeff
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 26, 1996
.Dt RND 9
.Os
.Sh NAME
.Nm random
.Nd device kernel interface
.Sh SYNOPSIS
.Fd #include <dev/rndvar.h>
.Ft void 
.Fn add_true_randomness "int"
.Ft void 
.Fn add_timer_randomness "int"
.Ft void 
.Fn add_mouse_randomness "int"
.Ft void
.Fn add_tty_randomness "int"
.Ft void 
.Fn add_net_randomness "int"
.Ft void 
.Fn add_disk_randomness "int"
.Ft void 
.Fn add_audio_randomness "int"
.Ft void
.Fn get_random_bytes "void *buf" "size_t nbytes"
.Ft u_int8_t 
.Fn arc4random_8 "void"
.Ft u_int32_t 
.Fn arc4random "void"
.br
.Sh DESCRIPTION
.Nm add_mouse_randomness ,
.Nm add_tty_randomness ,
.Nm add_net_randomness ,
.Nm add_disk_randomness ,
.Nm add_audio_randomness
routines are used to
supply data for the random data source device for futher processing.
The processing involves calculating inter-event time delta and measurirg
entropy contained in the resulting delta-T, supplied in argument data
is just mixed into the pool and does not increase entropy counter.
.br
.Nm add_true_randomness
does not involve usuall timing calculations
and cause passed data argument to added to the entropy pool
increasing the entropy counter by 32 bits.
.br
.Nm add_timer_randomness
will not cause entropy counter to rise, it
is used to change the state of the pool periodically mostly
by meaning of timing random driver's operations.
.Pp
.Nm get_random_bytes
may be used to retrieve strong random data, just
as it would by
.Xr srandom 4
device.
.br
.Nm arc4random ,
.Nm arc4random_8
will give random 32 and 8 respectively bit numbers hashed with
the aRC4 algorithm, which appears to be faster and less abusive
to the entropy pool.
.Sh SEE ALSO
.Xr arc4random 3 ,
.Xr random 4
