openbsd/src/share/man/man9/vaccess.9
.\"     $OpenBSD: vaccess.9,v 1.2 2002/05/28 09:07:07 mpech Exp $
.\"-
.\" Copyright (c) 2001 Robert N. M. Watson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd February 18, 2002
.Os
.Dt VACCESS 9
.Sh NAME
.Nm vaccess
.Nd check access permissions based vnode parameters
.Sh SYNOPSIS
.Fd #include <sys/param.h>
.Fd #include <sys/vnode.h>
.Ft int
.Fo vaccess
.Fa "mode_t file_mode"
.Fa "uid_t uid"
.Fa "gid_t gid"
.Fa "mode_t acc_mode"
.Fa "struct ucred *cred"
.Fc
.Sh DESCRIPTION
The
.Fn vaccess
function checks if the credentials described in
.Fa cred
are sufficent to perform the operation described by
.Fa acc_mode ,
based on the
.Fa file_mode ,
.Fa uid ,
and
.Fa gid
arguments.
These arguments would typically be based on the vnode being
accessed.
.Pp
.Fa file_mode
is the current mode of the file that is having access checked.
The
.Fa uid
and
.Fa gid
arguments are the user id and group id representing the owner of the file.
.Fa acc_mode
describes the operation wanted to be performed.
It should be one of
.Dv VREAD ,
.Dv VWRITE
or
.Dv VEXEC
representing read, write and execute respectively.
.Sh RETURN VALUES
.Fn vaccess
will return 0 on success, or a non-zero error value on failure.
.Sh ERRORS
.Bl -tag -width Er
.It Bq Er EACCES
Permission denied.
An attempt was made to access a file in a way forbidden by its file access
permissions.
.El
.Sh SEE ALSO
.Xr vnode 9
.Sh HISTORY
This man page was originally written by
.An Robert Watson
for
.Fx .
It was modified to represent the
.Ox 
implementation by
.An Peter Werner .
