openbsd/src/share/man/man9/vclean.9
.\"     $OpenBSD: vclean.9,v 1.9 2010/09/19 13:17:25 jmc Exp $
.\"-
.\" Copyright (c) 2002 Peter Werner
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd $Mdocdate: September 19 2010 $
.Dt VCLEAN 9
.Os
.Sh NAME
.Nm vclean
.Nd disassociate the underlying file system from a vnode
.Sh SYNOPSIS
.Fd #include <sys/param.h>
.Fd #include <sys/vnode.h>
.Ft void
.Fo vclean
.Fa "struct vnode *vp"
.Fa "int flags"
.Fa "struct proc *p"
.Fc
.Sh DESCRIPTION
The
.Fn vclean
function clears any VM and buffer data associated with the vnode
.Fa vp
and reclaims it from the underlying file system.
.Pp
Its arguments are:
.Bl -tag -width ".Fa flags"
.It Fa vp
The vnode to be cleaned.
.It Fa flags
The flags indicating how the vnode should be handled.
.Bl -tag -width ".Dv DOCLOSE"
.It Dv DOCLOSE
If this flag is set,
.Fn vclean
will call
.Xr vinvalbuf 9
on the vnode.
If the vnode is active, it will be closed and inactivated in the
underlying file system.
.El
.It Fa p
The process responsible for this call.
.El
.Pp
On exit, the
.Va v_tag
field of the vnode will be set to
.Dv VT_NON ,
and if the vnode was active, it will be placed on the vnode free list.
.Sh SEE ALSO
.Xr vinvalbuf 9 ,
.Xr vnode 9
.Sh HISTORY
This man page was originally written for
.Ox .
