openbsd/src/share/man/man9/vcount.9
.\"     $OpenBSD: vcount.9,v 1.6 2010/10/28 18:27:29 jmc Exp $
.\"
.\" Copyright (c) 2000 Andrew Stevenson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" If this man page travels to places exotic (like projects other than
.\" FreeBSD) I would love to hear about it.
.\"     Andrew <andrew@ugh.net.au>
.\"
.\" $FreeBSD: src/share/man/man9/vcount.9,v 1.4 2001/12/26 23:14:04 davidc Exp $
.\"
.Dd $Mdocdate: October 28 2010 $
.Dt VCOUNT 9
.Os
.Sh NAME
.Nm vcount
.Nd get total number of references to a device
.Sh SYNOPSIS
.Fd #include <sys/param.h>
.Fd #include <sys/time.h>
.Fd #include <sys/conf.h>
.Fd #include <sys/vnode.h>
.Ft int
.Fn vcount "struct vnode *vp"
.Sh DESCRIPTION
.Fn vcount
is used to get the number of references to a particular device.
It allows for the fact that multiple vnodes may reference the same device.
.Sh RETURN VALUES
.Fn vcount
returns the number of references to the device.
.Sh SEE ALSO
.Xr vnode 9
.Sh AUTHORS
This man page was originally written by
.An Andrew Stevenson
for
.Fx .
