openbsd/src/share/man/man9/vfinddev.9
.\"     $OpenBSD: vfinddev.9,v 1.1 2002/02/28 19:22:05 csapuntz Exp $
.\"-
.\" Copyright (c) 2002 Peter Werner 
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd February 18, 2002
.Os
.Dt VFINDDEV 9
.Sh NAME
.Nm vfinddev
.Nd lookup a vnode by device number
.Sh SYNOPSIS
.Fd #include <sys/param.h>
.Fd #include <sys/vnode.h>
.Ft int
.Fo vfinddev
.Fa "dev_t dev"
.Fa "enum vtype type"
.Fa "struct vnode **vpp"
.Fc
.Sh DESCRIPTION
The
.Fn vfinddev
function returns a pointer to the vnode of the device represented by the
device number
.Fa dev
and of type
.Fa type
in
.Fa vpp .
.Sh RETURN VALUES
.Fn vfinddev
will return 1 if a corresponding vnode was found, 0 if otherwise.
.Sh SEE ALSO
.Xr vnode 9
.Sh HISTORY
This man page was originally written for OpenBSD.
