openbsd/src/share/man/man9/vm_deallocate.9
.\" 
.\"	$OpenBSD: vm_deallocate.9,v 1.1 1996/03/11 13:04:51 mickey Exp $
.\"
.\" Mach Operating System
.\" Copyright (c) 1991,1990 Carnegie Mellon University
.\" All Rights Reserved.
.\" 
.\" Permission to use, copy, modify and distribute this software and its
.\" documentation is hereby granted, provided that both the copyright
.\" notice and this permission notice appear in all copies of the
.\" software, derivative works or modified versions, and any portions
.\" thereof, and that both notices appear in supporting documentation.
.\" 
.\" CARNEGIE MELLON ALLOWS FREE USE OF THIS SOFTWARE IN ITS "AS IS"
.\" CONDITION.  CARNEGIE MELLON DISCLAIMS ANY LIABILITY OF ANY KIND FOR
.\" ANY DAMAGES WHATSOEVER RESULTING FROM THE USE OF THIS SOFTWARE.
.\" 
.\" Carnegie Mellon requests users of this software to return to
.\" 
.\"  Software Distribution Coordinator  or  Software.Distribution@CS.CMU.EDU
.\"  School of Computer Science
.\"  Carnegie Mellon University
.\"  Pittsburgh PA 15213-3890
.\" 
.\" any improvements or extensions that they make and grant Carnegie Mellon
.\" the rights to redistribute these changes.
.\" 
.TH vm_deallocate 9 9/19/93
.CM 4
.SH NAME
.nf
vm_deallocate  \-  releases a region of a task's address space
.SH SYNOPSIS
.nf
.ft B
#include <vm/vm_extern.h>

.nf
.ft B
int vm_deallocate(map, address, size)
	vm_map_t	map;
	vm_address_t    address;
	vm_size_t	size;


.fi
.ft P
.SH ARGUMENTS
.TP 15
.B
map
Virtual memory map to be affected.
.TP 15
.B
address
Starting address (will be rounded down to a page boundary).
.TP 15
.B
size
Number of bytes to deallocate (will be rounded up to give a 
page boundary).

.SH DESCRIPTION
.B vm_deallocate
relinquishes access to a region of a map's
address space, causing further access to that memory to fail.
This address range will be available for reallocation.
Note, that because of the rounding to virtual page boundaries, more
than 
.B size
bytes may be deallocated. Use 
.B cnt.vm_page_size
find out the current virtual page size.

This call may be used to deallocte memory that was passed to a task
in a message (via out of line data). In that case, the rounding should
cause no trouble, since the region of memory was allocated as a set
of pages.

The 
.B vm_deallocate
call affects only the map specified by the 
.B map
.
Other maps which may have access to this memory may continue to reference it.

.SH DIAGNOSTICS
.TP 25
KERN_SUCCESS
Memory deallocated.
.TP 25
KERN_INVALID_ADDRESS
Illegal or non-allocated address specified.

.SH SEE ALSO
.B vm_allocate

