openbsd/src/share/man/man9/vrecycle.9
.\"     $OpenBSD: vrecycle.9,v 1.2 2002/05/28 09:07:07 mpech Exp $
.\"-
.\" Copyright (c) 2002 Peter Werner 
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd February 18, 2002
.Os
.Dt VRECYCLE 9
.Sh NAME
.Nm vrecycle
.Nd recycle a vnode if its usecount is zero
.Sh SYNOPSIS
.Fd #include <sys/param.h>
.Fd #include <sys/vnode.h>
.Ft int
.Fo vrecycle
.Fa "struct vnode *vp"
.Fa "struct simplelock *inter_lkp"
.Fa "struct proc *p"
.Fc
.Sh DESCRIPTION
The
.Fn vrecycle
function places a vnode
.Fa vp
on the free list using
.Xr vgonel 9
if its v_usecount field is zero.
If the usecount is not zero it simply returns.
If its usecount is zero and an interlock
.Fa inter_lkp
was passed, this will be unlocked before calling
.Xr vgonel 9 .
.Sh RETURN VALUES
.Fn vrecycle
will return 1 if the vnode was placed on the free list.
It will return 0 if the usecount was not zero, and any lock passed in
.Fa inter_lkp
will still be locked.
.Sh SEE ALSO
.Xr vnode 9 ,
.Xr vgonel 9
.Sh HISTORY
This man page was originally written for OpenBSD.
