openbsd/src/sbin/pfctl/pfctl.8
.\" $OpenBSD: pfctl.8,v 1.6 2001/06/26 00:16:55 ian Exp $
.\"
.\" Copyright (c) 2001 Kjell Wooding.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Ericsson Radio Systems.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 24, 2001
.Dt PFCTL 8
.Os
.Sh NAME
.Nm pfctl
.Nd control the packet filter and NAT subsystems
.Sh SYNOPSIS
.Nm pfctl
.Ar commands
.Sh DESCRIPTION
The
.Nm
utility communicates with the packet filter system using the
ioctl interface described in
.Xr pf 4 .
.Pp
Packet filtering lets you restrict packets entering or leaving
your host; packets can be specified in a variety of ways including
by protocol, by port number, and by address.
Network Address Translation lets you map a series of internal
host IP numbers to a single external address.
The NAT code also has provision for redirecting a
range of connections to a different host and/or port number.
Taken together this provides a powerful basic firewall mechanism.
.Pp
The
.Nm
command is normally invoked automatically at system initialization
time to start and load the packet filter,
but can also be used when the filter or translation rules change.
.Pp
.Nm
requires a kernel with
.Xr pf 4
configured in (the GENERIC kernel qualifies).
To forward packets (using NAT), 
.Nm
also requires
.Li net.inet.ip.forwarding=1
in the file
.Pa /etc/sysctl.conf .
The variables IPF and IPNAT in 
.Pa /etc/rc.conf
determine whether this mechanism will be started automatically
when the system is booted.
.Pp
The
.Nm
utility provides several commands:
.Pp
.Bl -tag -width "parse" -compact
.It Cm start
Start the packet filter
.It Cm stop
Stop the packet filter
.It Cm show
.Bl -tag -width "status" -compact
.It Cm rules
Show filter rules
.It Cm nat
Show NAT rules
.It Cm states Op proto
Show active states, optionally for a particular protocol
.It Cm status
Filter status
.El
.It Cm clear
.Bl -tag -width "rules" -compact
.It Cm rules
Clear filter rules
.It Cm nat
Clear NAT rules
.El
.It Cm parse
.Bl -tag -width "wules" -compact
.It Cm rules Pa filename
Test the syntax of a rules file
.It Cm nat Pa filename
Test the syntax of a NAT file
.El
.It Cm load
.Bl -tag -width "rules" -compact
.It Cm rules Pa filename
Load rules into the filter
.It Cm nat
Load rules into NAT
.El
.It Cm log Ar if
Enable logging for an interface
.El
.Pp
.Sh FILES
.Bl -tag -width /etc/nat.rules
.It Pa /etc/pf.rules
packet filter rules file
.It Pa /etc/nat.rules
rules for Network Address Translation
.Sh SEE ALSO
.Xr pf 4 , 
.Xr pf.rules 5 ,
.Xr nat.rules 5 .
.Sh COMPATIBILITY
This mechanism is largely compatible with the previous
IP Filter mechanism, which was removed from
.Ox
due to a licensing conflict.
.Sh AUTHORS
Daniel Hartmeier wrote the program and the underlying mechanism.
.Sh HISTORY
The
.Nm
program and the 
.Xr pf 4
filter mechanism first appeared in
.Ox 2.9 .
.Sh BUGS
Probably.
.Sh CAVEATS
It is not yet as fully featured as the mechanism it replaced.
