openbsd/src/sbin/pfctl/pfctl.8
.\" $OpenBSD: pfctl.8,v 1.13 2001/06/27 11:01:11 kjell Exp $
.\"
.\" Copyright (c) 2001 Kjell Wooding.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Ericsson Radio Systems.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 24, 2001
.Dt PFCTL 8
.Os
.Sh NAME
.Nm pfctl
.Nd control the packet filter and NAT subsystems
.Sh SYNOPSIS
.Nm 
.Op Fl d
.Op Fl e
.Op Fl c Ar set
.Op Fl l Ar interface
.Op Fl n Ar file
.Op Fl N
.Op Fl r Ar file
.Op Fl s Ar set
.Op Fl v
.Op Fl z
.Sh DESCRIPTION
The
.Nm
utility communicates with the packet filter system using the
ioctl interface described in
.Xr pf 4 .
.Pp
Packet filtering lets you restrict packets entering or leaving
your host; packets can be specified in a variety of ways including
by protocol, by port number, and by address.
Network Address Translation lets you map a series of internal
host IP numbers to a single external address.
The NAT code also has provision for redirecting a
range of connections to a different host and/or port number.
Taken together this provides a powerful basic firewall mechanism.
.Pp
The
.Nm
command is normally invoked automatically at system initialization
time to start and load the packet filter,
but can also be used when the filter or translation rules change.
.Pp
.Nm
requires the
.Xr pf 4
pseudo-device driver.
Forwarding packets, by using NAT, also requires specifying
.Li net.inet.ip.forwarding=1
in the file
.Pa /etc/sysctl.conf .
.Pp
The
.Nm
utility provides several commands:
The options are as follows:
.Bl -tag -width Ds
.It Fl d
Disable the packet filter
.It Fl e
Enable the packet filter
.It Fl c Ar set
Clear one of the following sets:
.Bl -tag -width "states" -compact
.It Ar nat
Clear the NAT rules
.It Ar rules
Clear the filter rules
.It Ar states
Clear the state table (NAT and filter)
.El
.It Fl l Ar interface
Enable collection of packet and byte count statistics for interface named
.Ar interface .
These statistics can be viewed with the
.Fl s Ar status
option.
.It Fl N
Do not actually load rules
.It Fl n Ar file
Load a NAT rules file
.It Fl r Ar file
Load a filter rules file into the filter
.It Fl s Ar set
Show filter parameters.
.Ar set
is one of the following:
.Bl -tag -width "status" -compact
.It Ar nat
Show the currently loaded NAT rules
.It Ar rules
Show the currently loaded packet filter rules
.It Ar states
Show the contents of the state table
.It Ar status
Show filter statistics
.El
.It Fl v
Show rules as they are parsed
.It Fl z
Zero the filter statistics
.El
.Sh FILES
.Bl -tag -width "/etc/nat.conf" -compact
.It Pa /etc/pf.conf
packet filter rules file
.It Pa /etc/nat.conf
rules for Network Address Translation
.Sh SEE ALSO
.Xr pf 4 , 
.Xr pf.conf 5 ,
.Xr nat.conf 5 .
.Sh COMPATIBILITY
This mechanism is largely compatible with the previous
IP Filter mechanism, which was removed from
.Ox
due to a licensing conflict.
.Sh AUTHORS
Daniel Hartmeier wrote the program and the underlying mechanism.
.Sh HISTORY
The
.Nm
program and the 
.Xr pf 4
filter mechanism first appeared in
.Ox 2.9 .
.Sh BUGS
Probably.
.Sh CAVEATS
It is not yet as fully featured as the mechanism it replaced.
