openbsd/src/sbin/lmccontrol/lmccontrol.8
.\"	$OpenBSD: lmccontrol.8,v 1.2 2000/10/13 19:11:34 aaron Exp $
.\"
.\" Copyright (c) 1997-1999 LAN Media Corporation (LMC)
.\" All rights reserved.  www.lanmedia.com
.\"
.\" This code is written by Michael Graff <graff@vix.com> for LMC.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above
.\"    copyright notice, this list of conditions and the following disclaimer
.\"    in the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. All marketing or advertising materials mentioning features or
.\"    use of this software must display the following acknowledgement:
.\"      This product includes software developed by LAN Media Corporation
.\"      and its contributors.
.\" 4. Neither the name of LAN Media Corporation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY LAN MEDIA CORPORATION AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 11, 2000
.Dt LMCCTL 8
.Os
.Sh NAME
.Nm lmcctl
.Nd configure Lan Media Corporation SSI/HSSI/T1/T3 devices
.Sh SYNOPSIS
.Nm lmcctl
.Op Fl i Ar interface
.Op Fl l Ar speed
.Op Fl cCeEsSkKoO
.Sh DESCRIPTION
The
.Nm
command controls the operation of the Lan Media devices via the
.Xr lmc 4
driver.
Most of the parameters that can be changed relate to the
line characteristics or layer 2 protocol options.
You can adjust layer 2 protocol keepalives, and line speed.
Line characteristics which can be adjusted include CRC length,
internal or external clock source, DS3 scrambler, and DS3 cable length.
.Pp
This program controlls the Lan Media SSI, HSSI, T1, and DS3 network interfaces.
The SSI is the LMC1000, and runs at various speeds up to 10Mbps.
It requires an external CSU/DSU for operation on T1/E1 lines.
The HSSI card is the LMC5000, and runs at various speeds up to 52Mbps.
It requires an external DSU for operation on DS3 lines.
The DS3 is the LMC5245 and runs at a speed of 45Mbps.
It has no internal clock generator, and does not require external
DSU for DS3 operation.
The T1 card is the LMC1200 and runs at a speed of 1.544Mbps or
2Mbps for E1 operation, without CSU/DSU.
.Pp
The
.Op Fl i Ar iface
argument given to
.Nm
should be the logical interface name associated with the Lan Media
device (lmc0, lmc1, etc...).
.Pp
The
.Nm
command given without any additional flags retrieves the current card
settings from the driver and prints them out.
.Pp
The options are as follows:
.Pp
.Bl -tag -width Fl
.It Fl i Ar interface
The interface name of the Lan Media card (default is lmc0)
.It Fl l Ar speed
To manually specify line speed, in bits per second (for devices without built-in CSU/DSU)
.It Fl c
Sets the interface to use an external clock source.
This is only valid for SSI/HSSI cards.
.It Fl C
Set the interface to use internal clocking.
On the SSI card this uses the internal baud rate generator.
On the HSSI card it uses the PCI bus clock.
This is only valid for SSI/HSSI cards.
.It Fl e
Sets 16-bit CRC.
.It Fl E
Sets 32-bit CRC.
.It Fl k
Enables layer 2 keepalive.
.It Fl K
Disables layer 2 keepalive.
.It Fl s
Turn DS3 scrambler off.
.It Fl S
Turn DS3 scrambler on.
.It Fl o
Program the DS3 card for cable lengths of less than 100 feet.
In this mode, the card uses lower power to transmit data for short cable runs,
which might otherwise overdrive a receiver.
This is the default, and will work in most situations even with runs
more than 100 feet.
.It Fl O 
Program the DS3 card for cable length for over 100 feet in length (higher
power).
.El
.Pp
.Sh EXAMPLES
To set a SSI card for a speed of 2048000 bits/sec with HDLC keepalive off,
one could use:
.Bd -unfilled -offset indent
lmcctl -i lmc0 -l 2048000 -K
.Ed
.Pp
.Sh SEE ALSO
.Xr lmc 4 ,
.Xr sppp 4 ,
.Xr hostname.if 8 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Ox 2.8 .
.Sh AUTHOR
The
.Nm
utility was written by
.An Michael Graff Aq explorer@vix.com .
