openbsd/src/usr.sbin/vmmctl/vmmctl.8
.\"	$OpenBSD: vmmctl.8,v 1.4 2015/11/22 23:41:27 jmc Exp $
.\"
.\" Copyright (c) 2015 Mike Larkin <mlarkin@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: November 22 2015 $
.Dt VMMCTL 8
.Os
.Sh NAME
.Nm vmmctl
.Nd control VMM subsystem
.Sh SYNOPSIS
.Nm
.Op Fl s Ar socket
.Ar command
.Op Ar arg ...
.Sh DESCRIPTION
The
.Nm
utility is used to control the virtual machine monitor (VMM) subsystem.
A VMM manages virtual machines (VMs) on a
.Ar host .
The VMM subsystem is responsible for creating, destroying, and executing
VMs.
.Sh VMM OPERATIONS
The options are as follows:
.Bl -tag -width Ds
.It Cm enable
Enable the VMM subsystem.
The VMM subsystem must be enabled before VMs can be managed on the host.
.It Cm disable
Disable the VMM subsystem.
Virtual machines running on the host should be terminated first.
.It Cm load Op Ar path
Load the
.Xr vmm.conf 5
configuration file from
.Pa /etc/vmm.conf
or the specified
.Ar path .
.El
.Pp
Generally, the
.Nm
utility is run with
.Cm enable
option during system startup to enable the VMM subsystem on boot.
This can be automated via the
.Xr rc 8
and
.Xr rc.conf 8
facilities used during system startup.
.Sh VM OPERATIONS
The options are as follows:
.Bl -tag -width Ds
.It Cm create Ar path Cm size Ar number
Creates a VM disk image file with the specified pathname and size in MB.
.It Cm start Ar name Op Ar parameters
Starts a VM defined by the specified name and parameters:
.Bl -tag -width "memory size"
.It Cm disk Ar path
Disk image file (may be specified multiple times to add multiple disk images).
.It Cm kernel Ar path
Kernel to load when booting the VM.
.It Cm memory Ar size
Memory size of the VM, in bytes.
Optionally, the units 'K', 'M', or 'G', for kilo-, mega-, and gigabytes
can be used.
.It Cm interfaces Ar count
Number of network interfaces to add to the VM.
.El
.It Cm terminate Ar id
Terminates (stops) a VM defined by the specified VM
.Ar id .
.It Cm show info Op Ar id
Lists VMs running on the host, optionally listing just the selected VM
.Ar id .
.El
.Sh FILES
.Bl -tag -width "/etc/var/run/vmd.sockXX" -compact
.It Pa /etc/vmm.conf
Default configuration file.
.It Pa /var/run/vmd.sock
.Ux Ns -domain
socket used for communication with
.Xr vmd 8 .
.El
.Sh EXIT STATUS
.Ex -std vmmctl
.Nm
may fail due to one of the following reasons:
.Pp
.Bl -bullet -compact
.It
The VMM subsystem could not be enabled or disabled as requested.
.It
A requested VM-based operation could not be completed.
.El
.Sh EXAMPLES
Enable the VMM subsystem:
.Dl $ vmmctl enable
.Pp
Disable the VMM subsystem:
.Dl $ vmmctl disable
.Pp
Create a new disk image ('disk.img') of 4 gigabyte size:
.Dl $ vmmctl create disk.img size 4G
.Pp
Create a new VM with 512MB memory, one network interface, one disk image
('disk.img') and boot from kernel '/bsd':
.Bd -literal -offset indent
$ vmmctl start "myvm" memory 512M interfaces 1 disk disk.img \e
	kernel /bsd
.Ed
.Pp
Terminate VM number 1:
.Dl $ vmmctl terminate 1
.Sh SEE ALSO
.Xr vmm 4 ,
.Xr vmm.conf 5 ,
.Xr rc.conf 8 ,
.Xr vmd 8
.Sh HISTORY
The
.Nm
command first appeared in
.Ox 5.9 .
.Sh AUTHORS
.An -nosplit
.An Mike Larkin Aq Mt mlarkin@openbsd.org
and
.An Reyk Floeter Aq Mt reyk@openbsd.org .
