openbsd/src/share/man/man4/man4.mvme88k/bussw.4
.\"	$OpenBSD: bussw.4,v 1.7 2013/05/18 11:26:01 miod Exp $
.\"
.\" Copyright (c) 2003 Paul Weissmann
.\" All rights reserved.
.\"
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 18 2013 $
.Dt BUSSW 4 mvme88k
.Os
.Sh NAME
.Nm bussw
.Nd BusSwitch local peripheral bus interface
.Sh SYNOPSIS
.Cd "bussw0  at mainbus0 addr 0xfff00000"
.Cd "pcctwo0 at bussw0 offset 0x00000"
.Sh DESCRIPTION
The
.Nm
.Tn BusSwitch
ASIC provides an interface from the MVME197's 64-bit wide system bus
to the
.Tn MC68040
compatible 32-bit wide local bus, to which the system's
I/O devices, e.g. SCSI and Ethernet, are attached.
.Pp
It includes the following features:
.Pp
.Bl -bullet -compact -offset indent
.It
Bus arbitration for the
.Tn MC88110
bus
.It
Seven level interrupt handler
.It
Programmable map decoders
.It
Write post buffers
.It
Two tick timers
.It
Four 32-bit general purpose registers
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pcctwo 4
