openbsd/src/share/man/man4/man4.mvme88k/le.4
.\"	$OpenBSD: le.4,v 1.4 2004/04/30 18:22:12 miod Exp $
.\"
.\" Copyright (c) 2003 Paul Weissmann
.\" All rights reserved.
.\"
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 30, 2004
.Dt LE 4 mvme88k
.Os
.Sh NAME
.Nm le
.Nd MVME376 AMD LANCE Ethernet interface
.Sh SYNOPSIS
.Cd "le0 at vmes0 addr 0xffff1200 ipl 1"
.Cd "le1 at vmes0 addr 0xffff1400 ipl 1"
.Cd "le2 at vmes0 addr 0xffff1600 ipl 1"
.Cd "le3 at vmes0 addr 0xffff5400 ipl 1"
.Cd "le4 at vmes0 addr 0xffff5600 ipl 1"
.Cd "le5 at vmes0 addr 0xffffa400 ipl 1"
.Sh DESCRIPTION
The
.Nm
driver provides access to the AMD 7990/LANCE-based MVME376 VME board.
This in turn provides an interface to the
.Tn Ethernet
network.
.Pp
Each of the host's network addresses
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm
interface employs the address resolution protocol described in
.Xr arp 4
to dynamically map between Internet and
.Tn Ethernet
addresses on the local network.
.Sh HARDWARE CONFIGURATION
The card's base address
.Po
matching the
.Em addr
locator on the configuration line
.Pc
is defined through three sets of DIP switches,
.Dq SW1
and
.Dq SW2 ,
located in the middle of the board, near the space between the two
VME connectors, and
.Dq SW3 ,
closer to the AM7990DC chip at the bottom edge.
.Pp
The only supported configurations are:
.Bl -column "xxxxxxxx" "xxxxxxxx" "xxxxxxxx" "0xffffffff"
.It Li SW1 Ta SW2 Ta SW3 Ta Address
.It " "
.It Li "UUU_UU_U" Ta "U__U____" Ta "______U_" Ta "0xffff1200"
.It Li "UUU_U_UU" Ta "U__U_U__" Ta "______U_" Ta "0xffff1400"
.It Li "UUU_U__U" Ta "U__UU___" Ta "______U_" Ta "0xffff1600"
.It Li "U_U_U_UU" Ta "U__UUU__" Ta "______U_" Ta "0xffff5400"
.It Li "U_U_U__U" Ta "U_U_____" Ta "______U_" Ta "0xffff5600"
.It Li "_U_UU_UU" Ta "U_U__U__" Ta "______U_" Ta "0xffffa400"
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr inet 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr vme 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
