openbsd/src/share/man/man4/man4.mvme88k/pcctwo.4
.\"	$OpenBSD: pcctwo.4,v 1.10 2013/05/23 21:20:48 miod Exp $
.\"
.\" Copyright (c) 2003 Paul Weissmann
.\" All rights reserved.
.\"
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 23 2013 $
.Dt PCCTWO 4 mvme88k
.Os
.Sh NAME
.Nm pcctwo
.Nd PCCchip2 local bus controller
.Sh SYNOPSIS
.Cd "pcctwo0 at mainbus0 addr 0xfff00000        " Pq "MVME187"
.Cd "pcctwo0 at bussw0 offset 0x00000           " Pq "MVME197"
.Cd "nvram0  at pcctwo0 offset 0xc0000"
.Cd "vme0    at pcctwo0 offset 0x40000"
.Cd "ie0     at pcctwo0 offset 0x46000 ipl 3"
.Cd "osiop0  at pcctwo0 offset 0x47000 ipl 2"
.Cd "cl0     at pcctwo0 offset 0x45000 ipl 3"
.Cd "cl1     at pcctwo0 offset 0x45200 ipl 3    " Pq "M8120 only"
.Cd "memc0   at pcctwo0 offset 0x43000"
.Cd "memc1   at pcctwo0 offset 0x43100"
.Sh DESCRIPTION
The
.Nm
.Tn PCCchip2
ASIC provides an interface to the different local bus-attached I/O
devices as found on some of the
.Tn MVME88k
Single-Board Computers.
On
.Tn MVME187
boards it is attached directly to the processor bus, while on
.Tn MVME197
boards it attaches to the
.Xr bussw 4
.Tn BusSwitch
ASIC.
.Pp
Features Summary:
.Pp
.Bl -bullet -compact
.It
8-bit parallel I/O port
.It
Master/slave interface for
.Xr cl 4
Cirrus Logic CD2401 serial controller
.It
Host interface to
.Xr ie 4
.Tn Intel
i82596CA LAN coprocessor
.It
Host interface to
.Xr nvram 4
Mostek MK48T0x battery-backed realtime clock
.Xr osiop 4
Symbios/NCR 53C710 SCSI controller
.It
Interface to the
.Xr memc 4
Memory controller ASIC
.El
.Sh SEE ALSO
.Xr bussw 4 ,
.Xr cl 4 ,
.Xr ie 4 ,
.Xr intro 4 ,
.Xr memc 4 ,
.Xr nvram 4 ,
.Xr osiop 4
