openbsd/src/share/man/man4/man4.mvme88k/syscon.4
.\"	$OpenBSD: syscon.4,v 1.3 2013/05/23 21:20:48 miod Exp $
.\"
.\" Copyright (c) 2008 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies. And
.\" I won't mind if you keep the disclaimer below.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 23 2013 $
.Dt SYSCON 4 mvme88k
.Os
.Sh NAME
.Nm syscon
.Nd MVME188 system controller
.Sh SYNOPSIS
.Cd "syscon0 at mainbus0 addr 0xfff00000"
.Cd "nvram0  at syscon0 offset 0x80000"
.Cd "dart0   at syscon0 offset 0x82000 ipl 3"
.Cd "vme0    at syscon0 offset 0x85000"
.Sh DESCRIPTION
The
.Nm
driver provides an interface to the different local bus-attached I/O
devices found on MVME188 systems.
.Pp
The devices connected to
.Nm
are:
.Pp
.Bl -tag -compact -width 8n -offset indent
.It Xr dart 4
MC68681 or MC68692 dual UART
.It Xr nvram 4
Mostek MK48T0x battery-backed realtime clock
.It Xr vme 4
VMEbus interface
.El
.Sh SEE ALSO
.Xr dart 4 ,
.Xr intro 4 ,
.Xr nvram 4 ,
.Xr vme 4
