openbsd/src/share/man/man4/man4.mvme88k/vme.4
.\"	$OpenBSD: vme.4,v 1.6 2009/02/14 18:03:12 miod Exp $
.\"
.\" Copyright (c) 2003 Paul Weissmann
.\" All rights reserved.
.\"
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: February 14 2009 $
.Dt VME 4 mvme88k
.Os
.Sh NAME
.Nm vme
.Nd VMEbus interface
.Sh SYNOPSIS
.Cd "vme0   at pcctwo0 offset 0x40000"
.Cd "vme0   at syscon0 offset 0x85000"
.Cd "vmes0  at vme0"
.Cd "vmel0  at vme0"
.Sh DESCRIPTION
The
.Nm
driver provides access to the VMEbus.
On MVME187 and MVME197 boards, it operates the VMEchip2 ASIC connected to the
.Xr pcctwo 4
PCCchip2 local bus controller.
On MVME188 boards, it operates the VMEbus part of the
.Xr syscon 4
device.
.Pp
The
.Nm
driver exposes the D16 and D32 access spaces through the
.Nm vmes
and
.Nm vmel
drivers, respectively.
.Pp
The currently VMEbus drivers supported are:
.Pp
.Bl -tag -compact -width 6n -offset indent
.It Xr le 4
MVME376 AMD LANCE Ethernet device
.It Xr vs 4
MVME328, MVME328S and MVME328XT high performance SCSI controller
.It Xr vsbic 4
MVME327A SCSI and floppy controller
.\" .It Xr vx 4
.\" MVME332XT high performance serial I/O controller
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pcctwo 4 ,
.Xr syscon 4
