openbsd/src/share/man/man4/man4.mvme88k/vs.4
.\"	$OpenBSD: vs.4,v 1.7 2008/01/01 22:38:49 jmc Exp $
.\"
.\" Copyright (c) 2003 Paul Weissmann
.\" All rights reserved.
.\"
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: January 1 2008 $
.Dt VS 4 mvme88k
.Os
.Sh NAME
.Nm vs
.Nd MVME328S High Performance SCSI Controller
.Sh SYNOPSIS
.Cd "vs0 at vmes0 addr 0xffff9000 ipl 2"
.Cd "vs1 at vmes0 addr 0xffff9800 ipl 2"
.Cd "vs2 at vmes0 addr 0xffff4800 ipl 2"
.Cd "vs3 at vmes0 addr 0xffff5800 ipl 2"
.Cd "vs4 at vmes0 addr 0xffff7000 ipl 2"
.Cd "vs5 at vmes0 addr 0xffff7800 ipl 2"
.Cd "scsibus* at vs?"
.Sh DESCRIPTION
The
.Nm
provides access to the MVME328S family of
.Tn SCSI
.Tn VME
I/O boards.
Depending on the version, it provides a single or dual channel single-ended
.Tn SCSI
interface.
It is attached to the
.Tn VME
bus of the system, controlled by the
.Xr vme 4
.Tn VMEchip2
interface chip.
Several types of both internal and external connectors are provided, also
depending on the version of the MVME328S.
.Sh HARDWARE CONFIGURATION
The card's base address
.Po
matching the
.Em addr
locator on the configuration line
.Pc
is defined through a set of nine jumpers, labeled
.Dq JB1
on the board, near the fuse in a corner of the card.
They are contiguous to the
.Dq JA7
single jumper and
.Dq JA8
dual jumper, located immediately to the left of the
.Dq JB1
block.
.Pp
The only supported configurations are:
.Bl -column "xxxxxxxxx" "0xffffffff"
.It Li JB1 Ta Address Ta Configuration
.It " "
.It Li "___X_XX__" Ta "0xffff9000" Ta "1st board"
.It Li "_____XX__" Ta "0xffff9800" Ta "2nd board"
.It Li "____XX_X_" Ta "0xffff4800" Ta "3rd board"
.It Li "_____X_X_" Ta "0xffff5800" Ta "4th board"
.It Li "___X___X_" Ta "0xffff7000" Ta "5th board"
.It Li "_______X_" Ta "0xffff7800" Ta "6th board"
.El
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr ss 4 ,
.Xr st 4 ,
.Xr uk 4 ,
.Xr vme 4
.Sh BUGS
The daughterboard providing access to the second SCSI channel does not
work under
.Ox
if the first SCSI channel is empty.
.Pp
MVME328XT boards are not supported by this driver yet.
