openbsd/src/share/man/man4/man4.mvme88k/vs.4
.\"	$OpenBSD: vs.4,v 1.1 2003/08/07 19:22:38 miod Exp $
.\"
.\" Copyright (c) 2003 Paul Weissmann
.\" All rights reserved.
.\"
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Paul Weissmann
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd May 14, 2003
.Dt VS 4 mvme88k
.Os
.Sh NAME
.Nm vs
.Nd MVME328 SCSI I/O adapter
.Sh SYNOPSIS
.Cd "vs0 at vmes0 addr 0xffff9000 ipl 2 len 0x800"
.Cd "vs1 at vmes0 addr 0xffff9800 ipl 2 len 0x800"
.Cd "vs2 at vmes0 addr 0xffff4800 ipl 2 len 0x800"
.Cd "vs3 at vmes0 addr 0xffff5800 ipl 2 len 0x800"
.Cd "vs4 at vmes0 addr 0xffff7000 ipl 2 len 0x800"
.Cd "vs5 at vmes0 addr 0xffff7800 ipl 2 len 0x800"
.Cd "scsibus* at vs?"
.Sh DESCRIPTION
The
.Nm
provides access to the
.Tn MVME328
.Tn SCSI
.Tn VME
I/O board.
Depending on the version it provides a single or dual channel
.Tn SCSI
interface.
It is attached to the
.Tn VME
bus of the system, controlled by the
.Xr vme 4
.Tn VMEchip2
interface chip.
Several types of both internal and external connectors are provided, also
depending on the version of the
.Tn MVME328 .
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr ss 4 ,
.Xr st 4 ,
.Xr uk 4 ,
.Xr vme 4
