openbsd/src/share/man/man4/man4.mvme88k/vsbic.4
.\"	$OpenBSD: vsbic.4,v 1.1 2009/02/14 18:03:12 miod Exp $
.\"
.\" Copyright (c) 2009 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: February 14 2009 $
.Dt VSBIC 4 mvme88k
.Os
.Sh NAME
.Nm vsbic
.Nd MVME327A SCSI and floppy controller
.Sh SYNOPSIS
.Cd "vsbic0 at vmes0 addr 0xffffa600 ipl 2"
.Cd "vsbic1 at vmes0 addr 0xffffa700 ipl 2"
.Cd "scsibus* at vsbic?"
.Sh DESCRIPTION
The
.Nm
driver supports the SCSI interface of the Motorola MVME327A
SCSI and floppy VME controller.
The WD33C93 SCSI controller found on this board is not directly accessible;
instead, the
.Nm
driver runs SCSI commands through the MVME327A firmware interface.
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr ss 4 ,
.Xr st 4 ,
.Xr uk 4 ,
.Xr vme 4
.Sh BUGS
Due to firmware limitations, SCSI commands using command blocks larger than
12 bytes are not supported.
Therefore, only the first 2TB of SCSI disks are accessible.
