openbsd/src/share/man/man8/man8.atari/MAKEDEV.8
.\"	$NetBSD: MAKEDEV.8,v 1.1.1.1 1995/10/17 20:44:26 leo Exp $
.\"
.\" Copyright (c) 1995 Leo Weppelman
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Leo Weppelman.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	from: @(#)MAKEDEV.8	5.2 (Berkeley) 3/22/91
.\"
.Dd October 10, 1995
.Dt MAKEDEV 8 atari
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Op Ar ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the
.Pa /dev
directory, is used to create
the common special
files.
See
.Xr special 8
for a more complete discussion of special files.
.Pp
.Nm MAKEDEV
takes any number of device names as arguments,
where the names are the common abbreviation for
the device.  There are three special device names,
.Ar all ,
.Ar std
and
.Ar local .
If
given,
.Ar all
creates device files for all devices on the Atari.  If units are
expected for a device
.Nm MAKEDEV
supplies the standard numbers.
The
.Ar std
argument creates the standard devices for the Atari.
Finally
.Ar local
is for devices specific to the local site, and
executes the shell file
.Pa MAKEDEV.local .
.Pp
The Atari supports the following devices.
Where a device name is followed by a hash
sign ("#"), the hash sign must be replaced
by a unit number.
.Pp
.Sy Pseudo\-names
.Bl -tag -width indent -compact
.It Ar all
All known devices for the Atari.
.It Ar std
The standard devices (console, drum, fd/*, klog, kmem, mem, null,
reload, stderr, stdin, stdout, tty, zero)
.It Ar local
Configuration specific devices
.El
.Pp
.Sy Device\-names
.Bl -tag -width indent -compact
.It Ar aconf
Autoconfig information
.It Ar bpf#
Berkeley packet filters
.It Ar ccd#
Concatenating disk driver
.It Ar cd#
SCSI CD-ROM drives
.It Ar fd#
Floppy disk drives
.It Ar grf#
Graphic "frame buffers"
.It Ar ite#
Bit-mapped based character consoles
.It Ar kbd
The keyboard
.It Ar lkm
Loadable kernel modules.
.It Ar mdm#
Both modem ports
.It Ar mouse#
Mouse ports
.It Ar par#
Parallel ports (not yet supported)
.It Ar pty#
Set of 16 master and slave pseudo terminals
.It Ar sd#
SCSI disks drives
.It Ar ser#
Both serial ports
.It Ar st#
SCSI tape drives
.It Ar ttye#
Terminal emulator interface to the Atari graphics device. Also named
pseudo console.
.It Ar tun#
The network tunnel device
.It Ar view#
Abstract graphics interface to grf#'s
.It Ar vnd#
"File" pseudo-disks
.El
.Sh FILES
.Bl -tag -width /dev -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr mknod 1 , 
.Xr intro 4 ,
.Xr config 8 ,
.Xr special 8
