openbsd/src/sys/arch/amd64/stand/installboot/installboot.8
.\"	$OpenBSD: installboot.8,v 1.1 2004/02/03 12:09:47 mickey Exp $
.\"
.\" Copyright (c) 1997 Michael Shalayeff
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd December 23, 2003
.Dt INSTALLBOOT 8 i386
.Os
.Sh NAME
.Nm installboot
.Nd installs a bootstrap on an FFS disk or partition
.Sh SYNOPSIS
.Nm installboot
.Op Fl nv
.Ar boot
.Ar biosboot
.Ar disk
.Sh DESCRIPTION
.Nm
is used to install a
.Dq first-stage
boot program into the boot area of an FFS disk partition.
It inserts the block number and offset of the inode of
the second-stage boot program
.Xr boot 8
so that the
.Xr biosboot 8
program can load it.
Various filesystem parameters are also patched into the boot block.
.Pp
The options are as follows:
.Bl -tag -width flag_opt
.It Fl n
Do not actually write anything on the disk.
.It Fl v
Be verbose, printing out the data that are stored in
.Ar biosboot
along with lots of other information.
.El
.Pp
The arguments are:
.Bl -tag -width biosboot
.It Ar boot
The name of the second-stage boot program in the mounted file system
where the first-stage boot program is to be installed.
This should be a full pathname.
.It Ar biosboot
The name of the prototype file for the first stage boot program,
usually
.Pa /usr/mdec/biosboot .
.It Ar disk
The name of the disk containing the partition in which the second-stage
boot program resides and the first-stage boot program is to be installed.
This can either be specified in short form (e.g.,
.Sq sd0
or
.Sq wd0 ) ,
or as the explicit device node, such as
.Pa /dev/rsd0c
or
.Pa /dev/rwd0c .
.Pp
Note that you must be in single-user mode or have your kernel in
insecure mode (see the
.Xr sysctl 8
.Va kern.securelevel
variable or
.Pa /etc/rc.securelevel )
to enable access to the raw partition of a mounted disk.
.Pp
The
.Sq c
partition is always used to represent the
.Dq entire
disk on i386.
.El
.Sh EXAMPLES
The typical use is
.Bd -literal -offset indent
# cp /usr/mdec/boot /boot
# /usr/mdec/installboot -n -v /boot /usr/mdec/biosboot sd0
.Ed
.Pp
And if the information supplied looks right, run the above without the
.Fl n
flag.
If you are upgrading an old system, you may need to perform
some additional steps first.
For example:
.Bd -literal -offset indent
boot the floppy.fs filesystem floppy
# fsck /dev/rsd0a
# mount /dev/sd0a /mnt
# cp /usr/mdec/boot /mnt/boot
# /usr/mdec/installboot -v /mnt/boot /usr/mdec/biosboot sd0
.Ed
.Sh SEE ALSO
.Xr biosboot 8 ,
.Xr boot 8 ,
.Xr disklabel 8 ,
.Xr fdisk 8 ,
.Xr init 8
.Sh CAVEATS
The disklabel
.Va d_type
field must be set to a value other than
.Dq unknown .
.Pp
.Pa /boot
must be on the drive/partition specified by
.Pa disk ;
you cannot perform cross-device
.Nm Ns s .
